<abi-corpus version='2.0' architecture='elf-amd-x86_64' soname='libwx_gtk3u_html-3.2.so.0'>
  <elf-needed>
    <dependency name='libwx_gtk3u_core-3.2.so.0'/>
    <dependency name='libwx_baseu-3.2.so.0'/>
    <dependency name='libm.so.6'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_ZN10wxHtmlCell13SetScriptModeE16wxHtmlScriptModel' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN10wxHtmlCell17ProcessMouseClickEP21wxHtmlWindowInterfaceRK7wxPointRK12wxMouseEvent' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN10wxHtmlCell6LayoutEi' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN10wxHtmlCell7SetLinkERK14wxHtmlLinkInfo' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN10wxHtmlCellC1Ev' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_ZTV18wxDataObjectSimple' size='112' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV18wxHtmlEasyPrinting' size='80' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV18wxHtmlSearchEngine' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV18wxVarVScrollHelper' size='224' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV19wxHtmlContainerCell' size='224' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV19wxHtmlWinTagHandler' size='80' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV19wxMessageDialogBase' size='2136' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV19wxSimpleHtmlListBox' size='2528' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV20wxHtmlEntitiesParser' size='56' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV20wxHtmlHelpController' size='240' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV20wxHtmlRenderingStyle' size='48' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV21wxHtmlFilterPlainText' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV21wxHtmlWindowInterface' size='112' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV22wxControlWithItemsBase' size='1896' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV22wxHtmlWordWithTabsCell' size='232' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV23wxHtmlWindowMouseHelper' size='48' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV27wxDefaultHtmlRenderingStyle' size='48' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV6wxList' size='48' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV9wxPenBase' size='216' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_HTML_CELL_CLICKED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_HTML_CELL_HOVER' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_HTML_LINK_CLICKED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxHtmlListBoxNameStr' size='12' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxSimpleHtmlListBoxNameStr' size='18' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/generic/htmllbox.cpp' language='LANG_C_plus_plus_14'>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='96' id='type-id-2'>
      <subrange length='12' type-id='type-id-3' id='type-id-4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='144' id='type-id-5'>
      <subrange length='18' type-id='type-id-3' id='type-id-6'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='infinite' id='type-id-7'>
      <subrange length='infinite' id='type-id-8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-9' size-in-bits='1024' id='type-id-10'>
      <subrange length='4' type-id='type-id-3' id='type-id-11'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-12' size-in-bits='3200' id='type-id-13'>
      <subrange length='50' type-id='type-id-3' id='type-id-14'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='3200' id='type-id-16'>
      <subrange length='50' type-id='type-id-3' id='type-id-14'/>
    </array-type-def>
    <class-decl name='wxWindowWithItems&lt;wxHtmlListBox, wxItemContainer&gt;' size-in-bits='8448' visibility='default' filepath='include/wx/ctrlsub.h' line='424' column='1' id='type-id-17'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-18'/>
      <base-class access='public' layout-offset-in-bits='8320' type-id='type-id-19'/>
    </class-decl>
    <enum-decl name='wxOrientation' filepath='include/wx/defs.h' line='1351' column='1' id='type-id-20'>
      <underlying-type type-id='type-id-21'/>
      <enumerator name='wxHORIZONTAL' value='4'/>
      <enumerator name='wxVERTICAL' value='8'/>
      <enumerator name='wxBOTH' value='12'/>
      <enumerator name='wxORIENTATION_MASK' value='12'/>
    </enum-decl>
    <class-decl name='wxHtmlListBox' size-in-bits='8320' visibility='default' filepath='include/wx/htmllbox.h' line='38' column='1' id='type-id-18'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-22'/>
      <base-class access='public' layout-offset-in-bits='6528' type-id='type-id-23'/>
      <base-class access='public' layout-offset-in-bits='6592' type-id='type-id-24'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-25' mangled-name='_ZN13wxHtmlListBox12ms_classInfoE' visibility='default' filepath='src/generic/htmllbox.cpp' line='208' column='1' elf-symbol-id='_ZN13wxHtmlListBox12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='6912'>
        <var-decl name='m_cache' type-id='type-id-26' visibility='default' filepath='include/wx/htmllbox.h' line='174' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='6976'>
        <var-decl name='m_htmlParser' type-id='type-id-27' visibility='default' filepath='include/wx/htmllbox.h' line='177' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='7040'>
        <var-decl name='m_filesystem' type-id='type-id-28' visibility='default' filepath='include/wx/htmllbox.h' line='181' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='8256'>
        <var-decl name='m_htmlRendStyle' type-id='type-id-29' visibility='default' filepath='include/wx/htmllbox.h' line='185' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='sm_eventTableEntries' type-id='type-id-10' mangled-name='_ZN13wxHtmlListBox20sm_eventTableEntriesE' visibility='default' filepath='src/generic/htmllbox.cpp' line='198' column='1' elf-symbol-id='_ZN13wxHtmlListBox20sm_eventTableEntriesE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' static='yes'>
        <var-decl name='sm_eventTable' type-id='type-id-30' mangled-name='_ZN13wxHtmlListBox13sm_eventTableE' visibility='default' filepath='src/generic/htmllbox.cpp' line='198' column='1' elf-symbol-id='_ZN13wxHtmlListBox13sm_eventTableE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' static='yes'>
        <var-decl name='sm_eventHashTable' type-id='type-id-31' mangled-name='_ZN13wxHtmlListBox17sm_eventHashTableE' visibility='default' filepath='src/generic/htmllbox.cpp' line='198' column='1' elf-symbol-id='_ZN13wxHtmlListBox17sm_eventHashTableE@@WXU_3.2'/>
      </data-member>
      <member-function access='protected'>
        <function-decl name='OnLeftDown' mangled-name='_ZN13wxHtmlListBox10OnLeftDownER12wxMouseEvent' filepath='src/generic/htmllbox.cpp' line='585' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxHtmlListBox10OnLeftDownER12wxMouseEvent@@WXU_3.2'>
          <parameter type-id='type-id-32' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-33' name='event' filepath='src/generic/htmllbox.cpp' line='585' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnMouseMove' mangled-name='_ZN13wxHtmlListBox11OnMouseMoveER12wxMouseEvent' filepath='src/generic/htmllbox.cpp' line='579' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxHtmlListBox11OnMouseMoveER12wxMouseEvent@@WXU_3.2'>
          <parameter type-id='type-id-32' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-33' name='event' filepath='src/generic/htmllbox.cpp' line='585' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='CellCoordsToPhysical' mangled-name='_ZNK13wxHtmlListBox20CellCoordsToPhysicalERK7wxPointP10wxHtmlCell' filepath='src/generic/htmllbox.cpp' line='558' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxHtmlListBox20CellCoordsToPhysicalERK7wxPointP10wxHtmlCell@@WXU_3.2'>
          <parameter type-id='type-id-35' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-36' name='pos' filepath='src/generic/htmllbox.cpp' line='558' column='1'/>
          <parameter type-id='type-id-15' name='cell' filepath='src/generic/htmllbox.cpp' line='558' column='1'/>
          <return type-id='type-id-37'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='GetItemForCell' mangled-name='_ZNK13wxHtmlListBox14GetItemForCellEPK10wxHtmlCell' filepath='src/generic/htmllbox.cpp' line='538' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxHtmlListBox14GetItemForCellEPK10wxHtmlCell@@WXU_3.2'>
          <parameter type-id='type-id-35' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-38' name='cell' filepath='src/generic/htmllbox.cpp' line='538' column='1'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='PhysicalCoordsToCell' mangled-name='_ZNK13wxHtmlListBox20PhysicalCoordsToCellER7wxPointRP10wxHtmlCell' filepath='src/generic/htmllbox.cpp' line='523' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxHtmlListBox20PhysicalCoordsToCellER7wxPointRP10wxHtmlCell@@WXU_3.2'>
          <parameter type-id='type-id-35' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-39' name='pos' filepath='src/generic/htmllbox.cpp' line='523' column='1'/>
          <parameter type-id='type-id-40' name='cell' filepath='src/generic/htmllbox.cpp' line='523' column='1'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='GetRootCellCoords' mangled-name='_ZNK13wxHtmlListBox17GetRootCellCoordsEm' filepath='src/generic/htmllbox.cpp' line='515' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxHtmlListBox17GetRootCellCoordsEm@@WXU_3.2'>
          <parameter type-id='type-id-35' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-12' name='n' filepath='src/generic/htmllbox.cpp' line='515' column='1'/>
          <return type-id='type-id-37'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnSize' mangled-name='_ZN13wxHtmlListBox6OnSizeER11wxSizeEvent' filepath='src/generic/htmllbox.cpp' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxHtmlListBox6OnSizeER11wxSizeEvent@@WXU_3.2'>
          <parameter type-id='type-id-32' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-42' name='event' filepath='src/generic/htmllbox.cpp' line='333' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes'>
        <function-decl name='CacheItem' mangled-name='_ZNK13wxHtmlListBox9CacheItemEm' filepath='src/generic/htmllbox.cpp' line='327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxHtmlListBox9CacheItemEm@@WXU_3.2'>
          <parameter type-id='type-id-35' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-12' name='n' filepath='src/generic/htmllbox.cpp' line='327' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='CreateCellForItem' mangled-name='_ZNK13wxHtmlListBox17CreateCellForItemEm' filepath='src/generic/htmllbox.cpp' line='297' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxHtmlListBox17CreateCellForItemEm@@WXU_3.2'>
          <parameter type-id='type-id-35' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-12' name='n' filepath='src/generic/htmllbox.cpp' line='297' column='1'/>
          <return type-id='type-id-15'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Create' mangled-name='_ZN13wxHtmlListBox6CreateEP8wxWindowiRK7wxPointRK6wxSizelRK8wxString' filepath='src/generic/htmllbox.cpp' line='242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxHtmlListBox6CreateEP8wxWindowiRK7wxPointRK6wxSizelRK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-32' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-43' name='parent' filepath='src/generic/htmllbox.cpp' line='242' column='1'/>
          <parameter type-id='type-id-44' name='id' filepath='src/generic/htmllbox.cpp' line='243' column='1'/>
          <parameter type-id='type-id-36' name='pos' filepath='src/generic/htmllbox.cpp' line='244' column='1'/>
          <parameter type-id='type-id-45' name='size' filepath='src/generic/htmllbox.cpp' line='245' column='1'/>
          <parameter type-id='type-id-46' name='style' filepath='src/generic/htmllbox.cpp' line='246' column='1'/>
          <parameter type-id='type-id-47' name='name' filepath='src/generic/htmllbox.cpp' line='247' column='1'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='Init' mangled-name='_ZN13wxHtmlListBox4InitEv' filepath='src/generic/htmllbox.cpp' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxHtmlListBox4InitEv@@WXU_3.2'>
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxHtmlListBox' mangled-name='_ZN13wxHtmlListBoxC2EP8wxWindowiRK7wxPointRK6wxSizelRK8wxString' filepath='src/generic/htmllbox.cpp' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxHtmlListBoxC2EP8wxWindowiRK7wxPointRK6wxSizelRK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-32' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-43' name='parent' filepath='src/generic/htmllbox.cpp' line='222' column='1'/>
          <parameter type-id='type-id-44' name='id' filepath='src/generic/htmllbox.cpp' line='223' column='1'/>
          <parameter type-id='type-id-36' name='pos' filepath='src/generic/htmllbox.cpp' line='224' column='1'/>
          <parameter type-id='type-id-45' name='size' filepath='src/generic/htmllbox.cpp' line='225' column='1'/>
          <parameter type-id='type-id-46' name='style' filepath='src/generic/htmllbox.cpp' line='226' column='1'/>
          <parameter type-id='type-id-47' name='name' filepath='src/generic/htmllbox.cpp' line='227' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxHtmlListBox' mangled-name='_ZN13wxHtmlListBoxC2Ev' filepath='src/generic/htmllbox.cpp' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxHtmlListBoxC2Ev@@WXU_3.2'>
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxHtmlListBox' mangled-name='_ZN13wxHtmlListBoxD4Ev' filepath='src/generic/htmllbox.cpp' line='252' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxHtmlListBox' mangled-name='_ZN13wxHtmlListBoxD0Ev' filepath='src/generic/htmllbox.cpp' line='252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxHtmlListBoxD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxHtmlListBox' mangled-name='_ZN13wxHtmlListBoxD2Ev' filepath='src/generic/htmllbox.cpp' line='252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxHtmlListBoxD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK13wxHtmlListBox12GetClassInfoEv' filepath='src/generic/htmllbox.cpp' line='208' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxHtmlListBox12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-50' is-artificial='yes'/>
          <return type-id='type-id-51'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='14'>
        <function-decl name='GetEventTable' mangled-name='_ZNK13wxHtmlListBox13GetEventTableEv' filepath='src/generic/htmllbox.cpp' line='198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxHtmlListBox13GetEventTableEv@@WXU_3.2'>
          <parameter type-id='type-id-50' is-artificial='yes'/>
          <return type-id='type-id-52'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='15'>
        <function-decl name='GetEventHashTable' mangled-name='_ZNK13wxHtmlListBox17GetEventHashTableEv' filepath='src/generic/htmllbox.cpp' line='198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxHtmlListBox17GetEventHashTableEv@@WXU_3.2'>
          <parameter type-id='type-id-50' is-artificial='yes'/>
          <return type-id='type-id-53'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='145'>
        <function-decl name='OnInternalIdle' mangled-name='_ZN13wxHtmlListBox14OnInternalIdleEv' filepath='src/generic/htmllbox.cpp' line='563' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxHtmlListBox14OnInternalIdleEv@@WXU_3.2'>
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='206'>
        <function-decl name='SetItemCount' mangled-name='_ZN13wxHtmlListBox12SetItemCountEm' filepath='src/generic/htmllbox.cpp' line='362' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxHtmlListBox12SetItemCountEm@@WXU_3.2'>
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='207'>
        <function-decl name='OnDrawItem' mangled-name='_ZNK13wxHtmlListBox10OnDrawItemER4wxDCRK6wxRectm' filepath='src/generic/htmllbox.cpp' line='395' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxHtmlListBox10OnDrawItemER4wxDCRK6wxRectm@@WXU_3.2'>
          <parameter type-id='type-id-50' is-artificial='yes'/>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-55'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='208'>
        <function-decl name='OnMeasureItem' mangled-name='_ZNK13wxHtmlListBox13OnMeasureItemEm' filepath='src/generic/htmllbox.cpp' line='428' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxHtmlListBox13OnMeasureItemEm@@WXU_3.2'>
          <parameter type-id='type-id-50' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='210'>
        <function-decl name='OnDrawBackground' mangled-name='_ZNK13wxHtmlListBox16OnDrawBackgroundER4wxDCRK6wxRectm' filepath='src/generic/htmllbox.cpp' line='375' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxHtmlListBox16OnDrawBackgroundER4wxDCRK6wxRectm@@WXU_3.2'>
          <parameter type-id='type-id-50' is-artificial='yes'/>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-55'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='213'>
        <function-decl name='RefreshRow' mangled-name='_ZN13wxHtmlListBox10RefreshRowEm' filepath='src/generic/htmllbox.cpp' line='341' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxHtmlListBox10RefreshRowEm@@WXU_3.2'>
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='214'>
        <function-decl name='RefreshRows' mangled-name='_ZN13wxHtmlListBox11RefreshRowsEmm' filepath='src/generic/htmllbox.cpp' line='348' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxHtmlListBox11RefreshRowsEmm@@WXU_3.2'>
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='215'>
        <function-decl name='RefreshAll' mangled-name='_ZN13wxHtmlListBox10RefreshAllEv' filepath='src/generic/htmllbox.cpp' line='355' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxHtmlListBox10RefreshAllEv@@WXU_3.2'>
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='216'>
        <function-decl name='OnGetItem' mangled-name='_ZNK13wxHtmlListBox9OnGetItemEm' filepath='include/wx/htmllbox.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-50' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-57'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='217'>
        <function-decl name='OnGetItemMarkup' mangled-name='_ZNK13wxHtmlListBox15OnGetItemMarkupEm' filepath='src/generic/htmllbox.cpp' line='285' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxHtmlListBox15OnGetItemMarkupEm@@WXU_3.2'>
          <parameter type-id='type-id-50' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-57'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='218'>
        <function-decl name='GetSelectedTextColour' mangled-name='_ZNK13wxHtmlListBox21GetSelectedTextColourERK8wxColour' filepath='src/generic/htmllbox.cpp' line='270' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxHtmlListBox21GetSelectedTextColourERK8wxColour@@WXU_3.2'>
          <parameter type-id='type-id-50' is-artificial='yes'/>
          <parameter type-id='type-id-58'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='219'>
        <function-decl name='GetSelectedTextBgColour' mangled-name='_ZNK13wxHtmlListBox23GetSelectedTextBgColourERK8wxColour' filepath='src/generic/htmllbox.cpp' line='276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxHtmlListBox23GetSelectedTextBgColourERK8wxColour@@WXU_3.2'>
          <parameter type-id='type-id-50' is-artificial='yes'/>
          <parameter type-id='type-id-58'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='220'>
        <function-decl name='OnLinkClicked' mangled-name='_ZN13wxHtmlListBox13OnLinkClickedEmRK14wxHtmlLinkInfo' filepath='src/generic/htmllbox.cpp' line='458' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxHtmlListBox13OnLinkClickedEmRK14wxHtmlLinkInfo@@WXU_3.2'>
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-60'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='221'>
        <function-decl name='SetHTMLWindowTitle' mangled-name='_ZN13wxHtmlListBox18SetHTMLWindowTitleERK8wxString' filepath='src/generic/htmllbox.cpp' line='448' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxHtmlListBox18SetHTMLWindowTitleERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <parameter type-id='type-id-47'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='222'>
        <function-decl name='OnHTMLLinkClicked' mangled-name='_ZN13wxHtmlListBox17OnHTMLLinkClickedERK14wxHtmlLinkInfo' filepath='src/generic/htmllbox.cpp' line='453' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxHtmlListBox17OnHTMLLinkClickedERK14wxHtmlLinkInfo@@WXU_3.2'>
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <parameter type-id='type-id-60'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes' vtable-offset='223'>
        <function-decl name='OnHTMLOpeningURL' mangled-name='_ZNK13wxHtmlListBox16OnHTMLOpeningURLE13wxHtmlURLTypeRK8wxStringPS1_' filepath='src/generic/htmllbox.cpp' line='466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxHtmlListBox16OnHTMLOpeningURLE13wxHtmlURLTypeRK8wxStringPS1_@@WXU_3.2'>
          <parameter type-id='type-id-50' is-artificial='yes'/>
          <parameter type-id='type-id-61'/>
          <parameter type-id='type-id-47'/>
          <parameter type-id='type-id-62'/>
          <return type-id='type-id-63'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes' vtable-offset='224'>
        <function-decl name='HTMLCoordsToWindow' mangled-name='_ZNK13wxHtmlListBox18HTMLCoordsToWindowEP10wxHtmlCellRK7wxPoint' filepath='src/generic/htmllbox.cpp' line='473' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxHtmlListBox18HTMLCoordsToWindowEP10wxHtmlCellRK7wxPoint@@WXU_3.2'>
          <parameter type-id='type-id-50' is-artificial='yes'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-36'/>
          <return type-id='type-id-37'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='225'>
        <function-decl name='GetHTMLWindow' mangled-name='_ZN13wxHtmlListBox13GetHTMLWindowEv' filepath='src/generic/htmllbox.cpp' line='479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxHtmlListBox13GetHTMLWindowEv@@WXU_3.2'>
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <return type-id='type-id-43'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes' vtable-offset='226'>
        <function-decl name='GetHTMLBackgroundColour' mangled-name='_ZNK13wxHtmlListBox23GetHTMLBackgroundColourEv' filepath='src/generic/htmllbox.cpp' line='481' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxHtmlListBox23GetHTMLBackgroundColourEv@@WXU_3.2'>
          <parameter type-id='type-id-50' is-artificial='yes'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='227'>
        <function-decl name='SetHTMLBackgroundColour' mangled-name='_ZN13wxHtmlListBox23SetHTMLBackgroundColourERK8wxColour' filepath='src/generic/htmllbox.cpp' line='486' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxHtmlListBox23SetHTMLBackgroundColourERK8wxColour@@WXU_3.2'>
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <parameter type-id='type-id-58'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='228'>
        <function-decl name='SetHTMLBackgroundImage' mangled-name='_ZN13wxHtmlListBox22SetHTMLBackgroundImageERK14wxBitmapBundle' filepath='src/generic/htmllbox.cpp' line='491' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxHtmlListBox22SetHTMLBackgroundImageERK14wxBitmapBundle@@WXU_3.2'>
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='229'>
        <function-decl name='SetHTMLStatusText' mangled-name='_ZN13wxHtmlListBox17SetHTMLStatusTextERK8wxString' filepath='src/generic/htmllbox.cpp' line='496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxHtmlListBox17SetHTMLStatusTextERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-48' is-artificial='yes'/>
          <parameter type-id='type-id-47'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes' vtable-offset='230'>
        <function-decl name='GetHTMLCursor' mangled-name='_ZNK13wxHtmlListBox13GetHTMLCursorEN21wxHtmlWindowInterface10HTMLCursorE' filepath='src/generic/htmllbox.cpp' line='501' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxHtmlListBox13GetHTMLCursorEN21wxHtmlWindowInterface10HTMLCursorE@@WXU_3.2'>
          <parameter type-id='type-id-50' is-artificial='yes'/>
          <parameter type-id='type-id-65'/>
          <return type-id='type-id-66'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxSimpleHtmlListBox' size-in-bits='8960' visibility='default' filepath='include/wx/htmllbox.h' line='205' column='1' id='type-id-67'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-17'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-25' mangled-name='_ZN19wxSimpleHtmlListBox12ms_classInfoE' visibility='default' filepath='src/generic/htmllbox.cpp' line='609' column='1' elf-symbol-id='_ZN19wxSimpleHtmlListBox12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='8448'>
        <var-decl name='m_items' type-id='type-id-68' visibility='default' filepath='include/wx/htmllbox.h' line='317' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='8768'>
        <var-decl name='m_HTMLclientData' type-id='type-id-69' visibility='default' filepath='include/wx/htmllbox.h' line='318' column='1'/>
      </data-member>
      <member-function access='protected'>
        <function-decl name='UpdateCount' mangled-name='_ZN19wxSimpleHtmlListBox11UpdateCountEv' filepath='src/generic/htmllbox.cpp' line='731' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxSimpleHtmlListBox11UpdateCountEv@@WXU_3.2'>
          <parameter type-id='type-id-70' name='this' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Create' mangled-name='_ZN19wxSimpleHtmlListBox6CreateEP8wxWindowiRK7wxPointRK6wxSizeRK13wxArrayStringlRK11wxValidatorRK8wxString' filepath='src/generic/htmllbox.cpp' line='632' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxSimpleHtmlListBox6CreateEP8wxWindowiRK7wxPointRK6wxSizeRK13wxArrayStringlRK11wxValidatorRK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-70' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-43' name='parent' filepath='src/generic/htmllbox.cpp' line='632' column='1'/>
          <parameter type-id='type-id-44' name='id' filepath='src/generic/htmllbox.cpp' line='632' column='1'/>
          <parameter type-id='type-id-36' name='pos' filepath='src/generic/htmllbox.cpp' line='633' column='1'/>
          <parameter type-id='type-id-45' name='size' filepath='src/generic/htmllbox.cpp' line='634' column='1'/>
          <parameter type-id='type-id-71' name='choices' filepath='src/generic/htmllbox.cpp' line='635' column='1'/>
          <parameter type-id='type-id-46' name='style' filepath='src/generic/htmllbox.cpp' line='636' column='1'/>
          <parameter type-id='type-id-72' name='validator' filepath='src/generic/htmllbox.cpp' line='637' column='1'/>
          <parameter type-id='type-id-47' name='name' filepath='src/generic/htmllbox.cpp' line='638' column='1'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Create' mangled-name='_ZN19wxSimpleHtmlListBox6CreateEP8wxWindowiRK7wxPointRK6wxSizeiPK8wxStringlRK11wxValidatorRS9_' filepath='src/generic/htmllbox.cpp' line='612' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxSimpleHtmlListBox6CreateEP8wxWindowiRK7wxPointRK6wxSizeiPK8wxStringlRK11wxValidatorRS9_@@WXU_3.2'>
          <parameter type-id='type-id-70' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-43' name='parent' filepath='src/generic/htmllbox.cpp' line='612' column='1'/>
          <parameter type-id='type-id-44' name='id' filepath='src/generic/htmllbox.cpp' line='612' column='1'/>
          <parameter type-id='type-id-36' name='pos' filepath='src/generic/htmllbox.cpp' line='613' column='1'/>
          <parameter type-id='type-id-45' name='size' filepath='src/generic/htmllbox.cpp' line='614' column='1'/>
          <parameter type-id='type-id-49' name='n' filepath='src/generic/htmllbox.cpp' line='615' column='1'/>
          <parameter type-id='type-id-73' name='choices' filepath='src/generic/htmllbox.cpp' line='615' column='1'/>
          <parameter type-id='type-id-46' name='style' filepath='src/generic/htmllbox.cpp' line='616' column='1'/>
          <parameter type-id='type-id-72' name='validator' filepath='src/generic/htmllbox.cpp' line='617' column='1'/>
          <parameter type-id='type-id-47' name='name' filepath='src/generic/htmllbox.cpp' line='618' column='1'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxSimpleHtmlListBox' mangled-name='_ZN19wxSimpleHtmlListBoxD4Ev' filepath='src/generic/htmllbox.cpp' line='652' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-74' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxSimpleHtmlListBox' mangled-name='_ZN19wxSimpleHtmlListBoxD0Ev' filepath='src/generic/htmllbox.cpp' line='652' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxSimpleHtmlListBoxD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-74' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxSimpleHtmlListBox' mangled-name='_ZN19wxSimpleHtmlListBoxD2Ev' filepath='src/generic/htmllbox.cpp' line='652' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxSimpleHtmlListBoxD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-74' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK19wxSimpleHtmlListBox12GetClassInfoEv' filepath='src/generic/htmllbox.cpp' line='609' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK19wxSimpleHtmlListBox12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-75' is-artificial='yes'/>
          <return type-id='type-id-51'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='206'>
        <function-decl name='SetItemCount' mangled-name='_ZN19wxSimpleHtmlListBox12SetItemCountEm' filepath='include/wx/htmllbox.h' line='301' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-74' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='212'>
        <function-decl name='InitEvent' mangled-name='_ZN19wxSimpleHtmlListBox9InitEventER14wxCommandEventi' filepath='include/wx/htmllbox.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-74' is-artificial='yes'/>
          <parameter type-id='type-id-76'/>
          <parameter type-id='type-id-49'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='216'>
        <function-decl name='OnGetItem' mangled-name='_ZNK19wxSimpleHtmlListBox9OnGetItemEm' filepath='include/wx/htmllbox.h' line='306' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-75' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-57'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='231'>
        <function-decl name='SetSelection' mangled-name='_ZN19wxSimpleHtmlListBox12SetSelectionEi' filepath='include/wx/htmllbox.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-74' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='232'>
        <function-decl name='GetSelection' mangled-name='_ZNK19wxSimpleHtmlListBox12GetSelectionEv' filepath='include/wx/htmllbox.h' line='260' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-75' is-artificial='yes'/>
          <return type-id='type-id-49'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='233'>
        <function-decl name='GetCount' mangled-name='_ZNK19wxSimpleHtmlListBox8GetCountEv' filepath='include/wx/htmllbox.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-75' is-artificial='yes'/>
          <return type-id='type-id-77'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='234'>
        <function-decl name='GetString' mangled-name='_ZNK19wxSimpleHtmlListBox9GetStringEj' filepath='src/generic/htmllbox.cpp' line='723' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK19wxSimpleHtmlListBox9GetStringEj@@WXU_3.2'>
          <parameter type-id='type-id-75' is-artificial='yes'/>
          <parameter type-id='type-id-77'/>
          <return type-id='type-id-57'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='235'>
        <function-decl name='SetString' mangled-name='_ZN19wxSimpleHtmlListBox9SetStringEjRK8wxString' filepath='src/generic/htmllbox.cpp' line='714' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxSimpleHtmlListBox9SetStringEjRK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-74' is-artificial='yes'/>
          <parameter type-id='type-id-77'/>
          <parameter type-id='type-id-47'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='236'>
        <function-decl name='Clear' mangled-name='_ZN19wxSimpleHtmlListBox5ClearEv' filepath='src/generic/htmllbox.cpp' line='667' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxSimpleHtmlListBox5ClearEv@@WXU_3.2'>
          <parameter type-id='type-id-74' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='237'>
        <function-decl name='DoInsertItems' mangled-name='_ZN19wxSimpleHtmlListBox13DoInsertItemsERK21wxArrayStringsAdapterjPPv16wxClientDataType' filepath='src/generic/htmllbox.cpp' line='693' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxSimpleHtmlListBox13DoInsertItemsERK21wxArrayStringsAdapterjPPv16wxClientDataType@@WXU_3.2'>
          <parameter type-id='type-id-74' is-artificial='yes'/>
          <parameter type-id='type-id-78'/>
          <parameter type-id='type-id-77'/>
          <parameter type-id='type-id-79'/>
          <parameter type-id='type-id-80'/>
          <return type-id='type-id-49'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='238'>
        <function-decl name='DoSetItemClientData' mangled-name='_ZN19wxSimpleHtmlListBox19DoSetItemClientDataEjPv' filepath='include/wx/htmllbox.h' line='286' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-74' is-artificial='yes'/>
          <parameter type-id='type-id-77'/>
          <parameter type-id='type-id-81'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='239'>
        <function-decl name='DoGetItemClientData' mangled-name='_ZNK19wxSimpleHtmlListBox19DoGetItemClientDataEj' filepath='include/wx/htmllbox.h' line='289' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-75' is-artificial='yes'/>
          <parameter type-id='type-id-77'/>
          <return type-id='type-id-81'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='240'>
        <function-decl name='DoClear' mangled-name='_ZN19wxSimpleHtmlListBox7DoClearEv' filepath='src/generic/htmllbox.cpp' line='657' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxSimpleHtmlListBox7DoClearEv@@WXU_3.2'>
          <parameter type-id='type-id-74' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='241'>
        <function-decl name='DoDeleteOneItem' mangled-name='_ZN19wxSimpleHtmlListBox15DoDeleteOneItemEj' filepath='src/generic/htmllbox.cpp' line='672' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxSimpleHtmlListBox15DoDeleteOneItemEj@@WXU_3.2'>
          <parameter type-id='type-id-74' is-artificial='yes'/>
          <parameter type-id='type-id-77'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='242'>
        <function-decl name='SetRowCount' mangled-name='_ZN19wxSimpleHtmlListBox11SetRowCountEm' filepath='include/wx/htmllbox.h' line='303' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-74' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxVarVScrollHelper' size-in-bits='640' visibility='default' filepath='include/wx/vscroll.h' line='295' column='1' id='type-id-82'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-83'/>
      <member-function access='public' const='yes' vtable-offset='9'>
        <function-decl name='GetOrientationTargetSize' mangled-name='_ZNK18wxVarVScrollHelper24GetOrientationTargetSizeEv' filepath='include/wx/vscroll.h' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-84' is-artificial='yes'/>
          <return type-id='type-id-49'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='10'>
        <function-decl name='GetNonOrientationTargetSize' mangled-name='_ZNK18wxVarVScrollHelper27GetNonOrientationTargetSizeEv' filepath='include/wx/vscroll.h' line='331' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-84' is-artificial='yes'/>
          <return type-id='type-id-49'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='11'>
        <function-decl name='GetOrientation' mangled-name='_ZNK18wxVarVScrollHelper14GetOrientationEv' filepath='include/wx/vscroll.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-84' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='16'>
        <function-decl name='OnGetUnitSize' mangled-name='_ZNK18wxVarVScrollHelper13OnGetUnitSizeEm' filepath='include/wx/vscroll.h' line='339' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-84' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='17'>
        <function-decl name='OnGetUnitsSizeHint' mangled-name='_ZNK18wxVarVScrollHelper18OnGetUnitsSizeHintEmm' filepath='include/wx/vscroll.h' line='345' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-84' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='18'>
        <function-decl name='EstimateTotalSize' mangled-name='_ZNK18wxVarVScrollHelper17EstimateTotalSizeEv' filepath='include/wx/vscroll.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-84' is-artificial='yes'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <function-decl name='ScrollRows' mangled-name='_ZN18wxVarVScrollHelper10ScrollRowsEi' filepath='include/wx/vscroll.h' line='312' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-85' is-artificial='yes'/>
          <parameter type-id='type-id-49'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='ScrollRowPages' mangled-name='_ZN18wxVarVScrollHelper14ScrollRowPagesEi' filepath='include/wx/vscroll.h' line='314' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-85' is-artificial='yes'/>
          <parameter type-id='type-id-49'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='21'>
        <function-decl name='RefreshRow' mangled-name='_ZN18wxVarVScrollHelper10RefreshRowEm' filepath='include/wx/vscroll.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-85' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <function-decl name='RefreshRows' mangled-name='_ZN18wxVarVScrollHelper11RefreshRowsEmm' filepath='include/wx/vscroll.h' line='319' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-85' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='23'>
        <function-decl name='OnGetRowHeight' mangled-name='_ZNK18wxVarVScrollHelper14OnGetRowHeightEm' filepath='include/wx/vscroll.h' line='338' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-84' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='24'>
        <function-decl name='OnGetRowsHeightHint' mangled-name='_ZNK18wxVarVScrollHelper19OnGetRowsHeightHintEmm' filepath='include/wx/vscroll.h' line='341' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-84' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='25'>
        <function-decl name='EstimateTotalHeight' mangled-name='_ZNK18wxVarVScrollHelper19EstimateTotalHeightEv' filepath='include/wx/vscroll.h' line='349' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-84' is-artificial='yes'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxHtmlListBoxCache' size-in-bits='6464' visibility='default' filepath='src/generic/htmllbox.cpp' line='58' column='1' id='type-id-86'>
      <member-type access='private'>
        <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='src/generic/htmllbox.cpp' line='138' column='1' id='type-id-87'>
          <underlying-type type-id='type-id-21'/>
          <enumerator name='SIZE' value='50'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_next' type-id='type-id-12' visibility='default' filepath='src/generic/htmllbox.cpp' line='141' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_cells' type-id='type-id-16' visibility='default' filepath='src/generic/htmllbox.cpp' line='144' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3264'>
        <var-decl name='m_items' type-id='type-id-13' visibility='default' filepath='src/generic/htmllbox.cpp' line='147' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxHtmlListBoxStyle' size-in-bits='192' visibility='default' filepath='src/generic/htmllbox.cpp' line='156' column='1' id='type-id-88'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-89'/>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_hlbox' type-id='type-id-90' visibility='default' filepath='src/generic/htmllbox.cpp' line='189' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='GetSelectedTextColour' mangled-name='_ZN18wxHtmlListBoxStyle21GetSelectedTextColourERK8wxColour' filepath='src/generic/htmllbox.cpp' line='163' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-29' is-artificial='yes'/>
          <parameter type-id='type-id-58'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <function-decl name='GetSelectedTextBgColour' mangled-name='_ZN18wxHtmlListBoxStyle23GetSelectedTextBgColourERK8wxColour' filepath='src/generic/htmllbox.cpp' line='177' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-29' is-artificial='yes'/>
          <parameter type-id='type-id-58'/>
          <return type-id='type-id-59'/>
        </function-decl>
      </member-function>
    </class-decl>
    <qualified-type-def type-id='type-id-91' const='yes' id='type-id-92'/>
    <reference-type-def kind='lvalue' type-id='type-id-93' size-in-bits='64' id='type-id-94'/>
    <qualified-type-def type-id='type-id-18' const='yes' id='type-id-95'/>
    <reference-type-def kind='lvalue' type-id='type-id-95' size-in-bits='64' id='type-id-90'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-50'/>
    <qualified-type-def type-id='type-id-50' const='yes' id='type-id-35'/>
    <qualified-type-def type-id='type-id-86' const='yes' id='type-id-96'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-97'/>
    <qualified-type-def type-id='type-id-97' const='yes' id='type-id-98'/>
    <qualified-type-def type-id='type-id-88' const='yes' id='type-id-99'/>
    <reference-type-def kind='lvalue' type-id='type-id-99' size-in-bits='64' id='type-id-100'/>
    <qualified-type-def type-id='type-id-101' const='yes' id='type-id-102'/>
    <qualified-type-def type-id='type-id-67' const='yes' id='type-id-103'/>
    <reference-type-def kind='lvalue' type-id='type-id-103' size-in-bits='64' id='type-id-104'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-75'/>
    <qualified-type-def type-id='type-id-22' const='yes' id='type-id-105'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-106'/>
    <qualified-type-def type-id='type-id-106' const='yes' id='type-id-107'/>
    <qualified-type-def type-id='type-id-108' const='yes' id='type-id-109'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-110'/>
    <qualified-type-def type-id='type-id-83' const='yes' id='type-id-111'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-112'/>
    <qualified-type-def type-id='type-id-112' const='yes' id='type-id-113'/>
    <qualified-type-def type-id='type-id-82' const='yes' id='type-id-114'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-84'/>
    <qualified-type-def type-id='type-id-84' const='yes' id='type-id-115'/>
    <qualified-type-def type-id='type-id-17' const='yes' id='type-id-116'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-117'/>
    <reference-type-def kind='lvalue' type-id='type-id-15' size-in-bits='64' id='type-id-40'/>
    <reference-type-def kind='lvalue' type-id='type-id-18' size-in-bits='64' id='type-id-118'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-48'/>
    <qualified-type-def type-id='type-id-48' const='yes' id='type-id-32'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-26'/>
    <qualified-type-def type-id='type-id-26' const='yes' id='type-id-119'/>
    <reference-type-def kind='lvalue' type-id='type-id-88' size-in-bits='64' id='type-id-120'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-29'/>
    <qualified-type-def type-id='type-id-29' const='yes' id='type-id-121'/>
    <reference-type-def kind='lvalue' type-id='type-id-67' size-in-bits='64' id='type-id-122'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-74'/>
    <qualified-type-def type-id='type-id-74' const='yes' id='type-id-70'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-123'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-124'/>
    <qualified-type-def type-id='type-id-124' const='yes' id='type-id-125'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-126'/>
    <qualified-type-def type-id='type-id-126' const='yes' id='type-id-127'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-85'/>
    <qualified-type-def type-id='type-id-85' const='yes' id='type-id-128'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-129'/>
    <class-decl name='wxVListBox' visibility='default' is-declaration-only='yes' id='type-id-22'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxVListBox' mangled-name='_ZN10wxVListBoxD2Ev' filepath='include/wx/vlbox.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-123' is-artificial='yes'/>
          <parameter type-id='type-id-49'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxVListBox' mangled-name='_ZN10wxVListBoxD4Ev' filepath='include/wx/vlbox.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-123' is-artificial='yes'/>
          <parameter type-id='type-id-49'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK10wxVListBox12GetClassInfoEv' filepath='include/wx/vlbox.h' line='308' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-106' is-artificial='yes'/>
          <return type-id='type-id-51'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='14'>
        <function-decl name='GetEventTable' mangled-name='_ZNK10wxVListBox13GetEventTableEv' filepath='include/wx/vlbox.h' line='306' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-106' is-artificial='yes'/>
          <return type-id='type-id-52'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='15'>
        <function-decl name='GetEventHashTable' mangled-name='_ZNK10wxVListBox17GetEventHashTableEv' filepath='include/wx/vlbox.h' line='306' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-106' is-artificial='yes'/>
          <return type-id='type-id-53'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='105'>
        <function-decl name='GetDefaultAttributes' mangled-name='_ZNK10wxVListBox20GetDefaultAttributesEv' filepath='include/wx/vlbox.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-106' is-artificial='yes'/>
          <return type-id='type-id-130'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='161'>
        <function-decl name='GetDefaultBorder' mangled-name='_ZNK10wxVListBox16GetDefaultBorderEv' filepath='include/wx/vlbox.h' line='206' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-106' is-artificial='yes'/>
          <return type-id='type-id-131'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='206'>
        <function-decl name='SetItemCount' mangled-name='_ZN10wxVListBox12SetItemCountEm' filepath='include/wx/vlbox.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-123' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='209'>
        <function-decl name='OnDrawSeparator' mangled-name='_ZNK10wxVListBox15OnDrawSeparatorER4wxDCR6wxRectm' filepath='include/wx/vlbox.h' line='221' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-106' is-artificial='yes'/>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-132'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='210'>
        <function-decl name='OnDrawBackground' mangled-name='_ZNK10wxVListBox16OnDrawBackgroundER4wxDCRK6wxRectm' filepath='include/wx/vlbox.h' line='230' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-106' is-artificial='yes'/>
          <parameter type-id='type-id-54'/>
          <parameter type-id='type-id-55'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='211'>
        <function-decl name='OnGetRowHeight' mangled-name='_ZNK10wxVListBox14OnGetRowHeightEm' filepath='include/wx/vlbox.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-106' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-56'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='212'>
        <function-decl name='InitEvent' mangled-name='_ZN10wxVListBox9InitEventER14wxCommandEventi' filepath='include/wx/vlbox.h' line='252' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-123' is-artificial='yes'/>
          <parameter type-id='type-id-76'/>
          <parameter type-id='type-id-49'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxVScrolledWindow' visibility='default' is-declaration-only='yes' id='type-id-108'>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK17wxVScrolledWindow12GetClassInfoEv' filepath='include/wx/vscroll.h' line='735' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-110' is-artificial='yes'/>
          <return type-id='type-id-51'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='100'>
        <function-decl name='PrepareDC' mangled-name='_ZN17wxVScrolledWindow9PrepareDCER4wxDC' filepath='include/wx/vscroll.h' line='726' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-124' is-artificial='yes'/>
          <parameter type-id='type-id-54'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='142'>
        <function-decl name='Layout' mangled-name='_ZN17wxVScrolledWindow6LayoutEv' filepath='include/wx/vscroll.h' line='726' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-124' is-artificial='yes'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxVarScrollHelperBase' visibility='default' is-declaration-only='yes' id='type-id-83'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxVarScrollHelperBase' mangled-name='_ZN21wxVarScrollHelperBaseD2Ev' filepath='include/wx/vscroll.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-126' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxVarScrollHelperBase' mangled-name='_ZN21wxVarScrollHelperBaseD4Ev' filepath='include/wx/vscroll.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-126' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <function-decl name='DoPrepareDC' mangled-name='_ZN21wxVarScrollHelperBase11DoPrepareDCER4wxDC' filepath='include/wx/vscroll.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-126' is-artificial='yes'/>
          <parameter type-id='type-id-54'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='4'>
        <function-decl name='RefreshAll' mangled-name='_ZN21wxVarScrollHelperBase10RefreshAllEv' filepath='include/wx/vscroll.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-126' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='DoCalcScrolledPosition' mangled-name='_ZNK21wxVarScrollHelperBase22DoCalcScrolledPositionEi' filepath='include/wx/vscroll.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-112' is-artificial='yes'/>
          <parameter type-id='type-id-49'/>
          <return type-id='type-id-49'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='6'>
        <function-decl name='DoCalcUnscrolledPosition' mangled-name='_ZNK21wxVarScrollHelperBase24DoCalcUnscrolledPositionEi' filepath='include/wx/vscroll.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-112' is-artificial='yes'/>
          <parameter type-id='type-id-49'/>
          <return type-id='type-id-49'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='UpdateScrollbar' mangled-name='_ZN21wxVarScrollHelperBase15UpdateScrollbarEv' filepath='include/wx/vscroll.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-126' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='SetTargetWindow' mangled-name='_ZN21wxVarScrollHelperBase15SetTargetWindowEP8wxWindow' filepath='include/wx/vscroll.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-126' is-artificial='yes'/>
          <parameter type-id='type-id-43'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='12'>
        <function-decl name='RefreshUnit' mangled-name='_ZN21wxVarScrollHelperBase11RefreshUnitEm' filepath='include/wx/vscroll.h' line='157' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-126' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='13'>
        <function-decl name='RefreshUnits' mangled-name='_ZN21wxVarScrollHelperBase12RefreshUnitsEmm' filepath='include/wx/vscroll.h' line='160' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-126' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='14'>
        <function-decl name='DoScrollUnits' mangled-name='_ZN21wxVarScrollHelperBase13DoScrollUnitsEi' filepath='include/wx/vscroll.h' line='169' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-126' is-artificial='yes'/>
          <parameter type-id='type-id-49'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='15'>
        <function-decl name='DoScrollPages' mangled-name='_ZN21wxVarScrollHelperBase13DoScrollPagesEi' filepath='include/wx/vscroll.h' line='170' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-126' is-artificial='yes'/>
          <parameter type-id='type-id-49'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
    </class-decl>
    <var-decl name='wxHtmlListBoxNameStr' type-id='type-id-7' mangled-name='wxHtmlListBoxNameStr' visibility='default' filepath='include/wx/htmllbox.h' line='31' column='1' elf-symbol-id='wxHtmlListBoxNameStr@@WXU_3.2'/>
    <var-decl name='wxSimpleHtmlListBoxNameStr' type-id='type-id-7' mangled-name='wxSimpleHtmlListBoxNameStr' visibility='default' filepath='include/wx/htmllbox.h' line='32' column='1' elf-symbol-id='wxSimpleHtmlListBoxNameStr@@WXU_3.2'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-3'/>
  </abi-instr>
  <abi-instr address-size='64' path='src/html/helpctrl.cpp' language='LANG_C_plus_plus_14'>
    <type-decl name='__float128' size-in-bits='128' id='type-id-133'/>
    <type-decl name='__int128' size-in-bits='128' id='type-id-134'/>
    <type-decl name='bool' size-in-bits='8' id='type-id-41'/>
    <type-decl name='char' size-in-bits='8' id='type-id-135'/>
    <array-type-def dimensions='1' type-id='type-id-135' size-in-bits='128' id='type-id-136'>
      <subrange length='16' type-id='type-id-3' id='type-id-137'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-135' size-in-bits='8' id='type-id-138'>
      <subrange length='1' type-id='type-id-3' id='type-id-139'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-135' size-in-bits='160' id='type-id-140'>
      <subrange length='20' type-id='type-id-3' id='type-id-141'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-135' size-in-bits='32' id='type-id-142'>
      <subrange length='4' type-id='type-id-3' id='type-id-11'/>
    </array-type-def>
    <class-decl name='typedef __va_list_tag __va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-143'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-77' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-77' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-81' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-81' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='type-id-144'/>
    <type-decl name='float' size-in-bits='32' id='type-id-145'/>
    <type-decl name='int' size-in-bits='32' id='type-id-49'/>
    <type-decl name='long double' size-in-bits='128' id='type-id-146'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-46'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-147'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-148'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-149'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-150'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-21'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-151'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-77'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-3'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-152'/>
    <type-decl name='variadic parameter type' id='type-id-153'/>
    <type-decl name='void' id='type-id-34'/>
    <type-decl name='wchar_t' size-in-bits='32' id='type-id-154'/>
    <array-type-def dimensions='1' type-id='type-id-154' size-in-bits='128' id='type-id-155'>
      <subrange length='4' type-id='type-id-3' id='type-id-11'/>
    </array-type-def>
    <class-decl name='wxAnyStrPtr' size-in-bits='128' visibility='default' filepath='include/wx/anystr.h' line='29' column='1' id='type-id-156'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_str' type-id='type-id-157' visibility='default' filepath='include/wx/anystr.h' line='134' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_iter' type-id='type-id-158' visibility='default' filepath='include/wx/anystr.h' line='135' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArrayString' size-in-bits='320' visibility='default' filepath='include/wx/arrstr.h' line='157' column='1' id='type-id-68'>
      <member-type access='public'>
        <typedef-decl name='CompareFunction' type-id='type-id-160' filepath='include/wx/arrstr.h' line='161' column='1' id='type-id-159'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CompareFunction2' type-id='type-id-162' filepath='include/wx/arrstr.h' line='165' column='1' id='type-id-161'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-57' filepath='include/wx/arrstr.h' line='267' column='1' id='type-id-163'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-165' filepath='include/wx/arrstr.h' line='270' column='1' id='type-id-164'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-167' filepath='include/wx/arrstr.h' line='271' column='1' id='type-id-166'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-169' filepath='include/wx/arrstr.h' line='272' column='1' id='type-id-168'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-171' filepath='include/wx/arrstr.h' line='273' column='1' id='type-id-170'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-12' filepath='include/wx/arrstr.h' line='275' column='1' id='type-id-172'/>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator' size-in-bits='64' visibility='default' filepath='include/wx/arrstr.h' line='278' column='1' id='type-id-173'>
          <member-type access='private'>
            <typedef-decl name='value_type' type-id='type-id-57' filepath='include/wx/arrstr.h' line='280' column='1' id='type-id-174'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='type-id-176' filepath='include/wx/arrstr.h' line='281' column='1' id='type-id-175'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reference' type-id='type-id-178' filepath='include/wx/arrstr.h' line='282' column='1' id='type-id-177'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='itor' type-id='type-id-173' filepath='include/wx/arrstr.h' line='283' column='1' id='type-id-179'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_ptr' type-id='type-id-175' visibility='default' filepath='include/wx/arrstr.h' line='289' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_reverse_iterator' size-in-bits='64' visibility='default' filepath='include/wx/arrstr.h' line='304' column='1' id='type-id-180'>
          <member-type access='private'>
            <typedef-decl name='value_type' type-id='type-id-57' filepath='include/wx/arrstr.h' line='306' column='1' id='type-id-181'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='type-id-183' filepath='include/wx/arrstr.h' line='307' column='1' id='type-id-182'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reference' type-id='type-id-185' filepath='include/wx/arrstr.h' line='308' column='1' id='type-id-184'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='itor' type-id='type-id-180' filepath='include/wx/arrstr.h' line='309' column='1' id='type-id-186'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_ptr' type-id='type-id-182' visibility='default' filepath='include/wx/arrstr.h' line='315' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_compareFunction' type-id='type-id-159' visibility='default' filepath='include/wx/arrstr.h' line='393' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_nSize' type-id='type-id-12' visibility='default' filepath='include/wx/arrstr.h' line='406' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_nCount' type-id='type-id-12' visibility='default' filepath='include/wx/arrstr.h' line='407' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_pItems' type-id='type-id-62' visibility='default' filepath='include/wx/arrstr.h' line='409' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_autoSort' type-id='type-id-41' visibility='default' filepath='include/wx/arrstr.h' line='411' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxScopedCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='66' column='1' id='type-id-187'>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-135' filepath='include/wx/buffer.h' line='69' column='1' id='type-id-188'/>
      </member-type>
      <member-type access='protected'>
        <class-decl name='Data' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='164' column='1' id='type-id-189'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-190'/>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-191' visibility='default' filepath='include/wx/buffer.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxScopedCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='66' column='1' id='type-id-192'>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-154' filepath='include/wx/buffer.h' line='69' column='1' id='type-id-193'/>
      </member-type>
      <member-type access='protected'>
        <class-decl name='Data' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='164' column='1' id='type-id-194'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-190'/>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-195' visibility='default' filepath='include/wx/buffer.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxScopedCharBuffer' type-id='type-id-187' filepath='include/wx/buffer.h' line='241' column='1' id='type-id-196'/>
    <typedef-decl name='wxScopedWCharBuffer' type-id='type-id-192' filepath='include/wx/buffer.h' line='242' column='1' id='type-id-197'/>
    <class-decl name='wxCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='247' column='1' id='type-id-198'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-187'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-135' filepath='include/wx/buffer.h' line='253' column='1' id='type-id-199'/>
      </member-type>
    </class-decl>
    <class-decl name='wxCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='247' column='1' id='type-id-200'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-192'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-154' filepath='include/wx/buffer.h' line='253' column='1' id='type-id-201'/>
      </member-type>
    </class-decl>
    <class-decl name='wxCharBuffer' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='357' column='1' id='type-id-202'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-198'/>
      <member-type access='public'>
        <typedef-decl name='wxCharTypeBufferBase' type-id='type-id-198' filepath='include/wx/buffer.h' line='360' column='1' id='type-id-203'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='wxScopedCharTypeBufferBase' type-id='type-id-187' filepath='include/wx/buffer.h' line='361' column='1' id='type-id-204'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWritableCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='393' column='1' id='type-id-205'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-198'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-188' filepath='include/wx/buffer.h' line='396' column='1' id='type-id-206'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWritableCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='393' column='1' id='type-id-207'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-200'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-193' filepath='include/wx/buffer.h' line='396' column='1' id='type-id-208'/>
      </member-type>
    </class-decl>
    <typedef-decl name='wxWritableCharBuffer' type-id='type-id-205' filepath='include/wx/buffer.h' line='410' column='1' id='type-id-209'/>
    <typedef-decl name='wxWritableWCharBuffer' type-id='type-id-207' filepath='include/wx/buffer.h' line='411' column='1' id='type-id-210'/>
    <class-decl name='wxBusyInfoFlags' size-in-bits='1664' visibility='default' filepath='include/wx/busyinfo.h' line='29' column='1' id='type-id-211'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_parent' type-id='type-id-43' visibility='default' filepath='include/wx/busyinfo.h' line='59' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_icon' type-id='type-id-212' visibility='default' filepath='include/wx/busyinfo.h' line='61' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_title' type-id='type-id-57' visibility='default' filepath='include/wx/busyinfo.h' line='62' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='m_text' type-id='type-id-57' visibility='default' filepath='include/wx/busyinfo.h' line='63' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='960'>
        <var-decl name='m_label' type-id='type-id-57' visibility='default' filepath='include/wx/busyinfo.h' line='64' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1344'>
        <var-decl name='m_foreground' type-id='type-id-59' visibility='default' filepath='include/wx/busyinfo.h' line='66' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1472'>
        <var-decl name='m_background' type-id='type-id-59' visibility='default' filepath='include/wx/busyinfo.h' line='67' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1600'>
        <var-decl name='m_alpha' type-id='type-id-213' visibility='default' filepath='include/wx/busyinfo.h' line='69' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxChar' type-id='type-id-154' filepath='include/wx/chartype.h' line='123' column='1' id='type-id-214'/>
    <typedef-decl name='wxStringCharType' type-id='type-id-154' filepath='include/wx/chartype.h' line='170' column='1' id='type-id-215'/>
    <class-decl name='wxClientData' size-in-bits='64' visibility='default' filepath='include/wx/clntdata.h' line='98' column='1' id='type-id-216'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxClientData' mangled-name='_ZN12wxClientDataD0Ev' filepath='include/wx/clntdata.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-217' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxClientData' mangled-name='_ZN12wxClientDataD2Ev' filepath='include/wx/clntdata.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-217' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxClientData' mangled-name='_ZN12wxClientDataD4Ev' filepath='include/wx/clntdata.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-217' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxNavigationEnabled&lt;wxTopLevelWindow&gt;' size-in-bits='7616' visibility='default' filepath='include/wx/containr.h' line='189' column='1' id='type-id-218'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-219'/>
      <data-member access='protected' layout-offset-in-bits='7360'>
        <var-decl name='m_container' type-id='type-id-220' visibility='default' filepath='include/wx/containr.h' line='293' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='71'>
        <function-decl name='SetFocus' mangled-name='_ZN19wxNavigationEnabledI16wxTopLevelWindowE8SetFocusEv' filepath='include/wx/containr.h' line='250' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-221' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='74'>
        <function-decl name='AcceptsFocus' mangled-name='_ZNK19wxNavigationEnabledI16wxTopLevelWindowE12AcceptsFocusEv' filepath='include/wx/containr.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-222' is-artificial='yes'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='75'>
        <function-decl name='AcceptsFocusRecursively' mangled-name='_ZNK19wxNavigationEnabledI16wxTopLevelWindowE23AcceptsFocusRecursivelyEv' filepath='include/wx/containr.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-222' is-artificial='yes'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='76'>
        <function-decl name='AcceptsFocusFromKeyboard' mangled-name='_ZNK19wxNavigationEnabledI16wxTopLevelWindowE24AcceptsFocusFromKeyboardEv' filepath='include/wx/containr.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-222' is-artificial='yes'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='82'>
        <function-decl name='AddChild' mangled-name='_ZN19wxNavigationEnabledI16wxTopLevelWindowE8AddChildEP12wxWindowBase' filepath='include/wx/containr.h' line='224' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-221' is-artificial='yes'/>
          <parameter type-id='type-id-223'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='83'>
        <function-decl name='RemoveChild' mangled-name='_ZN19wxNavigationEnabledI16wxTopLevelWindowE11RemoveChildEP12wxWindowBase' filepath='include/wx/containr.h' line='237' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-221' is-artificial='yes'/>
          <parameter type-id='type-id-223'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxDateTime' size-in-bits='64' visibility='default' filepath='include/wx/datetime.h' line='128' column='1' id='type-id-224'>
      <member-type access='public'>
        <typedef-decl name='wxDateTime_t' type-id='type-id-152' filepath='include/wx/datetime.h' line='139' column='1' id='type-id-225'/>
      </member-type>
      <member-type access='public'>
        <enum-decl name='TZ' filepath='include/wx/datetime.h' line='145' column='1' id='type-id-226'>
          <underlying-type type-id='type-id-21'/>
          <enumerator name='Local' value='0'/>
          <enumerator name='GMT_12' value='1'/>
          <enumerator name='GMT_11' value='2'/>
          <enumerator name='GMT_10' value='3'/>
          <enumerator name='GMT_9' value='4'/>
          <enumerator name='GMT_8' value='5'/>
          <enumerator name='GMT_7' value='6'/>
          <enumerator name='GMT_6' value='7'/>
          <enumerator name='GMT_5' value='8'/>
          <enumerator name='GMT_4' value='9'/>
          <enumerator name='GMT_3' value='10'/>
          <enumerator name='GMT_2' value='11'/>
          <enumerator name='GMT_1' value='12'/>
          <enumerator name='GMT0' value='13'/>
          <enumerator name='GMT1' value='14'/>
          <enumerator name='GMT2' value='15'/>
          <enumerator name='GMT3' value='16'/>
          <enumerator name='GMT4' value='17'/>
          <enumerator name='GMT5' value='18'/>
          <enumerator name='GMT6' value='19'/>
          <enumerator name='GMT7' value='20'/>
          <enumerator name='GMT8' value='21'/>
          <enumerator name='GMT9' value='22'/>
          <enumerator name='GMT10' value='23'/>
          <enumerator name='GMT11' value='24'/>
          <enumerator name='GMT12' value='25'/>
          <enumerator name='GMT13' value='26'/>
          <enumerator name='WET' value='13'/>
          <enumerator name='WEST' value='14'/>
          <enumerator name='CET' value='14'/>
          <enumerator name='CEST' value='15'/>
          <enumerator name='EET' value='15'/>
          <enumerator name='EEST' value='16'/>
          <enumerator name='MSK' value='16'/>
          <enumerator name='MSD' value='17'/>
          <enumerator name='AST' value='9'/>
          <enumerator name='ADT' value='10'/>
          <enumerator name='EST' value='8'/>
          <enumerator name='EDT' value='9'/>
          <enumerator name='CST' value='7'/>
          <enumerator name='CDT' value='8'/>
          <enumerator name='MST' value='6'/>
          <enumerator name='MDT' value='7'/>
          <enumerator name='PST' value='5'/>
          <enumerator name='PDT' value='6'/>
          <enumerator name='HST' value='3'/>
          <enumerator name='AKST' value='4'/>
          <enumerator name='AKDT' value='5'/>
          <enumerator name='A_WST' value='21'/>
          <enumerator name='A_CST' value='27'/>
          <enumerator name='A_EST' value='23'/>
          <enumerator name='A_ESST' value='24'/>
          <enumerator name='NZST' value='25'/>
          <enumerator name='NZDT' value='26'/>
          <enumerator name='UTC' value='13'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='Calendar' filepath='include/wx/datetime.h' line='212' column='1' id='type-id-227'>
          <underlying-type type-id='type-id-21'/>
          <enumerator name='Gregorian' value='0'/>
          <enumerator name='Julian' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='Country' filepath='include/wx/datetime.h' line='226' column='1' id='type-id-228'>
          <underlying-type type-id='type-id-21'/>
          <enumerator name='Country_Unknown' value='0'/>
          <enumerator name='Country_Default' value='1'/>
          <enumerator name='Country_WesternEurope_Start' value='2'/>
          <enumerator name='Country_EEC' value='2'/>
          <enumerator name='France' value='3'/>
          <enumerator name='Germany' value='4'/>
          <enumerator name='UK' value='5'/>
          <enumerator name='Country_WesternEurope_End' value='5'/>
          <enumerator name='Russia' value='6'/>
          <enumerator name='USA' value='7'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='Month' filepath='include/wx/datetime.h' line='248' column='1' id='type-id-229'>
          <underlying-type type-id='type-id-21'/>
          <enumerator name='Jan' value='0'/>
          <enumerator name='Feb' value='1'/>
          <enumerator name='Mar' value='2'/>
          <enumerator name='Apr' value='3'/>
          <enumerator name='May' value='4'/>
          <enumerator name='Jun' value='5'/>
          <enumerator name='Jul' value='6'/>
          <enumerator name='Aug' value='7'/>
          <enumerator name='Sep' value='8'/>
          <enumerator name='Oct' value='9'/>
          <enumerator name='Nov' value='10'/>
          <enumerator name='Dec' value='11'/>
          <enumerator name='Inv_Month' value='12'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='WeekDay' filepath='include/wx/datetime.h' line='254' column='1' id='type-id-230'>
          <underlying-type type-id='type-id-21'/>
          <enumerator name='Sun' value='0'/>
          <enumerator name='Mon' value='1'/>
          <enumerator name='Tue' value='2'/>
          <enumerator name='Wed' value='3'/>
          <enumerator name='Thu' value='4'/>
          <enumerator name='Fri' value='5'/>
          <enumerator name='Sat' value='6'/>
          <enumerator name='Inv_WeekDay' value='7'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='NameFlags' filepath='include/wx/datetime.h' line='266' column='1' id='type-id-231'>
          <underlying-type type-id='type-id-21'/>
          <enumerator name='Name_Full' value='1'/>
          <enumerator name='Name_Abbr' value='2'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='WeekFlags' filepath='include/wx/datetime.h' line='273' column='1' id='type-id-232'>
          <underlying-type type-id='type-id-21'/>
          <enumerator name='Default_First' value='0'/>
          <enumerator name='Monday_First' value='1'/>
          <enumerator name='Sunday_First' value='2'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='TimeZone' size-in-bits='64' visibility='default' filepath='include/wx/datetime.h' line='294' column='1' id='type-id-233'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_offset' type-id='type-id-46' visibility='default' filepath='include/wx/datetime.h' line='315' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='Tm' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/wx/datetime.h' line='325' column='1' id='type-id-234'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='msec' type-id='type-id-225' visibility='default' filepath='include/wx/datetime.h' line='327' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='16'>
            <var-decl name='sec' type-id='type-id-225' visibility='default' filepath='include/wx/datetime.h' line='327' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <var-decl name='min' type-id='type-id-225' visibility='default' filepath='include/wx/datetime.h' line='327' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='48'>
            <var-decl name='hour' type-id='type-id-225' visibility='default' filepath='include/wx/datetime.h' line='327' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='mday' type-id='type-id-225' visibility='default' filepath='include/wx/datetime.h' line='328' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='80'>
            <var-decl name='yday' type-id='type-id-225' visibility='default' filepath='include/wx/datetime.h' line='329' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='96'>
            <var-decl name='mon' type-id='type-id-229' visibility='default' filepath='include/wx/datetime.h' line='330' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='year' type-id='type-id-49' visibility='default' filepath='include/wx/datetime.h' line='331' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='192'>
            <var-decl name='m_tz' type-id='type-id-233' visibility='default' filepath='include/wx/datetime.h' line='362' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='256'>
            <var-decl name='wday' type-id='type-id-225' visibility='default' filepath='include/wx/datetime.h' line='367' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_time' type-id='type-id-235' visibility='default' filepath='include/wx/datetime.h' line='1160' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxTimeSpan' size-in-bits='64' visibility='default' filepath='include/wx/datetime.h' line='1169' column='1' id='type-id-236'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_diff' type-id='type-id-235' visibility='default' filepath='include/wx/datetime.h' line='1357' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxDateSpan' size-in-bits='128' visibility='default' filepath='include/wx/datetime.h' line='1395' column='1' id='type-id-237'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_years' type-id='type-id-49' visibility='default' filepath='include/wx/datetime.h' line='1518' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='m_months' type-id='type-id-49' visibility='default' filepath='include/wx/datetime.h' line='1519' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_weeks' type-id='type-id-49' visibility='default' filepath='include/wx/datetime.h' line='1520' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='m_days' type-id='type-id-49' visibility='default' filepath='include/wx/datetime.h' line='1521' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxBorder' filepath='include/wx/defs.h' line='1443' column='1' id='type-id-131'>
      <underlying-type type-id='type-id-21'/>
      <enumerator name='wxBORDER_DEFAULT' value='0'/>
      <enumerator name='wxBORDER_NONE' value='2097152'/>
      <enumerator name='wxBORDER_STATIC' value='16777216'/>
      <enumerator name='wxBORDER_SIMPLE' value='33554432'/>
      <enumerator name='wxBORDER_RAISED' value='67108864'/>
      <enumerator name='wxBORDER_SUNKEN' value='134217728'/>
      <enumerator name='wxBORDER_DOUBLE' value='268435456'/>
      <enumerator name='wxBORDER_THEME' value='268435456'/>
      <enumerator name='wxBORDER_MASK' value='522190848'/>
    </enum-decl>
    <enum-decl name='wxBackgroundStyle' filepath='include/wx/defs.h' line='1816' column='1' id='type-id-238'>
      <underlying-type type-id='type-id-21'/>
      <enumerator name='wxBG_STYLE_ERASE' value='0'/>
      <enumerator name='wxBG_STYLE_SYSTEM' value='1'/>
      <enumerator name='wxBG_STYLE_PAINT' value='2'/>
      <enumerator name='wxBG_STYLE_TRANSPARENT' value='3'/>
      <enumerator name='wxBG_STYLE_COLOUR' value='4'/>
      <enumerator name='wxBG_STYLE_CUSTOM' value='2'/>
    </enum-decl>
    <enum-decl name='wxKeyType' filepath='include/wx/defs.h' line='1857' column='1' id='type-id-239'>
      <underlying-type type-id='type-id-21'/>
      <enumerator name='wxKEY_NONE' value='0'/>
      <enumerator name='wxKEY_INTEGER' value='1'/>
      <enumerator name='wxKEY_STRING' value='2'/>
    </enum-decl>
    <typedef-decl name='wxWindowID' type-id='type-id-49' filepath='include/wx/defs.h' line='2069' column='1' id='type-id-44'/>
    <enum-decl name='wxHitTest' filepath='include/wx/defs.h' line='2099' column='1' id='type-id-240'>
      <underlying-type type-id='type-id-21'/>
      <enumerator name='wxHT_NOWHERE' value='0'/>
      <enumerator name='wxHT_SCROLLBAR_FIRST' value='0'/>
      <enumerator name='wxHT_SCROLLBAR_ARROW_LINE_1' value='1'/>
      <enumerator name='wxHT_SCROLLBAR_ARROW_LINE_2' value='2'/>
      <enumerator name='wxHT_SCROLLBAR_ARROW_PAGE_1' value='3'/>
      <enumerator name='wxHT_SCROLLBAR_ARROW_PAGE_2' value='4'/>
      <enumerator name='wxHT_SCROLLBAR_THUMB' value='5'/>
      <enumerator name='wxHT_SCROLLBAR_BAR_1' value='6'/>
      <enumerator name='wxHT_SCROLLBAR_BAR_2' value='7'/>
      <enumerator name='wxHT_SCROLLBAR_LAST' value='8'/>
      <enumerator name='wxHT_WINDOW_OUTSIDE' value='9'/>
      <enumerator name='wxHT_WINDOW_INSIDE' value='10'/>
      <enumerator name='wxHT_WINDOW_VERT_SCROLLBAR' value='11'/>
      <enumerator name='wxHT_WINDOW_HORZ_SCROLLBAR' value='12'/>
      <enumerator name='wxHT_WINDOW_CORNER' value='13'/>
      <enumerator name='wxHT_MAX' value='14'/>
    </enum-decl>
    <typedef-decl name='GdkWindow' type-id='type-id-241' filepath='include/wx/defs.h' line='3091' column='1' id='type-id-242'/>
    <typedef-decl name='GtkWidget' type-id='type-id-243' filepath='include/wx/defs.h' line='3103' column='1' id='type-id-244'/>
    <typedef-decl name='GtkRcStyle' type-id='type-id-245' filepath='include/wx/defs.h' line='3104' column='1' id='type-id-246'/>
    <typedef-decl name='WXWidget' type-id='type-id-247' filepath='include/wx/defs.h' line='3115' column='1' id='type-id-248'/>
    <enum-decl name='wxDialogModality' filepath='include/wx/dialog.h' line='55' column='1' id='type-id-249'>
      <underlying-type type-id='type-id-21'/>
      <enumerator name='wxDIALOG_MODALITY_NONE' value='0'/>
      <enumerator name='wxDIALOG_MODALITY_WINDOW_MODAL' value='1'/>
      <enumerator name='wxDIALOG_MODALITY_APP_MODAL' value='2'/>
    </enum-decl>
    <class-decl name='wxArray_SortFunction&lt;_GdkWindow*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-250'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-252' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-251'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-251' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArray_SortFunction&lt;const wxEventTableEntry*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-253'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-255' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-254'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-254' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArray_SortFunction&lt;int&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-256'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-258' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-257'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-257' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;_GdkWindow*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-259'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-261' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-260'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-260' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;const wxEventTableEntry*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-262'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-264' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-263'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-263' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;int&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-265'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-267' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-266'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-266' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxBaseArray&lt;_GdkWindow*, wxSortedArray_SortFunction&lt;_GdkWindow*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-268'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-269'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-260' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-270'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-251' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-271'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-273' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-272'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseArray&lt;const wxEventTableEntry*, wxSortedArray_SortFunction&lt;const wxEventTableEntry*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-274'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-275'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-263' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-276'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-254' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-277'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-279' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-278'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseArray&lt;int, wxSortedArray_SortFunction&lt;int&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-280'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-281'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-266' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-282'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-257' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-283'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-285' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-284'/>
      </member-type>
    </class-decl>
    <class-decl name='wxArrayInt' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='858' column='1' id='type-id-286'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-280'/>
    </class-decl>
    <typedef-decl name='wxEventType' type-id='type-id-49' filepath='include/wx/event.h' line='77' column='1' id='type-id-287'/>
    <class-decl name='wxObjectEventFunctor' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='258' column='1' id='type-id-288'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-289'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-290' visibility='default' filepath='include/wx/event.h' line='288' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxObjectEventFunctorclEP12wxEvtHandlerR7wxEvent' filepath='include/wx/event.h' line='4105' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-291' is-artificial='yes'/>
          <parameter type-id='type-id-290'/>
          <parameter type-id='type-id-292'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxObjectEventFunctor10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-293' is-artificial='yes'/>
          <parameter type-id='type-id-294'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxObjectEventFunctor13GetEvtHandlerEv' filepath='include/wx/event.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-293' is-artificial='yes'/>
          <return type-id='type-id-290'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxObjectEventFunctor12GetEvtMethodEv' filepath='include/wx/event.h' line='284' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-293' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEventTableEntryBase' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3469' column='1' id='type-id-295'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_id' type-id='type-id-49' visibility='default' filepath='include/wx/event.h' line='3504' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='m_lastId' type-id='type-id-49' visibility='default' filepath='include/wx/event.h' line='3505' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='m_fn' type-id='type-id-296' visibility='default' filepath='include/wx/event.h' line='3508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='m_callbackUserData' type-id='type-id-297' visibility='default' filepath='include/wx/event.h' line='3511' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTableEntry' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3518' column='1' id='type-id-298'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-295'/>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_eventType' type-id='type-id-299' visibility='default' filepath='include/wx/event.h' line='3532' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxDynamicEventTableEntry' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3539' column='1' id='type-id-300'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-295'/>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_eventType' type-id='type-id-49' visibility='default' filepath='include/wx/event.h' line='3550' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTable' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3560' column='1' id='type-id-301'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='baseTable' type-id='type-id-52' visibility='default' filepath='include/wx/event.h' line='3562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='entries' type-id='type-id-302' visibility='default' filepath='include/wx/event.h' line='3563' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTableEntryPointerArray' size-in-bits='192' visibility='default' filepath='include/wx/event.h' line='3570' column='1' id='type-id-303'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-274'/>
    </class-decl>
    <class-decl name='wxEventHashTable' size-in-bits='384' visibility='default' filepath='include/wx/event.h' line='3572' column='1' id='type-id-31'>
      <member-type access='private'>
        <class-decl name='EventTypeTable' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3576' column='1' id='type-id-304'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='eventType' type-id='type-id-287' visibility='default' filepath='include/wx/event.h' line='3578' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='eventEntryTable' type-id='type-id-303' visibility='default' filepath='include/wx/event.h' line='3579' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='EventTypeTablePointer' type-id='type-id-306' filepath='include/wx/event.h' line='3581' column='1' id='type-id-305'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_table' type-id='type-id-307' visibility='default' filepath='include/wx/event.h' line='3617' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_rebuildHash' type-id='type-id-41' visibility='default' filepath='include/wx/event.h' line='3618' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_size' type-id='type-id-12' visibility='default' filepath='include/wx/event.h' line='3620' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_eventTypeTable' type-id='type-id-308' visibility='default' filepath='include/wx/event.h' line='3621' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='256'>
        <var-decl name='m_previous' type-id='type-id-309' visibility='default' filepath='include/wx/event.h' line='3624' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='320'>
        <var-decl name='m_next' type-id='type-id-309' visibility='default' filepath='include/wx/event.h' line='3625' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxFile' size-in-bits='64' visibility='default' filepath='include/wx/file.h' line='30' column='1' id='type-id-310'>
      <member-type access='public'>
        <enum-decl name='OpenMode' filepath='include/wx/file.h' line='39' column='1' id='type-id-311'>
          <underlying-type type-id='type-id-21'/>
          <enumerator name='read' value='0'/>
          <enumerator name='write' value='1'/>
          <enumerator name='read_write' value='2'/>
          <enumerator name='write_append' value='3'/>
          <enumerator name='write_excl' value='4'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_fd' type-id='type-id-49' visibility='default' filepath='include/wx/file.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='m_lasterror' type-id='type-id-49' visibility='default' filepath='include/wx/file.h' line='132' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxSeekMode' filepath='include/wx/filefn.h' line='55' column='1' id='type-id-312'>
      <underlying-type type-id='type-id-21'/>
      <enumerator name='wxFromStart' value='0'/>
      <enumerator name='wxFromCurrent' value='1'/>
      <enumerator name='wxFromEnd' value='2'/>
    </enum-decl>
    <enum-decl name='wxFileKind' filepath='include/wx/filefn.h' line='62' column='1' id='type-id-313'>
      <underlying-type type-id='type-id-21'/>
      <enumerator name='wxFILE_KIND_UNKNOWN' value='0'/>
      <enumerator name='wxFILE_KIND_DISK' value='1'/>
      <enumerator name='wxFILE_KIND_TERMINAL' value='2'/>
      <enumerator name='wxFILE_KIND_PIPE' value='3'/>
    </enum-decl>
    <typedef-decl name='wxFileOffset' type-id='type-id-314' filepath='include/wx/filefn.h' line='343' column='1' id='type-id-315'/>
    <enum-decl name='wxPathFormat' filepath='include/wx/filename.h' line='42' column='1' id='type-id-316'>
      <underlying-type type-id='type-id-21'/>
      <enumerator name='wxPATH_NATIVE' value='0'/>
      <enumerator name='wxPATH_UNIX' value='1'/>
      <enumerator name='wxPATH_BEOS' value='1'/>
      <enumerator name='wxPATH_MAC' value='2'/>
      <enumerator name='wxPATH_DOS' value='3'/>
      <enumerator name='wxPATH_WIN' value='3'/>
      <enumerator name='wxPATH_OS2' value='3'/>
      <enumerator name='wxPATH_VMS' value='4'/>
      <enumerator name='wxPATH_MAX' value='5'/>
    </enum-decl>
    <enum-decl name='wxSizeConvention' filepath='include/wx/filename.h' line='57' column='1' id='type-id-317'>
      <underlying-type type-id='type-id-21'/>
      <enumerator name='wxSIZE_CONV_TRADITIONAL' value='0'/>
      <enumerator name='wxSIZE_CONV_IEC' value='1'/>
      <enumerator name='wxSIZE_CONV_SI' value='2'/>
    </enum-decl>
    <class-decl name='wxFileName' size-in-bits='1536' visibility='default' filepath='include/wx/filename.h' line='136' column='1' id='type-id-318'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_volume' type-id='type-id-57' visibility='default' filepath='include/wx/filename.h' line='644' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_dirs' type-id='type-id-68' visibility='default' filepath='include/wx/filename.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='704'>
        <var-decl name='m_name' type-id='type-id-57' visibility='default' filepath='include/wx/filename.h' line='650' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1088'>
        <var-decl name='m_ext' type-id='type-id-57' visibility='default' filepath='include/wx/filename.h' line='651' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1472'>
        <var-decl name='m_relative' type-id='type-id-41' visibility='default' filepath='include/wx/filename.h' line='661' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1480'>
        <var-decl name='m_hasExt' type-id='type-id-41' visibility='default' filepath='include/wx/filename.h' line='668' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1488'>
        <var-decl name='m_dontFollowLinks' type-id='type-id-41' visibility='default' filepath='include/wx/filename.h' line='673' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxBitmapType' filepath='include/wx/gdicmn.h' line='47' column='1' id='type-id-319'>
      <underlying-type type-id='type-id-21'/>
      <enumerator name='wxBITMAP_TYPE_INVALID' value='0'/>
      <enumerator name='wxBITMAP_TYPE_BMP' value='1'/>
      <enumerator name='wxBITMAP_TYPE_BMP_RESOURCE' value='2'/>
      <enumerator name='wxBITMAP_TYPE_RESOURCE' value='2'/>
      <enumerator name='wxBITMAP_TYPE_ICO' value='3'/>
      <enumerator name='wxBITMAP_TYPE_ICO_RESOURCE' value='4'/>
      <enumerator name='wxBITMAP_TYPE_CUR' value='5'/>
      <enumerator name='wxBITMAP_TYPE_CUR_RESOURCE' value='6'/>
      <enumerator name='wxBITMAP_TYPE_XBM' value='7'/>
      <enumerator name='wxBITMAP_TYPE_XBM_DATA' value='8'/>
      <enumerator name='wxBITMAP_TYPE_XPM' value='9'/>
      <enumerator name='wxBITMAP_TYPE_XPM_DATA' value='10'/>
      <enumerator name='wxBITMAP_TYPE_TIFF' value='11'/>
      <enumerator name='wxBITMAP_TYPE_TIF' value='11'/>
      <enumerator name='wxBITMAP_TYPE_TIFF_RESOURCE' value='12'/>
      <enumerator name='wxBITMAP_TYPE_TIF_RESOURCE' value='12'/>
      <enumerator name='wxBITMAP_TYPE_GIF' value='13'/>
      <enumerator name='wxBITMAP_TYPE_GIF_RESOURCE' value='14'/>
      <enumerator name='wxBITMAP_TYPE_PNG' value='15'/>
      <enumerator name='wxBITMAP_TYPE_PNG_RESOURCE' value='16'/>
      <enumerator name='wxBITMAP_TYPE_JPEG' value='17'/>
      <enumerator name='wxBITMAP_TYPE_JPEG_RESOURCE' value='18'/>
      <enumerator name='wxBITMAP_TYPE_PNM' value='19'/>
      <enumerator name='wxBITMAP_TYPE_PNM_RESOURCE' value='20'/>
      <enumerator name='wxBITMAP_TYPE_PCX' value='21'/>
      <enumerator name='wxBITMAP_TYPE_PCX_RESOURCE' value='22'/>
      <enumerator name='wxBITMAP_TYPE_PICT' value='23'/>
      <enumerator name='wxBITMAP_TYPE_PICT_RESOURCE' value='24'/>
      <enumerator name='wxBITMAP_TYPE_ICON' value='25'/>
      <enumerator name='wxBITMAP_TYPE_ICON_RESOURCE' value='26'/>
      <enumerator name='wxBITMAP_TYPE_ANI' value='27'/>
      <enumerator name='wxBITMAP_TYPE_IFF' value='28'/>
      <enumerator name='wxBITMAP_TYPE_TGA' value='29'/>
      <enumerator name='wxBITMAP_TYPE_MACCURSOR' value='30'/>
      <enumerator name='wxBITMAP_TYPE_MACCURSOR_RESOURCE' value='31'/>
      <enumerator name='wxBITMAP_TYPE_MAX' value='32'/>
      <enumerator name='wxBITMAP_TYPE_ANY' value='50'/>
    </enum-decl>
    <class-decl name='wxSize' size-in-bits='64' visibility='default' filepath='include/wx/gdicmn.h' line='282' column='1' id='type-id-320'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-49' visibility='default' filepath='include/wx/gdicmn.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-49' visibility='default' filepath='include/wx/gdicmn.h' line='286' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRealPoint' size-in-bits='128' visibility='default' filepath='include/wx/gdicmn.h' line='459' column='1' id='type-id-321'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-144' visibility='default' filepath='include/wx/gdicmn.h' line='462' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='y' type-id='type-id-144' visibility='default' filepath='include/wx/gdicmn.h' line='463' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxPoint' size-in-bits='64' visibility='default' filepath='include/wx/gdicmn.h' line='577' column='1' id='type-id-37'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-49' visibility='default' filepath='include/wx/gdicmn.h' line='580' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-49' visibility='default' filepath='include/wx/gdicmn.h' line='580' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRect' size-in-bits='128' visibility='default' filepath='include/wx/gdicmn.h' line='733' column='1' id='type-id-322'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-49' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-49' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='width' type-id='type-id-49' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='height' type-id='type-id-49' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxGDIRefData' size-in-bits='128' visibility='default' filepath='include/wx/gdiobj.h' line='22' column='1' id='type-id-323'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-324'/>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='IsOk' mangled-name='_ZNK12wxGDIRefData4IsOkEv' filepath='include/wx/gdiobj.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-325' is-artificial='yes'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='GdkEventKey' type-id='type-id-326' filepath='include/wx/gtk/window.h' line='25' column='1' id='type-id-327'/>
    <class-decl name='wxArrayGdkWindows' size-in-bits='192' visibility='default' filepath='include/wx/gtk/window.h' line='28' column='1' id='type-id-328'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-268'/>
    </class-decl>
    <union-decl name='wxHashKeyValue' size-in-bits='64' visibility='default' filepath='include/wx/hash.h' line='33' column='1' id='type-id-329'>
      <data-member access='public'>
        <var-decl name='integer' type-id='type-id-46' visibility='default' filepath='include/wx/hash.h' line='35' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='string' type-id='type-id-62' visibility='default' filepath='include/wx/hash.h' line='36' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='wxHashTableBase_Node' size-in-bits='256' visibility='default' filepath='include/wx/hash.h' line='46' column='1' id='type-id-330'>
      <member-type access='private'>
        <typedef-decl name='_Node' type-id='type-id-330' filepath='include/wx/hash.h' line='49' column='1' id='type-id-331'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_next' type-id='type-id-332' visibility='default' filepath='include/wx/hash.h' line='68' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_key' type-id='type-id-329' visibility='default' filepath='include/wx/hash.h' line='71' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_value' type-id='type-id-81' visibility='default' filepath='include/wx/hash.h' line='74' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_hashPtr' type-id='type-id-333' visibility='default' filepath='include/wx/hash.h' line='81' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxHashTableBase' size-in-bits='384' visibility='default' filepath='include/wx/hash.h' line='84' column='1' id='type-id-334'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-335'/>
      <member-type access='public'>
        <typedef-decl name='Node' type-id='type-id-330' filepath='include/wx/hash.h' line='91' column='1' id='type-id-336'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_size' type-id='type-id-12' visibility='default' filepath='include/wx/hash.h' line='140' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_count' type-id='type-id-12' visibility='default' filepath='include/wx/hash.h' line='143' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='256'>
        <var-decl name='m_table' type-id='type-id-337' visibility='default' filepath='include/wx/hash.h' line='146' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='320'>
        <var-decl name='m_keyType' type-id='type-id-239' visibility='default' filepath='include/wx/hash.h' line='149' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='352'>
        <var-decl name='m_deleteContents' type-id='type-id-41' visibility='default' filepath='include/wx/hash.h' line='152' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxHashTableBase' mangled-name='_ZN15wxHashTableBaseD0Ev' filepath='include/wx/hash.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxHashTableBase' mangled-name='_ZN15wxHashTableBaseD2Ev' filepath='include/wx/hash.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxHashTableBase' mangled-name='_ZN15wxHashTableBaseD4Ev' filepath='include/wx/hash.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='5'>
        <function-decl name='DoDeleteContents' mangled-name='_ZN15wxHashTableBase16DoDeleteContentsEP20wxHashTableBase_Node' filepath='include/wx/hash.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <parameter type-id='type-id-332'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxHashTable_Node' size-in-bits='256' visibility='default' filepath='include/wx/hash.h' line='162' column='1' id='type-id-338'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-330'/>
    </class-decl>
    <enum-decl name='wxHelpSearchMode' filepath='include/wx/helpbase.h' line='27' column='1' id='type-id-339'>
      <underlying-type type-id='type-id-21'/>
      <enumerator name='wxHELP_SEARCH_INDEX' value='0'/>
      <enumerator name='wxHELP_SEARCH_ALL' value='1'/>
    </enum-decl>
    <class-decl name='wxHtmlModalHelp' size-in-bits='8' visibility='default' filepath='include/wx/html/helpctrl.h' line='155' column='1' id='type-id-340'>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxHtmlModalHelp' mangled-name='_ZN15wxHtmlModalHelpC2EP8wxWindowRK8wxStringS4_i' filepath='src/html/helpctrl.cpp' line='452' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxHtmlModalHelpC2EP8wxWindowRK8wxStringS4_i@@WXU_3.2'>
          <parameter type-id='type-id-341' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-43' name='parent' filepath='src/html/helpctrl.cpp' line='452' column='1'/>
          <parameter type-id='type-id-47' name='helpFile' filepath='src/html/helpctrl.cpp' line='452' column='1'/>
          <parameter type-id='type-id-47' name='topic' filepath='src/html/helpctrl.cpp' line='452' column='1'/>
          <parameter type-id='type-id-49' name='style' filepath='src/html/helpctrl.cpp' line='452' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxHtmlHelpDialog' size-in-bits='8704' visibility='default' filepath='include/wx/html/helpdlg.h' line='37' column='1' id='type-id-342'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-343'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-25' mangled-name='_ZN16wxHtmlHelpDialog12ms_classInfoE' visibility='default' filepath='src/html/helpdlg.cpp' line='36' column='1' elf-symbol-id='_ZN16wxHtmlHelpDialog12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='8128'>
        <var-decl name='m_Data' type-id='type-id-344' visibility='default' filepath='include/wx/html/helpdlg.h' line='77' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='8192'>
        <var-decl name='m_TitleFormat' type-id='type-id-57' visibility='default' filepath='include/wx/html/helpdlg.h' line='78' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='8576'>
        <var-decl name='m_HtmlHelpWin' type-id='type-id-345' visibility='default' filepath='include/wx/html/helpdlg.h' line='79' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='8640'>
        <var-decl name='m_helpController' type-id='type-id-346' visibility='default' filepath='include/wx/html/helpdlg.h' line='80' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='sm_eventTableEntries' type-id='type-id-347' mangled-name='_ZN16wxHtmlHelpDialog20sm_eventTableEntriesE' visibility='default' filepath='src/html/helpdlg.cpp' line='38' column='1' elf-symbol-id='_ZN16wxHtmlHelpDialog20sm_eventTableEntriesE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' static='yes'>
        <var-decl name='sm_eventTable' type-id='type-id-30' mangled-name='_ZN16wxHtmlHelpDialog13sm_eventTableE' visibility='default' filepath='src/html/helpdlg.cpp' line='38' column='1' elf-symbol-id='_ZN16wxHtmlHelpDialog13sm_eventTableE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' static='yes'>
        <var-decl name='sm_eventHashTable' type-id='type-id-31' mangled-name='_ZN16wxHtmlHelpDialog17sm_eventHashTableE' visibility='default' filepath='src/html/helpdlg.cpp' line='38' column='1' elf-symbol-id='_ZN16wxHtmlHelpDialog17sm_eventHashTableE@@WXU_3.2'/>
      </data-member>
      <member-function access='protected'>
        <function-decl name='OnCloseWindow' mangled-name='_ZN16wxHtmlHelpDialog13OnCloseWindowER12wxCloseEvent' filepath='src/html/helpdlg.cpp' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpDialog13OnCloseWindowER12wxCloseEvent@@WXU_3.2'>
          <parameter type-id='type-id-348' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-349' name='evt' filepath='src/html/helpdlg.cpp' line='108' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetTitleFormat' mangled-name='_ZN16wxHtmlHelpDialog14SetTitleFormatERK8wxString' filepath='src/html/helpdlg.cpp' line='103' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpDialog14SetTitleFormatERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-348' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-47' name='format' filepath='src/html/helpdlg.cpp' line='103' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Create' mangled-name='_ZN16wxHtmlHelpDialog6CreateEP8wxWindowiRK8wxStringi' filepath='src/html/helpdlg.cpp' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpDialog6CreateEP8wxWindowiRK8wxStringi@@WXU_3.2'>
          <parameter type-id='type-id-348' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-43' name='parent' filepath='src/html/helpdlg.cpp' line='58' column='1'/>
          <parameter type-id='type-id-44' name='id' filepath='src/html/helpdlg.cpp' line='58' column='1'/>
          <parameter type-id='type-id-47'/>
          <parameter type-id='type-id-49' name='style' filepath='src/html/helpdlg.cpp' line='59' column='1'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='Init' mangled-name='_ZN16wxHtmlHelpDialog4InitEP14wxHtmlHelpData' filepath='src/html/helpdlg.cpp' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpDialog4InitEP14wxHtmlHelpData@@WXU_3.2'>
          <parameter type-id='type-id-348' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-344' name='data' filepath='include/wx/html/helpdlg.h' line='42' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxHtmlHelpDialog' mangled-name='_ZN16wxHtmlHelpDialogC2EP8wxWindowiRK8wxStringiP14wxHtmlHelpData' filepath='src/html/helpdlg.cpp' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpDialogC2EP8wxWindowiRK8wxStringiP14wxHtmlHelpData@@WXU_3.2'>
          <parameter type-id='type-id-348' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-43' name='parent' filepath='src/html/helpdlg.cpp' line='42' column='1'/>
          <parameter type-id='type-id-44' name='id' filepath='src/html/helpdlg.cpp' line='42' column='1'/>
          <parameter type-id='type-id-47' name='title' filepath='src/html/helpdlg.cpp' line='42' column='1'/>
          <parameter type-id='type-id-49' name='style' filepath='src/html/helpdlg.cpp' line='43' column='1'/>
          <parameter type-id='type-id-344' name='data' filepath='src/html/helpdlg.cpp' line='43' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='wxCreateObject' mangled-name='_ZN16wxHtmlHelpDialog14wxCreateObjectEv' filepath='src/html/helpdlg.cpp' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpDialog14wxCreateObjectEv@@WXU_3.2'>
          <return type-id='type-id-297'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxHtmlHelpDialog' mangled-name='_ZN16wxHtmlHelpDialogD0Ev' filepath='include/wx/html/helpdlg.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-350' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxHtmlHelpDialog' mangled-name='_ZN16wxHtmlHelpDialogD4Ev' filepath='include/wx/html/helpdlg.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-350' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxHtmlHelpDialog' mangled-name='_ZN16wxHtmlHelpDialogD0Ev' filepath='include/wx/html/helpdlg.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpDialogD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-350' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxHtmlHelpDialog' mangled-name='_ZN16wxHtmlHelpDialogD1Ev' filepath='include/wx/html/helpdlg.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpDialogD1Ev@@WXU_3.2'>
          <parameter type-id='type-id-350' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxHtmlHelpDialog' mangled-name='_ZN16wxHtmlHelpDialogD2Ev' filepath='include/wx/html/helpdlg.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpDialogD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-350' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK16wxHtmlHelpDialog12GetClassInfoEv' filepath='include/wx/html/helpdlg.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16wxHtmlHelpDialog12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-351' is-artificial='yes'/>
          <return type-id='type-id-51'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='14'>
        <function-decl name='GetEventTable' mangled-name='_ZNK16wxHtmlHelpDialog13GetEventTableEv' filepath='include/wx/html/helpdlg.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16wxHtmlHelpDialog13GetEventTableEv@@WXU_3.2'>
          <parameter type-id='type-id-351' is-artificial='yes'/>
          <return type-id='type-id-52'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='15'>
        <function-decl name='GetEventHashTable' mangled-name='_ZNK16wxHtmlHelpDialog17GetEventHashTableEv' filepath='include/wx/html/helpdlg.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16wxHtmlHelpDialog17GetEventHashTableEv@@WXU_3.2'>
          <parameter type-id='type-id-351' is-artificial='yes'/>
          <return type-id='type-id-53'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='252'>
        <function-decl name='AddToolbarButtons' mangled-name='_ZN16wxHtmlHelpDialog17AddToolbarButtonsEP9wxToolBari' filepath='include/wx/html/helpdlg.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-350' is-artificial='yes'/>
          <parameter type-id='type-id-352'/>
          <parameter type-id='type-id-49'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxHtmlHelpFrame' size-in-bits='9152' visibility='default' filepath='include/wx/html/helpfrm.h' line='68' column='1' id='type-id-353'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-354'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-25' mangled-name='_ZN15wxHtmlHelpFrame12ms_classInfoE' visibility='default' filepath='src/html/helpfrm.cpp' line='55' column='1' elf-symbol-id='_ZN15wxHtmlHelpFrame12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='8448'>
        <var-decl name='m_Data' type-id='type-id-344' visibility='default' filepath='include/wx/html/helpfrm.h' line='137' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='8512'>
        <var-decl name='m_DataCreated' type-id='type-id-41' visibility='default' filepath='include/wx/html/helpfrm.h' line='138' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='8576'>
        <var-decl name='m_TitleFormat' type-id='type-id-57' visibility='default' filepath='include/wx/html/helpfrm.h' line='139' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='8960'>
        <var-decl name='m_HtmlHelpWin' type-id='type-id-345' visibility='default' filepath='include/wx/html/helpfrm.h' line='140' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='9024'>
        <var-decl name='m_helpController' type-id='type-id-346' visibility='default' filepath='include/wx/html/helpfrm.h' line='141' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='9088'>
        <var-decl name='m_shouldPreventAppExit' type-id='type-id-41' visibility='default' filepath='include/wx/html/helpfrm.h' line='142' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='sm_eventTableEntries' type-id='type-id-355' mangled-name='_ZN15wxHtmlHelpFrame20sm_eventTableEntriesE' visibility='default' filepath='src/html/helpfrm.cpp' line='57' column='1' elf-symbol-id='_ZN15wxHtmlHelpFrame20sm_eventTableEntriesE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' static='yes'>
        <var-decl name='sm_eventTable' type-id='type-id-30' mangled-name='_ZN15wxHtmlHelpFrame13sm_eventTableE' visibility='default' filepath='src/html/helpfrm.cpp' line='57' column='1' elf-symbol-id='_ZN15wxHtmlHelpFrame13sm_eventTableE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' static='yes'>
        <var-decl name='sm_eventHashTable' type-id='type-id-31' mangled-name='_ZN15wxHtmlHelpFrame17sm_eventHashTableE' visibility='default' filepath='src/html/helpfrm.cpp' line='57' column='1' elf-symbol-id='_ZN15wxHtmlHelpFrame17sm_eventHashTableE@@WXU_3.2'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='SetShouldPreventAppExit' mangled-name='_ZN15wxHtmlHelpFrame23SetShouldPreventAppExitEb' filepath='src/html/helpfrm.cpp' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxHtmlHelpFrame23SetShouldPreventAppExitEb@@WXU_3.2'>
          <parameter type-id='type-id-356' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-41' name='enable' filepath='src/html/helpfrm.cpp' line='220' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='UseConfig' mangled-name='_ZN15wxHtmlHelpFrame9UseConfigEP12wxConfigBaseRK8wxString' filepath='src/html/helpfrm.cpp' line='213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxHtmlHelpFrame9UseConfigEP12wxConfigBaseRK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-356' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-357' name='config' filepath='src/html/helpfrm.cpp' line='213' column='1'/>
          <parameter type-id='type-id-47' name='rootPath' filepath='src/html/helpfrm.cpp' line='213' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='AddGrabIfNeeded' mangled-name='_ZN15wxHtmlHelpFrame15AddGrabIfNeededEv' filepath='src/html/helpfrm.cpp' line='187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxHtmlHelpFrame15AddGrabIfNeededEv@@WXU_3.2'>
          <parameter type-id='type-id-358' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnCloseWindow' mangled-name='_ZN15wxHtmlHelpFrame13OnCloseWindowER12wxCloseEvent' filepath='src/html/helpfrm.cpp' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxHtmlHelpFrame13OnCloseWindowER12wxCloseEvent@@WXU_3.2'>
          <parameter type-id='type-id-356' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-349' name='evt' filepath='src/html/helpfrm.cpp' line='159' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnActivate' mangled-name='_ZN15wxHtmlHelpFrame10OnActivateER15wxActivateEvent' filepath='src/html/helpfrm.cpp' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxHtmlHelpFrame10OnActivateER15wxActivateEvent@@WXU_3.2'>
          <parameter type-id='type-id-356' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-359' name='event' filepath='src/html/helpfrm.cpp' line='145' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetTitleFormat' mangled-name='_ZN15wxHtmlHelpFrame14SetTitleFormatERK8wxString' filepath='src/html/helpfrm.cpp' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxHtmlHelpFrame14SetTitleFormatERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-356' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-47' name='format' filepath='src/html/helpfrm.cpp' line='133' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Create' mangled-name='_ZN15wxHtmlHelpFrame6CreateEP8wxWindowiRK8wxStringiP12wxConfigBaseS4_' filepath='src/html/helpfrm.cpp' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxHtmlHelpFrame6CreateEP8wxWindowiRK8wxStringiP12wxConfigBaseS4_@@WXU_3.2'>
          <parameter type-id='type-id-356' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-43' name='parent' filepath='src/html/helpfrm.cpp' line='94' column='1'/>
          <parameter type-id='type-id-44' name='id' filepath='src/html/helpfrm.cpp' line='94' column='1'/>
          <parameter type-id='type-id-47'/>
          <parameter type-id='type-id-49' name='style' filepath='src/html/helpfrm.cpp' line='95' column='1'/>
          <parameter type-id='type-id-357' name='config' filepath='src/html/helpfrm.cpp' line='97' column='1'/>
          <parameter type-id='type-id-47' name='rootpath' filepath='src/html/helpfrm.cpp' line='97' column='1'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetController' mangled-name='_ZN15wxHtmlHelpFrame13SetControllerEP20wxHtmlHelpController' filepath='src/html/helpfrm.cpp' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxHtmlHelpFrame13SetControllerEP20wxHtmlHelpController@@WXU_3.2'>
          <parameter type-id='type-id-356' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-346' name='controller' filepath='src/html/helpfrm.cpp' line='86' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='Init' mangled-name='_ZN15wxHtmlHelpFrame4InitEP14wxHtmlHelpData' filepath='src/html/helpfrm.cpp' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxHtmlHelpFrame4InitEP14wxHtmlHelpData@@WXU_3.2'>
          <parameter type-id='type-id-356' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-344' name='data' filepath='include/wx/html/helpfrm.h' line='73' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxHtmlHelpFrame' mangled-name='_ZN15wxHtmlHelpFrameC2EP8wxWindowiRK8wxStringiP14wxHtmlHelpDataP12wxConfigBaseS4_' filepath='src/html/helpfrm.cpp' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxHtmlHelpFrameC2EP8wxWindowiRK8wxStringiP14wxHtmlHelpDataP12wxConfigBaseS4_@@WXU_3.2'>
          <parameter type-id='type-id-356' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-43' name='parent' filepath='src/html/helpfrm.cpp' line='62' column='1'/>
          <parameter type-id='type-id-44' name='id' filepath='src/html/helpfrm.cpp' line='62' column='1'/>
          <parameter type-id='type-id-47' name='title' filepath='src/html/helpfrm.cpp' line='62' column='1'/>
          <parameter type-id='type-id-49' name='style' filepath='src/html/helpfrm.cpp' line='63' column='1'/>
          <parameter type-id='type-id-344' name='data' filepath='src/html/helpfrm.cpp' line='63' column='1'/>
          <parameter type-id='type-id-357' name='config' filepath='src/html/helpfrm.cpp' line='65' column='1'/>
          <parameter type-id='type-id-47' name='rootpath' filepath='src/html/helpfrm.cpp' line='65' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='wxCreateObject' mangled-name='_ZN15wxHtmlHelpFrame14wxCreateObjectEv' filepath='src/html/helpfrm.cpp' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxHtmlHelpFrame14wxCreateObjectEv@@WXU_3.2'>
          <return type-id='type-id-297'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxHtmlHelpFrame' mangled-name='_ZN15wxHtmlHelpFrameD0Ev' filepath='include/wx/html/helpfrm.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-358' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxHtmlHelpFrame' mangled-name='_ZN15wxHtmlHelpFrameD4Ev' filepath='include/wx/html/helpfrm.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-358' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxHtmlHelpFrame' mangled-name='_ZN15wxHtmlHelpFrameD0Ev' filepath='include/wx/html/helpfrm.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxHtmlHelpFrameD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-358' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxHtmlHelpFrame' mangled-name='_ZN15wxHtmlHelpFrameD1Ev' filepath='include/wx/html/helpfrm.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxHtmlHelpFrameD1Ev@@WXU_3.2'>
          <parameter type-id='type-id-358' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxHtmlHelpFrame' mangled-name='_ZN15wxHtmlHelpFrameD2Ev' filepath='include/wx/html/helpfrm.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxHtmlHelpFrameD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-358' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK15wxHtmlHelpFrame12GetClassInfoEv' filepath='include/wx/html/helpfrm.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxHtmlHelpFrame12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-360' is-artificial='yes'/>
          <return type-id='type-id-51'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='14'>
        <function-decl name='GetEventTable' mangled-name='_ZNK15wxHtmlHelpFrame13GetEventTableEv' filepath='include/wx/html/helpfrm.h' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxHtmlHelpFrame13GetEventTableEv@@WXU_3.2'>
          <parameter type-id='type-id-360' is-artificial='yes'/>
          <return type-id='type-id-52'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='15'>
        <function-decl name='GetEventHashTable' mangled-name='_ZNK15wxHtmlHelpFrame17GetEventHashTableEv' filepath='include/wx/html/helpfrm.h' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxHtmlHelpFrame17GetEventHashTableEv@@WXU_3.2'>
          <parameter type-id='type-id-360' is-artificial='yes'/>
          <return type-id='type-id-53'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='229'>
        <function-decl name='ShouldPreventAppExit' mangled-name='_ZNK15wxHtmlHelpFrame20ShouldPreventAppExitEv' filepath='include/wx/html/helpfrm.h' line='121' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-360' is-artificial='yes'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='262'>
        <function-decl name='AddToolbarButtons' mangled-name='_ZN15wxHtmlHelpFrame17AddToolbarButtonsEP9wxToolBari' filepath='include/wx/html/helpfrm.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-358' is-artificial='yes'/>
          <parameter type-id='type-id-352'/>
          <parameter type-id='type-id-49'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxHtmlHelpWindow' size-in-bits='9792' visibility='default' filepath='include/wx/html/helpwnd.h' line='77' column='1' id='type-id-361'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-362'/>
      <member-type access='protected'>
        <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='include/wx/html/helpwnd.h' line='199' column='1' id='type-id-363'>
          <underlying-type type-id='type-id-21'/>
          <enumerator name='IMG_Book' value='0'/>
          <enumerator name='IMG_Folder' value='1'/>
          <enumerator name='IMG_Page' value='2'/>
        </enum-decl>
      </member-type>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-25' mangled-name='_ZN16wxHtmlHelpWindow12ms_classInfoE' visibility='default' filepath='src/html/helpwnd.cpp' line='202' column='1' elf-symbol-id='_ZN16wxHtmlHelpWindow12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='5312'>
        <var-decl name='m_Data' type-id='type-id-344' visibility='default' filepath='include/wx/html/helpwnd.h' line='206' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='5376'>
        <var-decl name='m_DataCreated' type-id='type-id-41' visibility='default' filepath='include/wx/html/helpwnd.h' line='207' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='5440'>
        <var-decl name='m_TitleFormat' type-id='type-id-57' visibility='default' filepath='include/wx/html/helpwnd.h' line='208' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='5824'>
        <var-decl name='m_HtmlWin' type-id='type-id-364' visibility='default' filepath='include/wx/html/helpwnd.h' line='210' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='5888'>
        <var-decl name='m_Splitter' type-id='type-id-365' visibility='default' filepath='include/wx/html/helpwnd.h' line='211' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='5952'>
        <var-decl name='m_NavigPan' type-id='type-id-366' visibility='default' filepath='include/wx/html/helpwnd.h' line='212' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6016'>
        <var-decl name='m_NavigNotebook' type-id='type-id-367' visibility='default' filepath='include/wx/html/helpwnd.h' line='213' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6080'>
        <var-decl name='m_ContentsBox' type-id='type-id-368' visibility='default' filepath='include/wx/html/helpwnd.h' line='214' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6144'>
        <var-decl name='m_IndexText' type-id='type-id-369' visibility='default' filepath='include/wx/html/helpwnd.h' line='215' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6208'>
        <var-decl name='m_IndexButton' type-id='type-id-370' visibility='default' filepath='include/wx/html/helpwnd.h' line='216' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6272'>
        <var-decl name='m_IndexButtonAll' type-id='type-id-370' visibility='default' filepath='include/wx/html/helpwnd.h' line='217' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6336'>
        <var-decl name='m_IndexList' type-id='type-id-371' visibility='default' filepath='include/wx/html/helpwnd.h' line='218' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6400'>
        <var-decl name='m_SearchText' type-id='type-id-369' visibility='default' filepath='include/wx/html/helpwnd.h' line='219' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6464'>
        <var-decl name='m_SearchButton' type-id='type-id-370' visibility='default' filepath='include/wx/html/helpwnd.h' line='220' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6528'>
        <var-decl name='m_SearchList' type-id='type-id-371' visibility='default' filepath='include/wx/html/helpwnd.h' line='221' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6592'>
        <var-decl name='m_SearchChoice' type-id='type-id-372' visibility='default' filepath='include/wx/html/helpwnd.h' line='222' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6656'>
        <var-decl name='m_IndexCountInfo' type-id='type-id-373' visibility='default' filepath='include/wx/html/helpwnd.h' line='223' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6720'>
        <var-decl name='m_SearchCaseSensitive' type-id='type-id-374' visibility='default' filepath='include/wx/html/helpwnd.h' line='224' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6784'>
        <var-decl name='m_SearchWholeWords' type-id='type-id-374' visibility='default' filepath='include/wx/html/helpwnd.h' line='225' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6848'>
        <var-decl name='m_toolBar' type-id='type-id-352' visibility='default' filepath='include/wx/html/helpwnd.h' line='226' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6912'>
        <var-decl name='m_Bookmarks' type-id='type-id-375' visibility='default' filepath='include/wx/html/helpwnd.h' line='228' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6976'>
        <var-decl name='m_BookmarksNames' type-id='type-id-68' visibility='default' filepath='include/wx/html/helpwnd.h' line='229' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7296'>
        <var-decl name='m_BookmarksPages' type-id='type-id-68' visibility='default' filepath='include/wx/html/helpwnd.h' line='229' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7616'>
        <var-decl name='m_Cfg' type-id='type-id-376' visibility='default' filepath='include/wx/html/helpwnd.h' line='231' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7872'>
        <var-decl name='m_Config' type-id='type-id-357' visibility='default' filepath='include/wx/html/helpwnd.h' line='234' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7936'>
        <var-decl name='m_ConfigRoot' type-id='type-id-57' visibility='default' filepath='include/wx/html/helpwnd.h' line='235' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='8320'>
        <var-decl name='m_ContentsPage' type-id='type-id-49' visibility='default' filepath='include/wx/html/helpwnd.h' line='239' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='8352'>
        <var-decl name='m_IndexPage' type-id='type-id-49' visibility='default' filepath='include/wx/html/helpwnd.h' line='240' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='8384'>
        <var-decl name='m_SearchPage' type-id='type-id-49' visibility='default' filepath='include/wx/html/helpwnd.h' line='241' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='8448'>
        <var-decl name='m_NormalFonts' type-id='type-id-377' visibility='default' filepath='include/wx/html/helpwnd.h' line='244' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='8512'>
        <var-decl name='m_FixedFonts' type-id='type-id-377' visibility='default' filepath='include/wx/html/helpwnd.h' line='244' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='8576'>
        <var-decl name='m_FontSize' type-id='type-id-49' visibility='default' filepath='include/wx/html/helpwnd.h' line='245' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='8640'>
        <var-decl name='m_NormalFace' type-id='type-id-57' visibility='default' filepath='include/wx/html/helpwnd.h' line='246' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='9024'>
        <var-decl name='m_FixedFace' type-id='type-id-57' visibility='default' filepath='include/wx/html/helpwnd.h' line='246' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='9408'>
        <var-decl name='m_UpdateContents' type-id='type-id-41' visibility='default' filepath='include/wx/html/helpwnd.h' line='248' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='9472'>
        <var-decl name='m_Printer' type-id='type-id-378' visibility='default' filepath='include/wx/html/helpwnd.h' line='251' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='9536'>
        <var-decl name='m_PagesHash' type-id='type-id-379' visibility='default' filepath='include/wx/html/helpwnd.h' line='253' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='9600'>
        <var-decl name='m_helpController' type-id='type-id-346' visibility='default' filepath='include/wx/html/helpwnd.h' line='254' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='9664'>
        <var-decl name='m_hfStyle' type-id='type-id-49' visibility='default' filepath='include/wx/html/helpwnd.h' line='256' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='9728'>
        <var-decl name='m_mergedIndex' type-id='type-id-380' visibility='default' filepath='include/wx/html/helpwnd.h' line='262' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='sm_eventTableEntries' type-id='type-id-381' mangled-name='_ZN16wxHtmlHelpWindow20sm_eventTableEntriesE' visibility='default' filepath='src/html/helpwnd.cpp' line='204' column='1' elf-symbol-id='_ZN16wxHtmlHelpWindow20sm_eventTableEntriesE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' static='yes'>
        <var-decl name='sm_eventTable' type-id='type-id-30' mangled-name='_ZN16wxHtmlHelpWindow13sm_eventTableE' visibility='default' filepath='src/html/helpwnd.cpp' line='204' column='1' elf-symbol-id='_ZN16wxHtmlHelpWindow13sm_eventTableE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' static='yes'>
        <var-decl name='sm_eventHashTable' type-id='type-id-31' mangled-name='_ZN16wxHtmlHelpWindow17sm_eventHashTableE' visibility='default' filepath='src/html/helpwnd.cpp' line='204' column='1' elf-symbol-id='_ZN16wxHtmlHelpWindow17sm_eventHashTableE@@WXU_3.2'/>
      </data-member>
      <member-function access='protected'>
        <function-decl name='OnSize' mangled-name='_ZN16wxHtmlHelpWindow6OnSizeER11wxSizeEvent' filepath='src/html/helpwnd.cpp' line='1745' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow6OnSizeER11wxSizeEvent@@WXU_3.2'>
          <parameter type-id='type-id-382' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-42'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnBookmarksSel' mangled-name='_ZN16wxHtmlHelpWindow14OnBookmarksSelER14wxCommandEvent' filepath='src/html/helpwnd.cpp' line='1735' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow14OnBookmarksSelER14wxCommandEvent@@WXU_3.2'>
          <parameter type-id='type-id-382' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-76'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnSearch' mangled-name='_ZN16wxHtmlHelpWindow8OnSearchER14wxCommandEvent' filepath='src/html/helpwnd.cpp' line='1727' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow8OnSearchER14wxCommandEvent@@WXU_3.2'>
          <parameter type-id='type-id-382' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-76'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnSearchSel' mangled-name='_ZN16wxHtmlHelpWindow11OnSearchSelER14wxCommandEvent' filepath='src/html/helpwnd.cpp' line='1717' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow11OnSearchSelER14wxCommandEvent@@WXU_3.2'>
          <parameter type-id='type-id-382' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-76'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='DoIndexAll' mangled-name='_ZN16wxHtmlHelpWindow10DoIndexAllEv' filepath='src/html/helpwnd.cpp' line='1688' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow10DoIndexAllEv@@WXU_3.2'>
          <parameter type-id='type-id-345' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnIndexAll' mangled-name='_ZN16wxHtmlHelpWindow10OnIndexAllER14wxCommandEvent' filepath='src/html/helpwnd.cpp' line='1683' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow10OnIndexAllER14wxCommandEvent@@WXU_3.2'>
          <parameter type-id='type-id-382' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-76'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='DoIndexFind' mangled-name='_ZN16wxHtmlHelpWindow11DoIndexFindEv' filepath='src/html/helpwnd.cpp' line='1608' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow11DoIndexFindEv@@WXU_3.2'>
          <parameter type-id='type-id-345' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnIndexFind' mangled-name='_ZN16wxHtmlHelpWindow11OnIndexFindER14wxCommandEvent' filepath='src/html/helpwnd.cpp' line='1603' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow11OnIndexFindER14wxCommandEvent@@WXU_3.2'>
          <parameter type-id='type-id-382' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-76'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnIndexSel' mangled-name='_ZN16wxHtmlHelpWindow10OnIndexSelER14wxCommandEvent' filepath='src/html/helpwnd.cpp' line='1595' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow10OnIndexSelER14wxCommandEvent@@WXU_3.2'>
          <parameter type-id='type-id-382' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-76'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnContentsSel' mangled-name='_ZN16wxHtmlHelpWindow13OnContentsSelER11wxTreeEvent' filepath='src/html/helpwnd.cpp' line='1579' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow13OnContentsSelER11wxTreeEvent@@WXU_3.2'>
          <parameter type-id='type-id-382' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-383' name='event' filepath='src/html/helpwnd.cpp' line='1579' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnToolbar' mangled-name='_ZN16wxHtmlHelpWindow9OnToolbarER14wxCommandEvent' filepath='src/html/helpwnd.cpp' line='1384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow9OnToolbarER14wxCommandEvent@@WXU_3.2'>
          <parameter type-id='type-id-382' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-76'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='NotifyPageChanged' mangled-name='_ZN16wxHtmlHelpWindow17NotifyPageChangedEv' filepath='src/html/helpwnd.cpp' line='1359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow17NotifyPageChangedEv@@WXU_3.2'>
          <parameter type-id='type-id-345' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='WriteCustomization' mangled-name='_ZN16wxHtmlHelpWindow18WriteCustomizationEP12wxConfigBaseRK8wxString' filepath='src/html/helpwnd.cpp' line='1126' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow18WriteCustomizationEP12wxConfigBaseRK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-382' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-357' name='config' filepath='include/wx/html/helpwnd.h' line='131' column='1'/>
          <parameter type-id='type-id-47' name='rootpath' filepath='include/wx/html/helpwnd.h' line='131' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='ReadCustomization' mangled-name='_ZN16wxHtmlHelpWindow17ReadCustomizationEP12wxConfigBaseRK8wxString' filepath='src/html/helpwnd.cpp' line='1068' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow17ReadCustomizationEP12wxConfigBaseRK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-382' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-357' name='config' filepath='include/wx/html/helpwnd.h' line='131' column='1'/>
          <parameter type-id='type-id-47' name='rootpath' filepath='include/wx/html/helpwnd.h' line='131' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='RefreshLists' mangled-name='_ZN16wxHtmlHelpWindow12RefreshListsEv' filepath='src/html/helpwnd.cpp' line='1057' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow12RefreshListsEv@@WXU_3.2'>
          <parameter type-id='type-id-345' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='CreateSearch' mangled-name='_ZN16wxHtmlHelpWindow12CreateSearchEv' filepath='src/html/helpwnd.cpp' line='1043' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow12CreateSearchEv@@WXU_3.2'>
          <parameter type-id='type-id-345' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='CreateIndex' mangled-name='_ZN16wxHtmlHelpWindow11CreateIndexEv' filepath='src/html/helpwnd.cpp' line='1017' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow11CreateIndexEv@@WXU_3.2'>
          <parameter type-id='type-id-345' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='CreateContents' mangled-name='_ZN16wxHtmlHelpWindow14CreateContentsEv' filepath='src/html/helpwnd.cpp' line='932' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow14CreateContentsEv@@WXU_3.2'>
          <parameter type-id='type-id-345' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='KeywordSearch' mangled-name='_ZN16wxHtmlHelpWindow13KeywordSearchERK8wxString16wxHelpSearchMode' filepath='src/html/helpwnd.cpp' line='809' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow13KeywordSearchERK8wxString16wxHelpSearchMode@@WXU_3.2'>
          <parameter type-id='type-id-382' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-47' name='keyword' filepath='src/html/helpwnd.cpp' line='809' column='1'/>
          <parameter type-id='type-id-339' name='mode' filepath='src/html/helpwnd.cpp' line='810' column='1'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='DisplayIndexItem' mangled-name='_ZN16wxHtmlHelpWindow16DisplayIndexItemEPK25wxHtmlHelpMergedIndexItem' filepath='src/html/helpwnd.cpp' line='762' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow16DisplayIndexItemEPK25wxHtmlHelpMergedIndexItem@@WXU_3.2'>
          <parameter type-id='type-id-382' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-384' name='it' filepath='src/html/helpwnd.cpp' line='762' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='DisplayIndex' mangled-name='_ZN16wxHtmlHelpWindow12DisplayIndexEv' filepath='src/html/helpwnd.cpp' line='738' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow12DisplayIndexEv@@WXU_3.2'>
          <parameter type-id='type-id-382' name='this' is-artificial='yes'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='DisplayContents' mangled-name='_ZN16wxHtmlHelpWindow15DisplayContentsEv' filepath='src/html/helpwnd.cpp' line='713' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow15DisplayContentsEv@@WXU_3.2'>
          <parameter type-id='type-id-382' name='this' is-artificial='yes'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Display' mangled-name='_ZN16wxHtmlHelpWindow7DisplayEi' filepath='src/html/helpwnd.cpp' line='701' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow7DisplayEi@@WXU_3.2'>
          <parameter type-id='type-id-382' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-49' name='id' filepath='src/html/helpwnd.cpp' line='701' column='1'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Display' mangled-name='_ZN16wxHtmlHelpWindow7DisplayERK8wxString' filepath='src/html/helpwnd.cpp' line='689' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow7DisplayERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-382' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-47' name='x' filepath='src/html/helpwnd.cpp' line='689' column='1'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetController' mangled-name='_ZN16wxHtmlHelpWindow13SetControllerEP20wxHtmlHelpController' filepath='src/html/helpwnd.cpp' line='616' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow13SetControllerEP20wxHtmlHelpController@@WXU_3.2'>
          <parameter type-id='type-id-382' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-346' name='controller' filepath='src/html/helpwnd.cpp' line='616' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Create' mangled-name='_ZN16wxHtmlHelpWindow6CreateEP8wxWindowiRK7wxPointRK6wxSizeii' filepath='src/html/helpwnd.cpp' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow6CreateEP8wxWindowiRK7wxPointRK6wxSizeii@@WXU_3.2'>
          <parameter type-id='type-id-382' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-43' name='parent' filepath='src/html/helpwnd.cpp' line='305' column='1'/>
          <parameter type-id='type-id-44' name='id' filepath='src/html/helpwnd.cpp' line='305' column='1'/>
          <parameter type-id='type-id-36' name='pos' filepath='src/html/helpwnd.cpp' line='306' column='1'/>
          <parameter type-id='type-id-45' name='size' filepath='src/html/helpwnd.cpp' line='306' column='1'/>
          <parameter type-id='type-id-49' name='style' filepath='src/html/helpwnd.cpp' line='307' column='1'/>
          <parameter type-id='type-id-49' name='helpStyle' filepath='src/html/helpwnd.cpp' line='307' column='1'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='Init' mangled-name='_ZN16wxHtmlHelpWindow4InitEP14wxHtmlHelpData' filepath='src/html/helpwnd.cpp' line='229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow4InitEP14wxHtmlHelpData@@WXU_3.2'>
          <parameter type-id='type-id-382' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-344' name='data' filepath='include/wx/html/helpwnd.h' line='82' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxHtmlHelpWindow' mangled-name='_ZN16wxHtmlHelpWindowC2EP8wxWindowiRK7wxPointRK6wxSizeiiP14wxHtmlHelpData' filepath='src/html/helpwnd.cpp' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindowC2EP8wxWindowiRK7wxPointRK6wxSizeiiP14wxHtmlHelpData@@WXU_3.2'>
          <parameter type-id='type-id-382' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-43' name='parent' filepath='include/wx/html/helpwnd.h' line='83' column='1'/>
          <parameter type-id='type-id-44' name='id' filepath='include/wx/html/helpwnd.h' line='83' column='1'/>
          <parameter type-id='type-id-36' name='pos' filepath='include/wx/html/helpwnd.h' line='84' column='1'/>
          <parameter type-id='type-id-45' name='size' filepath='include/wx/html/helpwnd.h' line='85' column='1'/>
          <parameter type-id='type-id-49' name='style' filepath='include/wx/html/helpwnd.h' line='86' column='1'/>
          <parameter type-id='type-id-49' name='helpStyle' filepath='include/wx/html/helpwnd.h' line='87' column='1'/>
          <parameter type-id='type-id-344' name='data' filepath='include/wx/html/helpwnd.h' line='88' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='wxCreateObject' mangled-name='_ZN16wxHtmlHelpWindow14wxCreateObjectEv' filepath='src/html/helpwnd.cpp' line='202' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow14wxCreateObjectEv@@WXU_3.2'>
          <return type-id='type-id-297'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='UpdateMergedIndex' mangled-name='_ZN16wxHtmlHelpWindow17UpdateMergedIndexEv' filepath='src/html/helpwnd.cpp' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow17UpdateMergedIndexEv@@WXU_3.2'>
          <parameter type-id='type-id-345' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxHtmlHelpWindow' mangled-name='_ZN16wxHtmlHelpWindowD0Ev' filepath='include/wx/html/helpwnd.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-345' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxHtmlHelpWindow' mangled-name='_ZN16wxHtmlHelpWindowD0Ev' filepath='include/wx/html/helpwnd.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-345' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxHtmlHelpWindow' mangled-name='_ZN16wxHtmlHelpWindowD4Ev' filepath='include/wx/html/helpwnd.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-345' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxHtmlHelpWindow' mangled-name='_ZN16wxHtmlHelpWindowD0Ev' filepath='include/wx/html/helpwnd.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindowD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-345' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxHtmlHelpWindow' mangled-name='_ZN16wxHtmlHelpWindowD1Ev' filepath='include/wx/html/helpwnd.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindowD1Ev@@WXU_3.2'>
          <parameter type-id='type-id-345' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxHtmlHelpWindow' mangled-name='_ZN16wxHtmlHelpWindowD1Ev' filepath='include/wx/html/helpwnd.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindowD1Ev@@WXU_3.2'>
          <parameter type-id='type-id-345' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxHtmlHelpWindow' mangled-name='_ZN16wxHtmlHelpWindowD2Ev' filepath='include/wx/html/helpwnd.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindowD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-345' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK16wxHtmlHelpWindow12GetClassInfoEv' filepath='include/wx/html/helpwnd.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16wxHtmlHelpWindow12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-385' is-artificial='yes'/>
          <return type-id='type-id-51'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='14'>
        <function-decl name='GetEventTable' mangled-name='_ZNK16wxHtmlHelpWindow13GetEventTableEv' filepath='include/wx/html/helpwnd.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16wxHtmlHelpWindow13GetEventTableEv@@WXU_3.2'>
          <parameter type-id='type-id-385' is-artificial='yes'/>
          <return type-id='type-id-52'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='15'>
        <function-decl name='GetEventHashTable' mangled-name='_ZNK16wxHtmlHelpWindow17GetEventHashTableEv' filepath='include/wx/html/helpwnd.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16wxHtmlHelpWindow17GetEventHashTableEv@@WXU_3.2'>
          <parameter type-id='type-id-385' is-artificial='yes'/>
          <return type-id='type-id-53'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='206'>
        <function-decl name='AddToolbarButtons' mangled-name='_ZN16wxHtmlHelpWindow17AddToolbarButtonsEP9wxToolBari' filepath='include/wx/html/helpwnd.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow17AddToolbarButtonsEP9wxToolBari@@WXU_3.2'>
          <parameter type-id='type-id-345' is-artificial='yes'/>
          <parameter type-id='type-id-352'/>
          <parameter type-id='type-id-49'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='207'>
        <function-decl name='OptionsDialog' mangled-name='_ZN16wxHtmlHelpWindow13OptionsDialogEv' filepath='include/wx/html/helpwnd.h' line='186' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxHtmlHelpWindow13OptionsDialogEv@@WXU_3.2'>
          <parameter type-id='type-id-345' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='wxLayoutDirection' filepath='include/wx/localedefs.h' line='20' column='1' id='type-id-386'>
      <underlying-type type-id='type-id-21'/>
      <enumerator name='wxLayout_Default' value='0'/>
      <enumerator name='wxLayout_LeftToRight' value='1'/>
      <enumerator name='wxLayout_RightToLeft' value='2'/>
    </enum-decl>
    <typedef-decl name='wxLongLong' type-id='type-id-387' filepath='include/wx/longlong.h' line='90' column='1' id='type-id-235'/>
    <typedef-decl name='wxULongLong' type-id='type-id-388' filepath='include/wx/longlong.h' line='91' column='1' id='type-id-389'/>
    <class-decl name='wxLongLongNative' size-in-bits='64' visibility='default' filepath='include/wx/longlong.h' line='106' column='1' id='type-id-387'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_ll' type-id='type-id-147' visibility='default' filepath='include/wx/longlong.h' line='343' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxULongLongNative' size-in-bits='64' visibility='default' filepath='include/wx/longlong.h' line='347' column='1' id='type-id-388'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_ll' type-id='type-id-148' visibility='default' filepath='include/wx/longlong.h' line='562' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxNonOwnedWindowBase' size-in-bits='5312' visibility='default' filepath='include/wx/nonownedwnd.h' line='25' column='1' id='type-id-390'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-362'/>
      <member-function access='public' vtable-offset='151'>
        <function-decl name='InheritAttributes' mangled-name='_ZN20wxNonOwnedWindowBase17InheritAttributesEv' filepath='include/wx/nonownedwnd.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-391' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='185'>
        <function-decl name='AdjustForParentClientOrigin' mangled-name='_ZNK20wxNonOwnedWindowBase27AdjustForParentClientOriginERiS0_i' filepath='include/wx/nonownedwnd.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-392' is-artificial='yes'/>
          <parameter type-id='type-id-393'/>
          <parameter type-id='type-id-393'/>
          <parameter type-id='type-id-49'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='206'>
        <function-decl name='DoClearShape' mangled-name='_ZN20wxNonOwnedWindowBase12DoClearShapeEv' filepath='include/wx/nonownedwnd.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-391' is-artificial='yes'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='207'>
        <function-decl name='DoSetRegionShape' mangled-name='_ZN20wxNonOwnedWindowBase16DoSetRegionShapeERK8wxRegion' filepath='include/wx/nonownedwnd.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-391' is-artificial='yes'/>
          <parameter type-id='type-id-394'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='208'>
        <function-decl name='DoSetPathShape' mangled-name='_ZN20wxNonOwnedWindowBase14DoSetPathShapeERK14wxGraphicsPath' filepath='include/wx/nonownedwnd.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-391' is-artificial='yes'/>
          <parameter type-id='type-id-395'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxRefCounter' size-in-bits='128' visibility='default' filepath='include/wx/object.h' line='228' column='1' id='type-id-324'>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_count' type-id='type-id-49' visibility='default' filepath='include/wx/object.h' line='245' column='1'/>
      </data-member>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRefCounter' mangled-name='_ZN12wxRefCounterD4Ev' filepath='include/wx/object.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-396' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='wxObjectRefData' type-id='type-id-324' filepath='include/wx/object.h' line='258' column='1' id='type-id-397'/>
    <typedef-decl name='wxObjectConstructorFn' type-id='type-id-398' filepath='include/wx/rtti.h' line='39' column='1' id='type-id-399'/>
    <class-decl name='wxClassInfo' size-in-bits='384' visibility='default' filepath='include/wx/rtti.h' line='41' column='1' id='type-id-25'>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-400'>
          <member-type access='private'>
            <typedef-decl name='Node' type-id='type-id-338' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-401'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-400' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-402'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-404' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-403'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-405' visibility='default' filepath='include/wx/rtti.h' line='106' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_table' type-id='type-id-379' visibility='default' filepath='include/wx/rtti.h' line='106' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_className' type-id='type-id-406' visibility='default' filepath='include/wx/rtti.h' line='109' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_objectSize' type-id='type-id-49' visibility='default' filepath='include/wx/rtti.h' line='110' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_objectConstructor' type-id='type-id-399' visibility='default' filepath='include/wx/rtti.h' line='111' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_baseInfo1' type-id='type-id-404' visibility='default' filepath='include/wx/rtti.h' line='115' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_baseInfo2' type-id='type-id-404' visibility='default' filepath='include/wx/rtti.h' line='116' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='sm_first' type-id='type-id-51' mangled-name='_ZN11wxClassInfo8sm_firstE' visibility='default' filepath='include/wx/rtti.h' line='121' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='m_next' type-id='type-id-51' visibility='default' filepath='include/wx/rtti.h' line='122' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxCStrData' size-in-bits='192' visibility='default' filepath='include/wx/string.h' line='152' column='1' id='type-id-407'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_str' type-id='type-id-73' visibility='default' filepath='include/wx/string.h' line='245' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_offset' type-id='type-id-12' visibility='default' filepath='include/wx/string.h' line='252' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_owned' type-id='type-id-41' visibility='default' filepath='include/wx/string.h' line='254' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxString' size-in-bits='384' visibility='default' filepath='include/wx/string.h' line='301' column='1' id='type-id-57'>
      <member-type access='private'>
        <class-decl name='SubstrBufFromType&lt;wchar_t const*&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='337' column='1' id='type-id-408'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='data' type-id='type-id-409' visibility='default' filepath='include/wx/string.h' line='339' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='len' type-id='type-id-12' visibility='default' filepath='include/wx/string.h' line='340' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='SubstrBufFromType&lt;wxScopedCharTypeBuffer&lt;wchar_t&gt; &gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='337' column='1' id='type-id-410'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='data' type-id='type-id-192' visibility='default' filepath='include/wx/string.h' line='339' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='len' type-id='type-id-12' visibility='default' filepath='include/wx/string.h' line='340' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='SubstrBufFromWC' type-id='type-id-408' filepath='include/wx/string.h' line='354' column='1' id='type-id-411'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='SubstrBufFromMB' type-id='type-id-410' filepath='include/wx/string.h' line='355' column='1' id='type-id-412'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-12' filepath='include/wx/string.h' line='752' column='1' id='type-id-413'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-415' filepath='include/wx/string.h' line='753' column='1' id='type-id-414'/>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='963' column='1' id='type-id-416'>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-418' filepath='include/wx/string.h' line='965' column='1' id='type-id-417'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-420' filepath='include/wx/string.h' line='965' column='1' id='type-id-419'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='underlying_iterator' type-id='type-id-422' filepath='include/wx/string.h' line='965' column='1' id='type-id-421'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-421' visibility='default' filepath='include/wx/string.h' line='965' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='994' column='1' id='type-id-423'>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-418' filepath='include/wx/string.h' line='998' column='1' id='type-id-424'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-426' filepath='include/wx/string.h' line='998' column='1' id='type-id-425'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='underlying_iterator' type-id='type-id-428' filepath='include/wx/string.h' line='998' column='1' id='type-id-427'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-427' visibility='default' filepath='include/wx/string.h' line='998' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator_impl&lt;wxString::const_iterator&gt;' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='1060' column='1' id='type-id-429'>
          <member-type access='public'>
            <typedef-decl name='iterator_type' type-id='type-id-423' filepath='include/wx/string.h' line='1063' column='1' id='type-id-430'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-424' filepath='include/wx/string.h' line='1067' column='1' id='type-id-431'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-425' filepath='include/wx/string.h' line='1068' column='1' id='type-id-432'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-430' visibility='default' filepath='include/wx/string.h' line='1115' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator_impl&lt;wxString::iterator&gt;' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='1060' column='1' id='type-id-433'>
          <member-type access='public'>
            <typedef-decl name='iterator_type' type-id='type-id-416' filepath='include/wx/string.h' line='1063' column='1' id='type-id-434'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-417' filepath='include/wx/string.h' line='1067' column='1' id='type-id-435'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-419' filepath='include/wx/string.h' line='1068' column='1' id='type-id-436'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-434' visibility='default' filepath='include/wx/string.h' line='1115' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reverse_iterator' type-id='type-id-433' filepath='include/wx/string.h' line='1118' column='1' id='type-id-437'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reverse_iterator' type-id='type-id-429' filepath='include/wx/string.h' line='1119' column='1' id='type-id-438'/>
      </member-type>
      <member-type access='public'>
        <enum-decl name='caseCompare' filepath='include/wx/string.h' line='2386' column='1' id='type-id-439'>
          <underlying-type type-id='type-id-21'/>
          <enumerator name='exact' value='0'/>
          <enumerator name='ignoreCase' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='stripType' filepath='include/wx/string.h' line='2388' column='1' id='type-id-440'>
          <underlying-type type-id='type-id-21'/>
          <enumerator name='leading' value='1'/>
          <enumerator name='trailing' value='2'/>
          <enumerator name='both' value='3'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='ConvertedBuffer&lt;char&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='3599' column='1' id='type-id-441'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_str' type-id='type-id-442' visibility='default' filepath='include/wx/string.h' line='3625' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_len' type-id='type-id-12' visibility='default' filepath='include/wx/string.h' line='3626' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' static='yes'>
        <var-decl name='npos' type-id='type-id-443' mangled-name='_ZN8wxString4nposE' visibility='default' filepath='include/wx/string.h' line='308' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_impl' type-id='type-id-444' visibility='default' filepath='include/wx/string.h' line='3589' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_convertedToChar' type-id='type-id-441' visibility='default' filepath='include/wx/string.h' line='3677' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxStdWideString' type-id='type-id-445' filepath='include/wx/stringimpl.h' line='70' column='1' id='type-id-446'/>
    <typedef-decl name='wxStdString' type-id='type-id-446' filepath='include/wx/stringimpl.h' line='76' column='1' id='type-id-447'/>
    <typedef-decl name='wxStringImpl' type-id='type-id-447' filepath='include/wx/stringimpl.h' line='90' column='1' id='type-id-444'/>
    <class-decl name='wxFormatString' size-in-bits='320' visibility='default' filepath='include/wx/strvararg.h' line='137' column='1' id='type-id-448'>
      <member-type access='public'>
        <enum-decl name='ArgumentType' filepath='include/wx/strvararg.h' line='161' column='1' id='type-id-449'>
          <underlying-type type-id='type-id-21'/>
          <enumerator name='Arg_Unused' value='0'/>
          <enumerator name='Arg_Char' value='1'/>
          <enumerator name='Arg_Pointer' value='2'/>
          <enumerator name='Arg_String' value='6'/>
          <enumerator name='Arg_Int' value='9'/>
          <enumerator name='Arg_LongInt' value='16'/>
          <enumerator name='Arg_LongLongInt' value='16'/>
          <enumerator name='Arg_Double' value='64'/>
          <enumerator name='Arg_LongDouble' value='128'/>
          <enumerator name='Arg_Size_t' value='16'/>
          <enumerator name='Arg_IntPtr' value='512'/>
          <enumerator name='Arg_ShortIntPtr' value='1024'/>
          <enumerator name='Arg_LongIntPtr' value='2048'/>
          <enumerator name='Arg_Unknown' value='32768'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_convertedWChar' type-id='type-id-197' visibility='default' filepath='include/wx/strvararg.h' line='232' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_char' type-id='type-id-196' visibility='default' filepath='include/wx/strvararg.h' line='236' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_wchar' type-id='type-id-197' visibility='default' filepath='include/wx/strvararg.h' line='237' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_str' type-id='type-id-157' visibility='default' filepath='include/wx/strvararg.h' line='242' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_cstr' type-id='type-id-450' visibility='default' filepath='include/wx/strvararg.h' line='243' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxFormatStringArgument' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='250' column='1' id='type-id-451'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_str' type-id='type-id-452' visibility='default' filepath='include/wx/strvararg.h' line='253' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxFormatStringArgumentFinder&lt;const wxFormatString&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='277' column='1' id='type-id-453'/>
    <class-decl name='wxArgNormalizerWchar&lt;const wxCStrData&amp;&gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='570' column='1' id='type-id-454'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_value' type-id='type-id-455' visibility='default' filepath='include/wx/strvararg.h' line='582' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArgNormalizerWchar&lt;wxCStrData&gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='756' column='1' id='type-id-456'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-454'/>
    </class-decl>
    <enum-decl name='wxMutexError' filepath='include/wx/thread.h' line='28' column='1' id='type-id-457'>
      <underlying-type type-id='type-id-21'/>
      <enumerator name='wxMUTEX_NO_ERROR' value='0'/>
      <enumerator name='wxMUTEX_INVALID' value='1'/>
      <enumerator name='wxMUTEX_DEAD_LOCK' value='2'/>
      <enumerator name='wxMUTEX_BUSY' value='3'/>
      <enumerator name='wxMUTEX_UNLOCKED' value='4'/>
      <enumerator name='wxMUTEX_TIMEOUT' value='5'/>
      <enumerator name='wxMUTEX_MISC_ERROR' value='6'/>
    </enum-decl>
    <enum-decl name='wxThreadError' filepath='include/wx/thread.h' line='57' column='1' id='type-id-458'>
      <underlying-type type-id='type-id-21'/>
      <enumerator name='wxTHREAD_NO_ERROR' value='0'/>
      <enumerator name='wxTHREAD_NO_RESOURCE' value='1'/>
      <enumerator name='wxTHREAD_RUNNING' value='2'/>
      <enumerator name='wxTHREAD_NOT_RUNNING' value='3'/>
      <enumerator name='wxTHREAD_KILLED' value='4'/>
      <enumerator name='wxTHREAD_MISC_ERROR' value='5'/>
    </enum-decl>
    <enum-decl name='wxThreadKind' filepath='include/wx/thread.h' line='67' column='1' id='type-id-459'>
      <underlying-type type-id='type-id-21'/>
      <enumerator name='wxTHREAD_DETACHED' value='0'/>
      <enumerator name='wxTHREAD_JOINABLE' value='1'/>
    </enum-decl>
    <enum-decl name='wxMutexType' filepath='include/wx/thread.h' line='112' column='1' id='type-id-460'>
      <underlying-type type-id='type-id-21'/>
      <enumerator name='wxMUTEX_DEFAULT' value='0'/>
      <enumerator name='wxMUTEX_RECURSIVE' value='1'/>
    </enum-decl>
    <class-decl name='wxMutex' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='137' column='1' id='type-id-461'>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_internal' type-id='type-id-462' visibility='default' filepath='include/wx/thread.h' line='174' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxCriticalSectionType' filepath='include/wx/thread.h' line='231' column='1' id='type-id-463'>
      <underlying-type type-id='type-id-21'/>
      <enumerator name='wxCRITSEC_DEFAULT' value='0'/>
      <enumerator name='wxCRITSEC_NON_RECURSIVE' value='1'/>
    </enum-decl>
    <class-decl name='wxCriticalSection' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='242' column='1' id='type-id-464'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_mutex' type-id='type-id-461' visibility='default' filepath='include/wx/thread.h' line='259' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='Leave' mangled-name='_ZN17wxCriticalSection5LeaveEv' filepath='include/wx/thread.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxCriticalSection5LeaveEv@@WXU_3.2'>
          <parameter type-id='type-id-465' name='this' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Enter' mangled-name='_ZN17wxCriticalSection5EnterEv' filepath='include/wx/thread.h' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxCriticalSection5EnterEv@@WXU_3.2'>
          <parameter type-id='type-id-465' name='this' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxCriticalSectionLocker' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='301' column='1' id='type-id-466'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_critsect' type-id='type-id-467' visibility='default' filepath='include/wx/thread.h' line='316' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxThreadHelperThread' size-in-bits='320' visibility='default' filepath='include/wx/thread.h' line='658' column='1' id='type-id-468'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-469'/>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_owner' type-id='type-id-470' visibility='default' filepath='include/wx/thread.h' line='673' column='1'/>
      </data-member>
      <member-function access='protected' vtable-offset='3'>
        <function-decl name='Entry' mangled-name='_ZN20wxThreadHelperThread5EntryEv' filepath='include/wx/thread.h' line='761' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-471' is-artificial='yes'/>
          <return type-id='type-id-81'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxThreadHelper' size-in-bits='256' visibility='default' filepath='include/wx/thread.h' line='686' column='1' id='type-id-472'>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_thread' type-id='type-id-473' visibility='default' filepath='include/wx/thread.h' line='748' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_kind' type-id='type-id-459' visibility='default' filepath='include/wx/thread.h' line='749' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_critSection' type-id='type-id-464' visibility='default' filepath='include/wx/thread.h' line='750' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThreadHelper' mangled-name='_ZN14wxThreadHelperD4Ev' filepath='include/wx/thread.h' line='714' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-474' is-artificial='yes'/>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='Entry' mangled-name='_ZN14wxThreadHelper5EntryEv' filepath='include/wx/thread.h' line='735' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-474' is-artificial='yes'/>
          <return type-id='type-id-81'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='wxContentProtection' filepath='include/wx/toplevel.h' line='123' column='1' id='type-id-475'>
      <underlying-type type-id='type-id-21'/>
      <enumerator name='wxCONTENT_PROTECTION_NONE' value='0'/>
      <enumerator name='wxCONTENT_PROTECTION_ENABLED' value='1'/>
    </enum-decl>
    <class-decl name='wxTypeIdentifier' size-in-bits='64' visibility='default' filepath='include/wx/typeinfo.h' line='63' column='1' id='type-id-476'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_className' type-id='type-id-477' visibility='default' filepath='include/wx/typeinfo.h' line='81' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxCoord' type-id='type-id-49' filepath='include/wx/types.h' line='26' column='1' id='type-id-56'/>
    <typedef-decl name='wxUint8' type-id='type-id-151' filepath='include/wx/types.h' line='43' column='1' id='type-id-478'/>
    <typedef-decl name='wxByte' type-id='type-id-478' filepath='include/wx/types.h' line='44' column='1' id='type-id-213'/>
    <typedef-decl name='wxUint16' type-id='type-id-152' filepath='include/wx/types.h' line='57' column='1' id='type-id-479'/>
    <typedef-decl name='wxInt32' type-id='type-id-49' filepath='include/wx/types.h' line='145' column='1' id='type-id-480'/>
    <typedef-decl name='wxUint32' type-id='type-id-77' filepath='include/wx/types.h' line='146' column='1' id='type-id-481'/>
    <class-decl name='wxUniChar' size-in-bits='32' visibility='default' filepath='include/wx/unichar.h' line='29' column='1' id='type-id-426'>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-481' filepath='include/wx/unichar.h' line='35' column='1' id='type-id-482'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_value' type-id='type-id-482' visibility='default' filepath='include/wx/unichar.h' line='212' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxUniChar' mangled-name='_ZN9wxUniCharC2ERK12wxUniCharRef' filepath='include/wx/unichar.h' line='328' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxUniCharC2ERK12wxUniCharRef@@WXU_3.2'>
          <parameter type-id='type-id-483' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-484' name='c' filepath='include/wx/unichar.h' line='328' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxUniCharRef' size-in-bits='64' visibility='default' filepath='include/wx/unichar.h' line='220' column='1' id='type-id-420'>
      <member-type access='private'>
        <typedef-decl name='iterator' type-id='type-id-422' filepath='include/wx/unichar.h' line='223' column='1' id='type-id-485'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_pos' type-id='type-id-485' visibility='default' filepath='include/wx/unichar.h' line='325' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxBusyCursor' size-in-bits='8' visibility='default' filepath='include/wx/utils.h' line='771' column='1' id='type-id-486'/>
    <class-decl name='wxVector&lt;_GdkWindow*&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-269'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-12' filepath='include/wx/vector.h' line='179' column='1' id='type-id-487'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-489' filepath='include/wx/vector.h' line='181' column='1' id='type-id-488'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-491' filepath='include/wx/vector.h' line='184' column='1' id='type-id-490'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-493' filepath='include/wx/vector.h' line='185' column='1' id='type-id-492'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-494' filepath='include/wx/vector.h' line='187' column='1' id='type-id-273'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-495'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-496'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_INITIAL_SIZE' type-id='type-id-497' mangled-name='_ZN8wxVectorIP10_GdkWindowE18ALLOC_INITIAL_SIZEE' visibility='default' filepath='include/wx/vector.h' line='592' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-487' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-487' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-491' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVector&lt;const wxEventTableEntry*&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-275'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-12' filepath='include/wx/vector.h' line='179' column='1' id='type-id-498'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-302' filepath='include/wx/vector.h' line='181' column='1' id='type-id-499'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-501' filepath='include/wx/vector.h' line='184' column='1' id='type-id-500'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-503' filepath='include/wx/vector.h' line='185' column='1' id='type-id-502'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-504' filepath='include/wx/vector.h' line='187' column='1' id='type-id-279'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-505'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-506'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_INITIAL_SIZE' type-id='type-id-507' mangled-name='_ZN8wxVectorIPK17wxEventTableEntryE18ALLOC_INITIAL_SIZEE' visibility='default' filepath='include/wx/vector.h' line='592' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-498' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-498' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-501' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVector&lt;int&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-281'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-12' filepath='include/wx/vector.h' line='179' column='1' id='type-id-508'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-49' filepath='include/wx/vector.h' line='181' column='1' id='type-id-509'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_pointer' type-id='type-id-511' filepath='include/wx/vector.h' line='183' column='1' id='type-id-510'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-513' filepath='include/wx/vector.h' line='184' column='1' id='type-id-512'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-511' filepath='include/wx/vector.h' line='185' column='1' id='type-id-514'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-515' filepath='include/wx/vector.h' line='187' column='1' id='type-id-285'/>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator' size-in-bits='64' visibility='default' filepath='include/wx/vector.h' line='189' column='1' id='type-id-516'>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-418' filepath='include/wx/vector.h' line='195' column='1' id='type-id-517'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-49' filepath='include/wx/vector.h' line='196' column='1' id='type-id-518'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='pointer' type-id='type-id-520' filepath='include/wx/vector.h' line='197' column='1' id='type-id-519'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-522' filepath='include/wx/vector.h' line='198' column='1' id='type-id-521'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_ptr' type-id='type-id-520' visibility='default' filepath='include/wx/vector.h' line='245' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_reverse_iterator' size-in-bits='64' visibility='default' filepath='include/wx/vector.h' line='250' column='1' id='type-id-523'>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-418' filepath='include/wx/vector.h' line='256' column='1' id='type-id-524'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-49' filepath='include/wx/vector.h' line='257' column='1' id='type-id-525'/>
          </member-type>
          <data-member access='protected' layout-offset-in-bits='0'>
            <var-decl name='m_ptr' type-id='type-id-526' visibility='default' filepath='include/wx/vector.h' line='308' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_INITIAL_SIZE' type-id='type-id-527' mangled-name='_ZN8wxVectorIiE18ALLOC_INITIAL_SIZEE' visibility='default' filepath='include/wx/vector.h' line='592' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-508' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-508' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-513' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVisualAttributes' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/wx/window.h' line='77' column='1' id='type-id-130'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='font' type-id='type-id-528' visibility='default' filepath='include/wx/window.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='colFg' type-id='type-id-59' visibility='default' filepath='include/wx/window.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='colBg' type-id='type-id-59' visibility='default' filepath='include/wx/window.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxWindowVariant' filepath='include/wx/window.h' line='92' column='1' id='type-id-529'>
      <underlying-type type-id='type-id-21'/>
      <enumerator name='wxWINDOW_VARIANT_NORMAL' value='0'/>
      <enumerator name='wxWINDOW_VARIANT_SMALL' value='1'/>
      <enumerator name='wxWINDOW_VARIANT_MINI' value='2'/>
      <enumerator name='wxWINDOW_VARIANT_LARGE' value='3'/>
      <enumerator name='wxWINDOW_VARIANT_MAX' value='4'/>
    </enum-decl>
    <enum-decl name='wxShowEffect' filepath='include/wx/window.h' line='106' column='1' id='type-id-530'>
      <underlying-type type-id='type-id-21'/>
      <enumerator name='wxSHOW_EFFECT_NONE' value='0'/>
      <enumerator name='wxSHOW_EFFECT_ROLL_TO_LEFT' value='1'/>
      <enumerator name='wxSHOW_EFFECT_ROLL_TO_RIGHT' value='2'/>
      <enumerator name='wxSHOW_EFFECT_ROLL_TO_TOP' value='3'/>
      <enumerator name='wxSHOW_EFFECT_ROLL_TO_BOTTOM' value='4'/>
      <enumerator name='wxSHOW_EFFECT_SLIDE_TO_LEFT' value='5'/>
      <enumerator name='wxSHOW_EFFECT_SLIDE_TO_RIGHT' value='6'/>
      <enumerator name='wxSHOW_EFFECT_SLIDE_TO_TOP' value='7'/>
      <enumerator name='wxSHOW_EFFECT_SLIDE_TO_BOTTOM' value='8'/>
      <enumerator name='wxSHOW_EFFECT_BLEND' value='9'/>
      <enumerator name='wxSHOW_EFFECT_EXPAND' value='10'/>
      <enumerator name='wxSHOW_EFFECT_MAX' value='11'/>
    </enum-decl>
    <class-decl name='wxWindowIDRef' size-in-bits='32' visibility='default' filepath='include/wx/windowid.h' line='26' column='1' id='type-id-531'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_id' type-id='type-id-44' visibility='default' filepath='include/wx/windowid.h' line='114' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='lconv' size-in-bits='768' is-struct='yes' visibility='default' filepath='/usr/include/locale.h' line='51' column='1' id='type-id-532'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='decimal_point' type-id='type-id-442' visibility='default' filepath='/usr/include/locale.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thousands_sep' type-id='type-id-442' visibility='default' filepath='/usr/include/locale.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='grouping' type-id='type-id-442' visibility='default' filepath='/usr/include/locale.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='int_curr_symbol' type-id='type-id-442' visibility='default' filepath='/usr/include/locale.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='currency_symbol' type-id='type-id-442' visibility='default' filepath='/usr/include/locale.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mon_decimal_point' type-id='type-id-442' visibility='default' filepath='/usr/include/locale.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mon_thousands_sep' type-id='type-id-442' visibility='default' filepath='/usr/include/locale.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mon_grouping' type-id='type-id-442' visibility='default' filepath='/usr/include/locale.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='positive_sign' type-id='type-id-442' visibility='default' filepath='/usr/include/locale.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='negative_sign' type-id='type-id-442' visibility='default' filepath='/usr/include/locale.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='int_frac_digits' type-id='type-id-135' visibility='default' filepath='/usr/include/locale.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <var-decl name='frac_digits' type-id='type-id-135' visibility='default' filepath='/usr/include/locale.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='p_cs_precedes' type-id='type-id-135' visibility='default' filepath='/usr/include/locale.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='664'>
        <var-decl name='p_sep_by_space' type-id='type-id-135' visibility='default' filepath='/usr/include/locale.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='n_cs_precedes' type-id='type-id-135' visibility='default' filepath='/usr/include/locale.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='680'>
        <var-decl name='n_sep_by_space' type-id='type-id-135' visibility='default' filepath='/usr/include/locale.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='688'>
        <var-decl name='p_sign_posn' type-id='type-id-135' visibility='default' filepath='/usr/include/locale.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='696'>
        <var-decl name='n_sign_posn' type-id='type-id-135' visibility='default' filepath='/usr/include/locale.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='int_p_cs_precedes' type-id='type-id-135' visibility='default' filepath='/usr/include/locale.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='712'>
        <var-decl name='int_p_sep_by_space' type-id='type-id-135' visibility='default' filepath='/usr/include/locale.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='720'>
        <var-decl name='int_n_cs_precedes' type-id='type-id-135' visibility='default' filepath='/usr/include/locale.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='728'>
        <var-decl name='int_n_sep_by_space' type-id='type-id-135' visibility='default' filepath='/usr/include/locale.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='int_p_sign_posn' type-id='type-id-135' visibility='default' filepath='/usr/include/locale.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='744'>
        <var-decl name='int_n_sign_posn' type-id='type-id-135' visibility='default' filepath='/usr/include/locale.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='fpos_t' type-id='type-id-533' filepath='/usr/include/stdio.h' line='86' column='1' id='type-id-534'/>
    <class-decl name='div_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-535' visibility='default' filepath='/usr/include/stdlib.h' line='60' column='1' id='type-id-536'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-49' visibility='default' filepath='/usr/include/stdlib.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rem' type-id='type-id-49' visibility='default' filepath='/usr/include/stdlib.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='div_t' type-id='type-id-536' filepath='/usr/include/stdlib.h' line='63' column='1' id='type-id-535'/>
    <class-decl name='ldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-537' visibility='default' filepath='/usr/include/stdlib.h' line='68' column='1' id='type-id-538'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-46' visibility='default' filepath='/usr/include/stdlib.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-46' visibility='default' filepath='/usr/include/stdlib.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ldiv_t' type-id='type-id-538' filepath='/usr/include/stdlib.h' line='71' column='1' id='type-id-537'/>
    <class-decl name='lldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-539' visibility='default' filepath='/usr/include/stdlib.h' line='78' column='1' id='type-id-540'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-147' visibility='default' filepath='/usr/include/stdlib.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-147' visibility='default' filepath='/usr/include/stdlib.h' line='80' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='lldiv_t' type-id='type-id-540' filepath='/usr/include/stdlib.h' line='81' column='1' id='type-id-539'/>
    <typedef-decl name='__compar_fn_t' type-id='type-id-541' filepath='/usr/include/stdlib.h' line='816' column='1' id='type-id-542'/>
    <typedef-decl name='wctrans_t' type-id='type-id-543' filepath='/usr/include/wctype.h' line='48' column='1' id='type-id-544'/>
    <typedef-decl name='__int32_t' type-id='type-id-49' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='41' column='1' id='type-id-545'/>
    <typedef-decl name='__off_t' type-id='type-id-46' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-546'/>
    <typedef-decl name='__off64_t' type-id='type-id-46' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1' id='type-id-547'/>
    <typedef-decl name='__time_t' type-id='type-id-46' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='160' column='1' id='type-id-548'/>
    <typedef-decl name='__ssize_t' type-id='type-id-46' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='194' column='1' id='type-id-549'/>
    <typedef-decl name='FILE' type-id='type-id-550' filepath='/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-551'/>
    <typedef-decl name='__FILE' type-id='type-id-550' filepath='/usr/include/x86_64-linux-gnu/bits/types/__FILE.h' line='5' column='1' id='type-id-552'/>
    <class-decl name='_G_fpos64_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='10' column='1' id='type-id-553'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__pos' type-id='type-id-547' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__state' type-id='type-id-554' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='13' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__fpos64_t' type-id='type-id-553' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='14' column='1' id='type-id-533'/>
    <class-decl name='__mbstate_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-554' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='14' column='1' id='type-id-555'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='17' column='1' id='type-id-556'>
          <data-member access='public'>
            <var-decl name='__wch' type-id='type-id-77' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='18' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='__wchb' type-id='type-id-142' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='19' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-49' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='type-id-556' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='20' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__mbstate_t' type-id='type-id-555' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='21' column='1' id='type-id-554'/>
    <typedef-decl name='mbstate_t' type-id='type-id-554' filepath='/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h' line='6' column='1' id='type-id-557'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-34' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='43' column='1' id='type-id-558'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='49' column='1' id='type-id-550'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-49' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-442' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-442' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-442' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-442' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-442' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-442' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-442' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-442' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-442' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-442' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-442' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-559' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-560' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-49' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-49' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-546' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-152' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-150' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-138' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-561' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-547' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-562' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-563' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-560' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-81' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-49' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-140' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='7' column='1' id='type-id-564'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-49' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-49' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-49' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-49' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-49' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-49' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-49' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-49' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-49' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-46' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-477' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='time_t' type-id='type-id-548' filepath='/usr/include/x86_64-linux-gnu/bits/types/time_t.h' line='10' column='1' id='type-id-565'/>
    <typedef-decl name='wint_t' type-id='type-id-77' filepath='/usr/include/x86_64-linux-gnu/bits/types/wint_t.h' line='20' column='1' id='type-id-566'/>
    <typedef-decl name='wctype_t' type-id='type-id-3' filepath='/usr/include/x86_64-linux-gnu/bits/wctype-wchar.h' line='38' column='1' id='type-id-567'/>
    <typedef-decl name='off_t' type-id='type-id-547' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='87' column='1' id='type-id-314'/>
    <typedef-decl name='ssize_t' type-id='type-id-549' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='108' column='1' id='type-id-568'/>
    <typedef-decl name='ptrdiff_t' type-id='type-id-46' filepath='/usr/lib/gcc/x86_64-linux-gnu/11/include/stddef.h' line='143' column='1' id='type-id-418'/>
    <typedef-decl name='size_t' type-id='type-id-3' filepath='/usr/lib/gcc/x86_64-linux-gnu/11/include/stddef.h' line='209' column='1' id='type-id-12'/>
    <pointer-type-def type-id='type-id-551' size-in-bits='64' id='type-id-569'/>
    <pointer-type-def type-id='type-id-327' size-in-bits='64' id='type-id-570'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-571'/>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' id='type-id-572'/>
    <pointer-type-def type-id='type-id-244' size-in-bits='64' id='type-id-247'/>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-489'/>
    <qualified-type-def type-id='type-id-489' const='yes' id='type-id-573'/>
    <reference-type-def kind='lvalue' type-id='type-id-573' size-in-bits='64' id='type-id-574'/>
    <reference-type-def kind='lvalue' type-id='type-id-489' size-in-bits='64' id='type-id-575'/>
    <pointer-type-def type-id='type-id-489' size-in-bits='64' id='type-id-576'/>
    <pointer-type-def type-id='type-id-550' size-in-bits='64' id='type-id-560'/>
    <pointer-type-def type-id='type-id-577' size-in-bits='64' id='type-id-562'/>
    <pointer-type-def type-id='type-id-558' size-in-bits='64' id='type-id-561'/>
    <pointer-type-def type-id='type-id-578' size-in-bits='64' id='type-id-559'/>
    <pointer-type-def type-id='type-id-579' size-in-bits='64' id='type-id-563'/>
    <pointer-type-def type-id='type-id-552' size-in-bits='64' id='type-id-580'/>
    <reference-type-def kind='lvalue' type-id='type-id-581' size-in-bits='64' id='type-id-582'/>
    <reference-type-def kind='lvalue' type-id='type-id-583' size-in-bits='64' id='type-id-584'/>
    <reference-type-def kind='lvalue' type-id='type-id-585' size-in-bits='64' id='type-id-586'/>
    <pointer-type-def type-id='type-id-585' size-in-bits='64' id='type-id-587'/>
    <reference-type-def kind='lvalue' type-id='type-id-588' size-in-bits='64' id='type-id-589'/>
    <pointer-type-def type-id='type-id-588' size-in-bits='64' id='type-id-590'/>
    <reference-type-def kind='lvalue' type-id='type-id-591' size-in-bits='64' id='type-id-592'/>
    <pointer-type-def type-id='type-id-591' size-in-bits='64' id='type-id-593'/>
    <reference-type-def kind='lvalue' type-id='type-id-594' size-in-bits='64' id='type-id-595'/>
    <pointer-type-def type-id='type-id-594' size-in-bits='64' id='type-id-596'/>
    <reference-type-def kind='lvalue' type-id='type-id-597' size-in-bits='64' id='type-id-598'/>
    <pointer-type-def type-id='type-id-597' size-in-bits='64' id='type-id-599'/>
    <pointer-type-def type-id='type-id-600' size-in-bits='64' id='type-id-601'/>
    <pointer-type-def type-id='type-id-602' size-in-bits='64' id='type-id-603'/>
    <qualified-type-def type-id='type-id-603' const='yes' id='type-id-604'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-605'/>
    <reference-type-def kind='lvalue' type-id='type-id-135' size-in-bits='64' id='type-id-606'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-442'/>
    <qualified-type-def type-id='type-id-442' const='yes' id='type-id-607'/>
    <reference-type-def kind='lvalue' type-id='type-id-607' size-in-bits='64' id='type-id-608'/>
    <pointer-type-def type-id='type-id-442' size-in-bits='64' id='type-id-609'/>
    <qualified-type-def type-id='type-id-581' const='yes' id='type-id-610'/>
    <reference-type-def kind='lvalue' type-id='type-id-610' size-in-bits='64' id='type-id-611'/>
    <qualified-type-def type-id='type-id-583' const='yes' id='type-id-612'/>
    <reference-type-def kind='lvalue' type-id='type-id-612' size-in-bits='64' id='type-id-613'/>
    <qualified-type-def type-id='type-id-585' const='yes' id='type-id-614'/>
    <pointer-type-def type-id='type-id-614' size-in-bits='64' id='type-id-615'/>
    <qualified-type-def type-id='type-id-588' const='yes' id='type-id-616'/>
    <pointer-type-def type-id='type-id-616' size-in-bits='64' id='type-id-617'/>
    <qualified-type-def type-id='type-id-591' const='yes' id='type-id-618'/>
    <pointer-type-def type-id='type-id-618' size-in-bits='64' id='type-id-619'/>
    <qualified-type-def type-id='type-id-594' const='yes' id='type-id-620'/>
    <pointer-type-def type-id='type-id-620' size-in-bits='64' id='type-id-621'/>
    <qualified-type-def type-id='type-id-597' const='yes' id='type-id-622'/>
    <reference-type-def kind='lvalue' type-id='type-id-622' size-in-bits='64' id='type-id-623'/>
    <pointer-type-def type-id='type-id-622' size-in-bits='64' id='type-id-624'/>
    <qualified-type-def type-id='type-id-625' const='yes' id='type-id-626'/>
    <reference-type-def kind='lvalue' type-id='type-id-626' size-in-bits='64' id='type-id-627'/>
    <qualified-type-def type-id='type-id-600' const='yes' id='type-id-628'/>
    <reference-type-def kind='lvalue' type-id='type-id-628' size-in-bits='64' id='type-id-629'/>
    <pointer-type-def type-id='type-id-628' size-in-bits='64' id='type-id-630'/>
    <qualified-type-def type-id='type-id-602' const='yes' id='type-id-631'/>
    <reference-type-def kind='lvalue' type-id='type-id-631' size-in-bits='64' id='type-id-632'/>
    <pointer-type-def type-id='type-id-631' size-in-bits='64' id='type-id-633'/>
    <qualified-type-def type-id='type-id-545' const='yes' id='type-id-634'/>
    <pointer-type-def type-id='type-id-634' size-in-bits='64' id='type-id-543'/>
    <qualified-type-def type-id='type-id-135' const='yes' id='type-id-1'/>
    <reference-type-def kind='lvalue' type-id='type-id-1' size-in-bits='64' id='type-id-635'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-477'/>
    <qualified-type-def type-id='type-id-477' const='yes' id='type-id-636'/>
    <reference-type-def kind='lvalue' type-id='type-id-636' size-in-bits='64' id='type-id-637'/>
    <pointer-type-def type-id='type-id-477' size-in-bits='64' id='type-id-638'/>
    <qualified-type-def type-id='type-id-534' const='yes' id='type-id-639'/>
    <pointer-type-def type-id='type-id-639' size-in-bits='64' id='type-id-640'/>
    <qualified-type-def type-id='type-id-49' const='yes' id='type-id-641'/>
    <reference-type-def kind='lvalue' type-id='type-id-641' size-in-bits='64' id='type-id-299'/>
    <pointer-type-def type-id='type-id-641' size-in-bits='64' id='type-id-642'/>
    <qualified-type-def type-id='type-id-557' const='yes' id='type-id-643'/>
    <pointer-type-def type-id='type-id-643' size-in-bits='64' id='type-id-644'/>
    <qualified-type-def type-id='type-id-12' const='yes' id='type-id-443'/>
    <qualified-type-def type-id='type-id-645' const='yes' id='type-id-646'/>
    <reference-type-def kind='lvalue' type-id='type-id-646' size-in-bits='64' id='type-id-647'/>
    <pointer-type-def type-id='type-id-646' size-in-bits='64' id='type-id-648'/>
    <qualified-type-def type-id='type-id-649' const='yes' id='type-id-650'/>
    <reference-type-def kind='lvalue' type-id='type-id-650' size-in-bits='64' id='type-id-651'/>
    <qualified-type-def type-id='type-id-652' const='yes' id='type-id-653'/>
    <reference-type-def kind='lvalue' type-id='type-id-653' size-in-bits='64' id='type-id-654'/>
    <pointer-type-def type-id='type-id-653' size-in-bits='64' id='type-id-655'/>
    <qualified-type-def type-id='type-id-655' const='yes' id='type-id-656'/>
    <qualified-type-def type-id='type-id-657' const='yes' id='type-id-658'/>
    <reference-type-def kind='lvalue' type-id='type-id-658' size-in-bits='64' id='type-id-659'/>
    <qualified-type-def type-id='type-id-660' const='yes' id='type-id-661'/>
    <qualified-type-def type-id='type-id-662' const='yes' id='type-id-663'/>
    <reference-type-def kind='lvalue' type-id='type-id-663' size-in-bits='64' id='type-id-664'/>
    <pointer-type-def type-id='type-id-663' size-in-bits='64' id='type-id-665'/>
    <qualified-type-def type-id='type-id-666' const='yes' id='type-id-667'/>
    <reference-type-def kind='lvalue' type-id='type-id-667' size-in-bits='64' id='type-id-668'/>
    <qualified-type-def type-id='type-id-669' const='yes' id='type-id-670'/>
    <reference-type-def kind='lvalue' type-id='type-id-670' size-in-bits='64' id='type-id-671'/>
    <qualified-type-def type-id='type-id-672' const='yes' id='type-id-673'/>
    <reference-type-def kind='lvalue' type-id='type-id-673' size-in-bits='64' id='type-id-674'/>
    <qualified-type-def type-id='type-id-675' const='yes' id='type-id-676'/>
    <reference-type-def kind='lvalue' type-id='type-id-676' size-in-bits='64' id='type-id-677'/>
    <qualified-type-def type-id='type-id-678' const='yes' id='type-id-679'/>
    <reference-type-def kind='lvalue' type-id='type-id-679' size-in-bits='64' id='type-id-680'/>
    <pointer-type-def type-id='type-id-679' size-in-bits='64' id='type-id-681'/>
    <qualified-type-def type-id='type-id-682' const='yes' id='type-id-683'/>
    <reference-type-def kind='lvalue' type-id='type-id-683' size-in-bits='64' id='type-id-684'/>
    <pointer-type-def type-id='type-id-683' size-in-bits='64' id='type-id-685'/>
    <qualified-type-def type-id='type-id-686' const='yes' id='type-id-687'/>
    <reference-type-def kind='lvalue' type-id='type-id-687' size-in-bits='64' id='type-id-688'/>
    <pointer-type-def type-id='type-id-687' size-in-bits='64' id='type-id-689'/>
    <qualified-type-def type-id='type-id-690' const='yes' id='type-id-691'/>
    <reference-type-def kind='lvalue' type-id='type-id-691' size-in-bits='64' id='type-id-692'/>
    <pointer-type-def type-id='type-id-691' size-in-bits='64' id='type-id-693'/>
    <qualified-type-def type-id='type-id-694' const='yes' id='type-id-695'/>
    <reference-type-def kind='lvalue' type-id='type-id-695' size-in-bits='64' id='type-id-696'/>
    <pointer-type-def type-id='type-id-695' size-in-bits='64' id='type-id-697'/>
    <qualified-type-def type-id='type-id-698' const='yes' id='type-id-699'/>
    <reference-type-def kind='lvalue' type-id='type-id-699' size-in-bits='64' id='type-id-700'/>
    <qualified-type-def type-id='type-id-701' const='yes' id='type-id-702'/>
    <pointer-type-def type-id='type-id-702' size-in-bits='64' id='type-id-703'/>
    <qualified-type-def type-id='type-id-704' const='yes' id='type-id-705'/>
    <pointer-type-def type-id='type-id-705' size-in-bits='64' id='type-id-706'/>
    <qualified-type-def type-id='type-id-707' const='yes' id='type-id-708'/>
    <reference-type-def kind='lvalue' type-id='type-id-708' size-in-bits='64' id='type-id-709'/>
    <qualified-type-def type-id='type-id-710' const='yes' id='type-id-711'/>
    <reference-type-def kind='lvalue' type-id='type-id-711' size-in-bits='64' id='type-id-712'/>
    <qualified-type-def type-id='type-id-713' const='yes' id='type-id-714'/>
    <pointer-type-def type-id='type-id-714' size-in-bits='64' id='type-id-715'/>
    <qualified-type-def type-id='type-id-715' const='yes' id='type-id-716'/>
    <qualified-type-def type-id='type-id-564' const='yes' id='type-id-717'/>
    <reference-type-def kind='lvalue' type-id='type-id-717' size-in-bits='64' id='type-id-718'/>
    <pointer-type-def type-id='type-id-717' size-in-bits='64' id='type-id-719'/>
    <qualified-type-def type-id='type-id-151' const='yes' id='type-id-720'/>
    <pointer-type-def type-id='type-id-720' size-in-bits='64' id='type-id-721'/>
    <qualified-type-def type-id='type-id-154' const='yes' id='type-id-722'/>
    <reference-type-def kind='lvalue' type-id='type-id-722' size-in-bits='64' id='type-id-723'/>
    <pointer-type-def type-id='type-id-722' size-in-bits='64' id='type-id-409'/>
    <qualified-type-def type-id='type-id-409' const='yes' id='type-id-724'/>
    <reference-type-def kind='lvalue' type-id='type-id-724' size-in-bits='64' id='type-id-725'/>
    <pointer-type-def type-id='type-id-409' size-in-bits='64' id='type-id-726'/>
    <qualified-type-def type-id='type-id-727' const='yes' id='type-id-728'/>
    <reference-type-def kind='lvalue' type-id='type-id-728' size-in-bits='64' id='type-id-729'/>
    <qualified-type-def type-id='type-id-156' const='yes' id='type-id-730'/>
    <reference-type-def kind='lvalue' type-id='type-id-730' size-in-bits='64' id='type-id-731'/>
    <pointer-type-def type-id='type-id-730' size-in-bits='64' id='type-id-732'/>
    <qualified-type-def type-id='type-id-454' const='yes' id='type-id-733'/>
    <pointer-type-def type-id='type-id-733' size-in-bits='64' id='type-id-734'/>
    <qualified-type-def type-id='type-id-68' const='yes' id='type-id-735'/>
    <reference-type-def kind='lvalue' type-id='type-id-735' size-in-bits='64' id='type-id-71'/>
    <pointer-type-def type-id='type-id-735' size-in-bits='64' id='type-id-736'/>
    <qualified-type-def type-id='type-id-180' const='yes' id='type-id-737'/>
    <pointer-type-def type-id='type-id-737' size-in-bits='64' id='type-id-738'/>
    <qualified-type-def type-id='type-id-186' const='yes' id='type-id-739'/>
    <reference-type-def kind='lvalue' type-id='type-id-739' size-in-bits='64' id='type-id-740'/>
    <qualified-type-def type-id='type-id-181' const='yes' id='type-id-741'/>
    <reference-type-def kind='lvalue' type-id='type-id-741' size-in-bits='64' id='type-id-185'/>
    <pointer-type-def type-id='type-id-741' size-in-bits='64' id='type-id-183'/>
    <qualified-type-def type-id='type-id-173' const='yes' id='type-id-742'/>
    <reference-type-def kind='lvalue' type-id='type-id-742' size-in-bits='64' id='type-id-743'/>
    <pointer-type-def type-id='type-id-742' size-in-bits='64' id='type-id-744'/>
    <qualified-type-def type-id='type-id-179' const='yes' id='type-id-745'/>
    <reference-type-def kind='lvalue' type-id='type-id-745' size-in-bits='64' id='type-id-746'/>
    <qualified-type-def type-id='type-id-163' const='yes' id='type-id-747'/>
    <reference-type-def kind='lvalue' type-id='type-id-747' size-in-bits='64' id='type-id-171'/>
    <pointer-type-def type-id='type-id-747' size-in-bits='64' id='type-id-167'/>
    <qualified-type-def type-id='type-id-268' const='yes' id='type-id-748'/>
    <pointer-type-def type-id='type-id-748' size-in-bits='64' id='type-id-749'/>
    <qualified-type-def type-id='type-id-274' const='yes' id='type-id-750'/>
    <pointer-type-def type-id='type-id-750' size-in-bits='64' id='type-id-751'/>
    <qualified-type-def type-id='type-id-280' const='yes' id='type-id-752'/>
    <pointer-type-def type-id='type-id-752' size-in-bits='64' id='type-id-753'/>
    <qualified-type-def type-id='type-id-754' const='yes' id='type-id-755'/>
    <pointer-type-def type-id='type-id-755' size-in-bits='64' id='type-id-756'/>
    <qualified-type-def type-id='type-id-757' const='yes' id='type-id-758'/>
    <pointer-type-def type-id='type-id-758' size-in-bits='64' id='type-id-759'/>
    <qualified-type-def type-id='type-id-211' const='yes' id='type-id-760'/>
    <reference-type-def kind='lvalue' type-id='type-id-760' size-in-bits='64' id='type-id-761'/>
    <qualified-type-def type-id='type-id-407' const='yes' id='type-id-762'/>
    <reference-type-def kind='lvalue' type-id='type-id-762' size-in-bits='64' id='type-id-455'/>
    <pointer-type-def type-id='type-id-762' size-in-bits='64' id='type-id-763'/>
    <qualified-type-def type-id='type-id-763' const='yes' id='type-id-450'/>
    <qualified-type-def type-id='type-id-214' const='yes' id='type-id-764'/>
    <pointer-type-def type-id='type-id-764' size-in-bits='64' id='type-id-406'/>
    <qualified-type-def type-id='type-id-202' const='yes' id='type-id-765'/>
    <qualified-type-def type-id='type-id-203' const='yes' id='type-id-766'/>
    <reference-type-def kind='lvalue' type-id='type-id-766' size-in-bits='64' id='type-id-767'/>
    <qualified-type-def type-id='type-id-204' const='yes' id='type-id-768'/>
    <reference-type-def kind='lvalue' type-id='type-id-768' size-in-bits='64' id='type-id-769'/>
    <qualified-type-def type-id='type-id-198' const='yes' id='type-id-770'/>
    <reference-type-def kind='lvalue' type-id='type-id-770' size-in-bits='64' id='type-id-771'/>
    <qualified-type-def type-id='type-id-199' const='yes' id='type-id-772'/>
    <pointer-type-def type-id='type-id-772' size-in-bits='64' id='type-id-773'/>
    <qualified-type-def type-id='type-id-200' const='yes' id='type-id-774'/>
    <reference-type-def kind='lvalue' type-id='type-id-774' size-in-bits='64' id='type-id-775'/>
    <qualified-type-def type-id='type-id-201' const='yes' id='type-id-776'/>
    <pointer-type-def type-id='type-id-776' size-in-bits='64' id='type-id-777'/>
    <qualified-type-def type-id='type-id-25' const='yes' id='type-id-778'/>
    <reference-type-def kind='lvalue' type-id='type-id-778' size-in-bits='64' id='type-id-779'/>
    <pointer-type-def type-id='type-id-778' size-in-bits='64' id='type-id-404'/>
    <qualified-type-def type-id='type-id-404' const='yes' id='type-id-780'/>
    <qualified-type-def type-id='type-id-400' const='yes' id='type-id-781'/>
    <pointer-type-def type-id='type-id-781' size-in-bits='64' id='type-id-782'/>
    <qualified-type-def type-id='type-id-402' const='yes' id='type-id-783'/>
    <reference-type-def kind='lvalue' type-id='type-id-783' size-in-bits='64' id='type-id-784'/>
    <qualified-type-def type-id='type-id-59' const='yes' id='type-id-785'/>
    <reference-type-def kind='lvalue' type-id='type-id-785' size-in-bits='64' id='type-id-58'/>
    <pointer-type-def type-id='type-id-785' size-in-bits='64' id='type-id-786'/>
    <qualified-type-def type-id='type-id-787' const='yes' id='type-id-788'/>
    <pointer-type-def type-id='type-id-788' size-in-bits='64' id='type-id-789'/>
    <qualified-type-def type-id='type-id-790' const='yes' id='type-id-791'/>
    <pointer-type-def type-id='type-id-791' size-in-bits='64' id='type-id-792'/>
    <qualified-type-def type-id='type-id-792' const='yes' id='type-id-793'/>
    <qualified-type-def type-id='type-id-464' const='yes' id='type-id-794'/>
    <reference-type-def kind='lvalue' type-id='type-id-794' size-in-bits='64' id='type-id-795'/>
    <qualified-type-def type-id='type-id-466' const='yes' id='type-id-796'/>
    <reference-type-def kind='lvalue' type-id='type-id-796' size-in-bits='64' id='type-id-797'/>
    <qualified-type-def type-id='type-id-66' const='yes' id='type-id-798'/>
    <reference-type-def kind='lvalue' type-id='type-id-798' size-in-bits='64' id='type-id-799'/>
    <pointer-type-def type-id='type-id-798' size-in-bits='64' id='type-id-800'/>
    <qualified-type-def type-id='type-id-237' const='yes' id='type-id-801'/>
    <reference-type-def kind='lvalue' type-id='type-id-801' size-in-bits='64' id='type-id-802'/>
    <pointer-type-def type-id='type-id-801' size-in-bits='64' id='type-id-803'/>
    <qualified-type-def type-id='type-id-224' const='yes' id='type-id-804'/>
    <reference-type-def kind='lvalue' type-id='type-id-804' size-in-bits='64' id='type-id-805'/>
    <pointer-type-def type-id='type-id-804' size-in-bits='64' id='type-id-806'/>
    <qualified-type-def type-id='type-id-233' const='yes' id='type-id-807'/>
    <reference-type-def kind='lvalue' type-id='type-id-807' size-in-bits='64' id='type-id-808'/>
    <pointer-type-def type-id='type-id-807' size-in-bits='64' id='type-id-809'/>
    <qualified-type-def type-id='type-id-234' const='yes' id='type-id-810'/>
    <reference-type-def kind='lvalue' type-id='type-id-810' size-in-bits='64' id='type-id-811'/>
    <pointer-type-def type-id='type-id-810' size-in-bits='64' id='type-id-812'/>
    <qualified-type-def type-id='type-id-343' const='yes' id='type-id-813'/>
    <pointer-type-def type-id='type-id-813' size-in-bits='64' id='type-id-814'/>
    <qualified-type-def type-id='type-id-815' const='yes' id='type-id-816'/>
    <pointer-type-def type-id='type-id-816' size-in-bits='64' id='type-id-817'/>
    <qualified-type-def type-id='type-id-300' const='yes' id='type-id-818'/>
    <reference-type-def kind='lvalue' type-id='type-id-818' size-in-bits='64' id='type-id-819'/>
    <qualified-type-def type-id='type-id-820' const='yes' id='type-id-821'/>
    <reference-type-def kind='lvalue' type-id='type-id-821' size-in-bits='64' id='type-id-822'/>
    <qualified-type-def type-id='type-id-289' const='yes' id='type-id-823'/>
    <reference-type-def kind='lvalue' type-id='type-id-823' size-in-bits='64' id='type-id-294'/>
    <qualified-type-def type-id='type-id-31' const='yes' id='type-id-824'/>
    <reference-type-def kind='lvalue' type-id='type-id-824' size-in-bits='64' id='type-id-825'/>
    <qualified-type-def type-id='type-id-301' const='yes' id='type-id-30'/>
    <reference-type-def kind='lvalue' type-id='type-id-30' size-in-bits='64' id='type-id-307'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-52'/>
    <qualified-type-def type-id='type-id-298' const='yes' id='type-id-9'/>
    <reference-type-def kind='lvalue' type-id='type-id-9' size-in-bits='64' id='type-id-826'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-302'/>
    <qualified-type-def type-id='type-id-302' const='yes' id='type-id-827'/>
    <reference-type-def kind='lvalue' type-id='type-id-827' size-in-bits='64' id='type-id-828'/>
    <reference-type-def kind='lvalue' type-id='type-id-302' size-in-bits='64' id='type-id-829'/>
    <pointer-type-def type-id='type-id-302' size-in-bits='64' id='type-id-830'/>
    <qualified-type-def type-id='type-id-295' const='yes' id='type-id-831'/>
    <reference-type-def kind='lvalue' type-id='type-id-831' size-in-bits='64' id='type-id-832'/>
    <qualified-type-def type-id='type-id-833' const='yes' id='type-id-834'/>
    <pointer-type-def type-id='type-id-834' size-in-bits='64' id='type-id-835'/>
    <qualified-type-def type-id='type-id-310' const='yes' id='type-id-836'/>
    <reference-type-def kind='lvalue' type-id='type-id-836' size-in-bits='64' id='type-id-837'/>
    <pointer-type-def type-id='type-id-836' size-in-bits='64' id='type-id-838'/>
    <qualified-type-def type-id='type-id-318' const='yes' id='type-id-839'/>
    <reference-type-def kind='lvalue' type-id='type-id-839' size-in-bits='64' id='type-id-840'/>
    <pointer-type-def type-id='type-id-839' size-in-bits='64' id='type-id-841'/>
    <qualified-type-def type-id='type-id-528' const='yes' id='type-id-842'/>
    <reference-type-def kind='lvalue' type-id='type-id-842' size-in-bits='64' id='type-id-843'/>
    <pointer-type-def type-id='type-id-842' size-in-bits='64' id='type-id-844'/>
    <qualified-type-def type-id='type-id-448' const='yes' id='type-id-845'/>
    <reference-type-def kind='lvalue' type-id='type-id-845' size-in-bits='64' id='type-id-846'/>
    <pointer-type-def type-id='type-id-845' size-in-bits='64' id='type-id-452'/>
    <qualified-type-def type-id='type-id-452' const='yes' id='type-id-847'/>
    <qualified-type-def type-id='type-id-451' const='yes' id='type-id-848'/>
    <reference-type-def kind='lvalue' type-id='type-id-848' size-in-bits='64' id='type-id-849'/>
    <pointer-type-def type-id='type-id-848' size-in-bits='64' id='type-id-850'/>
    <qualified-type-def type-id='type-id-850' const='yes' id='type-id-851'/>
    <qualified-type-def type-id='type-id-354' const='yes' id='type-id-852'/>
    <pointer-type-def type-id='type-id-852' size-in-bits='64' id='type-id-853'/>
    <qualified-type-def type-id='type-id-854' const='yes' id='type-id-855'/>
