<abi-corpus version='2.0' architecture='elf-amd-x86_64' soname='libwx_gtk3u_ribbon-3.2.so.0'>
  <elf-needed>
    <dependency name='libwx_gtk3u_core-3.2.so.0'/>
    <dependency name='libwx_baseu-3.2.so.0'/>
    <dependency name='libm.so.6'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_Z18wxRibbonLoadPixmapPKPKc8wxColour' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Z22wxRibbonShiftLuminance17wxRibbonHSLColourf' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Z25wxRibbonInterpolateColourRK8wxColourS1_iii' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Z31wxRibbonCanLabelBreakAtPositionRK8wxStringm' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Z33wxRibbonDrawParallelGradientLinesR4wxDCiPK7wxPointiiiiiRK8wxColourS6_' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_ZTV18wxRibbonPanelEvent' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV18wxRibbonXmlHandler' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV19wxRibbonArtProvider' size='368' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV20wxRibbonGalleryEvent' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV20wxRibbonToolBarEvent' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV21wxAutoBufferedPaintDC' size='80' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV22wxRibbonAUIArtProvider' size='376' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV22wxRibbonButtonBarEvent' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV22wxRibbonMSWArtProvider' size='376' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV9wxPenBase' size='216' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RIBBONBAR_HELP_CLICK' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RIBBONBAR_PAGE_CHANGED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RIBBONBAR_PAGE_CHANGING' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RIBBONBAR_TAB_LEFT_DCLICK' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RIBBONBAR_TAB_MIDDLE_DOWN' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RIBBONBAR_TAB_MIDDLE_UP' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RIBBONBAR_TAB_RIGHT_DOWN' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RIBBONBAR_TAB_RIGHT_UP' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RIBBONBAR_TOGGLED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RIBBONBUTTONBAR_CLICKED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RIBBONBUTTONBAR_DROPDOWN_CLICKED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RIBBONGALLERY_CLICKED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RIBBONGALLERY_HOVER_CHANGED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RIBBONGALLERY_SELECTED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RIBBONPANEL_EXTBUTTON_ACTIVATED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RIBBONTOOLBAR_CLICKED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RIBBONTOOLBAR_DROPDOWN_CLICKED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/ribbon/art_aui.cpp' language='LANG_C_plus_plus_14'>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-2'/>
    <qualified-type-def type-id='type-id-3' const='yes' id='type-id-4'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-5'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-6'/>
    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-7'/>
    <class-decl name='wxRibbonAUIArtProvider' visibility='default' filepath='include/wx/ribbon/art.h' line='793' column='1' is-declaration-only='yes' id='type-id-3'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-8'/>
      <data-member access='protected' layout-offset-in-bits='16512'>
        <var-decl name='m_tab_ctrl_background_colour' type-id='type-id-9' visibility='default' filepath='include/wx/ribbon/art.h' line='932' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='16640'>
        <var-decl name='m_tab_ctrl_background_gradient_colour' type-id='type-id-9' visibility='default' filepath='include/wx/ribbon/art.h' line='933' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='16768'>
        <var-decl name='m_panel_label_background_colour' type-id='type-id-9' visibility='default' filepath='include/wx/ribbon/art.h' line='934' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='16896'>
        <var-decl name='m_panel_label_background_gradient_colour' type-id='type-id-9' visibility='default' filepath='include/wx/ribbon/art.h' line='935' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='17024'>
        <var-decl name='m_panel_hover_label_background_colour' type-id='type-id-9' visibility='default' filepath='include/wx/ribbon/art.h' line='936' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='17152'>
        <var-decl name='m_panel_hover_label_background_gradient_colour' type-id='type-id-9' visibility='default' filepath='include/wx/ribbon/art.h' line='937' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='17280'>
        <var-decl name='m_background_brush' type-id='type-id-10' visibility='default' filepath='include/wx/ribbon/art.h' line='939' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='17408'>
        <var-decl name='m_tab_active_top_background_brush' type-id='type-id-10' visibility='default' filepath='include/wx/ribbon/art.h' line='940' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='17536'>
        <var-decl name='m_tab_hover_background_brush' type-id='type-id-10' visibility='default' filepath='include/wx/ribbon/art.h' line='941' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='17664'>
        <var-decl name='m_button_bar_hover_background_brush' type-id='type-id-10' visibility='default' filepath='include/wx/ribbon/art.h' line='942' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='17792'>
        <var-decl name='m_button_bar_active_background_brush' type-id='type-id-10' visibility='default' filepath='include/wx/ribbon/art.h' line='943' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='17920'>
        <var-decl name='m_gallery_button_active_background_brush' type-id='type-id-10' visibility='default' filepath='include/wx/ribbon/art.h' line='944' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='18048'>
        <var-decl name='m_gallery_button_hover_background_brush' type-id='type-id-10' visibility='default' filepath='include/wx/ribbon/art.h' line='945' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='18176'>
        <var-decl name='m_gallery_button_disabled_background_brush' type-id='type-id-10' visibility='default' filepath='include/wx/ribbon/art.h' line='946' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='18304'>
        <var-decl name='m_tool_hover_background_brush' type-id='type-id-10' visibility='default' filepath='include/wx/ribbon/art.h' line='947' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='18432'>
        <var-decl name='m_tool_active_background_brush' type-id='type-id-10' visibility='default' filepath='include/wx/ribbon/art.h' line='948' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='18560'>
        <var-decl name='m_toolbar_hover_borden_pen' type-id='type-id-11' visibility='default' filepath='include/wx/ribbon/art.h' line='950' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='18688'>
        <var-decl name='m_tab_active_label_font' type-id='type-id-12' visibility='default' filepath='include/wx/ribbon/art.h' line='952' column='1'/>
      </data-member>
      <member-function access='protected'>
        <function-decl name='DrawPartialPanelBackground' mangled-name='_ZN22wxRibbonAUIArtProvider26DrawPartialPanelBackgroundER4wxDCP8wxWindowRK6wxRect' filepath='src/ribbon/art_aui.cpp' line='891' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider26DrawPartialPanelBackgroundER4wxDCP8wxWindowRK6wxRect@@WXU_3.2'>
          <parameter type-id='type-id-7' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-13' name='dc' filepath='src/ribbon/art_aui.cpp' line='891' column='1'/>
          <parameter type-id='type-id-14' name='wnd' filepath='src/ribbon/art_aui.cpp' line='892' column='1'/>
          <parameter type-id='type-id-15' name='rect' filepath='src/ribbon/art_aui.cpp' line='892' column='1'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxRibbonAUIArtProvider' mangled-name='_ZN22wxRibbonAUIArtProviderC2Ev' filepath='src/ribbon/art_aui.cpp' line='34' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProviderC2Ev@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRibbonAUIArtProvider' mangled-name='_ZN22wxRibbonAUIArtProviderD4Ev' filepath='src/ribbon/art_aui.cpp' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRibbonAUIArtProvider' mangled-name='_ZN22wxRibbonAUIArtProviderD0Ev' filepath='src/ribbon/art_aui.cpp' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProviderD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRibbonAUIArtProvider' mangled-name='_ZN22wxRibbonAUIArtProviderD2Ev' filepath='src/ribbon/art_aui.cpp' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProviderD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='Clone' mangled-name='_ZNK22wxRibbonAUIArtProvider5CloneEv' filepath='src/ribbon/art_aui.cpp' line='66' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK22wxRibbonAUIArtProvider5CloneEv@@WXU_3.2'>
          <parameter type-id='type-id-5' is-artificial='yes'/>
          <return type-id='type-id-18'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='SetFont' mangled-name='_ZN22wxRibbonAUIArtProvider7SetFontEiRK6wxFont' filepath='src/ribbon/art_aui.cpp' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider7SetFontEiRK6wxFont@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='9'>
        <function-decl name='GetColour' mangled-name='_ZNK22wxRibbonAUIArtProvider9GetColourEi' filepath='src/ribbon/art_aui.cpp' line='109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK22wxRibbonAUIArtProvider9GetColourEi@@WXU_3.2'>
          <parameter type-id='type-id-5' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-9'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='SetColour' mangled-name='_ZN22wxRibbonAUIArtProvider9SetColourEiRK8wxColour' filepath='src/ribbon/art_aui.cpp' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider9SetColourEiRK8wxColour@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-20'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <function-decl name='SetColourScheme' mangled-name='_ZN22wxRibbonAUIArtProvider15SetColourSchemeERK8wxColourS2_S2_' filepath='src/ribbon/art_aui.cpp' line='221' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider15SetColourSchemeERK8wxColourS2_S2_@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-20'/>
          <parameter type-id='type-id-20'/>
          <parameter type-id='type-id-20'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <function-decl name='DrawTabCtrlBackground' mangled-name='_ZN22wxRibbonAUIArtProvider21DrawTabCtrlBackgroundER4wxDCP8wxWindowRK6wxRect' filepath='src/ribbon/art_aui.cpp' line='330' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider21DrawTabCtrlBackgroundER4wxDCP8wxWindowRK6wxRect@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <parameter type-id='type-id-14'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <function-decl name='DrawTab' mangled-name='_ZN22wxRibbonAUIArtProvider7DrawTabER4wxDCP8wxWindowRK19wxRibbonPageTabInfo' filepath='src/ribbon/art_aui.cpp' line='379' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider7DrawTabER4wxDCP8wxWindowRK19wxRibbonPageTabInfo@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <parameter type-id='type-id-14'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <function-decl name='DrawTabSeparator' mangled-name='_ZN22wxRibbonAUIArtProvider16DrawTabSeparatorER4wxDCP8wxWindowRK6wxRectd' filepath='src/ribbon/art_aui.cpp' line='570' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider16DrawTabSeparatorER4wxDCP8wxWindowRK6wxRectd@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <parameter type-id='type-id-14'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-22'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <function-decl name='DrawPageBackground' mangled-name='_ZN22wxRibbonAUIArtProvider18DrawPageBackgroundER4wxDCP8wxWindowRK6wxRect' filepath='src/ribbon/art_aui.cpp' line='579' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider18DrawPageBackgroundER4wxDCP8wxWindowRK6wxRect@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <parameter type-id='type-id-14'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <function-decl name='DrawScrollButton' mangled-name='_ZN22wxRibbonAUIArtProvider16DrawScrollButtonER4wxDCP8wxWindowRK6wxRectl' filepath='src/ribbon/art_aui.cpp' line='602' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider16DrawScrollButtonER4wxDCP8wxWindowRK6wxRectl@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <parameter type-id='type-id-14'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-23'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <function-decl name='DrawPanelBackground' mangled-name='_ZN22wxRibbonAUIArtProvider19DrawPanelBackgroundER4wxDCP13wxRibbonPanelRK6wxRect' filepath='src/ribbon/art_aui.cpp' line='744' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider19DrawPanelBackgroundER4wxDCP13wxRibbonPanelRK6wxRect@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <parameter type-id='type-id-24'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <function-decl name='DrawGalleryBackground' mangled-name='_ZN22wxRibbonAUIArtProvider21DrawGalleryBackgroundER4wxDCP15wxRibbonGalleryRK6wxRect' filepath='src/ribbon/art_aui.cpp' line='953' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider21DrawGalleryBackgroundER4wxDCP15wxRibbonGalleryRK6wxRect@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <parameter type-id='type-id-25'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='DrawGalleryItemBackground' mangled-name='_ZN22wxRibbonAUIArtProvider25DrawGalleryItemBackgroundER4wxDCP15wxRibbonGalleryRK6wxRectP19wxRibbonGalleryItem' filepath='src/ribbon/art_aui.cpp' line='1037' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider25DrawGalleryItemBackgroundER4wxDCP15wxRibbonGalleryRK6wxRectP19wxRibbonGalleryItem@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <parameter type-id='type-id-25'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-26'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='21'>
        <function-decl name='DrawMinimisedPanel' mangled-name='_ZN22wxRibbonAUIArtProvider18DrawMinimisedPanelER4wxDCP13wxRibbonPanelRK6wxRectR8wxBitmap' filepath='src/ribbon/art_aui.cpp' line='822' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider18DrawMinimisedPanelER4wxDCP13wxRibbonPanelRK6wxRectR8wxBitmap@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <parameter type-id='type-id-24'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-27'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <function-decl name='DrawButtonBarBackground' mangled-name='_ZN22wxRibbonAUIArtProvider23DrawButtonBarBackgroundER4wxDCP8wxWindowRK6wxRect' filepath='src/ribbon/art_aui.cpp' line='1056' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider23DrawButtonBarBackgroundER4wxDCP8wxWindowRK6wxRect@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <parameter type-id='type-id-14'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='23'>
        <function-decl name='DrawButtonBarButton' mangled-name='_ZN22wxRibbonAUIArtProvider19DrawButtonBarButtonER4wxDCP8wxWindowRK6wxRect18wxRibbonButtonKindlRK8wxStringRK8wxBitmapSD_' filepath='src/ribbon/art_aui.cpp' line='1064' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider19DrawButtonBarButtonER4wxDCP8wxWindowRK6wxRect18wxRibbonButtonKindlRK8wxStringRK8wxBitmapSD_@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <parameter type-id='type-id-14'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-23'/>
          <parameter type-id='type-id-29'/>
          <parameter type-id='type-id-30'/>
          <parameter type-id='type-id-30'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='24'>
        <function-decl name='DrawToolBarBackground' mangled-name='_ZN22wxRibbonAUIArtProvider21DrawToolBarBackgroundER4wxDCP8wxWindowRK6wxRect' filepath='src/ribbon/art_aui.cpp' line='1154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider21DrawToolBarBackgroundER4wxDCP8wxWindowRK6wxRect@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <parameter type-id='type-id-14'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='25'>
        <function-decl name='DrawToolGroupBackground' mangled-name='_ZN22wxRibbonAUIArtProvider23DrawToolGroupBackgroundER4wxDCP8wxWindowRK6wxRect' filepath='src/ribbon/art_aui.cpp' line='1162' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider23DrawToolGroupBackgroundER4wxDCP8wxWindowRK6wxRect@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <parameter type-id='type-id-14'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='26'>
        <function-decl name='DrawTool' mangled-name='_ZN22wxRibbonAUIArtProvider8DrawToolER4wxDCP8wxWindowRK6wxRectRK8wxBitmap18wxRibbonButtonKindl' filepath='src/ribbon/art_aui.cpp' line='1176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider8DrawToolER4wxDCP8wxWindowRK6wxRectRK8wxBitmap18wxRibbonButtonKindl@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <parameter type-id='type-id-14'/>
          <parameter type-id='type-id-15'/>
          <parameter type-id='type-id-30'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-23'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='29'>
        <function-decl name='GetBarTabWidth' mangled-name='_ZN22wxRibbonAUIArtProvider14GetBarTabWidthER4wxDCP8wxWindowRK8wxStringRK8wxBitmapPiSA_SA_SA_' filepath='src/ribbon/art_aui.cpp' line='522' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider14GetBarTabWidthER4wxDCP8wxWindowRK8wxStringRK8wxBitmapPiSA_SA_SA_@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <parameter type-id='type-id-14'/>
          <parameter type-id='type-id-29'/>
          <parameter type-id='type-id-30'/>
          <parameter type-id='type-id-31'/>
          <parameter type-id='type-id-31'/>
          <parameter type-id='type-id-31'/>
          <parameter type-id='type-id-31'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='30'>
        <function-decl name='GetTabCtrlHeight' mangled-name='_ZN22wxRibbonAUIArtProvider16GetTabCtrlHeightER4wxDCP8wxWindowRK24wxRibbonPageTabInfoArray' filepath='src/ribbon/art_aui.cpp' line='343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider16GetTabCtrlHeightER4wxDCP8wxWindowRK24wxRibbonPageTabInfoArray@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <parameter type-id='type-id-14'/>
          <parameter type-id='type-id-32'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='31'>
        <function-decl name='GetScrollButtonMinimumSize' mangled-name='_ZN22wxRibbonAUIArtProvider26GetScrollButtonMinimumSizeER4wxDCP8wxWindowl' filepath='src/ribbon/art_aui.cpp' line='594' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider26GetScrollButtonMinimumSizeER4wxDCP8wxWindowl@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <parameter type-id='type-id-14'/>
          <parameter type-id='type-id-23'/>
          <return type-id='type-id-33'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='32'>
        <function-decl name='GetPanelSize' mangled-name='_ZN22wxRibbonAUIArtProvider12GetPanelSizeER4wxDCPK13wxRibbonPanel6wxSizeP7wxPoint' filepath='src/ribbon/art_aui.cpp' line='673' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider12GetPanelSizeER4wxDCPK13wxRibbonPanel6wxSizeP7wxPoint@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <parameter type-id='type-id-34'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-35'/>
          <return type-id='type-id-33'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='33'>
        <function-decl name='GetPanelClientSize' mangled-name='_ZN22wxRibbonAUIArtProvider18GetPanelClientSizeER4wxDCPK13wxRibbonPanel6wxSizeP7wxPoint' filepath='src/ribbon/art_aui.cpp' line='697' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider18GetPanelClientSizeER4wxDCPK13wxRibbonPanel6wxSizeP7wxPoint@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <parameter type-id='type-id-34'/>
          <parameter type-id='type-id-33'/>
          <parameter type-id='type-id-35'/>
          <return type-id='type-id-33'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='34'>
        <function-decl name='GetPanelExtButtonArea' mangled-name='_ZN22wxRibbonAUIArtProvider21GetPanelExtButtonAreaER4wxDCPK13wxRibbonPanel6wxRect' filepath='src/ribbon/art_aui.cpp' line='723' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider21GetPanelExtButtonAreaER4wxDCPK13wxRibbonPanel6wxRect@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <parameter type-id='type-id-34'/>
          <parameter type-id='type-id-36'/>
          <return type-id='type-id-36'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='44'>
        <function-decl name='DrawGalleryButton' mangled-name='_ZN22wxRibbonAUIArtProvider17DrawGalleryButtonER4wxDC6wxRect26wxRibbonGalleryButtonStateP8wxBitmap' filepath='src/ribbon/art_aui.cpp' line='983' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxRibbonAUIArtProvider17DrawGalleryButtonER4wxDC6wxRect26wxRibbonGalleryButtonStateP8wxBitmap@@WXU_3.2'>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <parameter type-id='type-id-36'/>
          <parameter type-id='type-id-37'/>
          <parameter type-id='type-id-38'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='src/ribbon/art_internal.cpp' language='LANG_C_plus_plus_14'>
    <type-decl name='__float128' size-in-bits='128' id='type-id-39'/>
    <type-decl name='__int128' size-in-bits='128' id='type-id-40'/>
    <type-decl name='bool' size-in-bits='8' id='type-id-41'/>
    <type-decl name='char' size-in-bits='8' id='type-id-42'/>
    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='128' id='type-id-43'>
      <subrange length='16' type-id='type-id-44' id='type-id-45'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='8' id='type-id-46'>
      <subrange length='1' type-id='type-id-44' id='type-id-47'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='160' id='type-id-48'>
      <subrange length='20' type-id='type-id-44' id='type-id-49'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='32' id='type-id-50'>
      <subrange length='4' type-id='type-id-44' id='type-id-51'/>
    </array-type-def>
    <class-decl name='typedef __va_list_tag __va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-52'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-53' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-53' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-54' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='type-id-22'/>
    <type-decl name='float' size-in-bits='32' id='type-id-55'/>
    <type-decl name='int' size-in-bits='32' id='type-id-17'/>
    <type-decl name='long double' size-in-bits='128' id='type-id-56'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-23'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-57'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-58'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-59'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-60'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-61'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-62'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-53'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-44'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-63'/>
    <type-decl name='variadic parameter type' id='type-id-64'/>
    <type-decl name='void' id='type-id-16'/>
    <type-decl name='wchar_t' size-in-bits='32' id='type-id-65'/>
    <array-type-def dimensions='1' type-id='type-id-65' size-in-bits='128' id='type-id-66'>
      <subrange length='4' type-id='type-id-44' id='type-id-51'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-67' size-in-bits='64' id='type-id-68'>
      <subrange length='2' type-id='type-id-44' id='type-id-69'/>
    </array-type-def>
    <class-decl name='wxScopedCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='66' column='1' id='type-id-70'>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-42' filepath='include/wx/buffer.h' line='69' column='1' id='type-id-71'/>
      </member-type>
      <member-type access='protected'>
        <class-decl name='Data' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='164' column='1' id='type-id-72'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-73'/>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-74' visibility='default' filepath='include/wx/buffer.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxScopedCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='66' column='1' id='type-id-75'>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-65' filepath='include/wx/buffer.h' line='69' column='1' id='type-id-76'/>
      </member-type>
      <member-type access='protected'>
        <class-decl name='Data' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='164' column='1' id='type-id-77'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-73'/>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-78' visibility='default' filepath='include/wx/buffer.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxScopedCharBuffer' type-id='type-id-70' filepath='include/wx/buffer.h' line='241' column='1' id='type-id-79'/>
    <typedef-decl name='wxScopedWCharBuffer' type-id='type-id-75' filepath='include/wx/buffer.h' line='242' column='1' id='type-id-80'/>
    <class-decl name='wxCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='247' column='1' id='type-id-81'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-70'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-42' filepath='include/wx/buffer.h' line='253' column='1' id='type-id-82'/>
      </member-type>
    </class-decl>
    <class-decl name='wxCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='247' column='1' id='type-id-83'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-75'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-65' filepath='include/wx/buffer.h' line='253' column='1' id='type-id-84'/>
      </member-type>
    </class-decl>
    <class-decl name='wxCharBuffer' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='357' column='1' id='type-id-85'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-81'/>
      <member-type access='public'>
        <typedef-decl name='wxCharTypeBufferBase' type-id='type-id-81' filepath='include/wx/buffer.h' line='360' column='1' id='type-id-86'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='wxScopedCharTypeBufferBase' type-id='type-id-70' filepath='include/wx/buffer.h' line='361' column='1' id='type-id-87'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWCharBuffer' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='374' column='1' id='type-id-88'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-83'/>
      <member-type access='public'>
        <typedef-decl name='wxCharTypeBufferBase' type-id='type-id-83' filepath='include/wx/buffer.h' line='377' column='1' id='type-id-89'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='wxScopedCharTypeBufferBase' type-id='type-id-75' filepath='include/wx/buffer.h' line='378' column='1' id='type-id-90'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWritableCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='393' column='1' id='type-id-91'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-81'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-71' filepath='include/wx/buffer.h' line='396' column='1' id='type-id-92'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWritableCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='393' column='1' id='type-id-93'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-83'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-76' filepath='include/wx/buffer.h' line='396' column='1' id='type-id-94'/>
      </member-type>
    </class-decl>
    <typedef-decl name='wxWritableCharBuffer' type-id='type-id-91' filepath='include/wx/buffer.h' line='410' column='1' id='type-id-95'/>
    <typedef-decl name='wxWritableWCharBuffer' type-id='type-id-93' filepath='include/wx/buffer.h' line='411' column='1' id='type-id-96'/>
    <typedef-decl name='wxChar' type-id='type-id-65' filepath='include/wx/chartype.h' line='123' column='1' id='type-id-67'/>
    <typedef-decl name='wxStringCharType' type-id='type-id-65' filepath='include/wx/chartype.h' line='170' column='1' id='type-id-97'/>
    <enum-decl name='wxDirection' filepath='include/wx/defs.h' line='1363' column='1' id='type-id-98'>
      <underlying-type type-id='type-id-61'/>
      <enumerator name='wxLEFT' value='16'/>
      <enumerator name='wxRIGHT' value='32'/>
      <enumerator name='wxUP' value='64'/>
      <enumerator name='wxDOWN' value='128'/>
      <enumerator name='wxTOP' value='64'/>
      <enumerator name='wxBOTTOM' value='128'/>
      <enumerator name='wxNORTH' value='64'/>
      <enumerator name='wxSOUTH' value='128'/>
      <enumerator name='wxWEST' value='16'/>
      <enumerator name='wxEAST' value='32'/>
      <enumerator name='wxALL' value='240'/>
      <enumerator name='wxDIRECTION_MASK' value='240'/>
    </enum-decl>
    <class-decl name='wxArray_SortFunction&lt;wxRibbonPageTabInfo*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-99'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-101' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-100'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-100' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;wxRibbonPageTabInfo*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-102'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-104' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-103'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-103' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxBaseArray&lt;wxRibbonPageTabInfo*, wxSortedArray_SortFunction&lt;wxRibbonPageTabInfo*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-105'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-106'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-103' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-107'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-100' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-108'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-110' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-109'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseObjectArray&lt;wxRibbonPageTabInfo, wxObjectArrayTraitsForwxRibbonPageTabInfoArray&gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='276' column='1' id='type-id-111'>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-105'/>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-113' filepath='include/wx/dynarray.h' line='281' column='1' id='type-id-112'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-101' filepath='include/wx/dynarray.h' line='283' column='1' id='type-id-114'/>
      </member-type>
    </class-decl>
    <class-decl name='wxObjectEventFunctor' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='258' column='1' id='type-id-115'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-116'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-117' visibility='default' filepath='include/wx/event.h' line='288' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxObjectEventFunctorclEP12wxEvtHandlerR7wxEvent' filepath='include/wx/event.h' line='4105' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-118' is-artificial='yes'/>
          <parameter type-id='type-id-117'/>
          <parameter type-id='type-id-119'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxObjectEventFunctor10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-120' is-artificial='yes'/>
          <parameter type-id='type-id-121'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxObjectEventFunctor13GetEvtHandlerEv' filepath='include/wx/event.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-120' is-artificial='yes'/>
          <return type-id='type-id-117'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxObjectEventFunctor12GetEvtMethodEv' filepath='include/wx/event.h' line='284' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-120' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='wxBitmapType' filepath='include/wx/gdicmn.h' line='47' column='1' id='type-id-122'>
      <underlying-type type-id='type-id-61'/>
      <enumerator name='wxBITMAP_TYPE_INVALID' value='0'/>
      <enumerator name='wxBITMAP_TYPE_BMP' value='1'/>
      <enumerator name='wxBITMAP_TYPE_BMP_RESOURCE' value='2'/>
      <enumerator name='wxBITMAP_TYPE_RESOURCE' value='2'/>
      <enumerator name='wxBITMAP_TYPE_ICO' value='3'/>
      <enumerator name='wxBITMAP_TYPE_ICO_RESOURCE' value='4'/>
      <enumerator name='wxBITMAP_TYPE_CUR' value='5'/>
      <enumerator name='wxBITMAP_TYPE_CUR_RESOURCE' value='6'/>
      <enumerator name='wxBITMAP_TYPE_XBM' value='7'/>
      <enumerator name='wxBITMAP_TYPE_XBM_DATA' value='8'/>
      <enumerator name='wxBITMAP_TYPE_XPM' value='9'/>
      <enumerator name='wxBITMAP_TYPE_XPM_DATA' value='10'/>
      <enumerator name='wxBITMAP_TYPE_TIFF' value='11'/>
      <enumerator name='wxBITMAP_TYPE_TIF' value='11'/>
      <enumerator name='wxBITMAP_TYPE_TIFF_RESOURCE' value='12'/>
      <enumerator name='wxBITMAP_TYPE_TIF_RESOURCE' value='12'/>
      <enumerator name='wxBITMAP_TYPE_GIF' value='13'/>
      <enumerator name='wxBITMAP_TYPE_GIF_RESOURCE' value='14'/>
      <enumerator name='wxBITMAP_TYPE_PNG' value='15'/>
      <enumerator name='wxBITMAP_TYPE_PNG_RESOURCE' value='16'/>
      <enumerator name='wxBITMAP_TYPE_JPEG' value='17'/>
      <enumerator name='wxBITMAP_TYPE_JPEG_RESOURCE' value='18'/>
      <enumerator name='wxBITMAP_TYPE_PNM' value='19'/>
      <enumerator name='wxBITMAP_TYPE_PNM_RESOURCE' value='20'/>
      <enumerator name='wxBITMAP_TYPE_PCX' value='21'/>
      <enumerator name='wxBITMAP_TYPE_PCX_RESOURCE' value='22'/>
      <enumerator name='wxBITMAP_TYPE_PICT' value='23'/>
      <enumerator name='wxBITMAP_TYPE_PICT_RESOURCE' value='24'/>
      <enumerator name='wxBITMAP_TYPE_ICON' value='25'/>
      <enumerator name='wxBITMAP_TYPE_ICON_RESOURCE' value='26'/>
      <enumerator name='wxBITMAP_TYPE_ANI' value='27'/>
      <enumerator name='wxBITMAP_TYPE_IFF' value='28'/>
      <enumerator name='wxBITMAP_TYPE_TGA' value='29'/>
      <enumerator name='wxBITMAP_TYPE_MACCURSOR' value='30'/>
      <enumerator name='wxBITMAP_TYPE_MACCURSOR_RESOURCE' value='31'/>
      <enumerator name='wxBITMAP_TYPE_MAX' value='32'/>
      <enumerator name='wxBITMAP_TYPE_ANY' value='50'/>
    </enum-decl>
    <class-decl name='wxSize' size-in-bits='64' visibility='default' filepath='include/wx/gdicmn.h' line='282' column='1' id='type-id-33'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-17' visibility='default' filepath='include/wx/gdicmn.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-17' visibility='default' filepath='include/wx/gdicmn.h' line='286' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRealPoint' size-in-bits='128' visibility='default' filepath='include/wx/gdicmn.h' line='459' column='1' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-22' visibility='default' filepath='include/wx/gdicmn.h' line='462' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='y' type-id='type-id-22' visibility='default' filepath='include/wx/gdicmn.h' line='463' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxPoint' size-in-bits='64' visibility='default' filepath='include/wx/gdicmn.h' line='577' column='1' id='type-id-124'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-17' visibility='default' filepath='include/wx/gdicmn.h' line='580' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-17' visibility='default' filepath='include/wx/gdicmn.h' line='580' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRect' size-in-bits='128' visibility='default' filepath='include/wx/gdicmn.h' line='733' column='1' id='type-id-36'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-17' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-17' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='width' type-id='type-id-17' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='height' type-id='type-id-17' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxGDIRefData' size-in-bits='128' visibility='default' filepath='include/wx/gdiobj.h' line='22' column='1' id='type-id-125'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-126'/>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='IsOk' mangled-name='_ZNK12wxGDIRefData4IsOkEv' filepath='include/wx/gdiobj.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-127' is-artificial='yes'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxRefCounter' size-in-bits='128' visibility='default' filepath='include/wx/object.h' line='228' column='1' id='type-id-126'>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_count' type-id='type-id-17' visibility='default' filepath='include/wx/object.h' line='245' column='1'/>
      </data-member>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRefCounter' mangled-name='_ZN12wxRefCounterD4Ev' filepath='include/wx/object.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-128' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='wxObjectRefData' type-id='type-id-126' filepath='include/wx/object.h' line='258' column='1' id='type-id-129'/>
    <enum-decl name='wxPenStyle' filepath='include/wx/peninfobase.h' line='17' column='1' id='type-id-130'>
      <underlying-type type-id='type-id-61'/>
      <enumerator name='wxPENSTYLE_INVALID' value='-1'/>
      <enumerator name='wxPENSTYLE_SOLID' value='100'/>
      <enumerator name='wxPENSTYLE_DOT' value='101'/>
      <enumerator name='wxPENSTYLE_LONG_DASH' value='102'/>
      <enumerator name='wxPENSTYLE_SHORT_DASH' value='103'/>
      <enumerator name='wxPENSTYLE_DOT_DASH' value='104'/>
      <enumerator name='wxPENSTYLE_USER_DASH' value='105'/>
      <enumerator name='wxPENSTYLE_TRANSPARENT' value='106'/>
      <enumerator name='wxPENSTYLE_STIPPLE_MASK_OPAQUE' value='107'/>
      <enumerator name='wxPENSTYLE_STIPPLE_MASK' value='108'/>
      <enumerator name='wxPENSTYLE_STIPPLE' value='110'/>
      <enumerator name='wxPENSTYLE_BDIAGONAL_HATCH' value='111'/>
      <enumerator name='wxPENSTYLE_CROSSDIAG_HATCH' value='112'/>
      <enumerator name='wxPENSTYLE_FDIAGONAL_HATCH' value='113'/>
      <enumerator name='wxPENSTYLE_CROSS_HATCH' value='114'/>
      <enumerator name='wxPENSTYLE_HORIZONTAL_HATCH' value='115'/>
      <enumerator name='wxPENSTYLE_VERTICAL_HATCH' value='116'/>
      <enumerator name='wxPENSTYLE_FIRST_HATCH' value='111'/>
      <enumerator name='wxPENSTYLE_LAST_HATCH' value='116'/>
    </enum-decl>
    <enum-decl name='wxRibbonButtonKind' filepath='include/wx/ribbon/art.h' line='167' column='1' id='type-id-28'>
      <underlying-type type-id='type-id-61'/>
      <enumerator name='wxRIBBON_BUTTON_NORMAL' value='1'/>
      <enumerator name='wxRIBBON_BUTTON_DROPDOWN' value='2'/>
      <enumerator name='wxRIBBON_BUTTON_HYBRID' value='3'/>
      <enumerator name='wxRIBBON_BUTTON_TOGGLE' value='4'/>
    </enum-decl>
    <enum-decl name='wxRibbonButtonBarButtonState' filepath='include/wx/ribbon/art.h' line='175' column='1' id='type-id-131'>
      <underlying-type type-id='type-id-61'/>
      <enumerator name='wxRIBBON_BUTTONBAR_BUTTON_SMALL' value='0'/>
      <enumerator name='wxRIBBON_BUTTONBAR_BUTTON_MEDIUM' value='1'/>
      <enumerator name='wxRIBBON_BUTTONBAR_BUTTON_LARGE' value='2'/>
      <enumerator name='wxRIBBON_BUTTONBAR_BUTTON_SIZE_MASK' value='3'/>
      <enumerator name='wxRIBBON_BUTTONBAR_BUTTON_NORMAL_HOVERED' value='8'/>
      <enumerator name='wxRIBBON_BUTTONBAR_BUTTON_DROPDOWN_HOVERED' value='16'/>
      <enumerator name='wxRIBBON_BUTTONBAR_BUTTON_HOVER_MASK' value='24'/>
      <enumerator name='wxRIBBON_BUTTONBAR_BUTTON_NORMAL_ACTIVE' value='32'/>
      <enumerator name='wxRIBBON_BUTTONBAR_BUTTON_DROPDOWN_ACTIVE' value='64'/>
      <enumerator name='wxRIBBON_BUTTONBAR_BUTTON_ACTIVE_MASK' value='96'/>
      <enumerator name='wxRIBBON_BUTTONBAR_BUTTON_DISABLED' value='128'/>
      <enumerator name='wxRIBBON_BUTTONBAR_BUTTON_TOGGLED' value='256'/>
      <enumerator name='wxRIBBON_BUTTONBAR_BUTTON_STATE_MASK' value='504'/>
    </enum-decl>
    <class-decl name='wxRibbonHSLColour' size-in-bits='96' visibility='default' filepath='include/wx/ribbon/art_internal.h' line='55' column='1' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hue' type-id='type-id-55' visibility='default' filepath='include/wx/ribbon/art_internal.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='saturation' type-id='type-id-55' visibility='default' filepath='include/wx/ribbon/art_internal.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='luminance' type-id='type-id-55' visibility='default' filepath='include/wx/ribbon/art_internal.h' line='73' column='1'/>
      </data-member>
      <member-function access='public' const='yes'>
        <function-decl name='ShiftHue' mangled-name='_ZNK17wxRibbonHSLColour8ShiftHueEf' filepath='src/ribbon/art_internal.cpp' line='250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK17wxRibbonHSLColour8ShiftHueEf@@WXU_3.2'>
          <parameter type-id='type-id-133' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-55' name='delta' filepath='src/ribbon/art_internal.cpp' line='250' column='1'/>
          <return type-id='type-id-132'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='Desaturated' mangled-name='_ZNK17wxRibbonHSLColour11DesaturatedEf' filepath='src/ribbon/art_internal.cpp' line='245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK17wxRibbonHSLColour11DesaturatedEf@@WXU_3.2'>
          <parameter type-id='type-id-133' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-55' name='delta' filepath='src/ribbon/art_internal.cpp' line='250' column='1'/>
          <return type-id='type-id-132'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='Saturated' mangled-name='_ZNK17wxRibbonHSLColour9SaturatedEf' filepath='src/ribbon/art_internal.cpp' line='240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK17wxRibbonHSLColour9SaturatedEf@@WXU_3.2'>
          <parameter type-id='type-id-133' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-55' name='delta' filepath='src/ribbon/art_internal.cpp' line='250' column='1'/>
          <return type-id='type-id-132'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='Lighter' mangled-name='_ZNK17wxRibbonHSLColour7LighterEf' filepath='src/ribbon/art_internal.cpp' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK17wxRibbonHSLColour7LighterEf@@WXU_3.2'>
          <parameter type-id='type-id-133' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-55' name='delta' filepath='src/ribbon/art_internal.cpp' line='250' column='1'/>
          <return type-id='type-id-132'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='MakeDarker' mangled-name='_ZN17wxRibbonHSLColour10MakeDarkerEf' filepath='src/ribbon/art_internal.cpp' line='229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxRibbonHSLColour10MakeDarkerEf@@WXU_3.2'>
          <parameter type-id='type-id-134' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-55' name='delta' filepath='src/ribbon/art_internal.cpp' line='229' column='1'/>
          <return type-id='type-id-135'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='Darker' mangled-name='_ZNK17wxRibbonHSLColour6DarkerEf' filepath='src/ribbon/art_internal.cpp' line='224' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK17wxRibbonHSLColour6DarkerEf@@WXU_3.2'>
          <parameter type-id='type-id-133' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-55' name='delta' filepath='src/ribbon/art_internal.cpp' line='250' column='1'/>
          <return type-id='type-id-132'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='ToRGB' mangled-name='_ZNK17wxRibbonHSLColour5ToRGBEv' filepath='src/ribbon/art_internal.cpp' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK17wxRibbonHSLColour5ToRGBEv@@WXU_3.2'>
          <parameter type-id='type-id-133' name='this' is-artificial='yes'/>
          <return type-id='type-id-9'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxRibbonHSLColour' mangled-name='_ZN17wxRibbonHSLColourC2ERK8wxColour' filepath='src/ribbon/art_internal.cpp' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxRibbonHSLColourC2ERK8wxColour@@WXU_3.2'>
          <parameter type-id='type-id-134' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-20' name='col' filepath='src/ribbon/art_internal.cpp' line='119' column='1'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='wxRibbonDisplayMode' filepath='include/wx/ribbon/bar.h' line='49' column='1' id='type-id-136'>
      <underlying-type type-id='type-id-61'/>
      <enumerator name='wxRIBBON_BAR_PINNED' value='0'/>
      <enumerator name='wxRIBBON_BAR_MINIMIZED' value='1'/>
      <enumerator name='wxRIBBON_BAR_EXPANDED' value='2'/>
    </enum-decl>
    <class-decl name='wxRibbonPageTabInfo' size-in-bits='384' visibility='default' filepath='include/wx/ribbon/bar.h' line='80' column='1' id='type-id-113'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rect' type-id='type-id-36' visibility='default' filepath='include/wx/ribbon/bar.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='page' type-id='type-id-137' visibility='default' filepath='include/wx/ribbon/bar.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ideal_width' type-id='type-id-17' visibility='default' filepath='include/wx/ribbon/bar.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='small_begin_need_separator_width' type-id='type-id-17' visibility='default' filepath='include/wx/ribbon/bar.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='small_must_have_separator_width' type-id='type-id-17' visibility='default' filepath='include/wx/ribbon/bar.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='minimum_width' type-id='type-id-17' visibility='default' filepath='include/wx/ribbon/bar.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='active' type-id='type-id-41' visibility='default' filepath='include/wx/ribbon/bar.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='hovered' type-id='type-id-41' visibility='default' filepath='include/wx/ribbon/bar.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='highlight' type-id='type-id-41' visibility='default' filepath='include/wx/ribbon/bar.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='shown' type-id='type-id-41' visibility='default' filepath='include/wx/ribbon/bar.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRibbonPageTabInfoArray' size-in-bits='192' visibility='default' filepath='include/wx/ribbon/bar.h' line='96' column='1' id='type-id-138'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-111'/>
    </class-decl>
    <typedef-decl name='wxObjectConstructorFn' type-id='type-id-139' filepath='include/wx/rtti.h' line='39' column='1' id='type-id-140'/>
    <class-decl name='wxClassInfo' size-in-bits='384' visibility='default' filepath='include/wx/rtti.h' line='41' column='1' id='type-id-141'>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-142'>
          <member-type access='private'>
            <typedef-decl name='Node' type-id='type-id-144' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-143'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-142' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-145'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-147' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-146'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-148' visibility='default' filepath='include/wx/rtti.h' line='106' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_table' type-id='type-id-149' visibility='default' filepath='include/wx/rtti.h' line='106' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_className' type-id='type-id-150' visibility='default' filepath='include/wx/rtti.h' line='109' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_objectSize' type-id='type-id-17' visibility='default' filepath='include/wx/rtti.h' line='110' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_objectConstructor' type-id='type-id-140' visibility='default' filepath='include/wx/rtti.h' line='111' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_baseInfo1' type-id='type-id-147' visibility='default' filepath='include/wx/rtti.h' line='115' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_baseInfo2' type-id='type-id-147' visibility='default' filepath='include/wx/rtti.h' line='116' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='m_next' type-id='type-id-151' visibility='default' filepath='include/wx/rtti.h' line='122' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='sm_first' type-id='type-id-151' mangled-name='_ZN11wxClassInfo8sm_firstE' visibility='default' filepath='include/wx/rtti.h' line='121' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxCStrData' size-in-bits='192' visibility='default' filepath='include/wx/string.h' line='152' column='1' id='type-id-152'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_str' type-id='type-id-153' visibility='default' filepath='include/wx/string.h' line='245' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_offset' type-id='type-id-154' visibility='default' filepath='include/wx/string.h' line='252' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_owned' type-id='type-id-41' visibility='default' filepath='include/wx/string.h' line='254' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxString' size-in-bits='384' visibility='default' filepath='include/wx/string.h' line='301' column='1' id='type-id-155'>
      <member-type access='private'>
        <class-decl name='SubstrBufFromType&lt;wchar_t const*&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='337' column='1' id='type-id-156'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='data' type-id='type-id-157' visibility='default' filepath='include/wx/string.h' line='339' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='len' type-id='type-id-154' visibility='default' filepath='include/wx/string.h' line='340' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='SubstrBufFromType&lt;wxScopedCharTypeBuffer&lt;wchar_t&gt; &gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='337' column='1' id='type-id-158'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='data' type-id='type-id-75' visibility='default' filepath='include/wx/string.h' line='339' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='len' type-id='type-id-154' visibility='default' filepath='include/wx/string.h' line='340' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='SubstrBufFromWC' type-id='type-id-156' filepath='include/wx/string.h' line='354' column='1' id='type-id-159'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='SubstrBufFromMB' type-id='type-id-158' filepath='include/wx/string.h' line='355' column='1' id='type-id-160'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-154' filepath='include/wx/string.h' line='752' column='1' id='type-id-161'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-163' filepath='include/wx/string.h' line='753' column='1' id='type-id-162'/>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='963' column='1' id='type-id-164'>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-166' filepath='include/wx/string.h' line='965' column='1' id='type-id-165'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-168' filepath='include/wx/string.h' line='965' column='1' id='type-id-167'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='underlying_iterator' type-id='type-id-170' filepath='include/wx/string.h' line='965' column='1' id='type-id-169'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-169' visibility='default' filepath='include/wx/string.h' line='965' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='994' column='1' id='type-id-171'>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-166' filepath='include/wx/string.h' line='998' column='1' id='type-id-172'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-174' filepath='include/wx/string.h' line='998' column='1' id='type-id-173'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='underlying_iterator' type-id='type-id-176' filepath='include/wx/string.h' line='998' column='1' id='type-id-175'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-175' visibility='default' filepath='include/wx/string.h' line='998' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator_impl&lt;wxString::const_iterator&gt;' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='1060' column='1' id='type-id-177'>
          <member-type access='public'>
            <typedef-decl name='iterator_type' type-id='type-id-171' filepath='include/wx/string.h' line='1063' column='1' id='type-id-178'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-172' filepath='include/wx/string.h' line='1067' column='1' id='type-id-179'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-173' filepath='include/wx/string.h' line='1068' column='1' id='type-id-180'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-178' visibility='default' filepath='include/wx/string.h' line='1115' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator_impl&lt;wxString::iterator&gt;' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='1060' column='1' id='type-id-181'>
          <member-type access='public'>
            <typedef-decl name='iterator_type' type-id='type-id-164' filepath='include/wx/string.h' line='1063' column='1' id='type-id-182'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-165' filepath='include/wx/string.h' line='1067' column='1' id='type-id-183'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-167' filepath='include/wx/string.h' line='1068' column='1' id='type-id-184'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-182' visibility='default' filepath='include/wx/string.h' line='1115' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reverse_iterator' type-id='type-id-181' filepath='include/wx/string.h' line='1118' column='1' id='type-id-185'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reverse_iterator' type-id='type-id-177' filepath='include/wx/string.h' line='1119' column='1' id='type-id-186'/>
      </member-type>
      <member-type access='public'>
        <enum-decl name='caseCompare' filepath='include/wx/string.h' line='2386' column='1' id='type-id-187'>
          <underlying-type type-id='type-id-61'/>
          <enumerator name='exact' value='0'/>
          <enumerator name='ignoreCase' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='stripType' filepath='include/wx/string.h' line='2388' column='1' id='type-id-188'>
          <underlying-type type-id='type-id-61'/>
          <enumerator name='leading' value='1'/>
          <enumerator name='trailing' value='2'/>
          <enumerator name='both' value='3'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='ConvertedBuffer&lt;char&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='3599' column='1' id='type-id-189'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_str' type-id='type-id-190' visibility='default' filepath='include/wx/string.h' line='3625' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_len' type-id='type-id-154' visibility='default' filepath='include/wx/string.h' line='3626' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_impl' type-id='type-id-191' visibility='default' filepath='include/wx/string.h' line='3589' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_convertedToChar' type-id='type-id-189' visibility='default' filepath='include/wx/string.h' line='3677' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='npos' type-id='type-id-192' mangled-name='_ZN8wxString4nposE' visibility='default' filepath='include/wx/string.h' line='308' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxStdWideString' type-id='type-id-193' filepath='include/wx/stringimpl.h' line='70' column='1' id='type-id-194'/>
    <typedef-decl name='wxStdString' type-id='type-id-194' filepath='include/wx/stringimpl.h' line='76' column='1' id='type-id-195'/>
    <typedef-decl name='wxStringImpl' type-id='type-id-195' filepath='include/wx/stringimpl.h' line='90' column='1' id='type-id-191'/>
    <class-decl name='wxStringOperationsWchar' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/stringops.h' line='27' column='1' id='type-id-196'>
      <member-type access='public'>
        <class-decl name='SingleCharBuffer' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/stringops.h' line='64' column='1' id='type-id-197'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='data' type-id='type-id-68' visibility='default' filepath='include/wx/stringops.h' line='66' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
    </class-decl>
    <class-decl name='wxFormatString' size-in-bits='320' visibility='default' filepath='include/wx/strvararg.h' line='137' column='1' id='type-id-198'>
      <member-type access='public'>
        <enum-decl name='ArgumentType' filepath='include/wx/strvararg.h' line='161' column='1' id='type-id-199'>
          <underlying-type type-id='type-id-61'/>
          <enumerator name='Arg_Unused' value='0'/>
          <enumerator name='Arg_Char' value='1'/>
          <enumerator name='Arg_Pointer' value='2'/>
          <enumerator name='Arg_String' value='6'/>
          <enumerator name='Arg_Int' value='9'/>
          <enumerator name='Arg_LongInt' value='16'/>
          <enumerator name='Arg_LongLongInt' value='16'/>
          <enumerator name='Arg_Double' value='64'/>
          <enumerator name='Arg_LongDouble' value='128'/>
          <enumerator name='Arg_Size_t' value='16'/>
          <enumerator name='Arg_IntPtr' value='512'/>
          <enumerator name='Arg_ShortIntPtr' value='1024'/>
          <enumerator name='Arg_LongIntPtr' value='2048'/>
          <enumerator name='Arg_Unknown' value='32768'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_convertedWChar' type-id='type-id-80' visibility='default' filepath='include/wx/strvararg.h' line='232' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_char' type-id='type-id-79' visibility='default' filepath='include/wx/strvararg.h' line='236' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_wchar' type-id='type-id-80' visibility='default' filepath='include/wx/strvararg.h' line='237' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_str' type-id='type-id-200' visibility='default' filepath='include/wx/strvararg.h' line='242' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_cstr' type-id='type-id-201' visibility='default' filepath='include/wx/strvararg.h' line='243' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxMutexError' filepath='include/wx/thread.h' line='28' column='1' id='type-id-202'>
      <underlying-type type-id='type-id-61'/>
      <enumerator name='wxMUTEX_NO_ERROR' value='0'/>
      <enumerator name='wxMUTEX_INVALID' value='1'/>
      <enumerator name='wxMUTEX_DEAD_LOCK' value='2'/>
      <enumerator name='wxMUTEX_BUSY' value='3'/>
      <enumerator name='wxMUTEX_UNLOCKED' value='4'/>
      <enumerator name='wxMUTEX_TIMEOUT' value='5'/>
      <enumerator name='wxMUTEX_MISC_ERROR' value='6'/>
    </enum-decl>
    <enum-decl name='wxThreadError' filepath='include/wx/thread.h' line='57' column='1' id='type-id-203'>
      <underlying-type type-id='type-id-61'/>
      <enumerator name='wxTHREAD_NO_ERROR' value='0'/>
      <enumerator name='wxTHREAD_NO_RESOURCE' value='1'/>
      <enumerator name='wxTHREAD_RUNNING' value='2'/>
      <enumerator name='wxTHREAD_NOT_RUNNING' value='3'/>
      <enumerator name='wxTHREAD_KILLED' value='4'/>
      <enumerator name='wxTHREAD_MISC_ERROR' value='5'/>
    </enum-decl>
    <enum-decl name='wxThreadKind' filepath='include/wx/thread.h' line='67' column='1' id='type-id-204'>
      <underlying-type type-id='type-id-61'/>
      <enumerator name='wxTHREAD_DETACHED' value='0'/>
      <enumerator name='wxTHREAD_JOINABLE' value='1'/>
    </enum-decl>
    <enum-decl name='wxMutexType' filepath='include/wx/thread.h' line='112' column='1' id='type-id-205'>
      <underlying-type type-id='type-id-61'/>
      <enumerator name='wxMUTEX_DEFAULT' value='0'/>
      <enumerator name='wxMUTEX_RECURSIVE' value='1'/>
    </enum-decl>
    <class-decl name='wxMutex' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='137' column='1' id='type-id-206'>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_internal' type-id='type-id-207' visibility='default' filepath='include/wx/thread.h' line='174' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxCriticalSectionType' filepath='include/wx/thread.h' line='231' column='1' id='type-id-208'>
      <underlying-type type-id='type-id-61'/>
      <enumerator name='wxCRITSEC_DEFAULT' value='0'/>
      <enumerator name='wxCRITSEC_NON_RECURSIVE' value='1'/>
    </enum-decl>
    <class-decl name='wxCriticalSection' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='242' column='1' id='type-id-209'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_mutex' type-id='type-id-206' visibility='default' filepath='include/wx/thread.h' line='259' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='Leave' mangled-name='_ZN17wxCriticalSection5LeaveEv' filepath='include/wx/thread.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxCriticalSection5LeaveEv@@WXU_3.2'>
          <parameter type-id='type-id-210' name='this' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Enter' mangled-name='_ZN17wxCriticalSection5EnterEv' filepath='include/wx/thread.h' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxCriticalSection5EnterEv@@WXU_3.2'>
          <parameter type-id='type-id-210' name='this' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxCriticalSectionLocker' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='301' column='1' id='type-id-211'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_critsect' type-id='type-id-212' visibility='default' filepath='include/wx/thread.h' line='316' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxThreadHelperThread' size-in-bits='320' visibility='default' filepath='include/wx/thread.h' line='658' column='1' id='type-id-213'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-214'/>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_owner' type-id='type-id-215' visibility='default' filepath='include/wx/thread.h' line='673' column='1'/>
      </data-member>
      <member-function access='protected' vtable-offset='3'>
        <function-decl name='Entry' mangled-name='_ZN20wxThreadHelperThread5EntryEv' filepath='include/wx/thread.h' line='761' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-216' is-artificial='yes'/>
          <return type-id='type-id-54'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxThreadHelper' size-in-bits='256' visibility='default' filepath='include/wx/thread.h' line='686' column='1' id='type-id-217'>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_thread' type-id='type-id-218' visibility='default' filepath='include/wx/thread.h' line='748' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_kind' type-id='type-id-204' visibility='default' filepath='include/wx/thread.h' line='749' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_critSection' type-id='type-id-209' visibility='default' filepath='include/wx/thread.h' line='750' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThreadHelper' mangled-name='_ZN14wxThreadHelperD4Ev' filepath='include/wx/thread.h' line='714' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-219' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='Entry' mangled-name='_ZN14wxThreadHelper5EntryEv' filepath='include/wx/thread.h' line='735' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-219' is-artificial='yes'/>
          <return type-id='type-id-54'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxTypeIdentifier' size-in-bits='64' visibility='default' filepath='include/wx/typeinfo.h' line='63' column='1' id='type-id-220'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_className' type-id='type-id-221' visibility='default' filepath='include/wx/typeinfo.h' line='81' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxCoord' type-id='type-id-17' filepath='include/wx/types.h' line='26' column='1' id='type-id-222'/>
    <typedef-decl name='wxUint16' type-id='type-id-63' filepath='include/wx/types.h' line='57' column='1' id='type-id-223'/>
    <typedef-decl name='wxUint32' type-id='type-id-53' filepath='include/wx/types.h' line='146' column='1' id='type-id-224'/>
    <class-decl name='wxUniChar' size-in-bits='32' visibility='default' filepath='include/wx/unichar.h' line='29' column='1' id='type-id-174'>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-224' filepath='include/wx/unichar.h' line='35' column='1' id='type-id-225'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_value' type-id='type-id-225' visibility='default' filepath='include/wx/unichar.h' line='212' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxUniCharRef' size-in-bits='64' visibility='default' filepath='include/wx/unichar.h' line='220' column='1' id='type-id-168'>
      <member-type access='private'>
        <typedef-decl name='iterator' type-id='type-id-170' filepath='include/wx/unichar.h' line='223' column='1' id='type-id-226'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_pos' type-id='type-id-226' visibility='default' filepath='include/wx/unichar.h' line='325' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVector&lt;wxRibbonPageTabInfo*&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-106'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-154' filepath='include/wx/vector.h' line='179' column='1' id='type-id-227'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-229' filepath='include/wx/vector.h' line='181' column='1' id='type-id-228'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-231' filepath='include/wx/vector.h' line='184' column='1' id='type-id-230'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-233' filepath='include/wx/vector.h' line='185' column='1' id='type-id-232'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-234' filepath='include/wx/vector.h' line='187' column='1' id='type-id-110'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-235'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-236'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-227' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-227' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-231' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_INITIAL_SIZE' type-id='type-id-237' mangled-name='_ZN8wxVectorIP19wxRibbonPageTabInfoE18ALLOC_INITIAL_SIZEE' visibility='default' filepath='include/wx/vector.h' line='592' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRibbonGalleryItem' size-in-bits='512' visibility='default' filepath='src/ribbon/gallery.cpp' line='36' column='1' id='type-id-238'>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_bitmap' type-id='type-id-239' visibility='default' filepath='src/ribbon/gallery.cpp' line='62' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_client_data' type-id='type-id-240' visibility='default' filepath='src/ribbon/gallery.cpp' line='63' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='320'>
        <var-decl name='m_position' type-id='type-id-36' visibility='default' filepath='src/ribbon/gallery.cpp' line='64' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='448'>
        <var-decl name='m_id' type-id='type-id-17' visibility='default' filepath='src/ribbon/gallery.cpp' line='65' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='480'>
        <var-decl name='m_is_visible' type-id='type-id-41' visibility='default' filepath='src/ribbon/gallery.cpp' line='66' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='lconv' size-in-bits='768' is-struct='yes' visibility='default' filepath='/usr/include/locale.h' line='51' column='1' id='type-id-241'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='decimal_point' type-id='type-id-190' visibility='default' filepath='/usr/include/locale.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thousands_sep' type-id='type-id-190' visibility='default' filepath='/usr/include/locale.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='grouping' type-id='type-id-190' visibility='default' filepath='/usr/include/locale.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='int_curr_symbol' type-id='type-id-190' visibility='default' filepath='/usr/include/locale.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='currency_symbol' type-id='type-id-190' visibility='default' filepath='/usr/include/locale.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mon_decimal_point' type-id='type-id-190' visibility='default' filepath='/usr/include/locale.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mon_thousands_sep' type-id='type-id-190' visibility='default' filepath='/usr/include/locale.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mon_grouping' type-id='type-id-190' visibility='default' filepath='/usr/include/locale.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='positive_sign' type-id='type-id-190' visibility='default' filepath='/usr/include/locale.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='negative_sign' type-id='type-id-190' visibility='default' filepath='/usr/include/locale.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='int_frac_digits' type-id='type-id-42' visibility='default' filepath='/usr/include/locale.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <var-decl name='frac_digits' type-id='type-id-42' visibility='default' filepath='/usr/include/locale.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='p_cs_precedes' type-id='type-id-42' visibility='default' filepath='/usr/include/locale.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='664'>
        <var-decl name='p_sep_by_space' type-id='type-id-42' visibility='default' filepath='/usr/include/locale.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='n_cs_precedes' type-id='type-id-42' visibility='default' filepath='/usr/include/locale.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='680'>
        <var-decl name='n_sep_by_space' type-id='type-id-42' visibility='default' filepath='/usr/include/locale.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='688'>
        <var-decl name='p_sign_posn' type-id='type-id-42' visibility='default' filepath='/usr/include/locale.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='696'>
        <var-decl name='n_sign_posn' type-id='type-id-42' visibility='default' filepath='/usr/include/locale.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='int_p_cs_precedes' type-id='type-id-42' visibility='default' filepath='/usr/include/locale.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='712'>
        <var-decl name='int_p_sep_by_space' type-id='type-id-42' visibility='default' filepath='/usr/include/locale.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='720'>
        <var-decl name='int_n_cs_precedes' type-id='type-id-42' visibility='default' filepath='/usr/include/locale.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='728'>
        <var-decl name='int_n_sep_by_space' type-id='type-id-42' visibility='default' filepath='/usr/include/locale.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='int_p_sign_posn' type-id='type-id-42' visibility='default' filepath='/usr/include/locale.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='744'>
        <var-decl name='int_n_sign_posn' type-id='type-id-42' visibility='default' filepath='/usr/include/locale.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='fpos_t' type-id='type-id-242' filepath='/usr/include/stdio.h' line='86' column='1' id='type-id-243'/>
    <class-decl name='div_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-244' visibility='default' filepath='/usr/include/stdlib.h' line='60' column='1' id='type-id-245'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-17' visibility='default' filepath='/usr/include/stdlib.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rem' type-id='type-id-17' visibility='default' filepath='/usr/include/stdlib.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='div_t' type-id='type-id-245' filepath='/usr/include/stdlib.h' line='63' column='1' id='type-id-244'/>
    <class-decl name='ldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-246' visibility='default' filepath='/usr/include/stdlib.h' line='68' column='1' id='type-id-247'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-23' visibility='default' filepath='/usr/include/stdlib.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-23' visibility='default' filepath='/usr/include/stdlib.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ldiv_t' type-id='type-id-247' filepath='/usr/include/stdlib.h' line='71' column='1' id='type-id-246'/>
    <class-decl name='lldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-248' visibility='default' filepath='/usr/include/stdlib.h' line='78' column='1' id='type-id-249'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-57' visibility='default' filepath='/usr/include/stdlib.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-57' visibility='default' filepath='/usr/include/stdlib.h' line='80' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='lldiv_t' type-id='type-id-249' filepath='/usr/include/stdlib.h' line='81' column='1' id='type-id-248'/>
    <typedef-decl name='__compar_fn_t' type-id='type-id-250' filepath='/usr/include/stdlib.h' line='816' column='1' id='type-id-251'/>
    <typedef-decl name='__off_t' type-id='type-id-23' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-252'/>
    <typedef-decl name='__off64_t' type-id='type-id-23' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1' id='type-id-253'/>
    <typedef-decl name='FILE' type-id='type-id-254' filepath='/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-255'/>
    <typedef-decl name='__FILE' type-id='type-id-254' filepath='/usr/include/x86_64-linux-gnu/bits/types/__FILE.h' line='5' column='1' id='type-id-256'/>
    <class-decl name='_G_fpos64_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='10' column='1' id='type-id-257'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__pos' type-id='type-id-253' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__state' type-id='type-id-258' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='13' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__fpos64_t' type-id='type-id-257' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='14' column='1' id='type-id-242'/>
    <class-decl name='__mbstate_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-258' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='14' column='1' id='type-id-259'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='17' column='1' id='type-id-260'>
          <data-member access='public'>
            <var-decl name='__wch' type-id='type-id-53' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='18' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='__wchb' type-id='type-id-50' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='19' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-17' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='type-id-260' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='20' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__mbstate_t' type-id='type-id-259' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='21' column='1' id='type-id-258'/>
    <typedef-decl name='mbstate_t' type-id='type-id-258' filepath='/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h' line='6' column='1' id='type-id-261'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-16' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='43' column='1' id='type-id-262'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='49' column='1' id='type-id-254'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-17' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-190' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-190' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-190' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-190' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-190' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-190' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-190' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-190' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-190' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-190' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-190' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-263' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-264' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-17' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-17' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-252' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-63' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-60' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-46' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-265' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-253' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-266' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-267' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-264' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-54' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-154' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-17' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-48' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='7' column='1' id='type-id-268'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-17' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-17' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-17' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-17' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-17' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-17' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-17' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-17' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-17' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-23' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-221' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wint_t' type-id='type-id-53' filepath='/usr/include/x86_64-linux-gnu/bits/types/wint_t.h' line='20' column='1' id='type-id-269'/>
    <typedef-decl name='ptrdiff_t' type-id='type-id-23' filepath='/usr/lib/gcc/x86_64-linux-gnu/11/include/stddef.h' line='143' column='1' id='type-id-166'/>
    <typedef-decl name='size_t' type-id='type-id-44' filepath='/usr/lib/gcc/x86_64-linux-gnu/11/include/stddef.h' line='209' column='1' id='type-id-154'/>
    <pointer-type-def type-id='type-id-255' size-in-bits='64' id='type-id-270'/>
    <pointer-type-def type-id='type-id-254' size-in-bits='64' id='type-id-264'/>
    <pointer-type-def type-id='type-id-271' size-in-bits='64' id='type-id-266'/>
    <pointer-type-def type-id='type-id-262' size-in-bits='64' id='type-id-265'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-263'/>
    <pointer-type-def type-id='type-id-273' size-in-bits='64' id='type-id-267'/>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-274'/>
    <reference-type-def kind='lvalue' type-id='type-id-275' size-in-bits='64' id='type-id-276'/>
    <reference-type-def kind='lvalue' type-id='type-id-277' size-in-bits='64' id='type-id-278'/>
    <reference-type-def kind='lvalue' type-id='type-id-279' size-in-bits='64' id='type-id-280'/>
    <pointer-type-def type-id='type-id-279' size-in-bits='64' id='type-id-281'/>
    <reference-type-def kind='lvalue' type-id='type-id-282' size-in-bits='64' id='type-id-283'/>
    <pointer-type-def type-id='type-id-282' size-in-bits='64' id='type-id-284'/>
    <reference-type-def kind='lvalue' type-id='type-id-285' size-in-bits='64' id='type-id-286'/>
    <pointer-type-def type-id='type-id-285' size-in-bits='64' id='type-id-287'/>
    <qualified-type-def type-id='type-id-287' const='yes' id='type-id-288'/>
    <reference-type-def kind='lvalue' type-id='type-id-289' size-in-bits='64' id='type-id-290'/>
    <pointer-type-def type-id='type-id-289' size-in-bits='64' id='type-id-291'/>
    <pointer-type-def type-id='type-id-292' size-in-bits='64' id='type-id-293'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-295'/>
    <reference-type-def kind='lvalue' type-id='type-id-42' size-in-bits='64' id='type-id-296'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-190'/>
    <qualified-type-def type-id='type-id-190' const='yes' id='type-id-297'/>
    <reference-type-def kind='lvalue' type-id='type-id-297' size-in-bits='64' id='type-id-298'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' id='type-id-299'/>
    <qualified-type-def type-id='type-id-275' const='yes' id='type-id-300'/>
    <reference-type-def kind='lvalue' type-id='type-id-300' size-in-bits='64' id='type-id-301'/>
    <qualified-type-def type-id='type-id-277' const='yes' id='type-id-302'/>
    <reference-type-def kind='lvalue' type-id='type-id-302' size-in-bits='64' id='type-id-303'/>
    <qualified-type-def type-id='type-id-279' const='yes' id='type-id-304'/>
    <pointer-type-def type-id='type-id-304' size-in-bits='64' id='type-id-305'/>
    <qualified-type-def type-id='type-id-282' const='yes' id='type-id-306'/>
    <pointer-type-def type-id='type-id-306' size-in-bits='64' id='type-id-307'/>
    <qualified-type-def type-id='type-id-285' const='yes' id='type-id-308'/>
    <pointer-type-def type-id='type-id-308' size-in-bits='64' id='type-id-309'/>
    <qualified-type-def type-id='type-id-309' const='yes' id='type-id-310'/>
    <qualified-type-def type-id='type-id-289' const='yes' id='type-id-311'/>
    <pointer-type-def type-id='type-id-311' size-in-bits='64' id='type-id-312'/>
    <qualified-type-def type-id='type-id-292' const='yes' id='type-id-313'/>
    <reference-type-def kind='lvalue' type-id='type-id-313' size-in-bits='64' id='type-id-314'/>
    <pointer-type-def type-id='type-id-313' size-in-bits='64' id='type-id-315'/>
    <qualified-type-def type-id='type-id-294' const='yes' id='type-id-316'/>
    <reference-type-def kind='lvalue' type-id='type-id-316' size-in-bits='64' id='type-id-317'/>
    <pointer-type-def type-id='type-id-316' size-in-bits='64' id='type-id-318'/>
    <qualified-type-def type-id='type-id-42' const='yes' id='type-id-319'/>
    <reference-type-def kind='lvalue' type-id='type-id-319' size-in-bits='64' id='type-id-320'/>
    <pointer-type-def type-id='type-id-319' size-in-bits='64' id='type-id-221'/>
    <qualified-type-def type-id='type-id-221' const='yes' id='type-id-321'/>
    <reference-type-def kind='lvalue' type-id='type-id-321' size-in-bits='64' id='type-id-322'/>
    <pointer-type-def type-id='type-id-321' size-in-bits='64' id='type-id-323'/>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' id='type-id-324'/>
    <qualified-type-def type-id='type-id-243' const='yes' id='type-id-325'/>
    <pointer-type-def type-id='type-id-325' size-in-bits='64' id='type-id-326'/>
    <qualified-type-def type-id='type-id-17' const='yes' id='type-id-327'/>
    <qualified-type-def type-id='type-id-261' const='yes' id='type-id-328'/>
    <pointer-type-def type-id='type-id-328' size-in-bits='64' id='type-id-329'/>
    <qualified-type-def type-id='type-id-330' const='yes' id='type-id-331'/>
    <reference-type-def kind='lvalue' type-id='type-id-331' size-in-bits='64' id='type-id-332'/>
    <pointer-type-def type-id='type-id-331' size-in-bits='64' id='type-id-333'/>
    <qualified-type-def type-id='type-id-334' const='yes' id='type-id-335'/>
    <reference-type-def kind='lvalue' type-id='type-id-335' size-in-bits='64' id='type-id-336'/>
    <qualified-type-def type-id='type-id-337' const='yes' id='type-id-338'/>
    <reference-type-def kind='lvalue' type-id='type-id-338' size-in-bits='64' id='type-id-339'/>
    <pointer-type-def type-id='type-id-338' size-in-bits='64' id='type-id-340'/>
    <qualified-type-def type-id='type-id-340' const='yes' id='type-id-341'/>
    <qualified-type-def type-id='type-id-342' const='yes' id='type-id-343'/>
    <reference-type-def kind='lvalue' type-id='type-id-343' size-in-bits='64' id='type-id-344'/>
    <qualified-type-def type-id='type-id-176' const='yes' id='type-id-345'/>
    <reference-type-def kind='lvalue' type-id='type-id-345' size-in-bits='64' id='type-id-346'/>
    <qualified-type-def type-id='type-id-347' const='yes' id='type-id-348'/>
    <qualified-type-def type-id='type-id-349' const='yes' id='type-id-350'/>
    <reference-type-def kind='lvalue' type-id='type-id-350' size-in-bits='64' id='type-id-351'/>
    <pointer-type-def type-id='type-id-350' size-in-bits='64' id='type-id-352'/>
    <qualified-type-def type-id='type-id-353' const='yes' id='type-id-354'/>
    <reference-type-def kind='lvalue' type-id='type-id-354' size-in-bits='64' id='type-id-355'/>
    <qualified-type-def type-id='type-id-356' const='yes' id='type-id-357'/>
    <reference-type-def kind='lvalue' type-id='type-id-357' size-in-bits='64' id='type-id-358'/>
    <qualified-type-def type-id='type-id-359' const='yes' id='type-id-360'/>
    <reference-type-def kind='lvalue' type-id='type-id-360' size-in-bits='64' id='type-id-361'/>
    <qualified-type-def type-id='type-id-362' const='yes' id='type-id-363'/>
    <reference-type-def kind='lvalue' type-id='type-id-363' size-in-bits='64' id='type-id-364'/>
    <qualified-type-def type-id='type-id-365' const='yes' id='type-id-366'/>
    <reference-type-def kind='lvalue' type-id='type-id-366' size-in-bits='64' id='type-id-367'/>
    <pointer-type-def type-id='type-id-366' size-in-bits='64' id='type-id-368'/>
    <qualified-type-def type-id='type-id-369' const='yes' id='type-id-370'/>
    <reference-type-def kind='lvalue' type-id='type-id-370' size-in-bits='64' id='type-id-371'/>
    <pointer-type-def type-id='type-id-370' size-in-bits='64' id='type-id-372'/>
    <qualified-type-def type-id='type-id-373' const='yes' id='type-id-374'/>
    <reference-type-def kind='lvalue' type-id='type-id-374' size-in-bits='64' id='type-id-375'/>
    <pointer-type-def type-id='type-id-374' size-in-bits='64' id='type-id-376'/>
    <qualified-type-def type-id='type-id-377' const='yes' id='type-id-378'/>
    <reference-type-def kind='lvalue' type-id='type-id-378' size-in-bits='64' id='type-id-379'/>
    <pointer-type-def type-id='type-id-378' size-in-bits='64' id='type-id-380'/>
    <qualified-type-def type-id='type-id-381' const='yes' id='type-id-382'/>
    <pointer-type-def type-id='type-id-382' size-in-bits='64' id='type-id-383'/>
    <qualified-type-def type-id='type-id-384' const='yes' id='type-id-385'/>
    <pointer-type-def type-id='type-id-385' size-in-bits='64' id='type-id-386'/>
    <qualified-type-def type-id='type-id-387' const='yes' id='type-id-388'/>
    <reference-type-def kind='lvalue' type-id='type-id-388' size-in-bits='64' id='type-id-389'/>
    <qualified-type-def type-id='type-id-390' const='yes' id='type-id-391'/>
    <pointer-type-def type-id='type-id-391' size-in-bits='64' id='type-id-392'/>
    <qualified-type-def type-id='type-id-392' const='yes' id='type-id-393'/>
    <qualified-type-def type-id='type-id-268' const='yes' id='type-id-394'/>
    <pointer-type-def type-id='type-id-394' size-in-bits='64' id='type-id-395'/>
    <qualified-type-def type-id='type-id-62' const='yes' id='type-id-396'/>
    <pointer-type-def type-id='type-id-396' size-in-bits='64' id='type-id-397'/>
    <qualified-type-def type-id='type-id-65' const='yes' id='type-id-398'/>
    <reference-type-def kind='lvalue' type-id='type-id-398' size-in-bits='64' id='type-id-399'/>
    <pointer-type-def type-id='type-id-398' size-in-bits='64' id='type-id-157'/>
    <qualified-type-def type-id='type-id-157' const='yes' id='type-id-400'/>
    <reference-type-def kind='lvalue' type-id='type-id-400' size-in-bits='64' id='type-id-401'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-402'/>
    <qualified-type-def type-id='type-id-105' const='yes' id='type-id-403'/>
    <pointer-type-def type-id='type-id-403' size-in-bits='64' id='type-id-404'/>
    <qualified-type-def type-id='type-id-111' const='yes' id='type-id-405'/>
    <reference-type-def kind='lvalue' type-id='type-id-405' size-in-bits='64' id='type-id-406'/>
    <pointer-type-def type-id='type-id-405' size-in-bits='64' id='type-id-407'/>
    <qualified-type-def type-id='type-id-239' const='yes' id='type-id-408'/>
    <reference-type-def kind='lvalue' type-id='type-id-408' size-in-bits='64' id='type-id-30'/>
    <pointer-type-def type-id='type-id-408' size-in-bits='64' id='type-id-409'/>
    <qualified-type-def type-id='type-id-152' const='yes' id='type-id-410'/>
    <reference-type-def kind='lvalue' type-id='type-id-410' size-in-bits='64' id='type-id-411'/>
    <pointer-type-def type-id='type-id-410' size-in-bits='64' id='type-id-412'/>
    <qualified-type-def type-id='type-id-412' const='yes' id='type-id-201'/>
    <qualified-type-def type-id='type-id-67' const='yes' id='type-id-413'/>
    <pointer-type-def type-id='type-id-413' size-in-bits='64' id='type-id-150'/>
    <qualified-type-def type-id='type-id-85' const='yes' id='type-id-414'/>
    <qualified-type-def type-id='type-id-86' const='yes' id='type-id-415'/>
    <reference-type-def kind='lvalue' type-id='type-id-415' size-in-bits='64' id='type-id-416'/>
    <qualified-type-def type-id='type-id-87' const='yes' id='type-id-417'/>
    <reference-type-def kind='lvalue' type-id='type-id-417' size-in-bits='64' id='type-id-418'/>
    <qualified-type-def type-id='type-id-81' const='yes' id='type-id-419'/>
    <reference-type-def kind='lvalue' type-id='type-id-419' size-in-bits='64' id='type-id-420'/>
    <qualified-type-def type-id='type-id-82' const='yes' id='type-id-421'/>
    <pointer-type-def type-id='type-id-421' size-in-bits='64' id='type-id-422'/>
    <qualified-type-def type-id='type-id-83' const='yes' id='type-id-423'/>
    <reference-type-def kind='lvalue' type-id='type-id-423' size-in-bits='64' id='type-id-424'/>
    <qualified-type-def type-id='type-id-84' const='yes' id='type-id-425'/>
    <pointer-type-def type-id='type-id-425' size-in-bits='64' id='type-id-426'/>
    <qualified-type-def type-id='type-id-141' const='yes' id='type-id-427'/>
    <reference-type-def kind='lvalue' type-id='type-id-427' size-in-bits='64' id='type-id-428'/>
    <pointer-type-def type-id='type-id-427' size-in-bits='64' id='type-id-147'/>
    <qualified-type-def type-id='type-id-142' const='yes' id='type-id-429'/>
    <pointer-type-def type-id='type-id-429' size-in-bits='64' id='type-id-430'/>
    <qualified-type-def type-id='type-id-145' const='yes' id='type-id-431'/>
    <reference-type-def kind='lvalue' type-id='type-id-431' size-in-bits='64' id='type-id-432'/>
    <qualified-type-def type-id='type-id-9' const='yes' id='type-id-433'/>
    <reference-type-def kind='lvalue' type-id='type-id-433' size-in-bits='64' id='type-id-20'/>
    <pointer-type-def type-id='type-id-433' size-in-bits='64' id='type-id-1'/>
    <qualified-type-def type-id='type-id-434' const='yes' id='type-id-435'/>
    <pointer-type-def type-id='type-id-435' size-in-bits='64' id='type-id-436'/>
    <qualified-type-def type-id='type-id-209' const='yes' id='type-id-437'/>
    <reference-type-def kind='lvalue' type-id='type-id-437' size-in-bits='64' id='type-id-438'/>
    <qualified-type-def type-id='type-id-211' const='yes' id='type-id-439'/>
    <reference-type-def kind='lvalue' type-id='type-id-439' size-in-bits='64' id='type-id-440'/>
    <qualified-type-def type-id='type-id-441' const='yes' id='type-id-442'/>
    <reference-type-def kind='lvalue' type-id='type-id-442' size-in-bits='64' id='type-id-443'/>
    <qualified-type-def type-id='type-id-116' const='yes' id='type-id-444'/>
    <reference-type-def kind='lvalue' type-id='type-id-444' size-in-bits='64' id='type-id-121'/>
    <qualified-type-def type-id='type-id-12' const='yes' id='type-id-445'/>
    <reference-type-def kind='lvalue' type-id='type-id-445' size-in-bits='64' id='type-id-19'/>
    <qualified-type-def type-id='type-id-198' const='yes' id='type-id-446'/>
    <reference-type-def kind='lvalue' type-id='type-id-446' size-in-bits='64' id='type-id-447'/>
    <pointer-type-def type-id='type-id-446' size-in-bits='64' id='type-id-448'/>
    <qualified-type-def type-id='type-id-449' const='yes' id='type-id-450'/>
    <pointer-type-def type-id='type-id-450' size-in-bits='64' id='type-id-451'/>
    <qualified-type-def type-id='type-id-125' const='yes' id='type-id-452'/>
    <reference-type-def kind='lvalue' type-id='type-id-452' size-in-bits='64' id='type-id-453'/>
    <pointer-type-def type-id='type-id-452' size-in-bits='64' id='type-id-127'/>
    <qualified-type-def type-id='type-id-454' const='yes' id='type-id-455'/>
    <reference-type-def kind='lvalue' type-id='type-id-455' size-in-bits='64' id='type-id-456'/>
    <pointer-type-def type-id='type-id-455' size-in-bits='64' id='type-id-457'/>
    <qualified-type-def type-id='type-id-458' const='yes' id='type-id-459'/>
    <reference-type-def kind='lvalue' type-id='type-id-459' size-in-bits='64' id='type-id-460'/>
    <qualified-type-def type-id='type-id-206' const='yes' id='type-id-461'/>
    <reference-type-def kind='lvalue' type-id='type-id-461' size-in-bits='64' id='type-id-462'/>
    <pointer-type-def type-id='type-id-461' size-in-bits='64' id='type-id-463'/>
    <qualified-type-def type-id='type-id-464' const='yes' id='type-id-465'/>
    <reference-type-def kind='lvalue' type-id='type-id-465' size-in-bits='64' id='type-id-466'/>
    <pointer-type-def type-id='type-id-465' size-in-bits='64' id='type-id-467'/>
    <qualified-type-def type-id='type-id-115' const='yes' id='type-id-468'/>
    <pointer-type-def type-id='type-id-468' size-in-bits='64' id='type-id-120'/>
    <qualified-type-def type-id='type-id-129' const='yes' id='type-id-469'/>
    <pointer-type-def type-id='type-id-469' size-in-bits='64' id='type-id-470'/>
    <qualified-type-def type-id='type-id-11' const='yes' id='type-id-471'/>
    <reference-type-def kind='lvalue' type-id='type-id-471' size-in-bits='64' id='type-id-472'/>
    <qualified-type-def type-id='type-id-124' const='yes' id='type-id-473'/>
    <reference-type-def kind='lvalue' type-id='type-id-473' size-in-bits='64' id='type-id-474'/>
    <pointer-type-def type-id='type-id-473' size-in-bits='64' id='type-id-475'/>
    <qualified-type-def type-id='type-id-123' const='yes' id='type-id-476'/>
    <reference-type-def kind='lvalue' type-id='type-id-476' size-in-bits='64' id='type-id-477'/>
    <qualified-type-def type-id='type-id-36' const='yes' id='type-id-478'/>
    <reference-type-def kind='lvalue' type-id='type-id-478' size-in-bits='64' id='type-id-15'/>
    <pointer-type-def type-id='type-id-478' size-in-bits='64' id='type-id-479'/>
    <qualified-type-def type-id='type-id-126' const='yes' id='type-id-480'/>
    <reference-type-def kind='lvalue' type-id='type-id-480' size-in-bits='64' id='type-id-481'/>
    <pointer-type-def type-id='type-id-480' size-in-bits='64' id='type-id-482'/>
    <qualified-type-def type-id='type-id-483' const='yes' id='type-id-484'/>
    <pointer-type-def type-id='type-id-484' size-in-bits='64' id='type-id-485'/>
    <qualified-type-def type-id='type-id-486' const='yes' id='type-id-487'/>
    <pointer-type-def type-id='type-id-487' size-in-bits='64' id='type-id-488'/>
    <qualified-type-def type-id='type-id-132' const='yes' id='type-id-489'/>
    <pointer-type-def type-id='type-id-489' size-in-bits='64' id='type-id-490'/>
    <qualified-type-def type-id='type-id-490' const='yes' id='type-id-133'/>
    <qualified-type-def type-id='type-id-491' const='yes' id='type-id-492'/>
    <pointer-type-def type-id='type-id-492' size-in-bits='64' id='type-id-493'/>
    <qualified-type-def type-id='type-id-113' const='yes' id='type-id-494'/>
    <reference-type-def kind='lvalue' type-id='type-id-494' size-in-bits='64' id='type-id-21'/>
    <pointer-type-def type-id='type-id-494' size-in-bits='64' id='type-id-495'/>
    <qualified-type-def type-id='type-id-138' const='yes' id='type-id-496'/>
    <reference-type-def kind='lvalue' type-id='type-id-496' size-in-bits='64' id='type-id-32'/>
    <qualified-type-def type-id='type-id-497' const='yes' id='type-id-498'/>
    <pointer-type-def type-id='type-id-498' size-in-bits='64' id='type-id-34'/>
    <qualified-type-def type-id='type-id-79' const='yes' id='type-id-499'/>
    <reference-type-def kind='lvalue' type-id='type-id-499' size-in-bits='64' id='type-id-500'/>
    <qualified-type-def type-id='type-id-70' const='yes' id='type-id-501'/>
    <reference-type-def kind='lvalue' type-id='type-id-501' size-in-bits='64' id='type-id-502'/>
    <pointer-type-def type-id='type-id-501' size-in-bits='64' id='type-id-503'/>
    <qualified-type-def type-id='type-id-71' const='yes' id='type-id-504'/>
    <pointer-type-def type-id='type-id-504' size-in-bits='64' id='type-id-505'/>
    <qualified-type-def type-id='type-id-72' const='yes' id='type-id-506'/>
    <pointer-type-def type-id='type-id-506' size-in-bits='64' id='type-id-507'/>
    <qualified-type-def type-id='type-id-75' const='yes' id='type-id-508'/>
    <reference-type-def kind='lvalue' type-id='type-id-508' size-in-bits='64' id='type-id-509'/>
    <pointer-type-def type-id='type-id-508' size-in-bits='64' id='type-id-510'/>
    <qualified-type-def type-id='type-id-76' const='yes' id='type-id-511'/>
    <pointer-type-def type-id='type-id-511' size-in-bits='64' id='type-id-512'/>
    <qualified-type-def type-id='type-id-77' const='yes' id='type-id-513'/>
    <pointer-type-def type-id='type-id-513' size-in-bits='64' id='type-id-514'/>
    <qualified-type-def type-id='type-id-80' const='yes' id='type-id-515'/>
    <reference-type-def kind='lvalue' type-id='type-id-515' size-in-bits='64' id='type-id-516'/>
    <qualified-type-def type-id='type-id-33' const='yes' id='type-id-517'/>
    <reference-type-def kind='lvalue' type-id='type-id-517' size-in-bits='64' id='type-id-518'/>
    <pointer-type-def type-id='type-id-517' size-in-bits='64' id='type-id-519'/>
    <qualified-type-def type-id='type-id-194' const='yes' id='type-id-520'/>
    <reference-type-def kind='lvalue' type-id='type-id-520' size-in-bits='64' id='type-id-521'/>
    <qualified-type-def type-id='type-id-155' const='yes' id='type-id-522'/>
    <reference-type-def kind='lvalue' type-id='type-id-522' size-in-bits='64' id='type-id-29'/>
    <pointer-type-def type-id='type-id-522' size-in-bits='64' id='type-id-153'/>
    <qualified-type-def type-id='type-id-153' const='yes' id='type-id-200'/>
    <qualified-type-def type-id='type-id-189' const='yes' id='type-id-523'/>
    <pointer-type-def type-id='type-id-523' size-in-bits='64' id='type-id-524'/>
    <qualified-type-def type-id='type-id-159' const='yes' id='type-id-525'/>
    <qualified-type-def type-id='type-id-171' const='yes' id='type-id-526'/>
    <reference-type-def kind='lvalue' type-id='type-id-526' size-in-bits='64' id='type-id-527'/>
    <pointer-type-def type-id='type-id-526' size-in-bits='64' id='type-id-528'/>
    <qualified-type-def type-id='type-id-164' const='yes' id='type-id-529'/>
    <reference-type-def kind='lvalue' type-id='type-id-529' size-in-bits='64' id='type-id-530'/>
    <pointer-type-def type-id='type-id-529' size-in-bits='64' id='type-id-531'/>
    <qualified-type-def type-id='type-id-177' const='yes' id='type-id-532'/>
    <reference-type-def kind='lvalue' type-id='type-id-532' size-in-bits='64' id='type-id-533'/>
    <pointer-type-def type-id='type-id-532' size-in-bits='64' id='type-id-534'/>
    <qualified-type-def type-id='type-id-181' const='yes' id='type-id-535'/>
    <reference-type-def kind='lvalue' type-id='type-id-535' size-in-bits='64' id='type-id-536'/>
    <pointer-type-def type-id='type-id-535' size-in-bits='64' id='type-id-537'/>
    <qualified-type-def type-id='type-id-97' const='yes' id='type-id-538'/>
    <pointer-type-def type-id='type-id-538' size-in-bits='64' id='type-id-539'/>
    <qualified-type-def type-id='type-id-191' const='yes' id='type-id-540'/>
    <reference-type-def kind='lvalue' type-id='type-id-540' size-in-bits='64' id='type-id-541'/>
    <qualified-type-def type-id='type-id-197' const='yes' id='type-id-542'/>
    <pointer-type-def type-id='type-id-542' size-in-bits='64' id='type-id-543'/>
    <qualified-type-def type-id='type-id-217' const='yes' id='type-id-544'/>
    <pointer-type-def type-id='type-id-544' size-in-bits='64' id='type-id-545'/>
    <qualified-type-def type-id='type-id-213' const='yes' id='type-id-546'/>
    <reference-type-def kind='lvalue' type-id='type-id-546' size-in-bits='64' id='type-id-547'/>
    <qualified-type-def type-id='type-id-220' const='yes' id='type-id-548'/>
    <reference-type-def kind='lvalue' type-id='type-id-548' size-in-bits='64' id='type-id-549'/>
    <pointer-type-def type-id='type-id-548' size-in-bits='64' id='type-id-550'/>
    <qualified-type-def type-id='type-id-550' const='yes' id='type-id-551'/>
    <qualified-type-def type-id='type-id-174' const='yes' id='type-id-163'/>
    <reference-type-def kind='lvalue' type-id='type-id-163' size-in-bits='64' id='type-id-552'/>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-553'/>
    <qualified-type-def type-id='type-id-553' const='yes' id='type-id-554'/>
    <qualified-type-def type-id='type-id-168' const='yes' id='type-id-555'/>
    <reference-type-def kind='lvalue' type-id='type-id-555' size-in-bits='64' id='type-id-556'/>
    <pointer-type-def type-id='type-id-555' size-in-bits='64' id='type-id-557'/>
    <qualified-type-def type-id='type-id-106' const='yes' id='type-id-558'/>
    <reference-type-def kind='lvalue' type-id='type-id-558' size-in-bits='64' id='type-id-559'/>
    <pointer-type-def type-id='type-id-558' size-in-bits='64' id='type-id-560'/>
    <qualified-type-def type-id='type-id-228' const='yes' id='type-id-561'/>
    <reference-type-def kind='lvalue' type-id='type-id-561' size-in-bits='64' id='type-id-234'/>
    <pointer-type-def type-id='type-id-561' size-in-bits='64' id='type-id-233'/>
    <qualified-type-def type-id='type-id-89' const='yes' id='type-id-562'/>
    <reference-type-def kind='lvalue' type-id='type-id-562' size-in-bits='64' id='type-id-563'/>
    <qualified-type-def type-id='type-id-90' const='yes' id='type-id-564'/>
    <reference-type-def kind='lvalue' type-id='type-id-564' size-in-bits='64' id='type-id-565'/>
    <qualified-type-def type-id='type-id-92' const='yes' id='type-id-566'/>
    <pointer-type-def type-id='type-id-566' size-in-bits='64' id='type-id-567'/>
    <qualified-type-def type-id='type-id-94' const='yes' id='type-id-568'/>
    <pointer-type-def type-id='type-id-568' size-in-bits='64' id='type-id-569'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-570'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-571'/>
    <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-572'/>
    <pointer-type-def type-id='type-id-573' size-in-bits='64' id='type-id-250'/>
    <pointer-type-def type-id='type-id-574' size-in-bits='64' id='type-id-101'/>
    <pointer-type-def type-id='type-id-575' size-in-bits='64' id='type-id-104'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-576'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-577'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-578'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-579'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-580'/>
    <pointer-type-def type-id='type-id-261' size-in-bits='64' id='type-id-581'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-582'/>
    <reference-type-def kind='lvalue' type-id='type-id-330' size-in-bits='64' id='type-id-583'/>
    <reference-type-def kind='rvalue' type-id='type-id-330' size-in-bits='64' id='type-id-584'/>
    <pointer-type-def type-id='type-id-330' size-in-bits='64' id='type-id-585'/>
    <pointer-type-def type-id='type-id-586' size-in-bits='64' id='type-id-587'/>
    <pointer-type-def type-id='type-id-588' size-in-bits='64' id='type-id-589'/>
    <reference-type-def kind='lvalue' type-id='type-id-334' size-in-bits='64' id='type-id-590'/>
    <reference-type-def kind='lvalue' type-id='type-id-591' size-in-bits='64' id='type-id-592'/>
    <reference-type-def kind='lvalue' type-id='type-id-337' size-in-bits='64' id='type-id-593'/>
    <reference-type-def kind='rvalue' type-id='type-id-337' size-in-bits='64' id='type-id-594'/>
    <pointer-type-def type-id='type-id-337' size-in-bits='64' id='type-id-595'/>
    <pointer-type-def type-id='type-id-596' size-in-bits='64' id='type-id-597'/>
    <pointer-type-def type-id='type-id-598' size-in-bits='64' id='type-id-599'/>
    <reference-type-def kind='lvalue' type-id='type-id-342' size-in-bits='64' id='type-id-600'/>
    <reference-type-def kind='lvalue' type-id='type-id-347' size-in-bits='64' id='type-id-601'/>
    <reference-type-def kind='lvalue' type-id='type-id-349' size-in-bits='64' id='type-id-602'/>
    <reference-type-def kind='rvalue' type-id='type-id-349' size-in-bits='64' id='type-id-603'/>
    <pointer-type-def type-id='type-id-349' size-in-bits='64' id='type-id-604'/>
    <reference-type-def kind='lvalue' type-id='type-id-353' size-in-bits='64' id='type-id-605'/>
    <reference-type-def kind='rvalue' type-id='type-id-353' size-in-bits='64' id='type-id-606'/>
    <pointer-type-def type-id='type-id-353' size-in-bits='64' id='type-id-607'/>
    <reference-type-def kind='lvalue' type-id='type-id-356' size-in-bits='64' id='type-id-608'/>
    <reference-type-def kind='rvalue' type-id='type-id-356' size-in-bits='64' id='type-id-609'/>
    <pointer-type-def type-id='type-id-356' size-in-bits='64' id='type-id-610'/>
    <reference-type-def kind='lvalue' type-id='type-id-359' size-in-bits='64' id='type-id-611'/>
    <reference-type-def kind='lvalue' type-id='type-id-362' size-in-bits='64' id='type-id-612'/>
    <reference-type-def kind='lvalue' type-id='type-id-365' size-in-bits='64' id='type-id-613'/>
    <pointer-type-def type-id='type-id-365' size-in-bits='64' id='type-id-614'/>
    <reference-type-def kind='lvalue' type-id='type-id-373' size-in-bits='64' id='type-id-615'/>
    <pointer-type-def type-id='type-id-373' size-in-bits='64' id='type-id-616'/>
    <pointer-type-def type-id='type-id-381' size-in-bits='64' id='type-id-617'/>
    <pointer-type-def type-id='type-id-384' size-in-bits='64' id='type-id-618'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-619'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-620'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-621'/>
    <pointer-type-def type-id='type-id-622' size-in-bits='64' id='type-id-623'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-54'/>
    <reference-type-def kind='lvalue' type-id='type-id-65' size-in-bits='64' id='type-id-624'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-625'/>
    <qualified-type-def type-id='type-id-625' const='yes' id='type-id-626'/>
    <reference-type-def kind='lvalue' type-id='type-id-626' size-in-bits='64' id='type-id-627'/>
    <pointer-type-def type-id='type-id-625' size-in-bits='64' id='type-id-628'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-629'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-630'/>
    <reference-type-def kind='lvalue' type-id='type-id-111' size-in-bits='64' id='type-id-631'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-632'/>
    <reference-type-def kind='lvalue' type-id='type-id-239' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-239' size-in-bits='64' id='type-id-38'/>
    <qualified-type-def type-id='type-id-38' const='yes' id='type-id-633'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-634'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-635'/>
    <reference-type-def kind='lvalue' type-id='type-id-81' size-in-bits='64' id='type-id-636'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-637'/>
    <reference-type-def kind='lvalue' type-id='type-id-83' size-in-bits='64' id='type-id-638'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-639'/>
    <reference-type-def kind='lvalue' type-id='type-id-141' size-in-bits='64' id='type-id-640'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-151'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-641'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-148'/>
    <reference-type-def kind='lvalue' type-id='type-id-145' size-in-bits='64' id='type-id-642'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-643'/>
    <qualified-type-def type-id='type-id-643' const='yes' id='type-id-644'/>
    <pointer-type-def type-id='type-id-434' size-in-bits='64' id='type-id-645'/>
    <qualified-type-def type-id='type-id-645' const='yes' id='type-id-646'/>
    <reference-type-def kind='lvalue' type-id='type-id-209' size-in-bits='64' id='type-id-212'/>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-647'/>
    <qualified-type-def type-id='type-id-647' const='yes' id='type-id-210'/>
    <reference-type-def kind='lvalue' type-id='type-id-211' size-in-bits='64' id='type-id-648'/>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' id='type-id-649'/>
    <qualified-type-def type-id='type-id-649' const='yes' id='type-id-650'/>
    <reference-type-def kind='lvalue' type-id='type-id-651' size-in-bits='64' id='type-id-13'/>
    <pointer-type-def type-id='type-id-651' size-in-bits='64' id='type-id-652'/>
    <qualified-type-def type-id='type-id-652' const='yes' id='type-id-653'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-654'/>
    <reference-type-def kind='lvalue' type-id='type-id-441' size-in-bits='64' id='type-id-119'/>
    <pointer-type-def type-id='type-id-441' size-in-bits='64' id='type-id-655'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-656'/>
    <pointer-type-def type-id='type-id-657' size-in-bits='64' id='type-id-117'/>
    <reference-type-def kind='lvalue' type-id='type-id-198' size-in-bits='64' id='type-id-658'/>
    <pointer-type-def type-id='type-id-198' size-in-bits='64' id='type-id-659'/>
    <reference-type-def kind='lvalue' type-id='type-id-125' size-in-bits='64' id='type-id-660'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-661'/>
    <pointer-type-def type-id='type-id-662' size-in-bits='64' id='type-id-149'/>
    <pointer-type-def type-id='type-id-454' size-in-bits='64' id='type-id-663'/>
    <reference-type-def kind='lvalue' type-id='type-id-664' size-in-bits='64' id='type-id-665'/>
    <reference-type-def kind='lvalue' type-id='type-id-206' size-in-bits='64' id='type-id-666'/>
    <pointer-type-def type-id='type-id-206' size-in-bits='64' id='type-id-667'/>
    <pointer-type-def type-id='type-id-668' size-in-bits='64' id='type-id-207'/>
    <pointer-type-def type-id='type-id-464' size-in-bits='64' id='type-id-669'/>
    <pointer-type-def type-id='type-id-670' size-in-bits='64' id='type-id-139'/>
    <qualified-type-def type-id='type-id-669' const='yes' id='type-id-671'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-118'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-672'/>
    <reference-type-def kind='lvalue' type-id='type-id-673' size-in-bits='64' id='type-id-674'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-675'/>
    <qualified-type-def type-id='type-id-675' const='yes' id='type-id-676'/>
    <reference-type-def kind='lvalue' type-id='type-id-124' size-in-bits='64' id='type-id-677'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-35'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-678'/>
    <reference-type-def kind='lvalue' type-id='type-id-123' size-in-bits='64' id='type-id-679'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-680'/>
    <reference-type-def kind='lvalue' type-id='type-id-36' size-in-bits='64' id='type-id-681'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-682'/>
    <reference-type-def kind='lvalue' type-id='type-id-126' size-in-bits='64' id='type-id-683'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-128'/>
    <qualified-type-def type-id='type-id-128' const='yes' id='type-id-684'/>
    <pointer-type-def type-id='type-id-483' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-685' size-in-bits='64' id='type-id-686'/>
    <pointer-type-def type-id='type-id-486' size-in-bits='64' id='type-id-25'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-26'/>
    <reference-type-def kind='lvalue' type-id='type-id-132' size-in-bits='64' id='type-id-135'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-687'/>
    <qualified-type-def type-id='type-id-687' const='yes' id='type-id-134'/>
    <pointer-type-def type-id='type-id-491' size-in-bits='64' id='type-id-137'/>
    <reference-type-def kind='lvalue' type-id='type-id-113' size-in-bits='64' id='type-id-688'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-229'/>
    <qualified-type-def type-id='type-id-229' const='yes' id='type-id-689'/>
    <reference-type-def kind='lvalue' type-id='type-id-689' size-in-bits='64' id='type-id-690'/>
    <reference-type-def kind='lvalue' type-id='type-id-229' size-in-bits='64' id='type-id-691'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-692'/>
    <pointer-type-def type-id='type-id-497' size-in-bits='64' id='type-id-24'/>
    <reference-type-def kind='lvalue' type-id='type-id-70' size-in-bits='64' id='type-id-693'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-694'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-695'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-74'/>
    <reference-type-def kind='lvalue' type-id='type-id-75' size-in-bits='64' id='type-id-696'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-697'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-698'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-78'/>
    <reference-type-def kind='lvalue' type-id='type-id-33' size-in-bits='64' id='type-id-699'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-700'/>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-701'/>
    <reference-type-def kind='lvalue' type-id='type-id-155' size-in-bits='64' id='type-id-702'/>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-703'/>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' id='type-id-704'/>
    <pointer-type-def type-id='type-id-156' size-in-bits='64' id='type-id-705'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-706'/>
    <reference-type-def kind='lvalue' type-id='type-id-171' size-in-bits='64' id='type-id-707'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-708'/>
    <reference-type-def kind='lvalue' type-id='type-id-164' size-in-bits='64' id='type-id-709'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-710'/>
    <reference-type-def kind='lvalue' type-id='type-id-177' size-in-bits='64' id='type-id-711'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-712'/>
    <reference-type-def kind='lvalue' type-id='type-id-181' size-in-bits='64' id='type-id-713'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-714'/>
    <pointer-type-def type-id='type-id-214' size-in-bits='64' id='type-id-218'/>
    <reference-type-def kind='lvalue' type-id='type-id-217' size-in-bits='64' id='type-id-215'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-219'/>
    <reference-type-def kind='lvalue' type-id='type-id-213' size-in-bits='64' id='type-id-715'/>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-216'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-716'/>
    <qualified-type-def type-id='type-id-716' const='yes' id='type-id-717'/>
    <reference-type-def kind='lvalue' type-id='type-id-174' size-in-bits='64' id='type-id-718'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-719'/>
    <qualified-type-def type-id='type-id-719' const='yes' id='type-id-720'/>
    <reference-type-def kind='lvalue' type-id='type-id-168' size-in-bits='64' id='type-id-721'/>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-722'/>
    <reference-type-def kind='lvalue' type-id='type-id-106' size-in-bits='64' id='type-id-723'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-724'/>
    <reference-type-def kind='lvalue' type-id='type-id-228' size-in-bits='64' id='type-id-725'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-231'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-726'/>
    <pointer-type-def type-id='type-id-727' size-in-bits='64' id='type-id-14'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-728'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-729'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-730'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-731'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-271'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-272'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-273'/>
    <class-decl name='wxBitmap' visibility='default' is-declaration-only='yes' id='type-id-239'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD0Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD0Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD0Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD0Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD0Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD0Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD0Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD0Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD1Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD1Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD1Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD1Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD1Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD1Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD1Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD1Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD1Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD1Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD4Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK8wxBitmap12GetClassInfoEv' filepath='include/wx/gtk/bitmap.h' line='186' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-409' is-artificial='yes'/>
          <return type-id='type-id-151'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='6'>
        <function-decl name='CreateGDIRefData' mangled-name='_ZNK8wxBitmap16CreateGDIRefDataEv' filepath='include/wx/gtk/bitmap.h' line='158' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-409' is-artificial='yes'/>
          <return type-id='type-id-661'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='7'>
        <function-decl name='CloneGDIRefData' mangled-name='_ZNK8wxBitmap15CloneGDIRefDataEPK12wxGDIRefData' filepath='include/wx/gtk/bitmap.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-409' is-artificial='yes'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-661'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='Create' mangled-name='_ZN8wxBitmap6CreateEiii' filepath='include/wx/gtk/bitmap.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='Create' mangled-name='_ZN8wxBitmap6CreateERK6wxSizei' filepath='include/wx/gtk/bitmap.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-518'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='10'>
        <function-decl name='GetHeight' mangled-name='_ZNK8wxBitmap9GetHeightEv' filepath='include/wx/gtk/bitmap.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-409' is-artificial='yes'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='11'>
        <function-decl name='GetWidth' mangled-name='_ZNK8wxBitmap8GetWidthEv' filepath='include/wx/gtk/bitmap.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-409' is-artificial='yes'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='12'>
        <function-decl name='GetDepth' mangled-name='_ZNK8wxBitmap8GetDepthEv' filepath='include/wx/gtk/bitmap.h' line='98' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-409' is-artificial='yes'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <function-decl name='SetScaleFactor' mangled-name='_ZN8wxBitmap14SetScaleFactorEd' filepath='include/wx/gtk/bitmap.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-22'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='14'>
        <function-decl name='GetScaleFactor' mangled-name='_ZNK8wxBitmap14GetScaleFactorEv' filepath='include/wx/gtk/bitmap.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-409' is-artificial='yes'/>
          <return type-id='type-id-22'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='15'>
        <function-decl name='ConvertToImage' mangled-name='_ZNK8wxBitmap14ConvertToImageEv' filepath='include/wx/gtk/bitmap.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-409' is-artificial='yes'/>
          <return type-id='type-id-454'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='16'>
        <function-decl name='GetMask' mangled-name='_ZNK8wxBitmap7GetMaskEv' filepath='include/wx/gtk/bitmap.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-409' is-artificial='yes'/>
          <return type-id='type-id-732'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <function-decl name='SetMask' mangled-name='_ZN8wxBitmap7SetMaskEP6wxMask' filepath='include/wx/gtk/bitmap.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-732'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='18'>
        <function-decl name='GetSubBitmap' mangled-name='_ZNK8wxBitmap12GetSubBitmapERK6wxRect' filepath='include/wx/gtk/bitmap.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-409' is-artificial='yes'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-239'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='19'>
        <function-decl name='SaveFile' mangled-name='_ZNK8wxBitmap8SaveFileERK8wxString12wxBitmapTypePK9wxPalette' filepath='include/wx/gtk/bitmap.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-409' is-artificial='yes'/>
          <parameter type-id='type-id-29'/>
          <parameter type-id='type-id-122'/>
          <parameter type-id='type-id-733'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='LoadFile' mangled-name='_ZN8wxBitmap8LoadFileERK8wxString12wxBitmapType' filepath='include/wx/gtk/bitmap.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-29'/>
          <parameter type-id='type-id-122'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='21'>
        <function-decl name='GetPalette' mangled-name='_ZNK8wxBitmap10GetPaletteEv' filepath='include/wx/gtk/bitmap.h' line='114' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-409' is-artificial='yes'/>
          <return type-id='type-id-734'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <function-decl name='SetPalette' mangled-name='_ZN8wxBitmap10SetPaletteERK9wxPalette' filepath='include/wx/gtk/bitmap.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-735'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='23'>
        <function-decl name='HasAlpha' mangled-name='_ZNK8wxBitmap8HasAlphaEv' filepath='include/wx/gtk/bitmap.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-409' is-artificial='yes'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='25'>
        <function-decl name='SetHeight' mangled-name='_ZN8wxBitmap9SetHeightEi' filepath='include/wx/gtk/bitmap.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='26'>
        <function-decl name='SetWidth' mangled-name='_ZN8wxBitmap8SetWidthEi' filepath='include/wx/gtk/bitmap.h' line='126' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='27'>
        <function-decl name='SetDepth' mangled-name='_ZN8wxBitmap8SetDepthEi' filepath='include/wx/gtk/bitmap.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='29'>
        <function-decl name='DoCreate' mangled-name='_ZN8wxBitmap8DoCreateERK6wxSizedi' filepath='include/wx/gtk/bitmap.h' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-518'/>
          <parameter type-id='type-id-22'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxColour' visibility='default' is-declaration-only='yes' id='type-id-9'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD0Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-643' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD0Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-643' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD0Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-643' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD1Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-643' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD1Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-643' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD1Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-643' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD4Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-643' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK8wxColour12GetClassInfoEv' filepath='include/wx/gtk/colour.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-151'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='8'>
        <function-decl name='Red' mangled-name='_ZNK8wxColour3RedEv' filepath='include/wx/gtk/colour.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-62'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='9'>
        <function-decl name='Green' mangled-name='_ZNK8wxColour5GreenEv' filepath='include/wx/gtk/colour.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-62'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='10'>
        <function-decl name='Blue' mangled-name='_ZNK8wxColour4BlueEv' filepath='include/wx/gtk/colour.h' line='38' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-62'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='11'>
        <function-decl name='Alpha' mangled-name='_ZNK8wxColour5AlphaEv' filepath='include/wx/gtk/colour.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1' is-artificial='yes'/>
          <return type-id='type-id-62'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='14'>
        <function-decl name='InitRGBA' mangled-name='_ZN8wxColour8InitRGBAEhhhh' filepath='include/wx/gtk/colour.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-643' is-artificial='yes'/>
          <parameter type-id='type-id-62'/>
          <parameter type-id='type-id-62'/>
          <parameter type-id='type-id-62'/>
          <parameter type-id='type-id-62'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='15'>
        <function-decl name='FromString' mangled-name='_ZN8wxColour10FromStringERK8wxString' filepath='include/wx/gtk/colour.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-643' is-artificial='yes'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxColourBase' visibility='default' is-declaration-only='yes' id='type-id-434'>
      <member-type access='public'>
        <typedef-decl name='ChannelType' type-id='type-id-62' filepath='include/wx/colour.h' line='89' column='1' id='type-id-736'/>
      </member-type>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColourBase' mangled-name='_ZN12wxColourBaseD0Ev' filepath='include/wx/colour.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-645' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColourBase' mangled-name='_ZN12wxColourBaseD0Ev' filepath='include/wx/colour.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-645' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColourBase' mangled-name='_ZN12wxColourBaseD0Ev' filepath='include/wx/colour.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-645' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColourBase' mangled-name='_ZN12wxColourBaseD2Ev' filepath='include/wx/colour.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-645' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColourBase' mangled-name='_ZN12wxColourBaseD2Ev' filepath='include/wx/colour.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-645' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColourBase' mangled-name='_ZN12wxColourBaseD2Ev' filepath='include/wx/colour.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-645' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColourBase' mangled-name='_ZN12wxColourBaseD4Ev' filepath='include/wx/colour.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-645' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='6'>
        <function-decl name='CreateGDIRefData' mangled-name='_ZNK12wxColourBase16CreateGDIRefDataEv' filepath='include/wx/colour.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-436' is-artificial='yes'/>
          <return type-id='type-id-661'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='7'>
        <function-decl name='CloneGDIRefData' mangled-name='_ZNK12wxColourBase15CloneGDIRefDataEPK12wxGDIRefData' filepath='include/wx/colour.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-436' is-artificial='yes'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-661'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='11'>
        <function-decl name='Alpha' mangled-name='_ZNK12wxColourBase5AlphaEv' filepath='include/wx/colour.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-436' is-artificial='yes'/>
          <return type-id='type-id-736'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='12'>
        <function-decl name='IsSolid' mangled-name='_ZNK12wxColourBase7IsSolidEv' filepath='include/wx/colour.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-436' is-artificial='yes'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='13'>
        <function-decl name='GetAsString' mangled-name='_ZNK12wxColourBase11GetAsStringEl' filepath='include/wx/colour.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-436' is-artificial='yes'/>
          <parameter type-id='type-id-23'/>
          <return type-id='type-id-155'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='15'>
        <function-decl name='FromString' mangled-name='_ZN12wxColourBase10FromStringERK8wxString' filepath='include/wx/colour.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-645' is-artificial='yes'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxDC' visibility='default' is-declaration-only='yes' id='type-id-651'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxDC' mangled-name='_ZN4wxDCD0Ev' filepath='include/wx/dc.h' line='801' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-652' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxDC' mangled-name='_ZN4wxDCD0Ev' filepath='include/wx/dc.h' line='801' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-652' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxDC' mangled-name='_ZN4wxDCD0Ev' filepath='include/wx/dc.h' line='801' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-652' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxDC' mangled-name='_ZN4wxDCD0Ev' filepath='include/wx/dc.h' line='801' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-652' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxDC' mangled-name='_ZN4wxDCD0Ev' filepath='include/wx/dc.h' line='801' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-652' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxDC' mangled-name='_ZN4wxDCD0Ev' filepath='include/wx/dc.h' line='801' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-652' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxDC' mangled-name='_ZN4wxDCD0Ev' filepath='include/wx/dc.h' line='801' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-652' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxDC' mangled-name='_ZN4wxDCD2Ev' filepath='include/wx/dc.h' line='801' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-652' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxDC' mangled-name='_ZN4wxDCD2Ev' filepath='include/wx/dc.h' line='801' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-652' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxDC' mangled-name='_ZN4wxDCD2Ev' filepath='include/wx/dc.h' line='801' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-652' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxDC' mangled-name='_ZN4wxDCD2Ev' filepath='include/wx/dc.h' line='801' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-652' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxDC' mangled-name='_ZN4wxDCD2Ev' filepath='include/wx/dc.h' line='801' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-652' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxDC' mangled-name='_ZN4wxDCD2Ev' filepath='include/wx/dc.h' line='801' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-652' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxDC' mangled-name='_ZN4wxDCD2Ev' filepath='include/wx/dc.h' line='801' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-652' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxDC' mangled-name='_ZN4wxDCD4Ev' filepath='include/wx/dc.h' line='801' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-652' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK4wxDC12GetClassInfoEv' filepath='include/wx/dc.h' line='1443' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-737' is-artificial='yes'/>
          <return type-id='type-id-151'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetResolution' mangled-name='_ZNK4wxDC13GetResolutionEv' filepath='include/wx/dc.h' line='845' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-737' is-artificial='yes'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='6'>
        <function-decl name='GetGraphicsContext' mangled-name='_ZNK4wxDC18GetGraphicsContextEv' filepath='include/wx/dc.h' line='1423' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-737' is-artificial='yes'/>
          <return type-id='type-id-738'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='SetGraphicsContext' mangled-name='_ZN4wxDC18SetGraphicsContextEP17wxGraphicsContext' filepath='include/wx/dc.h' line='1427' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-652' is-artificial='yes'/>
          <parameter type-id='type-id-738'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEvent' visibility='default' is-declaration-only='yes' id='type-id-441'>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK7wxEvent12GetClassInfoEv' filepath='include/wx/event.h' line='1140' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-739' is-artificial='yes'/>
          <return type-id='type-id-151'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='6'>
        <function-decl name='GetEventCategory' mangled-name='_ZNK7wxEvent16GetEventCategoryEv' filepath='include/wx/event.h' line='1010' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-739' is-artificial='yes'/>
          <return type-id='type-id-740'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEventFunctor' visibility='default' is-declaration-only='yes' id='type-id-116'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD4Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK14wxEventFunctor13GetEvtHandlerEv' filepath='include/wx/event.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-741' is-artificial='yes'/>
          <return type-id='type-id-117'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK14wxEventFunctor12GetEvtMethodEv' filepath='include/wx/event.h' line='250' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-741' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEvtHandler' visibility='default' is-declaration-only='yes' id='type-id-657'>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='ProcessEvent' mangled-name='_ZN12wxEvtHandler12ProcessEventER7wxEvent' filepath='include/wx/event.h' line='3677' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-119'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='QueueEvent' mangled-name='_ZN12wxEvtHandler10QueueEventEP7wxEvent' filepath='include/wx/event.h' line='3705' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-655'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='AddPendingEvent' mangled-name='_ZN12wxEvtHandler15AddPendingEventERK7wxEvent' filepath='include/wx/event.h' line='3709' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-443'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='SearchEventTable' mangled-name='_ZN12wxEvtHandler16SearchEventTableER12wxEventTableR7wxEvent' filepath='include/wx/event.h' line='3964' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-742'/>
          <parameter type-id='type-id-119'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='13'>
        <function-decl name='OnDynamicBind' mangled-name='_ZN12wxEvtHandler13OnDynamicBindER24wxDynamicEventTableEntry' filepath='include/wx/event.h' line='4029' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-743'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='16'>
        <function-decl name='DoSetClientObject' mangled-name='_ZN12wxEvtHandler17DoSetClientObjectEP12wxClientData' filepath='include/wx/event.h' line='4073' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-744'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='17'>
        <function-decl name='DoGetClientObject' mangled-name='_ZNK12wxEvtHandler17DoGetClientObjectEv' filepath='include/wx/event.h' line='4074' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-745' is-artificial='yes'/>
          <return type-id='type-id-744'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='18'>
        <function-decl name='DoSetClientData' mangled-name='_ZN12wxEvtHandler15DoSetClientDataEPv' filepath='include/wx/event.h' line='4076' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-54'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='19'>
        <function-decl name='DoGetClientData' mangled-name='_ZNK12wxEvtHandler15DoGetClientDataEv' filepath='include/wx/event.h' line='4077' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-745' is-artificial='yes'/>
          <return type-id='type-id-54'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='20'>
        <function-decl name='WXReservedEvtHandler1' mangled-name='_ZN12wxEvtHandler21WXReservedEvtHandler1EPv' filepath='include/wx/event.h' line='4083' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-54'/>
          <return type-id='type-id-54'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='21'>
        <function-decl name='WXReservedEvtHandler2' mangled-name='_ZN12wxEvtHandler21WXReservedEvtHandler2EPv' filepath='include/wx/event.h' line='4084' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-54'/>
          <return type-id='type-id-54'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxFont' visibility='default' is-declaration-only='yes' id='type-id-12'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFont' mangled-name='_ZN6wxFontD0Ev' filepath='include/wx/gtk/font.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-746' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFont' mangled-name='_ZN6wxFontD0Ev' filepath='include/wx/gtk/font.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-746' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFont' mangled-name='_ZN6wxFontD1Ev' filepath='include/wx/gtk/font.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-746' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFont' mangled-name='_ZN6wxFontD1Ev' filepath='include/wx/gtk/font.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-746' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFont' mangled-name='_ZN6wxFontD4Ev' filepath='include/wx/gtk/font.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-746' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK6wxFont12GetClassInfoEv' filepath='include/wx/gtk/font.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-747' is-artificial='yes'/>
          <return type-id='type-id-151'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='6'>
        <function-decl name='CreateGDIRefData' mangled-name='_ZNK6wxFont16CreateGDIRefDataEv' filepath='include/wx/gtk/font.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-747' is-artificial='yes'/>
          <return type-id='type-id-661'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='7'>
        <function-decl name='CloneGDIRefData' mangled-name='_ZNK6wxFont15CloneGDIRefDataEPK12wxGDIRefData' filepath='include/wx/gtk/font.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-747' is-artificial='yes'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-661'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='9'>
        <function-decl name='GetFractionalPointSize' mangled-name='_ZNK6wxFont22GetFractionalPointSizeEv' filepath='include/wx/gtk/font.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-747' is-artificial='yes'/>
          <return type-id='type-id-22'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='12'>
        <function-decl name='GetStyle' mangled-name='_ZNK6wxFont8GetStyleEv' filepath='include/wx/gtk/font.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-747' is-artificial='yes'/>
          <return type-id='type-id-748'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='13'>
        <function-decl name='GetNumericWeight' mangled-name='_ZNK6wxFont16GetNumericWeightEv' filepath='include/wx/gtk/font.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-747' is-artificial='yes'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='14'>
        <function-decl name='GetUnderlined' mangled-name='_ZNK6wxFont13GetUnderlinedEv' filepath='include/wx/gtk/font.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-747' is-artificial='yes'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='15'>
        <function-decl name='GetStrikethrough' mangled-name='_ZNK6wxFont16GetStrikethroughEv' filepath='include/wx/gtk/font.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-747' is-artificial='yes'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='16'>
        <function-decl name='GetFaceName' mangled-name='_ZNK6wxFont11GetFaceNameEv' filepath='include/wx/gtk/font.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-747' is-artificial='yes'/>
          <return type-id='type-id-155'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='17'>
        <function-decl name='GetEncoding' mangled-name='_ZNK6wxFont11GetEncodingEv' filepath='include/wx/gtk/font.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-747' is-artificial='yes'/>
          <return type-id='type-id-749'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='18'>
        <function-decl name='GetNativeFontInfo' mangled-name='_ZNK6wxFont17GetNativeFontInfoEv' filepath='include/wx/gtk/font.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-747' is-artificial='yes'/>
          <return type-id='type-id-750'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='20'>
        <function-decl name='IsFixedWidth' mangled-name='_ZNK6wxFont12IsFixedWidthEv' filepath='include/wx/gtk/font.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-747' is-artificial='yes'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <function-decl name='SetFractionalPointSize' mangled-name='_ZN6wxFont22SetFractionalPointSizeEd' filepath='include/wx/gtk/font.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-746' is-artificial='yes'/>
          <parameter type-id='type-id-22'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='24'>
        <function-decl name='SetFamily' mangled-name='_ZN6wxFont9SetFamilyE12wxFontFamily' filepath='include/wx/gtk/font.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-746' is-artificial='yes'/>
          <parameter type-id='type-id-751'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='25'>
        <function-decl name='SetStyle' mangled-name='_ZN6wxFont8SetStyleE11wxFontStyle' filepath='include/wx/gtk/font.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-746' is-artificial='yes'/>
          <parameter type-id='type-id-748'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='26'>
        <function-decl name='SetNumericWeight' mangled-name='_ZN6wxFont16SetNumericWeightEi' filepath='include/wx/gtk/font.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-746' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='27'>
        <function-decl name='SetUnderlined' mangled-name='_ZN6wxFont13SetUnderlinedEb' filepath='include/wx/gtk/font.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-746' is-artificial='yes'/>
          <parameter type-id='type-id-41'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='28'>
        <function-decl name='SetStrikethrough' mangled-name='_ZN6wxFont16SetStrikethroughEb' filepath='include/wx/gtk/font.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-746' is-artificial='yes'/>
          <parameter type-id='type-id-41'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='29'>
        <function-decl name='SetEncoding' mangled-name='_ZN6wxFont11SetEncodingE14wxFontEncoding' filepath='include/wx/gtk/font.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-746' is-artificial='yes'/>
          <parameter type-id='type-id-749'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='30'>
        <function-decl name='SetFaceName' mangled-name='_ZN6wxFont11SetFaceNameERK8wxString' filepath='include/wx/gtk/font.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-746' is-artificial='yes'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='32'>
        <function-decl name='DoSetNativeFontInfo' mangled-name='_ZN6wxFont19DoSetNativeFontInfoERK16wxNativeFontInfo' filepath='include/wx/gtk/font.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-746' is-artificial='yes'/>
          <parameter type-id='type-id-752'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='33'>
        <function-decl name='DoGetFamily' mangled-name='_ZNK6wxFont11DoGetFamilyEv' filepath='include/wx/gtk/font.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-747' is-artificial='yes'/>
          <return type-id='type-id-751'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxGDIObject' visibility='default' is-declaration-only='yes' id='type-id-449'>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK11wxGDIObject12GetClassInfoEv' filepath='include/wx/gdiobj.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-451' is-artificial='yes'/>
          <return type-id='type-id-151'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='3'>
        <function-decl name='CreateRefData' mangled-name='_ZNK11wxGDIObject13CreateRefDataEv' filepath='include/wx/gdiobj.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-451' is-artificial='yes'/>
          <return type-id='type-id-672'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='4'>
        <function-decl name='CloneRefData' mangled-name='_ZNK11wxGDIObject12CloneRefDataEPK12wxRefCounter' filepath='include/wx/gdiobj.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-451' is-artificial='yes'/>
          <parameter type-id='type-id-470'/>
          <return type-id='type-id-672'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='IsOk' mangled-name='_ZNK11wxGDIObject4IsOkEv' filepath='include/wx/gdiobj.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-451' is-artificial='yes'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxHashTable' visibility='default' is-declaration-only='yes' id='type-id-662'/>
    <class-decl name='wxHashTable_Node' visibility='default' is-declaration-only='yes' id='type-id-144'/>
    <class-decl name='wxImage' visibility='default' is-declaration-only='yes' id='type-id-454'>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK7wxImage12GetClassInfoEv' filepath='include/wx/image.h' line='710' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-457' is-artificial='yes'/>
          <return type-id='type-id-151'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='3'>
        <function-decl name='CreateRefData' mangled-name='_ZNK7wxImage13CreateRefDataEv' filepath='include/wx/image.h' line='672' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-457' is-artificial='yes'/>
          <return type-id='type-id-672'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='4'>
        <function-decl name='CloneRefData' mangled-name='_ZNK7wxImage12CloneRefDataEPK12wxRefCounter' filepath='include/wx/image.h' line='673' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-457' is-artificial='yes'/>
          <parameter type-id='type-id-470'/>
          <return type-id='type-id-672'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='LoadFile' mangled-name='_ZN7wxImage8LoadFileERK8wxString12wxBitmapTypei' filepath='include/wx/image.h' line='474' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-663' is-artificial='yes'/>
          <parameter type-id='type-id-29'/>
          <parameter type-id='type-id-122'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='LoadFile' mangled-name='_ZN7wxImage8LoadFileERK8wxStringS2_i' filepath='include/wx/image.h' line='475' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-663' is-artificial='yes'/>
          <parameter type-id='type-id-29'/>
          <parameter type-id='type-id-29'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='LoadFile' mangled-name='_ZN7wxImage8LoadFileER13wxInputStream12wxBitmapTypei' filepath='include/wx/image.h' line='480' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-663' is-artificial='yes'/>
          <parameter type-id='type-id-665'/>
          <parameter type-id='type-id-122'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='LoadFile' mangled-name='_ZN7wxImage8LoadFileER13wxInputStreamRK8wxStringi' filepath='include/wx/image.h' line='481' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-663' is-artificial='yes'/>
          <parameter type-id='type-id-665'/>
          <parameter type-id='type-id-29'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='9'>
        <function-decl name='SaveFile' mangled-name='_ZNK7wxImage8SaveFileERK8wxString' filepath='include/wx/image.h' line='484' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-457' is-artificial='yes'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='10'>
        <function-decl name='SaveFile' mangled-name='_ZNK7wxImage8SaveFileERK8wxString12wxBitmapType' filepath='include/wx/image.h' line='485' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-457' is-artificial='yes'/>
          <parameter type-id='type-id-29'/>
          <parameter type-id='type-id-122'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='11'>
        <function-decl name='SaveFile' mangled-name='_ZNK7wxImage8SaveFileERK8wxStringS2_' filepath='include/wx/image.h' line='486' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-457' is-artificial='yes'/>
          <parameter type-id='type-id-29'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='12'>
        <function-decl name='SaveFile' mangled-name='_ZNK7wxImage8SaveFileER14wxOutputStream12wxBitmapType' filepath='include/wx/image.h' line='489' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-457' is-artificial='yes'/>
          <parameter type-id='type-id-674'/>
          <parameter type-id='type-id-122'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='13'>
        <function-decl name='SaveFile' mangled-name='_ZNK7wxImage8SaveFileER14wxOutputStreamRK8wxString' filepath='include/wx/image.h' line='490' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-457' is-artificial='yes'/>
          <parameter type-id='type-id-674'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxInputStream' visibility='default' is-declaration-only='yes' id='type-id-664'/>
    <class-decl name='wxMBConv' visibility='default' is-declaration-only='yes' id='type-id-458'/>
    <class-decl name='wxMutexInternal' visibility='default' is-declaration-only='yes' id='type-id-668'/>
    <class-decl name='wxObject' visibility='default' is-declaration-only='yes' id='type-id-464'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-669' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-669' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-669' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-669' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-669' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-669' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-669' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-669' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-669' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-669' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-669' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-669' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-669' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-669' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-669' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-669' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-669' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-669' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-669' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-669' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD4Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-669' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK8wxObject12GetClassInfoEv' filepath='include/wx/object.h' line='446' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-467' is-artificial='yes'/>
          <return type-id='type-id-151'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='3'>
        <function-decl name='CreateRefData' mangled-name='_ZNK8wxObject13CreateRefDataEv' filepath='include/wx/object.h' line='464' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-467' is-artificial='yes'/>
          <return type-id='type-id-672'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='4'>
        <function-decl name='CloneRefData' mangled-name='_ZNK8wxObject12CloneRefDataEPK12wxRefCounter' filepath='include/wx/object.h' line='467' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-467' is-artificial='yes'/>
          <parameter type-id='type-id-470'/>
          <return type-id='type-id-672'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxOutputStream' visibility='default' is-declaration-only='yes' id='type-id-673'/>
    <class-decl name='wxPen' visibility='default' is-declaration-only='yes' id='type-id-11'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPen' mangled-name='_ZN5wxPenD0Ev' filepath='include/wx/gtk/pen.h' line='25' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPen' mangled-name='_ZN5wxPenD0Ev' filepath='include/wx/gtk/pen.h' line='25' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPen' mangled-name='_ZN5wxPenD1Ev' filepath='include/wx/gtk/pen.h' line='25' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPen' mangled-name='_ZN5wxPenD1Ev' filepath='include/wx/gtk/pen.h' line='25' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPen' mangled-name='_ZN5wxPenD1Ev' filepath='include/wx/gtk/pen.h' line='25' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPen' mangled-name='_ZN5wxPenD4Ev' filepath='include/wx/gtk/pen.h' line='25' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK5wxPen12GetClassInfoEv' filepath='include/wx/gtk/pen.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-753' is-artificial='yes'/>
          <return type-id='type-id-151'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='6'>
        <function-decl name='CreateGDIRefData' mangled-name='_ZNK5wxPen16CreateGDIRefDataEv' filepath='include/wx/gtk/pen.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-753' is-artificial='yes'/>
          <return type-id='type-id-661'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='7'>
        <function-decl name='CloneGDIRefData' mangled-name='_ZNK5wxPen15CloneGDIRefDataEPK12wxGDIRefData' filepath='include/wx/gtk/pen.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-753' is-artificial='yes'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-661'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='SetColour' mangled-name='_ZN5wxPen9SetColourERK8wxColour' filepath='include/wx/gtk/pen.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-20'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='SetColour' mangled-name='_ZN5wxPen9SetColourEhhh' filepath='include/wx/gtk/pen.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-62'/>
          <parameter type-id='type-id-62'/>
          <parameter type-id='type-id-62'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='SetWidth' mangled-name='_ZN5wxPen8SetWidthEi' filepath='include/wx/gtk/pen.h' line='35' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <function-decl name='SetStyle' mangled-name='_ZN5wxPen8SetStyleE10wxPenStyle' filepath='include/wx/gtk/pen.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-130'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <function-decl name='SetStipple' mangled-name='_ZN5wxPen10SetStippleERK8wxBitmap' filepath='include/wx/gtk/pen.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-30'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <function-decl name='SetDashes' mangled-name='_ZN5wxPen9SetDashesEiPKa' filepath='include/wx/gtk/pen.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-754'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <function-decl name='SetJoin' mangled-name='_ZN5wxPen7SetJoinE9wxPenJoin' filepath='include/wx/gtk/pen.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-755'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <function-decl name='SetCap' mangled-name='_ZN5wxPen6SetCapE8wxPenCap' filepath='include/wx/gtk/pen.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-756'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='17'>
        <function-decl name='GetColour' mangled-name='_ZNK5wxPen9GetColourEv' filepath='include/wx/gtk/pen.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-753' is-artificial='yes'/>
          <return type-id='type-id-9'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='18'>
        <function-decl name='GetStipple' mangled-name='_ZNK5wxPen10GetStippleEv' filepath='include/wx/gtk/pen.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-753' is-artificial='yes'/>
          <return type-id='type-id-38'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='19'>
        <function-decl name='GetStyle' mangled-name='_ZNK5wxPen8GetStyleEv' filepath='include/wx/gtk/pen.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-753' is-artificial='yes'/>
          <return type-id='type-id-130'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='20'>
        <function-decl name='GetJoin' mangled-name='_ZNK5wxPen7GetJoinEv' filepath='include/wx/gtk/pen.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-753' is-artificial='yes'/>
          <return type-id='type-id-755'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='21'>
        <function-decl name='GetCap' mangled-name='_ZNK5wxPen6GetCapEv' filepath='include/wx/gtk/pen.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-753' is-artificial='yes'/>
          <return type-id='type-id-756'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='23'>
        <function-decl name='GetWidth' mangled-name='_ZNK5wxPen8GetWidthEv' filepath='include/wx/gtk/pen.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-753' is-artificial='yes'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='24'>
        <function-decl name='GetDashes' mangled-name='_ZNK5wxPen9GetDashesEPPa' filepath='include/wx/gtk/pen.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-753' is-artificial='yes'/>
          <parameter type-id='type-id-757'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxThread' visibility='default' is-declaration-only='yes' id='type-id-214'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-218' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-218' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-218' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-218' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-218' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-218' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-218' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-218' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-218' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-218' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-218' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD4Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-218' is-artificial='yes'/>
          <parameter type-id='type-id-17' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='0'>
        <function-decl name='TestDestroy' mangled-name='_ZN8wxThread11TestDestroyEv' filepath='include/wx/thread.h' line='593' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-218' is-artificial='yes'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='4'>
        <function-decl name='OnDelete' mangled-name='_ZN8wxThread8OnDeleteEv' filepath='include/wx/thread.h' line='622' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-218' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='5'>
        <function-decl name='OnKill' mangled-name='_ZN8wxThread6OnKillEv' filepath='include/wx/thread.h' line='626' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-218' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='6'>
        <function-decl name='OnExit' mangled-name='_ZN8wxThread6OnExitEv' filepath='include/wx/thread.h' line='631' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-218' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxWindow' visibility='default' is-declaration-only='yes' id='type-id-727'>
      <member-function access='public' vtable-offset='23'>
        <function-decl name='SetLabel' mangled-name='_ZN8wxWindow8SetLabelERK8wxString' filepath='include/wx/gtk/window.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='27'>
        <function-decl name='GetLayoutDirection' mangled-name='_ZNK8wxWindow18GetLayoutDirectionEv' filepath='include/wx/gtk/window.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <return type-id='type-id-759'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='28'>
        <function-decl name='SetLayoutDirection' mangled-name='_ZN8wxWindow18SetLayoutDirectionE17wxLayoutDirection' filepath='include/wx/gtk/window.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-759'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='29'>
        <function-decl name='AdjustForLayoutDirection' mangled-name='_ZNK8wxWindow24AdjustForLayoutDirectionEiii' filepath='include/wx/gtk/window.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <parameter type-id='type-id-222'/>
          <parameter type-id='type-id-222'/>
          <parameter type-id='type-id-222'/>
          <return type-id='type-id-222'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='31'>
        <function-decl name='Raise' mangled-name='_ZN8wxWindow5RaiseEv' filepath='include/wx/gtk/window.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='32'>
        <function-decl name='Lower' mangled-name='_ZN8wxWindow5LowerEv' filepath='include/wx/gtk/window.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='51'>
        <function-decl name='GetContentScaleFactor' mangled-name='_ZNK8wxWindow21GetContentScaleFactorEv' filepath='include/wx/gtk/window.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <return type-id='type-id-22'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='52'>
        <function-decl name='GetDPIScaleFactor' mangled-name='_ZNK8wxWindow17GetDPIScaleFactorEv' filepath='include/wx/gtk/window.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <return type-id='type-id-22'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='53'>
        <function-decl name='GetWindowBorderSize' mangled-name='_ZNK8wxWindow19GetWindowBorderSizeEv' filepath='include/wx/gtk/window.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <return type-id='type-id-33'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='58'>
        <function-decl name='Show' mangled-name='_ZN8wxWindow4ShowEb' filepath='include/wx/gtk/window.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-41'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='62'>
        <function-decl name='IsShown' mangled-name='_ZNK8wxWindow7IsShownEv' filepath='include/wx/gtk/window.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='67'>
        <function-decl name='IsRetained' mangled-name='_ZNK8wxWindow10IsRetainedEv' filepath='include/wx/gtk/window.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='71'>
        <function-decl name='SetFocus' mangled-name='_ZN8wxWindow8SetFocusEv' filepath='include/wx/gtk/window.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='78'>
        <function-decl name='SetCanFocus' mangled-name='_ZN8wxWindow11SetCanFocusEb' filepath='include/wx/gtk/window.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-41'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='81'>
        <function-decl name='Reparent' mangled-name='_ZN8wxWindow8ReparentEP12wxWindowBase' filepath='include/wx/gtk/window.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-760'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='82'>
        <function-decl name='AddChild' mangled-name='_ZN8wxWindow8AddChildEP12wxWindowBase' filepath='include/wx/gtk/window.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-760'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='83'>
        <function-decl name='RemoveChild' mangled-name='_ZN8wxWindow11RemoveChildEP12wxWindowBase' filepath='include/wx/gtk/window.h' line='120' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-760'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='94'>
        <function-decl name='WarpPointer' mangled-name='_ZN8wxWindow11WarpPointerEii' filepath='include/wx/gtk/window.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='96'>
        <function-decl name='EnableTouchEvents' mangled-name='_ZN8wxWindow17EnableTouchEventsEi' filepath='include/wx/gtk/window.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='97'>
        <function-decl name='Refresh' mangled-name='_ZN8wxWindow7RefreshEbPK6wxRect' filepath='include/wx/gtk/window.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-41'/>
          <parameter type-id='type-id-479'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='98'>
        <function-decl name='Update' mangled-name='_ZN8wxWindow6UpdateEv' filepath='include/wx/gtk/window.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='99'>
        <function-decl name='ClearBackground' mangled-name='_ZN8wxWindow15ClearBackgroundEv' filepath='include/wx/gtk/window.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='101'>
        <function-decl name='SetDoubleBuffered' mangled-name='_ZN8wxWindow17SetDoubleBufferedEb' filepath='include/wx/gtk/window.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-41'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='102'>
        <function-decl name='IsDoubleBuffered' mangled-name='_ZNK8wxWindow16IsDoubleBufferedEv' filepath='include/wx/gtk/window.h' line='132' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='103'>
        <function-decl name='DoIsExposed' mangled-name='_ZNK8wxWindow11DoIsExposedEii' filepath='include/wx/gtk/window.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='104'>
        <function-decl name='DoIsExposed' mangled-name='_ZNK8wxWindow11DoIsExposedEiiii' filepath='include/wx/gtk/window.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='106'>
        <function-decl name='SetBackgroundColour' mangled-name='_ZN8wxWindow19SetBackgroundColourERK8wxColour' filepath='include/wx/gtk/window.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-20'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='107'>
        <function-decl name='SetForegroundColour' mangled-name='_ZN8wxWindow19SetForegroundColourERK8wxColour' filepath='include/wx/gtk/window.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-20'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='108'>
        <function-decl name='SetBackgroundStyle' mangled-name='_ZN8wxWindow18SetBackgroundStyleE17wxBackgroundStyle' filepath='include/wx/gtk/window.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-761'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='110'>
        <function-decl name='IsTransparentBackgroundSupported' mangled-name='_ZNK8wxWindow32IsTransparentBackgroundSupportedEP8wxString' filepath='include/wx/gtk/window.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <parameter type-id='type-id-703'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='111'>
        <function-decl name='SetFont' mangled-name='_ZN8wxWindow7SetFontERK6wxFont' filepath='include/wx/gtk/window.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='112'>
        <function-decl name='SetCursor' mangled-name='_ZN8wxWindow9SetCursorERK8wxCursor' filepath='include/wx/gtk/window.h' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-762'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='113'>
        <function-decl name='GetCharHeight' mangled-name='_ZNK8wxWindow13GetCharHeightEv' filepath='include/wx/gtk/window.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='114'>
        <function-decl name='GetCharWidth' mangled-name='_ZNK8wxWindow12GetCharWidthEv' filepath='include/wx/gtk/window.h' line='100' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='119'>
        <function-decl name='SetScrollbar' mangled-name='_ZN8wxWindow12SetScrollbarEiiiib' filepath='include/wx/gtk/window.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-41'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='120'>
        <function-decl name='SetScrollPos' mangled-name='_ZN8wxWindow12SetScrollPosEiib' filepath='include/wx/gtk/window.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-41'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='121'>
        <function-decl name='GetScrollPos' mangled-name='_ZNK8wxWindow12GetScrollPosEi' filepath='include/wx/gtk/window.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='122'>
        <function-decl name='GetScrollThumb' mangled-name='_ZNK8wxWindow14GetScrollThumbEi' filepath='include/wx/gtk/window.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='123'>
        <function-decl name='GetScrollRange' mangled-name='_ZNK8wxWindow14GetScrollRangeEi' filepath='include/wx/gtk/window.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='124'>
        <function-decl name='ScrollWindow' mangled-name='_ZN8wxWindow12ScrollWindowEiiPK6wxRect' filepath='include/wx/gtk/window.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-479'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='125'>
        <function-decl name='ScrollLines' mangled-name='_ZN8wxWindow11ScrollLinesEi' filepath='include/wx/gtk/window.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='126'>
        <function-decl name='ScrollPages' mangled-name='_ZN8wxWindow11ScrollPagesEi' filepath='include/wx/gtk/window.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='130'>
        <function-decl name='SetDropTarget' mangled-name='_ZN8wxWindow13SetDropTargetEP12wxDropTarget' filepath='include/wx/gtk/window.h' line='116' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-763'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='145'>
        <function-decl name='OnInternalIdle' mangled-name='_ZN8wxWindow14OnInternalIdleEv' filepath='include/wx/gtk/window.h' line='145' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='148'>
        <function-decl name='GetHandle' mangled-name='_ZNK8wxWindow9GetHandleEv' filepath='include/wx/gtk/window.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <return type-id='type-id-764'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='158'>
        <function-decl name='DoMoveInTabOrder' mangled-name='_ZN8wxWindow16DoMoveInTabOrderEPS_N12wxWindowBase11WindowOrderE' filepath='include/wx/gtk/window.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-14'/>
          <parameter type-id='type-id-765'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='159'>
        <function-decl name='DoNavigateIn' mangled-name='_ZN8wxWindow12DoNavigateInEi' filepath='include/wx/gtk/window.h' line='420' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='160'>
        <function-decl name='DoEnable' mangled-name='_ZN8wxWindow8DoEnableEb' filepath='include/wx/gtk/window.h' line='390' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-41'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='163'>
        <function-decl name='DoGetTextExtent' mangled-name='_ZNK8wxWindow15DoGetTextExtentERK8wxStringPiS3_S3_S3_PK6wxFont' filepath='include/wx/gtk/window.h' line='375' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <parameter type-id='type-id-29'/>
          <parameter type-id='type-id-31'/>
          <parameter type-id='type-id-31'/>
          <parameter type-id='type-id-31'/>
          <parameter type-id='type-id-31'/>
          <parameter type-id='type-id-747'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='164'>
        <function-decl name='DoClientToScreen' mangled-name='_ZNK8wxWindow16DoClientToScreenEPiS0_' filepath='include/wx/gtk/window.h' line='380' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <parameter type-id='type-id-31'/>
          <parameter type-id='type-id-31'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='165'>
        <function-decl name='DoScreenToClient' mangled-name='_ZNK8wxWindow16DoScreenToClientEPiS0_' filepath='include/wx/gtk/window.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <parameter type-id='type-id-31'/>
          <parameter type-id='type-id-31'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='167'>
        <function-decl name='DoCaptureMouse' mangled-name='_ZN8wxWindow14DoCaptureMouseEv' filepath='include/wx/gtk/window.h' line='396' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='168'>
        <function-decl name='DoReleaseMouse' mangled-name='_ZN8wxWindow14DoReleaseMouseEv' filepath='include/wx/gtk/window.h' line='397' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='169'>
        <function-decl name='DoGetPosition' mangled-name='_ZNK8wxWindow13DoGetPositionEPiS0_' filepath='include/wx/gtk/window.h' line='382' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <parameter type-id='type-id-31'/>
          <parameter type-id='type-id-31'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='171'>
        <function-decl name='DoGetSize' mangled-name='_ZNK8wxWindow9DoGetSizeEPiS0_' filepath='include/wx/gtk/window.h' line='383' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <parameter type-id='type-id-31'/>
          <parameter type-id='type-id-31'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='172'>
        <function-decl name='DoGetClientSize' mangled-name='_ZNK8wxWindow15DoGetClientSizeEPiS0_' filepath='include/wx/gtk/window.h' line='384' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <parameter type-id='type-id-31'/>
          <parameter type-id='type-id-31'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='177'>
        <function-decl name='DoSetSize' mangled-name='_ZN8wxWindow9DoSetSizeEiiiii' filepath='include/wx/gtk/window.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='178'>
        <function-decl name='DoSetClientSize' mangled-name='_ZN8wxWindow15DoSetClientSizeEii' filepath='include/wx/gtk/window.h' line='388' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='180'>
        <function-decl name='DoMoveWindow' mangled-name='_ZN8wxWindow12DoMoveWindowEiiii' filepath='include/wx/gtk/window.h' line='389' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='183'>
        <function-decl name='DoSetToolTip' mangled-name='_ZN8wxWindow12DoSetToolTipEP9wxToolTip' filepath='include/wx/gtk/window.h' line='408' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-766'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='184'>
        <function-decl name='DoPopupMenu' mangled-name='_ZN8wxWindow11DoPopupMenuEP6wxMenuii' filepath='include/wx/gtk/window.h' line='393' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-767'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='187'>
        <function-decl name='DoFreeze' mangled-name='_ZN8wxWindow8DoFreezeEv' filepath='include/wx/gtk/window.h' line='399' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='188'>
        <function-decl name='DoThaw' mangled-name='_ZN8wxWindow6DoThawEv' filepath='include/wx/gtk/window.h' line='400' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='192'>
        <function-decl name='GetConnectWidget' mangled-name='_ZN8wxWindow16GetConnectWidgetEv' filepath='include/wx/gtk/window.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <return type-id='type-id-768'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='193'>
        <function-decl name='GTKProcessEvent' mangled-name='_ZNK8wxWindow15GTKProcessEventER7wxEvent' filepath='include/wx/gtk/window.h' line='189' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <parameter type-id='type-id-119'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='194'>
        <function-decl name='GTKHandleFocusOut' mangled-name='_ZN8wxWindow17GTKHandleFocusOutEv' filepath='include/wx/gtk/window.h' line='203' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='195'>
        <function-decl name='GTKHandleRealized' mangled-name='_ZN8wxWindow17GTKHandleRealizedEv' filepath='include/wx/gtk/window.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='196'>
        <function-decl name='GTKNeedsToFilterSameWindowFocus' mangled-name='_ZNK8wxWindow31GTKNeedsToFilterSameWindowFocusEv' filepath='include/wx/gtk/window.h' line='225' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='197'>
        <function-decl name='GTKWidgetNeedsMnemonic' mangled-name='_ZNK8wxWindow22GTKWidgetNeedsMnemonicEv' filepath='include/wx/gtk/window.h' line='231' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='198'>
        <function-decl name='GTKWidgetDoSetMnemonic' mangled-name='_ZN8wxWindow22GTKWidgetDoSetMnemonicEP10_GtkWidget' filepath='include/wx/gtk/window.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-768'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='199'>
        <function-decl name='GTKGetWindow' mangled-name='_ZNK8wxWindow12GTKGetWindowER17wxArrayGdkWindows' filepath='include/wx/gtk/window.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <parameter type-id='type-id-769'/>
          <return type-id='type-id-770'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='200'>
        <function-decl name='GTKApplyToolTip' mangled-name='_ZN8wxWindow15GTKApplyToolTipEPKc' filepath='include/wx/gtk/window.h' line='252' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-14' is-artificial='yes'/>
          <parameter type-id='type-id-221'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='201'>
        <function-decl name='GTKIsTransparentForMouse' mangled-name='_ZNK8wxWindow24GTKIsTransparentForMouseEv' filepath='include/wx/gtk/window.h' line='263' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <return type-id='type-id-41'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='202'>
        <function-decl name='GTKIMFilterKeypress' mangled-name='_ZNK8wxWindow19GTKIMFilterKeypressEP12_GdkEventKey' filepath='include/wx/gtk/window.h' line='315' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <parameter type-id='type-id-771'/>
          <return type-id='type-id-17'/>
        </function-decl>
