<abi-corpus version='2.0' architecture='elf-amd-x86_64' soname='libwx_gtk3u_propgrid-3.2.so.0'>
  <elf-needed>
    <dependency name='libwx_gtk3u_core-3.2.so.0'/>
    <dependency name='libwx_baseu-3.2.so.0'/>
    <dependency name='libm.so.6'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_Z13wxPGGetFailedPK12wxPGPropertyRK8wxString' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Z20wxSizeRefFromVariantR9wxVariant' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Z20wxSizeRefFromVariantRK9wxVariant' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Z21wxPointRefFromVariantR9wxVariant' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Z21wxPointRefFromVariantRK9wxVariant' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='wxEVT_PG_COL_BEGIN_DRAG' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_PG_COL_DRAGGING' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_PG_COL_END_DRAG' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_PG_DOUBLE_CLICK' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_PG_HIGHLIGHTED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_PG_ITEM_COLLAPSED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_PG_ITEM_EXPANDED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_PG_LABEL_EDIT_BEGIN' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_PG_LABEL_EDIT_ENDING' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_PG_PAGE_CHANGED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_PG_RIGHT_CLICK' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_PG_SELECTED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxPGEditor_CheckBox' size='8' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxPGEditor_Choice' size='8' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxPGEditor_ChoiceAndButton' size='8' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxPGEditor_ComboBox' size='8' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxPGEditor_DatePickerCtrl' size='8' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxPGEditor_SpinCtrl' size='8' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxPGEditor_TextCtrl' size='8' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxPGEditor_TextCtrlAndButton' size='8' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxPGGlobalVars' size='8' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxPoint_VariantType' size='8' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxPropertyGridManagerNameStr' size='22' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxPropertyGridNameStr' size='15' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxSize_VariantType' size='8' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/propgrid/advprops.cpp' language='LANG_C_plus_plus_14'>
    <type-decl name='__float128' size-in-bits='128' id='type-id-1'/>
    <type-decl name='__int128' size-in-bits='128' id='type-id-2'/>
    <type-decl name='bool' size-in-bits='8' id='type-id-3'/>
    <type-decl name='char' size-in-bits='8' id='type-id-4'/>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='128' id='type-id-5'>
      <subrange length='16' type-id='type-id-6' id='type-id-7'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='8' id='type-id-8'>
      <subrange length='1' type-id='type-id-6' id='type-id-9'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='160' id='type-id-10'>
      <subrange length='20' type-id='type-id-6' id='type-id-11'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='32' id='type-id-12'>
      <subrange length='4' type-id='type-id-6' id='type-id-13'/>
    </array-type-def>
    <class-decl name='typedef __va_list_tag __va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-16' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='type-id-17'/>
    <type-decl name='float' size-in-bits='32' id='type-id-18'/>
    <type-decl name='int' size-in-bits='32' id='type-id-19'/>
    <type-decl name='long double' size-in-bits='128' id='type-id-20'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-21'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-22'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-23'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-24'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-25'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-26'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-27'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-15'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-6'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-28'/>
    <type-decl name='variadic parameter type' id='type-id-29'/>
    <type-decl name='void' id='type-id-30'/>
    <type-decl name='wchar_t' size-in-bits='32' id='type-id-31'/>
    <array-type-def dimensions='1' type-id='type-id-31' size-in-bits='128' id='type-id-32'>
      <subrange length='4' type-id='type-id-6' id='type-id-13'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-33' size-in-bits='128' id='type-id-34'>
      <subrange length='16' type-id='type-id-6' id='type-id-7'/>
    </array-type-def>
    <union-decl name='wxAnyValueBuffer' size-in-bits='128' visibility='default' filepath='include/wx/any.h' line='30' column='1' id='type-id-35'>
      <member-type access='public'>
        <union-decl name='Alignment' size-in-bits='128' visibility='default' filepath='include/wx/any.h' line='32' column='1' id='type-id-36'>
          <data-member access='public'>
            <var-decl name='m_int64' type-id='type-id-37' visibility='default' filepath='include/wx/any.h' line='35' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='m_longDouble' type-id='type-id-20' visibility='default' filepath='include/wx/any.h' line='37' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='m_funcPtr' type-id='type-id-38' visibility='default' filepath='include/wx/any.h' line='38' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public'>
        <var-decl name='m_alignment' type-id='type-id-36' visibility='default' filepath='include/wx/any.h' line='40' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='m_ptr' type-id='type-id-16' visibility='default' filepath='include/wx/any.h' line='42' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='m_buffer' type-id='type-id-34' visibility='default' filepath='include/wx/any.h' line='43' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='wxAnyValueType' size-in-bits='64' visibility='default' filepath='include/wx/any.h' line='56' column='1' id='type-id-39'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAnyValueType' mangled-name='_ZN14wxAnyValueTypeD0Ev' filepath='include/wx/any.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-40' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAnyValueType' mangled-name='_ZN14wxAnyValueTypeD0Ev' filepath='include/wx/any.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-40' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAnyValueType' mangled-name='_ZN14wxAnyValueTypeD2Ev' filepath='include/wx/any.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-40' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAnyValueType' mangled-name='_ZN14wxAnyValueTypeD2Ev' filepath='include/wx/any.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-40' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAnyValueType' mangled-name='_ZN14wxAnyValueTypeD4Ev' filepath='include/wx/any.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-40' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='IsSameType' mangled-name='_ZNK14wxAnyValueType10IsSameTypeEPKS_' filepath='include/wx/any.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-41' is-artificial='yes'/>
          <parameter type-id='type-id-41'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='DeleteValue' mangled-name='_ZNK14wxAnyValueType11DeleteValueER16wxAnyValueBuffer' filepath='include/wx/any.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-41' is-artificial='yes'/>
          <parameter type-id='type-id-42'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='CopyBuffer' mangled-name='_ZNK14wxAnyValueType10CopyBufferERK16wxAnyValueBufferRS0_' filepath='include/wx/any.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-41' is-artificial='yes'/>
          <parameter type-id='type-id-43'/>
          <parameter type-id='type-id-42'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='ConvertValue' mangled-name='_ZNK14wxAnyValueType12ConvertValueERK16wxAnyValueBufferPS_RS0_' filepath='include/wx/any.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-41' is-artificial='yes'/>
          <parameter type-id='type-id-43'/>
          <parameter type-id='type-id-40'/>
          <parameter type-id='type-id-42'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxAnyValueTypeScopedPtr' size-in-bits='64' visibility='default' filepath='include/wx/any.h' line='130' column='1' id='type-id-44'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_ptr' type-id='type-id-40' visibility='default' filepath='include/wx/any.h' line='137' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxAnyValueTypeImplBase&lt;wxColourPropertyValue&gt;' size-in-bits='64' visibility='default' filepath='include/wx/any.h' line='284' column='1' id='type-id-45'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-39'/>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAnyValueTypeImplBase' mangled-name='_ZN22wxAnyValueTypeImplBaseI21wxColourPropertyValueED0Ev' filepath='include/wx/any.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-46' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAnyValueTypeImplBase' mangled-name='_ZN22wxAnyValueTypeImplBaseI21wxColourPropertyValueED2Ev' filepath='include/wx/any.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-46' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAnyValueTypeImplBase' mangled-name='_ZN22wxAnyValueTypeImplBaseI21wxColourPropertyValueED4Ev' filepath='include/wx/any.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-46' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='DeleteValue' mangled-name='_ZNK22wxAnyValueTypeImplBaseI21wxColourPropertyValueE11DeleteValueER16wxAnyValueBuffer' filepath='include/wx/any.h' line='295' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-47' is-artificial='yes'/>
          <parameter type-id='type-id-42'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='CopyBuffer' mangled-name='_ZNK22wxAnyValueTypeImplBaseI21wxColourPropertyValueE10CopyBufferERK16wxAnyValueBufferRS2_' filepath='include/wx/any.h' line='300' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-47' is-artificial='yes'/>
          <parameter type-id='type-id-43'/>
          <parameter type-id='type-id-42'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxAnyValueTypeImpl&lt;wxColourPropertyValue&gt;' size-in-bits='64' visibility='default' filepath='include/wx/any.h' line='338' column='1' id='type-id-48'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-45'/>
      <data-member access='private' static='yes'>
        <var-decl name='sm_instance' type-id='type-id-44' mangled-name='_ZN18wxAnyValueTypeImplI21wxColourPropertyValueE11sm_instanceE' visibility='default' filepath='include/wx/any.h' line='357' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAnyValueTypeImpl' mangled-name='_ZN18wxAnyValueTypeImplI21wxColourPropertyValueED0Ev' filepath='include/wx/any.h' line='343' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAnyValueTypeImpl' mangled-name='_ZN18wxAnyValueTypeImplI21wxColourPropertyValueED2Ev' filepath='include/wx/any.h' line='343' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAnyValueTypeImpl' mangled-name='_ZN18wxAnyValueTypeImplI21wxColourPropertyValueED4Ev' filepath='include/wx/any.h' line='343' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-49' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='IsSameType' mangled-name='_ZNK18wxAnyValueTypeImplI21wxColourPropertyValueE10IsSameTypeEPK14wxAnyValueType' filepath='include/wx/any.h' line='340' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-50' is-artificial='yes'/>
          <parameter type-id='type-id-41'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='ConvertValue' mangled-name='_ZNK18wxAnyValueTypeImplI21wxColourPropertyValueE12ConvertValueERK16wxAnyValueBufferP14wxAnyValueTypeRS2_' filepath='include/wx/any.h' line='345' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-50' is-artificial='yes'/>
          <parameter type-id='type-id-43'/>
          <parameter type-id='type-id-40'/>
          <parameter type-id='type-id-42'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxAny' size-in-bits='256' visibility='default' filepath='include/wx/any.h' line='731' column='1' id='type-id-51'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_buffer' type-id='type-id-35' visibility='default' filepath='include/wx/any.h' line='1082' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_type' type-id='type-id-40' visibility='default' filepath='include/wx/any.h' line='1083' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxAnyStrPtr' size-in-bits='128' visibility='default' filepath='include/wx/anystr.h' line='29' column='1' id='type-id-52'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_str' type-id='type-id-53' visibility='default' filepath='include/wx/anystr.h' line='134' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_iter' type-id='type-id-54' visibility='default' filepath='include/wx/anystr.h' line='135' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArrayString' size-in-bits='320' visibility='default' filepath='include/wx/arrstr.h' line='157' column='1' id='type-id-55'>
      <member-type access='public'>
        <typedef-decl name='CompareFunction' type-id='type-id-57' filepath='include/wx/arrstr.h' line='161' column='1' id='type-id-56'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CompareFunction2' type-id='type-id-59' filepath='include/wx/arrstr.h' line='165' column='1' id='type-id-58'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-61' filepath='include/wx/arrstr.h' line='267' column='1' id='type-id-60'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-63' filepath='include/wx/arrstr.h' line='270' column='1' id='type-id-62'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-65' filepath='include/wx/arrstr.h' line='271' column='1' id='type-id-64'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-67' filepath='include/wx/arrstr.h' line='272' column='1' id='type-id-66'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-69' filepath='include/wx/arrstr.h' line='273' column='1' id='type-id-68'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-71' filepath='include/wx/arrstr.h' line='275' column='1' id='type-id-70'/>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator' size-in-bits='64' visibility='default' filepath='include/wx/arrstr.h' line='278' column='1' id='type-id-72'>
          <member-type access='private'>
            <typedef-decl name='value_type' type-id='type-id-61' filepath='include/wx/arrstr.h' line='280' column='1' id='type-id-73'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='type-id-75' filepath='include/wx/arrstr.h' line='281' column='1' id='type-id-74'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reference' type-id='type-id-77' filepath='include/wx/arrstr.h' line='282' column='1' id='type-id-76'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='itor' type-id='type-id-72' filepath='include/wx/arrstr.h' line='283' column='1' id='type-id-78'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_ptr' type-id='type-id-74' visibility='default' filepath='include/wx/arrstr.h' line='289' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_reverse_iterator' size-in-bits='64' visibility='default' filepath='include/wx/arrstr.h' line='304' column='1' id='type-id-79'>
          <member-type access='private'>
            <typedef-decl name='value_type' type-id='type-id-61' filepath='include/wx/arrstr.h' line='306' column='1' id='type-id-80'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='type-id-82' filepath='include/wx/arrstr.h' line='307' column='1' id='type-id-81'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reference' type-id='type-id-84' filepath='include/wx/arrstr.h' line='308' column='1' id='type-id-83'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='itor' type-id='type-id-79' filepath='include/wx/arrstr.h' line='309' column='1' id='type-id-85'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_ptr' type-id='type-id-81' visibility='default' filepath='include/wx/arrstr.h' line='315' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_compareFunction' type-id='type-id-56' visibility='default' filepath='include/wx/arrstr.h' line='393' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_nSize' type-id='type-id-71' visibility='default' filepath='include/wx/arrstr.h' line='406' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_nCount' type-id='type-id-71' visibility='default' filepath='include/wx/arrstr.h' line='407' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_pItems' type-id='type-id-86' visibility='default' filepath='include/wx/arrstr.h' line='409' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_autoSort' type-id='type-id-3' visibility='default' filepath='include/wx/arrstr.h' line='411' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxBitmapBundle' size-in-bits='64' visibility='default' filepath='include/wx/bmpbndl.h' line='28' column='1' id='type-id-87'>
      <member-type access='private'>
        <typedef-decl name='wxBitmapBundleImplPtr' type-id='type-id-89' filepath='include/wx/bmpbndl.h' line='173' column='1' id='type-id-88'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_impl' type-id='type-id-88' visibility='default' filepath='include/wx/bmpbndl.h' line='179' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxBrushStyle' filepath='include/wx/brush.h' line='20' column='1' id='type-id-90'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxBRUSHSTYLE_INVALID' value='-1'/>
      <enumerator name='wxBRUSHSTYLE_SOLID' value='100'/>
      <enumerator name='wxBRUSHSTYLE_TRANSPARENT' value='106'/>
      <enumerator name='wxBRUSHSTYLE_STIPPLE_MASK_OPAQUE' value='107'/>
      <enumerator name='wxBRUSHSTYLE_STIPPLE_MASK' value='108'/>
      <enumerator name='wxBRUSHSTYLE_STIPPLE' value='110'/>
      <enumerator name='wxBRUSHSTYLE_BDIAGONAL_HATCH' value='111'/>
      <enumerator name='wxBRUSHSTYLE_CROSSDIAG_HATCH' value='112'/>
      <enumerator name='wxBRUSHSTYLE_FDIAGONAL_HATCH' value='113'/>
      <enumerator name='wxBRUSHSTYLE_CROSS_HATCH' value='114'/>
      <enumerator name='wxBRUSHSTYLE_HORIZONTAL_HATCH' value='115'/>
      <enumerator name='wxBRUSHSTYLE_VERTICAL_HATCH' value='116'/>
      <enumerator name='wxBRUSHSTYLE_FIRST_HATCH' value='111'/>
      <enumerator name='wxBRUSHSTYLE_LAST_HATCH' value='116'/>
    </enum-decl>
    <class-decl name='wxScopedCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='66' column='1' id='type-id-91'>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-4' filepath='include/wx/buffer.h' line='69' column='1' id='type-id-92'/>
      </member-type>
      <member-type access='protected'>
        <class-decl name='Data' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='164' column='1' id='type-id-93'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-94'/>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-95' visibility='default' filepath='include/wx/buffer.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxScopedCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='66' column='1' id='type-id-96'>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-31' filepath='include/wx/buffer.h' line='69' column='1' id='type-id-97'/>
      </member-type>
      <member-type access='protected'>
        <class-decl name='Data' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='164' column='1' id='type-id-98'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-94'/>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-99' visibility='default' filepath='include/wx/buffer.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxScopedCharBuffer' type-id='type-id-91' filepath='include/wx/buffer.h' line='241' column='1' id='type-id-100'/>
    <typedef-decl name='wxScopedWCharBuffer' type-id='type-id-96' filepath='include/wx/buffer.h' line='242' column='1' id='type-id-101'/>
    <class-decl name='wxCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='247' column='1' id='type-id-102'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-91'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-4' filepath='include/wx/buffer.h' line='253' column='1' id='type-id-103'/>
      </member-type>
    </class-decl>
    <class-decl name='wxCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='247' column='1' id='type-id-104'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-96'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-31' filepath='include/wx/buffer.h' line='253' column='1' id='type-id-105'/>
      </member-type>
    </class-decl>
    <class-decl name='wxCharBuffer' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='357' column='1' id='type-id-106'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-102'/>
      <member-type access='public'>
        <typedef-decl name='wxCharTypeBufferBase' type-id='type-id-102' filepath='include/wx/buffer.h' line='360' column='1' id='type-id-107'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='wxScopedCharTypeBufferBase' type-id='type-id-91' filepath='include/wx/buffer.h' line='361' column='1' id='type-id-108'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWritableCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='393' column='1' id='type-id-109'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-102'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-92' filepath='include/wx/buffer.h' line='396' column='1' id='type-id-110'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWritableCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='393' column='1' id='type-id-111'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-104'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-97' filepath='include/wx/buffer.h' line='396' column='1' id='type-id-112'/>
      </member-type>
    </class-decl>
    <typedef-decl name='wxWritableCharBuffer' type-id='type-id-109' filepath='include/wx/buffer.h' line='410' column='1' id='type-id-113'/>
    <typedef-decl name='wxWritableWCharBuffer' type-id='type-id-111' filepath='include/wx/buffer.h' line='411' column='1' id='type-id-114'/>
    <typedef-decl name='wxChar' type-id='type-id-31' filepath='include/wx/chartype.h' line='123' column='1' id='type-id-115'/>
    <typedef-decl name='wxStringCharType' type-id='type-id-31' filepath='include/wx/chartype.h' line='170' column='1' id='type-id-116'/>
    <class-decl name='wxClientData' size-in-bits='64' visibility='default' filepath='include/wx/clntdata.h' line='98' column='1' id='type-id-117'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxClientData' mangled-name='_ZN12wxClientDataD4Ev' filepath='include/wx/clntdata.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-118' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxCompositeWindowSettersOnly&lt;wxNavigationEnabled&lt;wxDatePickerCtrlCommonBase&lt;wxDateTimePickerCtrlBase&gt; &gt; &gt;' size-in-bits='5952' visibility='default' filepath='include/wx/compositewin.h' line='36' column='1' id='type-id-119'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-120'/>
      <member-function access='public' vtable-offset='28'>
        <function-decl name='SetLayoutDirection' mangled-name='_ZN28wxCompositeWindowSettersOnlyI19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEEE18SetLayoutDirectionE17wxLayoutDirection' filepath='include/wx/compositewin.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-121' is-artificial='yes'/>
          <parameter type-id='type-id-122'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='106'>
        <function-decl name='SetBackgroundColour' mangled-name='_ZN28wxCompositeWindowSettersOnlyI19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEEE19SetBackgroundColourERK8wxColour' filepath='include/wx/compositewin.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-121' is-artificial='yes'/>
          <parameter type-id='type-id-123'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='107'>
        <function-decl name='SetForegroundColour' mangled-name='_ZN28wxCompositeWindowSettersOnlyI19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEEE19SetForegroundColourERK8wxColour' filepath='include/wx/compositewin.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-121' is-artificial='yes'/>
          <parameter type-id='type-id-123'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='111'>
        <function-decl name='SetFont' mangled-name='_ZN28wxCompositeWindowSettersOnlyI19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEEE7SetFontERK6wxFont' filepath='include/wx/compositewin.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-121' is-artificial='yes'/>
          <parameter type-id='type-id-124'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='112'>
        <function-decl name='SetCursor' mangled-name='_ZN28wxCompositeWindowSettersOnlyI19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEEE9SetCursorERK8wxCursor' filepath='include/wx/compositewin.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-121' is-artificial='yes'/>
          <parameter type-id='type-id-125'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='182'>
        <function-decl name='DoSetToolTipText' mangled-name='_ZN28wxCompositeWindowSettersOnlyI19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEEE16DoSetToolTipTextERK8wxString' filepath='include/wx/compositewin.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-121' is-artificial='yes'/>
          <parameter type-id='type-id-126'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='183'>
        <function-decl name='DoSetToolTip' mangled-name='_ZN28wxCompositeWindowSettersOnlyI19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEEE12DoSetToolTipEP9wxToolTip' filepath='include/wx/compositewin.h' line='120' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-121' is-artificial='yes'/>
          <parameter type-id='type-id-127'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes' vtable-offset='217'>
        <function-decl name='GetCompositeWindowParts' mangled-name='_ZNK28wxCompositeWindowSettersOnlyI19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEEE23GetCompositeWindowPartsEv' filepath='include/wx/compositewin.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-128' is-artificial='yes'/>
          <return type-id='type-id-129'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxCompositeWindow&lt;wxNavigationEnabled&lt;wxDatePickerCtrlCommonBase&lt;wxDateTimePickerCtrlBase&gt; &gt; &gt;' size-in-bits='5952' visibility='default' filepath='include/wx/compositewin.h' line='163' column='1' id='type-id-130'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-119'/>
      <member-function access='public' vtable-offset='71'>
        <function-decl name='SetFocus' mangled-name='_ZN17wxCompositeWindowI19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEEE8SetFocusEv' filepath='include/wx/compositewin.h' line='166' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-131' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxNavigationEnabled&lt;wxDatePickerCtrlCommonBase&lt;wxDateTimePickerCtrlBase&gt; &gt;' size-in-bits='5952' visibility='default' filepath='include/wx/containr.h' line='189' column='1' id='type-id-120'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-132'/>
      <data-member access='protected' layout-offset-in-bits='5696'>
        <var-decl name='m_container' type-id='type-id-133' visibility='default' filepath='include/wx/containr.h' line='293' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='71'>
        <function-decl name='SetFocus' mangled-name='_ZN19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEE8SetFocusEv' filepath='include/wx/containr.h' line='250' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='74'>
        <function-decl name='AcceptsFocus' mangled-name='_ZNK19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEE12AcceptsFocusEv' filepath='include/wx/containr.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-135' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='75'>
        <function-decl name='AcceptsFocusRecursively' mangled-name='_ZNK19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEE23AcceptsFocusRecursivelyEv' filepath='include/wx/containr.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-135' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='76'>
        <function-decl name='AcceptsFocusFromKeyboard' mangled-name='_ZNK19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEE24AcceptsFocusFromKeyboardEv' filepath='include/wx/containr.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-135' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='82'>
        <function-decl name='AddChild' mangled-name='_ZN19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEE8AddChildEP12wxWindowBase' filepath='include/wx/containr.h' line='224' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-136'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='83'>
        <function-decl name='RemoveChild' mangled-name='_ZN19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEE11RemoveChildEP12wxWindowBase' filepath='include/wx/containr.h' line='237' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-136'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxNavigationEnabled&lt;wxTopLevelWindow&gt;' size-in-bits='7616' visibility='default' filepath='include/wx/containr.h' line='189' column='1' id='type-id-137'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-138'/>
      <data-member access='protected' layout-offset-in-bits='7360'>
        <var-decl name='m_container' type-id='type-id-133' visibility='default' filepath='include/wx/containr.h' line='293' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='71'>
        <function-decl name='SetFocus' mangled-name='_ZN19wxNavigationEnabledI16wxTopLevelWindowE8SetFocusEv' filepath='include/wx/containr.h' line='250' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-139' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='74'>
        <function-decl name='AcceptsFocus' mangled-name='_ZNK19wxNavigationEnabledI16wxTopLevelWindowE12AcceptsFocusEv' filepath='include/wx/containr.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-140' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='75'>
        <function-decl name='AcceptsFocusRecursively' mangled-name='_ZNK19wxNavigationEnabledI16wxTopLevelWindowE23AcceptsFocusRecursivelyEv' filepath='include/wx/containr.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-140' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='76'>
        <function-decl name='AcceptsFocusFromKeyboard' mangled-name='_ZNK19wxNavigationEnabledI16wxTopLevelWindowE24AcceptsFocusFromKeyboardEv' filepath='include/wx/containr.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-140' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='82'>
        <function-decl name='AddChild' mangled-name='_ZN19wxNavigationEnabledI16wxTopLevelWindowE8AddChildEP12wxWindowBase' filepath='include/wx/containr.h' line='224' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-139' is-artificial='yes'/>
          <parameter type-id='type-id-136'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='83'>
        <function-decl name='RemoveChild' mangled-name='_ZN19wxNavigationEnabledI16wxTopLevelWindowE11RemoveChildEP12wxWindowBase' filepath='include/wx/containr.h' line='237' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-139' is-artificial='yes'/>
          <parameter type-id='type-id-136'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxCursorBase' size-in-bits='128' visibility='default' filepath='include/wx/cursor.h' line='25' column='1' id='type-id-141'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-142'/>
      <member-function access='public' const='yes' vtable-offset='8'>
        <function-decl name='GetHotSpot' mangled-name='_ZNK12wxCursorBase10GetHotSpotEv' filepath='include/wx/cursor.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-143' is-artificial='yes'/>
          <return type-id='type-id-144'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxDatePickerCtrlCommonBase&lt;wxDateTimePickerCtrlBase&gt;' size-in-bits='5696' visibility='default' filepath='include/wx/datectrl.h' line='50' column='1' id='type-id-132'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-145'/>
      <member-function access='public' vtable-offset='215'>
        <function-decl name='SetRange' mangled-name='_ZN26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseE8SetRangeERK10wxDateTimeS4_' filepath='include/wx/datectrl.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-146' is-artificial='yes'/>
          <parameter type-id='type-id-147'/>
          <parameter type-id='type-id-147'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='216'>
        <function-decl name='GetRange' mangled-name='_ZNK26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseE8GetRangeEP10wxDateTimeS3_' filepath='include/wx/datectrl.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-148' is-artificial='yes'/>
          <parameter type-id='type-id-149'/>
          <parameter type-id='type-id-149'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxDateTime' size-in-bits='64' visibility='default' filepath='include/wx/datetime.h' line='128' column='1' id='type-id-150'>
      <member-type access='public'>
        <typedef-decl name='wxDateTime_t' type-id='type-id-28' filepath='include/wx/datetime.h' line='139' column='1' id='type-id-151'/>
      </member-type>
      <member-type access='public'>
        <enum-decl name='TZ' filepath='include/wx/datetime.h' line='145' column='1' id='type-id-152'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Local' value='0'/>
          <enumerator name='GMT_12' value='1'/>
          <enumerator name='GMT_11' value='2'/>
          <enumerator name='GMT_10' value='3'/>
          <enumerator name='GMT_9' value='4'/>
          <enumerator name='GMT_8' value='5'/>
          <enumerator name='GMT_7' value='6'/>
          <enumerator name='GMT_6' value='7'/>
          <enumerator name='GMT_5' value='8'/>
          <enumerator name='GMT_4' value='9'/>
          <enumerator name='GMT_3' value='10'/>
          <enumerator name='GMT_2' value='11'/>
          <enumerator name='GMT_1' value='12'/>
          <enumerator name='GMT0' value='13'/>
          <enumerator name='GMT1' value='14'/>
          <enumerator name='GMT2' value='15'/>
          <enumerator name='GMT3' value='16'/>
          <enumerator name='GMT4' value='17'/>
          <enumerator name='GMT5' value='18'/>
          <enumerator name='GMT6' value='19'/>
          <enumerator name='GMT7' value='20'/>
          <enumerator name='GMT8' value='21'/>
          <enumerator name='GMT9' value='22'/>
          <enumerator name='GMT10' value='23'/>
          <enumerator name='GMT11' value='24'/>
          <enumerator name='GMT12' value='25'/>
          <enumerator name='GMT13' value='26'/>
          <enumerator name='WET' value='13'/>
          <enumerator name='WEST' value='14'/>
          <enumerator name='CET' value='14'/>
          <enumerator name='CEST' value='15'/>
          <enumerator name='EET' value='15'/>
          <enumerator name='EEST' value='16'/>
          <enumerator name='MSK' value='16'/>
          <enumerator name='MSD' value='17'/>
          <enumerator name='AST' value='9'/>
          <enumerator name='ADT' value='10'/>
          <enumerator name='EST' value='8'/>
          <enumerator name='EDT' value='9'/>
          <enumerator name='CST' value='7'/>
          <enumerator name='CDT' value='8'/>
          <enumerator name='MST' value='6'/>
          <enumerator name='MDT' value='7'/>
          <enumerator name='PST' value='5'/>
          <enumerator name='PDT' value='6'/>
          <enumerator name='HST' value='3'/>
          <enumerator name='AKST' value='4'/>
          <enumerator name='AKDT' value='5'/>
          <enumerator name='A_WST' value='21'/>
          <enumerator name='A_CST' value='27'/>
          <enumerator name='A_EST' value='23'/>
          <enumerator name='A_ESST' value='24'/>
          <enumerator name='NZST' value='25'/>
          <enumerator name='NZDT' value='26'/>
          <enumerator name='UTC' value='13'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='Calendar' filepath='include/wx/datetime.h' line='212' column='1' id='type-id-153'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Gregorian' value='0'/>
          <enumerator name='Julian' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='Country' filepath='include/wx/datetime.h' line='226' column='1' id='type-id-154'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Country_Unknown' value='0'/>
          <enumerator name='Country_Default' value='1'/>
          <enumerator name='Country_WesternEurope_Start' value='2'/>
          <enumerator name='Country_EEC' value='2'/>
          <enumerator name='France' value='3'/>
          <enumerator name='Germany' value='4'/>
          <enumerator name='UK' value='5'/>
          <enumerator name='Country_WesternEurope_End' value='5'/>
          <enumerator name='Russia' value='6'/>
          <enumerator name='USA' value='7'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='Month' filepath='include/wx/datetime.h' line='248' column='1' id='type-id-155'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Jan' value='0'/>
          <enumerator name='Feb' value='1'/>
          <enumerator name='Mar' value='2'/>
          <enumerator name='Apr' value='3'/>
          <enumerator name='May' value='4'/>
          <enumerator name='Jun' value='5'/>
          <enumerator name='Jul' value='6'/>
          <enumerator name='Aug' value='7'/>
          <enumerator name='Sep' value='8'/>
          <enumerator name='Oct' value='9'/>
          <enumerator name='Nov' value='10'/>
          <enumerator name='Dec' value='11'/>
          <enumerator name='Inv_Month' value='12'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='WeekDay' filepath='include/wx/datetime.h' line='254' column='1' id='type-id-156'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Sun' value='0'/>
          <enumerator name='Mon' value='1'/>
          <enumerator name='Tue' value='2'/>
          <enumerator name='Wed' value='3'/>
          <enumerator name='Thu' value='4'/>
          <enumerator name='Fri' value='5'/>
          <enumerator name='Sat' value='6'/>
          <enumerator name='Inv_WeekDay' value='7'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='NameFlags' filepath='include/wx/datetime.h' line='266' column='1' id='type-id-157'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Name_Full' value='1'/>
          <enumerator name='Name_Abbr' value='2'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='WeekFlags' filepath='include/wx/datetime.h' line='273' column='1' id='type-id-158'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Default_First' value='0'/>
          <enumerator name='Monday_First' value='1'/>
          <enumerator name='Sunday_First' value='2'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='TimeZone' size-in-bits='64' visibility='default' filepath='include/wx/datetime.h' line='294' column='1' id='type-id-159'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_offset' type-id='type-id-21' visibility='default' filepath='include/wx/datetime.h' line='315' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='Tm' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/wx/datetime.h' line='325' column='1' id='type-id-160'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='msec' type-id='type-id-151' visibility='default' filepath='include/wx/datetime.h' line='327' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='16'>
            <var-decl name='sec' type-id='type-id-151' visibility='default' filepath='include/wx/datetime.h' line='327' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <var-decl name='min' type-id='type-id-151' visibility='default' filepath='include/wx/datetime.h' line='327' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='48'>
            <var-decl name='hour' type-id='type-id-151' visibility='default' filepath='include/wx/datetime.h' line='327' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='mday' type-id='type-id-151' visibility='default' filepath='include/wx/datetime.h' line='328' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='80'>
            <var-decl name='yday' type-id='type-id-151' visibility='default' filepath='include/wx/datetime.h' line='329' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='96'>
            <var-decl name='mon' type-id='type-id-155' visibility='default' filepath='include/wx/datetime.h' line='330' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='year' type-id='type-id-19' visibility='default' filepath='include/wx/datetime.h' line='331' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='192'>
            <var-decl name='m_tz' type-id='type-id-159' visibility='default' filepath='include/wx/datetime.h' line='362' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='256'>
            <var-decl name='wday' type-id='type-id-151' visibility='default' filepath='include/wx/datetime.h' line='367' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_time' type-id='type-id-161' visibility='default' filepath='include/wx/datetime.h' line='1160' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxTimeSpan' size-in-bits='64' visibility='default' filepath='include/wx/datetime.h' line='1169' column='1' id='type-id-162'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_diff' type-id='type-id-161' visibility='default' filepath='include/wx/datetime.h' line='1357' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxDateSpan' size-in-bits='128' visibility='default' filepath='include/wx/datetime.h' line='1395' column='1' id='type-id-163'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_years' type-id='type-id-19' visibility='default' filepath='include/wx/datetime.h' line='1518' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='m_months' type-id='type-id-19' visibility='default' filepath='include/wx/datetime.h' line='1519' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_weeks' type-id='type-id-19' visibility='default' filepath='include/wx/datetime.h' line='1520' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='m_days' type-id='type-id-19' visibility='default' filepath='include/wx/datetime.h' line='1521' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxDateTimePickerCtrlBase' size-in-bits='5696' visibility='default' filepath='include/wx/datetimectrl.h' line='29' column='1' id='type-id-145'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-164'/>
      <member-function access='public' vtable-offset='212'>
        <function-decl name='SetValue' mangled-name='_ZN24wxDateTimePickerCtrlBase8SetValueERK10wxDateTime' filepath='include/wx/datetimectrl.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-165' is-artificial='yes'/>
          <parameter type-id='type-id-147'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='213'>
        <function-decl name='GetValue' mangled-name='_ZNK24wxDateTimePickerCtrlBase8GetValueEv' filepath='include/wx/datetimectrl.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-166' is-artificial='yes'/>
          <return type-id='type-id-150'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='214'>
        <function-decl name='SetNullText' mangled-name='_ZN24wxDateTimePickerCtrlBase11SetNullTextERK8wxString' filepath='include/wx/datetimectrl.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-165' is-artificial='yes'/>
          <parameter type-id='type-id-126'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='wxBorder' filepath='include/wx/defs.h' line='1443' column='1' id='type-id-167'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxBORDER_DEFAULT' value='0'/>
      <enumerator name='wxBORDER_NONE' value='2097152'/>
      <enumerator name='wxBORDER_STATIC' value='16777216'/>
      <enumerator name='wxBORDER_SIMPLE' value='33554432'/>
      <enumerator name='wxBORDER_RAISED' value='67108864'/>
      <enumerator name='wxBORDER_SUNKEN' value='134217728'/>
      <enumerator name='wxBORDER_DOUBLE' value='268435456'/>
      <enumerator name='wxBORDER_THEME' value='268435456'/>
      <enumerator name='wxBORDER_MASK' value='522190848'/>
    </enum-decl>
    <enum-decl name='wxBackgroundStyle' filepath='include/wx/defs.h' line='1816' column='1' id='type-id-168'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxBG_STYLE_ERASE' value='0'/>
      <enumerator name='wxBG_STYLE_SYSTEM' value='1'/>
      <enumerator name='wxBG_STYLE_PAINT' value='2'/>
      <enumerator name='wxBG_STYLE_TRANSPARENT' value='3'/>
      <enumerator name='wxBG_STYLE_COLOUR' value='4'/>
      <enumerator name='wxBG_STYLE_CUSTOM' value='2'/>
    </enum-decl>
    <enum-decl name='wxKeyType' filepath='include/wx/defs.h' line='1857' column='1' id='type-id-169'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxKEY_NONE' value='0'/>
      <enumerator name='wxKEY_INTEGER' value='1'/>
      <enumerator name='wxKEY_STRING' value='2'/>
    </enum-decl>
    <typedef-decl name='wxWindowID' type-id='type-id-19' filepath='include/wx/defs.h' line='2069' column='1' id='type-id-170'/>
    <enum-decl name='wxHitTest' filepath='include/wx/defs.h' line='2099' column='1' id='type-id-171'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxHT_NOWHERE' value='0'/>
      <enumerator name='wxHT_SCROLLBAR_FIRST' value='0'/>
      <enumerator name='wxHT_SCROLLBAR_ARROW_LINE_1' value='1'/>
      <enumerator name='wxHT_SCROLLBAR_ARROW_LINE_2' value='2'/>
      <enumerator name='wxHT_SCROLLBAR_ARROW_PAGE_1' value='3'/>
      <enumerator name='wxHT_SCROLLBAR_ARROW_PAGE_2' value='4'/>
      <enumerator name='wxHT_SCROLLBAR_THUMB' value='5'/>
      <enumerator name='wxHT_SCROLLBAR_BAR_1' value='6'/>
      <enumerator name='wxHT_SCROLLBAR_BAR_2' value='7'/>
      <enumerator name='wxHT_SCROLLBAR_LAST' value='8'/>
      <enumerator name='wxHT_WINDOW_OUTSIDE' value='9'/>
      <enumerator name='wxHT_WINDOW_INSIDE' value='10'/>
      <enumerator name='wxHT_WINDOW_VERT_SCROLLBAR' value='11'/>
      <enumerator name='wxHT_WINDOW_HORZ_SCROLLBAR' value='12'/>
      <enumerator name='wxHT_WINDOW_CORNER' value='13'/>
      <enumerator name='wxHT_MAX' value='14'/>
    </enum-decl>
    <typedef-decl name='wxSortCompareFunction' type-id='type-id-172' filepath='include/wx/defs.h' line='2687' column='1' id='type-id-173'/>
    <typedef-decl name='GdkWindow' type-id='type-id-174' filepath='include/wx/defs.h' line='3091' column='1' id='type-id-175'/>
    <typedef-decl name='GtkWidget' type-id='type-id-176' filepath='include/wx/defs.h' line='3103' column='1' id='type-id-177'/>
    <typedef-decl name='GtkRcStyle' type-id='type-id-178' filepath='include/wx/defs.h' line='3104' column='1' id='type-id-179'/>
    <typedef-decl name='WXWidget' type-id='type-id-180' filepath='include/wx/defs.h' line='3115' column='1' id='type-id-181'/>
    <enum-decl name='wxDialogModality' filepath='include/wx/dialog.h' line='55' column='1' id='type-id-182'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxDIALOG_MODALITY_NONE' value='0'/>
      <enumerator name='wxDIALOG_MODALITY_WINDOW_MODAL' value='1'/>
      <enumerator name='wxDIALOG_MODALITY_APP_MODAL' value='2'/>
    </enum-decl>
    <class-decl name='wxArray_SortFunction&lt;_GdkWindow*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-183'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-185' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-184'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-184' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArray_SortFunction&lt;const wxEventTableEntry*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-186'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-188' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-187'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-187' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArray_SortFunction&lt;int&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-189'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-191' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-190'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-190' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;_GdkWindow*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-192'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-194' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-193'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-193' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;const wxEventTableEntry*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-195'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-197' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-196'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-196' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;int&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-198'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-200' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-199'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-199' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxBaseArray&lt;_GdkWindow*, wxSortedArray_SortFunction&lt;_GdkWindow*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-201'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-202'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-193' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-203'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-184' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-204'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-206' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-205'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseArray&lt;const wxEventTableEntry*, wxSortedArray_SortFunction&lt;const wxEventTableEntry*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-207'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-208'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-196' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-209'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-187' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-210'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-212' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-211'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseArray&lt;int, wxSortedArray_SortFunction&lt;int&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-213'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-214'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-199' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-215'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-190' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-216'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-218' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-217'/>
      </member-type>
    </class-decl>
    <class-decl name='wxArrayInt' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='858' column='1' id='type-id-219'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-213'/>
    </class-decl>
    <typedef-decl name='wxEventType' type-id='type-id-19' filepath='include/wx/event.h' line='77' column='1' id='type-id-220'/>
    <class-decl name='wxEventTypeTag&lt;wxCommandEvent&gt;' size-in-bits='32' visibility='default' filepath='include/wx/event.h' line='202' column='1' id='type-id-221'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_type' type-id='type-id-220' visibility='default' filepath='include/wx/event.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTypeTag&lt;wxDateEvent&gt;' size-in-bits='32' visibility='default' filepath='include/wx/event.h' line='202' column='1' id='type-id-222'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_type' type-id='type-id-220' visibility='default' filepath='include/wx/event.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTypeTag&lt;wxFocusEvent&gt;' size-in-bits='32' visibility='default' filepath='include/wx/event.h' line='202' column='1' id='type-id-223'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_type' type-id='type-id-220' visibility='default' filepath='include/wx/event.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTypeTag&lt;wxKeyEvent&gt;' size-in-bits='32' visibility='default' filepath='include/wx/event.h' line='202' column='1' id='type-id-224'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_type' type-id='type-id-220' visibility='default' filepath='include/wx/event.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTypeTag&lt;wxScrollEvent&gt;' size-in-bits='32' visibility='default' filepath='include/wx/event.h' line='202' column='1' id='type-id-225'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_type' type-id='type-id-220' visibility='default' filepath='include/wx/event.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTypeTag&lt;wxWindowCreateEvent&gt;' size-in-bits='32' visibility='default' filepath='include/wx/event.h' line='202' column='1' id='type-id-226'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_type' type-id='type-id-220' visibility='default' filepath='include/wx/event.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxObjectEventFunctor' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='258' column='1' id='type-id-227'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-228'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-229' visibility='default' filepath='include/wx/event.h' line='288' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxObjectEventFunctorclEP12wxEvtHandlerR7wxEvent' filepath='include/wx/event.h' line='4105' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-230' is-artificial='yes'/>
          <parameter type-id='type-id-229'/>
          <parameter type-id='type-id-231'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxObjectEventFunctor10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-232' is-artificial='yes'/>
          <parameter type-id='type-id-233'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxObjectEventFunctor13GetEvtHandlerEv' filepath='include/wx/event.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-232' is-artificial='yes'/>
          <return type-id='type-id-229'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxObjectEventFunctor12GetEvtMethodEv' filepath='include/wx/event.h' line='284' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-232' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEventFunctorMethod&lt;wxEventTypeTag&lt;wxFocusEvent&gt;, wxCompositeWindow&lt;wxNavigationEnabled&lt;wxDatePickerCtrlCommonBase&lt;wxDateTimePickerCtrlBase&gt; &gt; &gt;, wxFocusEvent, wxCompositeWindow&lt;wxNavigationEnabled&lt;wxDatePickerCtrlCommonBase&lt;wxDateTimePickerCtrlBase&gt; &gt; &gt; &gt;' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='392' column='1' id='type-id-234'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-228'/>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-235'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-131' visibility='default' filepath='include/wx/event.h' line='461' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxEventFunctorMethodI14wxEventTypeTagI12wxFocusEventE17wxCompositeWindowI19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEEES1_S9_EclEP12wxEvtHandlerR7wxEvent' filepath='include/wx/event.h' line='422' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-236' is-artificial='yes'/>
          <parameter type-id='type-id-229'/>
          <parameter type-id='type-id-231'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI12wxFocusEventE17wxCompositeWindowI19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEEES1_S9_E10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='439' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-237' is-artificial='yes'/>
          <parameter type-id='type-id-233'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI12wxFocusEventE17wxCompositeWindowI19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEEES1_S9_E13GetEvtHandlerEv' filepath='include/wx/event.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-237' is-artificial='yes'/>
          <return type-id='type-id-229'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI12wxFocusEventE17wxCompositeWindowI19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEEES1_S9_E12GetEvtMethodEv' filepath='include/wx/event.h' line='457' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-237' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEventFunctorMethod&lt;wxEventTypeTag&lt;wxKeyEvent&gt;, wxCompositeWindow&lt;wxNavigationEnabled&lt;wxDatePickerCtrlCommonBase&lt;wxDateTimePickerCtrlBase&gt; &gt; &gt;, wxKeyEvent, wxCompositeWindow&lt;wxNavigationEnabled&lt;wxDatePickerCtrlCommonBase&lt;wxDateTimePickerCtrlBase&gt; &gt; &gt; &gt;' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='392' column='1' id='type-id-238'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-228'/>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-239'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-131' visibility='default' filepath='include/wx/event.h' line='461' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxEventFunctorMethodI14wxEventTypeTagI10wxKeyEventE17wxCompositeWindowI19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEEES1_S9_EclEP12wxEvtHandlerR7wxEvent' filepath='include/wx/event.h' line='422' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-240' is-artificial='yes'/>
          <parameter type-id='type-id-229'/>
          <parameter type-id='type-id-231'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI10wxKeyEventE17wxCompositeWindowI19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEEES1_S9_E10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='439' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-241' is-artificial='yes'/>
          <parameter type-id='type-id-233'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI10wxKeyEventE17wxCompositeWindowI19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEEES1_S9_E13GetEvtHandlerEv' filepath='include/wx/event.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-241' is-artificial='yes'/>
          <return type-id='type-id-229'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI10wxKeyEventE17wxCompositeWindowI19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEEES1_S9_E12GetEvtMethodEv' filepath='include/wx/event.h' line='457' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-241' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEventFunctorMethod&lt;wxEventTypeTag&lt;wxWindowCreateEvent&gt;, wxCompositeWindow&lt;wxNavigationEnabled&lt;wxDatePickerCtrlCommonBase&lt;wxDateTimePickerCtrlBase&gt; &gt; &gt;, wxWindowCreateEvent, wxCompositeWindow&lt;wxNavigationEnabled&lt;wxDatePickerCtrlCommonBase&lt;wxDateTimePickerCtrlBase&gt; &gt; &gt; &gt;' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='392' column='1' id='type-id-242'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-228'/>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-243'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-131' visibility='default' filepath='include/wx/event.h' line='461' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxEventFunctorMethodI14wxEventTypeTagI19wxWindowCreateEventE17wxCompositeWindowI19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEEES1_S9_EclEP12wxEvtHandlerR7wxEvent' filepath='include/wx/event.h' line='422' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-244' is-artificial='yes'/>
          <parameter type-id='type-id-229'/>
          <parameter type-id='type-id-231'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI19wxWindowCreateEventE17wxCompositeWindowI19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEEES1_S9_E10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='439' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-245' is-artificial='yes'/>
          <parameter type-id='type-id-233'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI19wxWindowCreateEventE17wxCompositeWindowI19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEEES1_S9_E13GetEvtHandlerEv' filepath='include/wx/event.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-245' is-artificial='yes'/>
          <return type-id='type-id-229'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI19wxWindowCreateEventE17wxCompositeWindowI19wxNavigationEnabledI26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseEEES1_S9_E12GetEvtMethodEv' filepath='include/wx/event.h' line='457' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-245' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='wxEventCategory' filepath='include/wx/event.h' line='911' column='1' id='type-id-246'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxEVT_CATEGORY_UI' value='1'/>
      <enumerator name='wxEVT_CATEGORY_USER_INPUT' value='2'/>
      <enumerator name='wxEVT_CATEGORY_SOCKET' value='4'/>
      <enumerator name='wxEVT_CATEGORY_TIMER' value='8'/>
      <enumerator name='wxEVT_CATEGORY_THREAD' value='16'/>
      <enumerator name='wxEVT_CATEGORY_UNKNOWN' value='32'/>
      <enumerator name='wxEVT_CATEGORY_CLIPBOARD' value='64'/>
      <enumerator name='wxEVT_CATEGORY_NATIVE_EVENTS' value='3'/>
      <enumerator name='wxEVT_CATEGORY_ALL' value='127'/>
    </enum-decl>
    <class-decl name='wxEventObjectOriginSetter' size-in-bits='192' visibility='default' filepath='include/wx/event.h' line='1203' column='1' id='type-id-247'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_event' type-id='type-id-231' visibility='default' filepath='include/wx/event.h' line='1222' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_sourceOrig' type-id='type-id-248' visibility='default' filepath='include/wx/event.h' line='1223' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_idOrig' type-id='type-id-249' visibility='default' filepath='include/wx/event.h' line='1224' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTableEntryBase' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3469' column='1' id='type-id-250'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_id' type-id='type-id-19' visibility='default' filepath='include/wx/event.h' line='3504' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='m_lastId' type-id='type-id-19' visibility='default' filepath='include/wx/event.h' line='3505' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='m_fn' type-id='type-id-251' visibility='default' filepath='include/wx/event.h' line='3508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='m_callbackUserData' type-id='type-id-252' visibility='default' filepath='include/wx/event.h' line='3511' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTableEntry' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3518' column='1' id='type-id-253'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-250'/>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_eventType' type-id='type-id-254' visibility='default' filepath='include/wx/event.h' line='3532' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxDynamicEventTableEntry' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3539' column='1' id='type-id-255'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-250'/>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_eventType' type-id='type-id-19' visibility='default' filepath='include/wx/event.h' line='3550' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTable' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3560' column='1' id='type-id-256'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='baseTable' type-id='type-id-257' visibility='default' filepath='include/wx/event.h' line='3562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='entries' type-id='type-id-258' visibility='default' filepath='include/wx/event.h' line='3563' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTableEntryPointerArray' size-in-bits='192' visibility='default' filepath='include/wx/event.h' line='3570' column='1' id='type-id-259'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-207'/>
    </class-decl>
    <class-decl name='wxEventHashTable' size-in-bits='384' visibility='default' filepath='include/wx/event.h' line='3572' column='1' id='type-id-260'>
      <member-type access='private'>
        <class-decl name='EventTypeTable' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3576' column='1' id='type-id-261'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='eventType' type-id='type-id-220' visibility='default' filepath='include/wx/event.h' line='3578' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='eventEntryTable' type-id='type-id-259' visibility='default' filepath='include/wx/event.h' line='3579' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='EventTypeTablePointer' type-id='type-id-263' filepath='include/wx/event.h' line='3581' column='1' id='type-id-262'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_table' type-id='type-id-264' visibility='default' filepath='include/wx/event.h' line='3617' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_rebuildHash' type-id='type-id-3' visibility='default' filepath='include/wx/event.h' line='3618' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_size' type-id='type-id-71' visibility='default' filepath='include/wx/event.h' line='3620' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_eventTypeTable' type-id='type-id-265' visibility='default' filepath='include/wx/event.h' line='3621' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='256'>
        <var-decl name='m_previous' type-id='type-id-266' visibility='default' filepath='include/wx/event.h' line='3624' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='320'>
        <var-decl name='m_next' type-id='type-id-266' visibility='default' filepath='include/wx/event.h' line='3625' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxFile' size-in-bits='64' visibility='default' filepath='include/wx/file.h' line='30' column='1' id='type-id-267'>
      <member-type access='public'>
        <enum-decl name='OpenMode' filepath='include/wx/file.h' line='39' column='1' id='type-id-268'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='read' value='0'/>
          <enumerator name='write' value='1'/>
          <enumerator name='read_write' value='2'/>
          <enumerator name='write_append' value='3'/>
          <enumerator name='write_excl' value='4'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_fd' type-id='type-id-19' visibility='default' filepath='include/wx/file.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='m_lasterror' type-id='type-id-19' visibility='default' filepath='include/wx/file.h' line='132' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxSeekMode' filepath='include/wx/filefn.h' line='55' column='1' id='type-id-269'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxFromStart' value='0'/>
      <enumerator name='wxFromCurrent' value='1'/>
      <enumerator name='wxFromEnd' value='2'/>
    </enum-decl>
    <enum-decl name='wxFileKind' filepath='include/wx/filefn.h' line='62' column='1' id='type-id-270'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxFILE_KIND_UNKNOWN' value='0'/>
      <enumerator name='wxFILE_KIND_DISK' value='1'/>
      <enumerator name='wxFILE_KIND_TERMINAL' value='2'/>
      <enumerator name='wxFILE_KIND_PIPE' value='3'/>
    </enum-decl>
    <typedef-decl name='wxFileOffset' type-id='type-id-271' filepath='include/wx/filefn.h' line='343' column='1' id='type-id-272'/>
    <enum-decl name='wxPathFormat' filepath='include/wx/filename.h' line='42' column='1' id='type-id-273'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxPATH_NATIVE' value='0'/>
      <enumerator name='wxPATH_UNIX' value='1'/>
      <enumerator name='wxPATH_BEOS' value='1'/>
      <enumerator name='wxPATH_MAC' value='2'/>
      <enumerator name='wxPATH_DOS' value='3'/>
      <enumerator name='wxPATH_WIN' value='3'/>
      <enumerator name='wxPATH_OS2' value='3'/>
      <enumerator name='wxPATH_VMS' value='4'/>
      <enumerator name='wxPATH_MAX' value='5'/>
    </enum-decl>
    <enum-decl name='wxSizeConvention' filepath='include/wx/filename.h' line='57' column='1' id='type-id-274'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxSIZE_CONV_TRADITIONAL' value='0'/>
      <enumerator name='wxSIZE_CONV_IEC' value='1'/>
      <enumerator name='wxSIZE_CONV_SI' value='2'/>
    </enum-decl>
    <class-decl name='wxFileName' size-in-bits='1536' visibility='default' filepath='include/wx/filename.h' line='136' column='1' id='type-id-275'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_volume' type-id='type-id-61' visibility='default' filepath='include/wx/filename.h' line='644' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_dirs' type-id='type-id-55' visibility='default' filepath='include/wx/filename.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='704'>
        <var-decl name='m_name' type-id='type-id-61' visibility='default' filepath='include/wx/filename.h' line='650' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1088'>
        <var-decl name='m_ext' type-id='type-id-61' visibility='default' filepath='include/wx/filename.h' line='651' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1472'>
        <var-decl name='m_relative' type-id='type-id-3' visibility='default' filepath='include/wx/filename.h' line='661' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1480'>
        <var-decl name='m_hasExt' type-id='type-id-3' visibility='default' filepath='include/wx/filename.h' line='668' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1488'>
        <var-decl name='m_dontFollowLinks' type-id='type-id-3' visibility='default' filepath='include/wx/filename.h' line='673' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxFontFamily' filepath='include/wx/font.h' line='38' column='1' id='type-id-276'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxFONTFAMILY_DEFAULT' value='70'/>
      <enumerator name='wxFONTFAMILY_DECORATIVE' value='71'/>
      <enumerator name='wxFONTFAMILY_ROMAN' value='72'/>
      <enumerator name='wxFONTFAMILY_SCRIPT' value='73'/>
      <enumerator name='wxFONTFAMILY_SWISS' value='74'/>
      <enumerator name='wxFONTFAMILY_MODERN' value='75'/>
      <enumerator name='wxFONTFAMILY_TELETYPE' value='76'/>
      <enumerator name='wxFONTFAMILY_MAX' value='77'/>
      <enumerator name='wxFONTFAMILY_UNKNOWN' value='77'/>
    </enum-decl>
    <enum-decl name='wxFontStyle' filepath='include/wx/font.h' line='52' column='1' id='type-id-277'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxFONTSTYLE_NORMAL' value='90'/>
      <enumerator name='wxFONTSTYLE_ITALIC' value='93'/>
      <enumerator name='wxFONTSTYLE_SLANT' value='94'/>
      <enumerator name='wxFONTSTYLE_MAX' value='95'/>
    </enum-decl>
    <enum-decl name='wxFontWeight' filepath='include/wx/font.h' line='61' column='1' id='type-id-278'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxFONTWEIGHT_INVALID' value='0'/>
      <enumerator name='wxFONTWEIGHT_THIN' value='100'/>
      <enumerator name='wxFONTWEIGHT_EXTRALIGHT' value='200'/>
      <enumerator name='wxFONTWEIGHT_LIGHT' value='300'/>
      <enumerator name='wxFONTWEIGHT_NORMAL' value='400'/>
      <enumerator name='wxFONTWEIGHT_MEDIUM' value='500'/>
      <enumerator name='wxFONTWEIGHT_SEMIBOLD' value='600'/>
      <enumerator name='wxFONTWEIGHT_BOLD' value='700'/>
      <enumerator name='wxFONTWEIGHT_EXTRABOLD' value='800'/>
      <enumerator name='wxFONTWEIGHT_HEAVY' value='900'/>
      <enumerator name='wxFONTWEIGHT_EXTRAHEAVY' value='1000'/>
      <enumerator name='wxFONTWEIGHT_MAX' value='1000'/>
    </enum-decl>
    <class-decl name='wxFontDialogBase' size-in-bits='9344' visibility='default' filepath='include/wx/fontdlg.h' line='25' column='1' id='type-id-279'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-280'/>
      <data-member access='protected' layout-offset-in-bits='8128'>
        <var-decl name='m_fontData' type-id='type-id-281' visibility='default' filepath='include/wx/fontdlg.h' line='49' column='1'/>
      </data-member>
      <member-function access='protected' vtable-offset='252'>
        <function-decl name='DoCreate' mangled-name='_ZN16wxFontDialogBase8DoCreateEP8wxWindow' filepath='include/wx/fontdlg.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-282' is-artificial='yes'/>
          <parameter type-id='type-id-283'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='wxFontEncoding' filepath='include/wx/fontenc.h' line='15' column='1' id='type-id-284'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxFONTENCODING_SYSTEM' value='-1'/>
      <enumerator name='wxFONTENCODING_DEFAULT' value='0'/>
      <enumerator name='wxFONTENCODING_ISO8859_1' value='1'/>
      <enumerator name='wxFONTENCODING_ISO8859_2' value='2'/>
      <enumerator name='wxFONTENCODING_ISO8859_3' value='3'/>
      <enumerator name='wxFONTENCODING_ISO8859_4' value='4'/>
      <enumerator name='wxFONTENCODING_ISO8859_5' value='5'/>
      <enumerator name='wxFONTENCODING_ISO8859_6' value='6'/>
      <enumerator name='wxFONTENCODING_ISO8859_7' value='7'/>
      <enumerator name='wxFONTENCODING_ISO8859_8' value='8'/>
      <enumerator name='wxFONTENCODING_ISO8859_9' value='9'/>
      <enumerator name='wxFONTENCODING_ISO8859_10' value='10'/>
      <enumerator name='wxFONTENCODING_ISO8859_11' value='11'/>
      <enumerator name='wxFONTENCODING_ISO8859_12' value='12'/>
      <enumerator name='wxFONTENCODING_ISO8859_13' value='13'/>
      <enumerator name='wxFONTENCODING_ISO8859_14' value='14'/>
      <enumerator name='wxFONTENCODING_ISO8859_15' value='15'/>
      <enumerator name='wxFONTENCODING_ISO8859_MAX' value='16'/>
      <enumerator name='wxFONTENCODING_KOI8' value='17'/>
      <enumerator name='wxFONTENCODING_KOI8_U' value='18'/>
      <enumerator name='wxFONTENCODING_ALTERNATIVE' value='19'/>
      <enumerator name='wxFONTENCODING_BULGARIAN' value='20'/>
      <enumerator name='wxFONTENCODING_CP437' value='21'/>
      <enumerator name='wxFONTENCODING_CP850' value='22'/>
      <enumerator name='wxFONTENCODING_CP852' value='23'/>
      <enumerator name='wxFONTENCODING_CP855' value='24'/>
      <enumerator name='wxFONTENCODING_CP866' value='25'/>
      <enumerator name='wxFONTENCODING_CP874' value='26'/>
      <enumerator name='wxFONTENCODING_CP932' value='27'/>
      <enumerator name='wxFONTENCODING_CP936' value='28'/>
      <enumerator name='wxFONTENCODING_CP949' value='29'/>
      <enumerator name='wxFONTENCODING_CP950' value='30'/>
      <enumerator name='wxFONTENCODING_CP1250' value='31'/>
      <enumerator name='wxFONTENCODING_CP1251' value='32'/>
      <enumerator name='wxFONTENCODING_CP1252' value='33'/>
      <enumerator name='wxFONTENCODING_CP1253' value='34'/>
      <enumerator name='wxFONTENCODING_CP1254' value='35'/>
      <enumerator name='wxFONTENCODING_CP1255' value='36'/>
      <enumerator name='wxFONTENCODING_CP1256' value='37'/>
      <enumerator name='wxFONTENCODING_CP1257' value='38'/>
      <enumerator name='wxFONTENCODING_CP1258' value='39'/>
      <enumerator name='wxFONTENCODING_CP1361' value='40'/>
      <enumerator name='wxFONTENCODING_CP12_MAX' value='41'/>
      <enumerator name='wxFONTENCODING_UTF7' value='42'/>
      <enumerator name='wxFONTENCODING_UTF8' value='43'/>
      <enumerator name='wxFONTENCODING_EUC_JP' value='44'/>
      <enumerator name='wxFONTENCODING_UTF16BE' value='45'/>
      <enumerator name='wxFONTENCODING_UTF16LE' value='46'/>
      <enumerator name='wxFONTENCODING_UTF32BE' value='47'/>
      <enumerator name='wxFONTENCODING_UTF32LE' value='48'/>
      <enumerator name='wxFONTENCODING_MACROMAN' value='49'/>
      <enumerator name='wxFONTENCODING_MACJAPANESE' value='50'/>
      <enumerator name='wxFONTENCODING_MACCHINESETRAD' value='51'/>
      <enumerator name='wxFONTENCODING_MACKOREAN' value='52'/>
      <enumerator name='wxFONTENCODING_MACARABIC' value='53'/>
      <enumerator name='wxFONTENCODING_MACHEBREW' value='54'/>
      <enumerator name='wxFONTENCODING_MACGREEK' value='55'/>
      <enumerator name='wxFONTENCODING_MACCYRILLIC' value='56'/>
      <enumerator name='wxFONTENCODING_MACDEVANAGARI' value='57'/>
      <enumerator name='wxFONTENCODING_MACGURMUKHI' value='58'/>
      <enumerator name='wxFONTENCODING_MACGUJARATI' value='59'/>
      <enumerator name='wxFONTENCODING_MACORIYA' value='60'/>
      <enumerator name='wxFONTENCODING_MACBENGALI' value='61'/>
      <enumerator name='wxFONTENCODING_MACTAMIL' value='62'/>
      <enumerator name='wxFONTENCODING_MACTELUGU' value='63'/>
      <enumerator name='wxFONTENCODING_MACKANNADA' value='64'/>
      <enumerator name='wxFONTENCODING_MACMALAJALAM' value='65'/>
      <enumerator name='wxFONTENCODING_MACSINHALESE' value='66'/>
      <enumerator name='wxFONTENCODING_MACBURMESE' value='67'/>
      <enumerator name='wxFONTENCODING_MACKHMER' value='68'/>
      <enumerator name='wxFONTENCODING_MACTHAI' value='69'/>
      <enumerator name='wxFONTENCODING_MACLAOTIAN' value='70'/>
      <enumerator name='wxFONTENCODING_MACGEORGIAN' value='71'/>
      <enumerator name='wxFONTENCODING_MACARMENIAN' value='72'/>
      <enumerator name='wxFONTENCODING_MACCHINESESIMP' value='73'/>
      <enumerator name='wxFONTENCODING_MACTIBETAN' value='74'/>
      <enumerator name='wxFONTENCODING_MACMONGOLIAN' value='75'/>
      <enumerator name='wxFONTENCODING_MACETHIOPIC' value='76'/>
      <enumerator name='wxFONTENCODING_MACCENTRALEUR' value='77'/>
      <enumerator name='wxFONTENCODING_MACVIATNAMESE' value='78'/>
      <enumerator name='wxFONTENCODING_MACARABICEXT' value='79'/>
      <enumerator name='wxFONTENCODING_MACSYMBOL' value='80'/>
      <enumerator name='wxFONTENCODING_MACDINGBATS' value='81'/>
      <enumerator name='wxFONTENCODING_MACTURKISH' value='82'/>
      <enumerator name='wxFONTENCODING_MACCROATIAN' value='83'/>
      <enumerator name='wxFONTENCODING_MACICELANDIC' value='84'/>
      <enumerator name='wxFONTENCODING_MACROMANIAN' value='85'/>
      <enumerator name='wxFONTENCODING_MACCELTIC' value='86'/>
      <enumerator name='wxFONTENCODING_MACGAELIC' value='87'/>
      <enumerator name='wxFONTENCODING_MACKEYBOARD' value='88'/>
      <enumerator name='wxFONTENCODING_ISO2022_JP' value='89'/>
      <enumerator name='wxFONTENCODING_MAX' value='90'/>
      <enumerator name='wxFONTENCODING_MACMIN' value='49'/>
      <enumerator name='wxFONTENCODING_MACMAX' value='88'/>
      <enumerator name='wxFONTENCODING_UTF16' value='46'/>
      <enumerator name='wxFONTENCODING_UTF32' value='48'/>
      <enumerator name='wxFONTENCODING_UNICODE' value='48'/>
      <enumerator name='wxFONTENCODING_GB2312' value='28'/>
      <enumerator name='wxFONTENCODING_BIG5' value='30'/>
      <enumerator name='wxFONTENCODING_SHIFT_JIS' value='27'/>
      <enumerator name='wxFONTENCODING_EUC_KR' value='29'/>
      <enumerator name='wxFONTENCODING_JOHAB' value='40'/>
      <enumerator name='wxFONTENCODING_VIETNAMESE' value='39'/>
    </enum-decl>
    <enum-decl name='wxBitmapType' filepath='include/wx/gdicmn.h' line='47' column='1' id='type-id-285'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxBITMAP_TYPE_INVALID' value='0'/>
      <enumerator name='wxBITMAP_TYPE_BMP' value='1'/>
      <enumerator name='wxBITMAP_TYPE_BMP_RESOURCE' value='2'/>
      <enumerator name='wxBITMAP_TYPE_RESOURCE' value='2'/>
      <enumerator name='wxBITMAP_TYPE_ICO' value='3'/>
      <enumerator name='wxBITMAP_TYPE_ICO_RESOURCE' value='4'/>
      <enumerator name='wxBITMAP_TYPE_CUR' value='5'/>
      <enumerator name='wxBITMAP_TYPE_CUR_RESOURCE' value='6'/>
      <enumerator name='wxBITMAP_TYPE_XBM' value='7'/>
      <enumerator name='wxBITMAP_TYPE_XBM_DATA' value='8'/>
      <enumerator name='wxBITMAP_TYPE_XPM' value='9'/>
      <enumerator name='wxBITMAP_TYPE_XPM_DATA' value='10'/>
      <enumerator name='wxBITMAP_TYPE_TIFF' value='11'/>
      <enumerator name='wxBITMAP_TYPE_TIF' value='11'/>
      <enumerator name='wxBITMAP_TYPE_TIFF_RESOURCE' value='12'/>
      <enumerator name='wxBITMAP_TYPE_TIF_RESOURCE' value='12'/>
      <enumerator name='wxBITMAP_TYPE_GIF' value='13'/>
      <enumerator name='wxBITMAP_TYPE_GIF_RESOURCE' value='14'/>
      <enumerator name='wxBITMAP_TYPE_PNG' value='15'/>
      <enumerator name='wxBITMAP_TYPE_PNG_RESOURCE' value='16'/>
      <enumerator name='wxBITMAP_TYPE_JPEG' value='17'/>
      <enumerator name='wxBITMAP_TYPE_JPEG_RESOURCE' value='18'/>
      <enumerator name='wxBITMAP_TYPE_PNM' value='19'/>
      <enumerator name='wxBITMAP_TYPE_PNM_RESOURCE' value='20'/>
      <enumerator name='wxBITMAP_TYPE_PCX' value='21'/>
      <enumerator name='wxBITMAP_TYPE_PCX_RESOURCE' value='22'/>
      <enumerator name='wxBITMAP_TYPE_PICT' value='23'/>
      <enumerator name='wxBITMAP_TYPE_PICT_RESOURCE' value='24'/>
      <enumerator name='wxBITMAP_TYPE_ICON' value='25'/>
      <enumerator name='wxBITMAP_TYPE_ICON_RESOURCE' value='26'/>
      <enumerator name='wxBITMAP_TYPE_ANI' value='27'/>
      <enumerator name='wxBITMAP_TYPE_IFF' value='28'/>
      <enumerator name='wxBITMAP_TYPE_TGA' value='29'/>
      <enumerator name='wxBITMAP_TYPE_MACCURSOR' value='30'/>
      <enumerator name='wxBITMAP_TYPE_MACCURSOR_RESOURCE' value='31'/>
      <enumerator name='wxBITMAP_TYPE_MAX' value='32'/>
      <enumerator name='wxBITMAP_TYPE_ANY' value='50'/>
    </enum-decl>
    <enum-decl name='wxStockCursor' filepath='include/wx/gdicmn.h' line='97' column='1' id='type-id-286'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxCURSOR_NONE' value='0'/>
      <enumerator name='wxCURSOR_ARROW' value='1'/>
      <enumerator name='wxCURSOR_RIGHT_ARROW' value='2'/>
      <enumerator name='wxCURSOR_BULLSEYE' value='3'/>
      <enumerator name='wxCURSOR_CHAR' value='4'/>
      <enumerator name='wxCURSOR_CROSS' value='5'/>
      <enumerator name='wxCURSOR_HAND' value='6'/>
      <enumerator name='wxCURSOR_IBEAM' value='7'/>
      <enumerator name='wxCURSOR_LEFT_BUTTON' value='8'/>
      <enumerator name='wxCURSOR_MAGNIFIER' value='9'/>
      <enumerator name='wxCURSOR_MIDDLE_BUTTON' value='10'/>
      <enumerator name='wxCURSOR_NO_ENTRY' value='11'/>
      <enumerator name='wxCURSOR_PAINT_BRUSH' value='12'/>
      <enumerator name='wxCURSOR_PENCIL' value='13'/>
      <enumerator name='wxCURSOR_POINT_LEFT' value='14'/>
      <enumerator name='wxCURSOR_POINT_RIGHT' value='15'/>
      <enumerator name='wxCURSOR_QUESTION_ARROW' value='16'/>
      <enumerator name='wxCURSOR_RIGHT_BUTTON' value='17'/>
      <enumerator name='wxCURSOR_SIZENESW' value='18'/>
      <enumerator name='wxCURSOR_SIZENS' value='19'/>
      <enumerator name='wxCURSOR_SIZENWSE' value='20'/>
      <enumerator name='wxCURSOR_SIZEWE' value='21'/>
      <enumerator name='wxCURSOR_SIZING' value='22'/>
      <enumerator name='wxCURSOR_SPRAYCAN' value='23'/>
      <enumerator name='wxCURSOR_WAIT' value='24'/>
      <enumerator name='wxCURSOR_WATCH' value='25'/>
      <enumerator name='wxCURSOR_BLANK' value='26'/>
      <enumerator name='wxCURSOR_DEFAULT' value='27'/>
      <enumerator name='wxCURSOR_ARROWWAIT' value='28'/>
      <enumerator name='wxCURSOR_MAX' value='29'/>
    </enum-decl>
    <class-decl name='wxSize' size-in-bits='64' visibility='default' filepath='include/wx/gdicmn.h' line='282' column='1' id='type-id-287'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='286' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRealPoint' size-in-bits='128' visibility='default' filepath='include/wx/gdicmn.h' line='459' column='1' id='type-id-288'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-17' visibility='default' filepath='include/wx/gdicmn.h' line='462' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='y' type-id='type-id-17' visibility='default' filepath='include/wx/gdicmn.h' line='463' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxPoint' size-in-bits='64' visibility='default' filepath='include/wx/gdicmn.h' line='577' column='1' id='type-id-144'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='580' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='580' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRect' size-in-bits='128' visibility='default' filepath='include/wx/gdicmn.h' line='733' column='1' id='type-id-289'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='width' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='height' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxGDIRefData' size-in-bits='128' visibility='default' filepath='include/wx/gdiobj.h' line='22' column='1' id='type-id-290'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-291'/>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='IsOk' mangled-name='_ZNK12wxGDIRefData4IsOkEv' filepath='include/wx/gdiobj.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-292' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='GdkEventKey' type-id='type-id-293' filepath='include/wx/gtk/window.h' line='25' column='1' id='type-id-294'/>
    <class-decl name='wxArrayGdkWindows' size-in-bits='192' visibility='default' filepath='include/wx/gtk/window.h' line='28' column='1' id='type-id-295'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-201'/>
    </class-decl>
    <class-decl name='_wxHashTable_NodeBase' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='68' column='1' id='type-id-296'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_next' type-id='type-id-297' visibility='default' filepath='include/wx/hashmap.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_wxHashTableBase2' size-in-bits='8' visibility='default' filepath='include/wx/hashmap.h' line='80' column='1' id='type-id-298'>
      <member-type access='public'>
        <typedef-decl name='NodeDtor' type-id='type-id-300' filepath='include/wx/hashmap.h' line='83' column='1' id='type-id-299'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='BucketFromNode' type-id='type-id-302' filepath='include/wx/hashmap.h' line='84' column='1' id='type-id-301'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='ProcessNode' type-id='type-id-304' filepath='include/wx/hashmap.h' line='85' column='1' id='type-id-303'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringHash' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='566' column='1' id='type-id-305'/>
    <class-decl name='wxStringEqual' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='589' column='1' id='type-id-306'/>
    <enum-decl name='wxImageResizeQuality' filepath='include/wx/image.h' line='61' column='1' id='type-id-307'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxIMAGE_QUALITY_NEAREST' value='0'/>
      <enumerator name='wxIMAGE_QUALITY_BILINEAR' value='1'/>
      <enumerator name='wxIMAGE_QUALITY_BICUBIC' value='2'/>
      <enumerator name='wxIMAGE_QUALITY_BOX_AVERAGE' value='3'/>
      <enumerator name='wxIMAGE_QUALITY_NORMAL' value='0'/>
      <enumerator name='wxIMAGE_QUALITY_HIGH' value='4'/>
    </enum-decl>
    <union-decl name='wxListKeyValue' size-in-bits='64' visibility='default' filepath='include/wx/list.h' line='320' column='1' id='type-id-308'>
      <data-member access='public'>
        <var-decl name='integer' type-id='type-id-21' visibility='default' filepath='include/wx/list.h' line='322' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='string' type-id='type-id-86' visibility='default' filepath='include/wx/list.h' line='323' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='wxListKey' size-in-bits='128' visibility='default' filepath='include/wx/list.h' line='332' column='1' id='type-id-309'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_keyType' type-id='type-id-169' visibility='default' filepath='include/wx/list.h' line='369' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_key' type-id='type-id-308' visibility='default' filepath='include/wx/list.h' line='370' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxObjectList' size-in-bits='384' visibility='default' filepath='include/wx/list.h' line='1164' column='1' id='type-id-310'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-311'/>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/list.h' line='1164' column='1' id='type-id-312'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-314' filepath='include/wx/list.h' line='1164' column='1' id='type-id-313'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-312' filepath='include/wx/list.h' line='1164' column='1' id='type-id-315'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-317' filepath='include/wx/list.h' line='1164' column='1' id='type-id-316'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-316' filepath='include/wx/list.h' line='1164' column='1' id='type-id-318'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-252' filepath='include/wx/list.h' line='1164' column='1' id='type-id-319'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-320' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-320' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_reverse_iterator' size-in-bits='128' visibility='default' filepath='include/wx/list.h' line='1164' column='1' id='type-id-321'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-314' filepath='include/wx/list.h' line='1164' column='1' id='type-id-322'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-321' filepath='include/wx/list.h' line='1164' column='1' id='type-id-323'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-325' filepath='include/wx/list.h' line='1164' column='1' id='type-id-324'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-324' filepath='include/wx/list.h' line='1164' column='1' id='type-id-326'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-252' filepath='include/wx/list.h' line='1164' column='1' id='type-id-327'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-328' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-328' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='128' visibility='default' filepath='include/wx/list.h' line='1164' column='1' id='type-id-329'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-314' filepath='include/wx/list.h' line='1164' column='1' id='type-id-330'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-329' filepath='include/wx/list.h' line='1164' column='1' id='type-id-331'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='pointer' type-id='type-id-333' filepath='include/wx/list.h' line='1164' column='1' id='type-id-332'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='pointer_type' type-id='type-id-332' filepath='include/wx/list.h' line='1164' column='1' id='type-id-334'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-336' filepath='include/wx/list.h' line='1164' column='1' id='type-id-335'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-335' filepath='include/wx/list.h' line='1164' column='1' id='type-id-337'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-252' filepath='include/wx/list.h' line='1164' column='1' id='type-id-338'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-339' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-339' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator' size-in-bits='128' visibility='default' filepath='include/wx/list.h' line='1164' column='1' id='type-id-340'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-314' filepath='include/wx/list.h' line='1164' column='1' id='type-id-341'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-340' filepath='include/wx/list.h' line='1164' column='1' id='type-id-342'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-344' filepath='include/wx/list.h' line='1164' column='1' id='type-id-343'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-343' filepath='include/wx/list.h' line='1164' column='1' id='type-id-345'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-252' filepath='include/wx/list.h' line='1164' column='1' id='type-id-346'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-347' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-347' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-349' filepath='include/wx/list.h' line='1164' column='1' id='type-id-348'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-351' filepath='include/wx/list.h' line='1164' column='1' id='type-id-350'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-71' filepath='include/wx/list.h' line='1164' column='1' id='type-id-352'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-252' filepath='include/wx/list.h' line='1164' column='1' id='type-id-353'/>
      </member-type>
      <member-function access='protected' vtable-offset='2'>
        <function-decl name='CreateNode' mangled-name='_ZN12wxObjectList10CreateNodeEP10wxNodeBaseS1_PvRK9wxListKey' filepath='include/wx/list.h' line='1164' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-354' is-artificial='yes'/>
          <parameter type-id='type-id-355'/>
          <parameter type-id='type-id-355'/>
          <parameter type-id='type-id-16'/>
          <parameter type-id='type-id-356'/>
          <return type-id='type-id-355'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='Find' mangled-name='_ZNK12wxObjectList4FindERK9wxListKey' filepath='include/wx/list.h' line='1164' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-357' is-artificial='yes'/>
          <parameter type-id='type-id-356'/>
          <return type-id='type-id-358'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='wxSortFuncFor_wxObjectList' type-id='type-id-359' filepath='include/wx/list.h' line='1164' column='1' id='type-id-360'/>
    <class-decl name='wxList' size-in-bits='384' visibility='default' filepath='include/wx/list.h' line='1167' column='1' id='type-id-361'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-310'/>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxList' mangled-name='_ZN6wxListD4Ev' filepath='include/wx/list.h' line='1178' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-362' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='wxLayoutDirection' filepath='include/wx/localedefs.h' line='20' column='1' id='type-id-122'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxLayout_Default' value='0'/>
      <enumerator name='wxLayout_LeftToRight' value='1'/>
      <enumerator name='wxLayout_RightToLeft' value='2'/>
    </enum-decl>
    <typedef-decl name='wxLongLong' type-id='type-id-363' filepath='include/wx/longlong.h' line='90' column='1' id='type-id-161'/>
    <typedef-decl name='wxULongLong' type-id='type-id-364' filepath='include/wx/longlong.h' line='91' column='1' id='type-id-365'/>
    <class-decl name='wxLongLongNative' size-in-bits='64' visibility='default' filepath='include/wx/longlong.h' line='106' column='1' id='type-id-363'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_ll' type-id='type-id-22' visibility='default' filepath='include/wx/longlong.h' line='343' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxULongLongNative' size-in-bits='64' visibility='default' filepath='include/wx/longlong.h' line='347' column='1' id='type-id-364'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_ll' type-id='type-id-23' visibility='default' filepath='include/wx/longlong.h' line='562' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxNonOwnedWindowBase' size-in-bits='5312' visibility='default' filepath='include/wx/nonownedwnd.h' line='25' column='1' id='type-id-366'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-367'/>
      <member-function access='public' vtable-offset='151'>
        <function-decl name='InheritAttributes' mangled-name='_ZN20wxNonOwnedWindowBase17InheritAttributesEv' filepath='include/wx/nonownedwnd.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-368' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='185'>
        <function-decl name='AdjustForParentClientOrigin' mangled-name='_ZNK20wxNonOwnedWindowBase27AdjustForParentClientOriginERiS0_i' filepath='include/wx/nonownedwnd.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-369' is-artificial='yes'/>
          <parameter type-id='type-id-370'/>
          <parameter type-id='type-id-370'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='206'>
        <function-decl name='DoClearShape' mangled-name='_ZN20wxNonOwnedWindowBase12DoClearShapeEv' filepath='include/wx/nonownedwnd.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-368' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='207'>
        <function-decl name='DoSetRegionShape' mangled-name='_ZN20wxNonOwnedWindowBase16DoSetRegionShapeERK8wxRegion' filepath='include/wx/nonownedwnd.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-368' is-artificial='yes'/>
          <parameter type-id='type-id-371'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='208'>
        <function-decl name='DoSetPathShape' mangled-name='_ZN20wxNonOwnedWindowBase14DoSetPathShapeERK14wxGraphicsPath' filepath='include/wx/nonownedwnd.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-368' is-artificial='yes'/>
          <parameter type-id='type-id-372'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxRefCounter' size-in-bits='128' visibility='default' filepath='include/wx/object.h' line='228' column='1' id='type-id-291'>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_count' type-id='type-id-19' visibility='default' filepath='include/wx/object.h' line='245' column='1'/>
      </data-member>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRefCounter' mangled-name='_ZN12wxRefCounterD0Ev' filepath='include/wx/object.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-373' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRefCounter' mangled-name='_ZN12wxRefCounterD0Ev' filepath='include/wx/object.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-373' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRefCounter' mangled-name='_ZN12wxRefCounterD0Ev' filepath='include/wx/object.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-373' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRefCounter' mangled-name='_ZN12wxRefCounterD0Ev' filepath='include/wx/object.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-373' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRefCounter' mangled-name='_ZN12wxRefCounterD0Ev' filepath='include/wx/object.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-373' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRefCounter' mangled-name='_ZN12wxRefCounterD2Ev' filepath='include/wx/object.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-373' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRefCounter' mangled-name='_ZN12wxRefCounterD2Ev' filepath='include/wx/object.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-373' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRefCounter' mangled-name='_ZN12wxRefCounterD2Ev' filepath='include/wx/object.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-373' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRefCounter' mangled-name='_ZN12wxRefCounterD2Ev' filepath='include/wx/object.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-373' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRefCounter' mangled-name='_ZN12wxRefCounterD2Ev' filepath='include/wx/object.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-373' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRefCounter' mangled-name='_ZN12wxRefCounterD4Ev' filepath='include/wx/object.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-373' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='wxObjectRefData' type-id='type-id-291' filepath='include/wx/object.h' line='258' column='1' id='type-id-374'/>
    <class-decl name='wxObjectDataPtr&lt;wxBitmapBundleImpl&gt;' size-in-bits='64' visibility='default' filepath='include/wx/object.h' line='266' column='1' id='type-id-89'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_ptr' type-id='type-id-375' visibility='default' filepath='include/wx/object.h' line='366' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxColourPropertyValue' size-in-bits='320' visibility='default' filepath='include/wx/propgrid/advprops.h' line='54' column='1' id='type-id-376'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-377'/>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='m_type' type-id='type-id-378' visibility='default' filepath='include/wx/propgrid/advprops.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_colour' type-id='type-id-379' visibility='default' filepath='include/wx/propgrid/advprops.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-380' mangled-name='_ZN21wxColourPropertyValue12ms_classInfoE' visibility='default' filepath='src/propgrid/advprops.cpp' line='75' column='1' elf-symbol-id='_ZN21wxColourPropertyValue12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <member-function access='public' static='yes'>
        <function-decl name='wxCreateObject' mangled-name='_ZN21wxColourPropertyValue14wxCreateObjectEv' filepath='src/propgrid/advprops.cpp' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN21wxColourPropertyValue14wxCreateObjectEv@@WXU_3.2'>
          <return type-id='type-id-252'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColourPropertyValue' mangled-name='_ZN21wxColourPropertyValueD0Ev' filepath='include/wx/propgrid/advprops.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-381' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColourPropertyValue' mangled-name='_ZN21wxColourPropertyValueD2Ev' filepath='include/wx/propgrid/advprops.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-381' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColourPropertyValue' mangled-name='_ZN21wxColourPropertyValueD4Ev' filepath='include/wx/propgrid/advprops.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-381' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK21wxColourPropertyValue12GetClassInfoEv' filepath='src/propgrid/advprops.cpp' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK21wxColourPropertyValue12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-382' is-artificial='yes'/>
          <return type-id='type-id-383'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxFontProperty' size-in-bits='3712' visibility='default' filepath='include/wx/propgrid/advprops.h' line='133' column='1' id='type-id-384'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-385'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-380' mangled-name='_ZN14wxFontProperty12ms_classInfoE' visibility='default' filepath='src/propgrid/advprops.cpp' line='550' column='1' elf-symbol-id='_ZN14wxFontProperty12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxFontProperty' mangled-name='_ZN14wxFontPropertyC2ERK8wxStringS2_RK6wxFont' filepath='src/propgrid/advprops.cpp' line='553' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxFontPropertyC2ERK8wxStringS2_RK6wxFont@@WXU_3.2'>
          <parameter type-id='type-id-386' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='label' filepath='src/propgrid/advprops.cpp' line='553' column='1'/>
          <parameter type-id='type-id-126' name='name' filepath='src/propgrid/advprops.cpp' line='553' column='1'/>
          <parameter type-id='type-id-124' name='value' filepath='src/propgrid/advprops.cpp' line='554' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='wxCreateObject' mangled-name='_ZN14wxFontProperty14wxCreateObjectEv' filepath='src/propgrid/advprops.cpp' line='550' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxFontProperty14wxCreateObjectEv@@WXU_3.2'>
          <return type-id='type-id-252'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFontProperty' mangled-name='_ZN14wxFontPropertyD4Ev' filepath='src/propgrid/advprops.cpp' line='610' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-387' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFontProperty' mangled-name='_ZN14wxFontPropertyD0Ev' filepath='src/propgrid/advprops.cpp' line='610' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxFontPropertyD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-387' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFontProperty' mangled-name='_ZN14wxFontPropertyD2Ev' filepath='src/propgrid/advprops.cpp' line='610' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxFontPropertyD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-387' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK14wxFontProperty12GetClassInfoEv' filepath='src/propgrid/advprops.cpp' line='550' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxFontProperty12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-388' is-artificial='yes'/>
          <return type-id='type-id-383'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='OnSetValue' mangled-name='_ZN14wxFontProperty10OnSetValueEv' filepath='src/propgrid/advprops.cpp' line='612' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxFontProperty10OnSetValueEv@@WXU_3.2'>
          <parameter type-id='type-id-387' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='10'>
        <function-decl name='ValueToString' mangled-name='_ZNK14wxFontProperty13ValueToStringER9wxVarianti' filepath='src/propgrid/advprops.cpp' line='623' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxFontProperty13ValueToStringER9wxVarianti@@WXU_3.2'>
          <parameter type-id='type-id-388' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='13'>
        <function-decl name='ChildChanged' mangled-name='_ZNK14wxFontProperty12ChildChangedER9wxVariantiS1_' filepath='src/propgrid/advprops.cpp' line='668' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxFontProperty12ChildChangedER9wxVariantiS1_@@WXU_3.2'>
          <parameter type-id='type-id-388' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-389'/>
          <return type-id='type-id-390'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='14'>
        <function-decl name='DoGetEditorClass' mangled-name='_ZNK14wxFontProperty16DoGetEditorClassEv' filepath='src/propgrid/advprops.cpp' line='550' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxFontProperty16DoGetEditorClassEv@@WXU_3.2'>
          <parameter type-id='type-id-388' is-artificial='yes'/>
          <return type-id='type-id-391'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <function-decl name='RefreshChildren' mangled-name='_ZN14wxFontProperty15RefreshChildrenEv' filepath='src/propgrid/advprops.cpp' line='655' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxFontProperty15RefreshChildrenEv@@WXU_3.2'>
          <parameter type-id='type-id-387' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='25'>
        <function-decl name='DisplayEditorDialog' mangled-name='_ZN14wxFontProperty19DisplayEditorDialogEP14wxPropertyGridR9wxVariant' filepath='src/propgrid/advprops.cpp' line='629' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxFontProperty19DisplayEditorDialogEP14wxPropertyGridR9wxVariant@@WXU_3.2'>
          <parameter type-id='type-id-387' is-artificial='yes'/>
          <parameter type-id='type-id-392'/>
          <parameter type-id='type-id-389'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxSystemColourProperty' size-in-bits='3264' visibility='default' filepath='include/wx/propgrid/advprops.h' line='162' column='1' id='type-id-393'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-394'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-380' mangled-name='_ZN22wxSystemColourProperty12ms_classInfoE' visibility='default' filepath='src/propgrid/advprops.cpp' line='842' column='1' elf-symbol-id='_ZN22wxSystemColourProperty12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <member-function access='public' const='yes'>
        <function-decl name='QueryColourFromUser' mangled-name='_ZNK22wxSystemColourProperty19QueryColourFromUserER9wxVariant' filepath='src/propgrid/advprops.cpp' line='1141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK22wxSystemColourProperty19QueryColourFromUserER9wxVariant@@WXU_3.2'>
          <parameter type-id='type-id-395' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-389' name='variant' filepath='src/propgrid/advprops.cpp' line='1141' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes'>
        <function-decl name='ColToInd' mangled-name='_ZNK22wxSystemColourProperty8ColToIndERK8wxColour' filepath='src/propgrid/advprops.cpp' line='970' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK22wxSystemColourProperty8ColToIndERK8wxColour@@WXU_3.2'>
          <parameter type-id='type-id-395' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-123' name='colour' filepath='src/propgrid/advprops.cpp' line='970' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetVal' mangled-name='_ZNK22wxSystemColourProperty6GetValEPK9wxVariant' filepath='src/propgrid/advprops.cpp' line='895' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK22wxSystemColourProperty6GetValEPK9wxVariant@@WXU_3.2'>
          <parameter type-id='type-id-395' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-396' name='pVariant' filepath='src/propgrid/advprops.cpp' line='895' column='1'/>
          <return type-id='type-id-376'/>
        </function-decl>
      </member-function>
      <member-function access='protected' constructor='yes'>
        <function-decl name='wxSystemColourProperty' mangled-name='_ZN22wxSystemColourPropertyC2ERK8wxStringS2_PKPKcPKlP11wxPGChoicesRK8wxColour' filepath='src/propgrid/advprops.cpp' line='883' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxSystemColourPropertyC2ERK8wxStringS2_PKPKcPKlP11wxPGChoicesRK8wxColour@@WXU_3.2'>
          <parameter type-id='type-id-397' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='label' filepath='src/propgrid/advprops.cpp' line='883' column='1'/>
          <parameter type-id='type-id-126' name='name' filepath='src/propgrid/advprops.cpp' line='883' column='1'/>
          <parameter type-id='type-id-398' name='labels' filepath='src/propgrid/advprops.cpp' line='884' column='1'/>
          <parameter type-id='type-id-399' name='values' filepath='src/propgrid/advprops.cpp' line='884' column='1'/>
          <parameter type-id='type-id-400' name='choicesCache' filepath='src/propgrid/advprops.cpp' line='884' column='1'/>
          <parameter type-id='type-id-123' name='value' filepath='src/propgrid/advprops.cpp' line='885' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' constructor='yes'>
        <function-decl name='wxSystemColourProperty' mangled-name='_ZN22wxSystemColourPropertyC2ERK8wxStringS2_PKPKcPKlP11wxPGChoicesRK21wxColourPropertyValue' filepath='src/propgrid/advprops.cpp' line='874' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxSystemColourPropertyC2ERK8wxStringS2_PKPKcPKlP11wxPGChoicesRK21wxColourPropertyValue@@WXU_3.2'>
          <parameter type-id='type-id-397' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='label' filepath='src/propgrid/advprops.cpp' line='874' column='1'/>
          <parameter type-id='type-id-126' name='name' filepath='src/propgrid/advprops.cpp' line='874' column='1'/>
          <parameter type-id='type-id-398' name='labels' filepath='src/propgrid/advprops.cpp' line='875' column='1'/>
          <parameter type-id='type-id-399' name='values' filepath='src/propgrid/advprops.cpp' line='875' column='1'/>
          <parameter type-id='type-id-400' name='choicesCache' filepath='src/propgrid/advprops.cpp' line='875' column='1'/>
          <parameter type-id='type-id-401' name='value' filepath='src/propgrid/advprops.cpp' line='876' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxSystemColourProperty' mangled-name='_ZN22wxSystemColourPropertyC2ERK8wxStringS2_RK21wxColourPropertyValue' filepath='src/propgrid/advprops.cpp' line='862' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxSystemColourPropertyC2ERK8wxStringS2_RK21wxColourPropertyValue@@WXU_3.2'>
          <parameter type-id='type-id-397' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='label' filepath='src/propgrid/advprops.cpp' line='862' column='1'/>
          <parameter type-id='type-id-126' name='name' filepath='src/propgrid/advprops.cpp' line='862' column='1'/>
          <parameter type-id='type-id-401' name='value' filepath='src/propgrid/advprops.cpp' line='863' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='Init' mangled-name='_ZN22wxSystemColourProperty4InitEiRK8wxColour' filepath='src/propgrid/advprops.cpp' line='845' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxSystemColourProperty4InitEiRK8wxColour@@WXU_3.2'>
          <parameter type-id='type-id-397' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-19' name='type' filepath='src/propgrid/advprops.cpp' line='845' column='1'/>
          <parameter type-id='type-id-123' name='colour' filepath='src/propgrid/advprops.cpp' line='845' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='wxCreateObject' mangled-name='_ZN22wxSystemColourProperty14wxCreateObjectEv' filepath='src/propgrid/advprops.cpp' line='842' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxSystemColourProperty14wxCreateObjectEv@@WXU_3.2'>
          <return type-id='type-id-252'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxSystemColourProperty' mangled-name='_ZN22wxSystemColourPropertyD4Ev' filepath='src/propgrid/advprops.cpp' line='892' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-402' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxSystemColourProperty' mangled-name='_ZN22wxSystemColourPropertyD0Ev' filepath='src/propgrid/advprops.cpp' line='892' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxSystemColourPropertyD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-402' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxSystemColourProperty' mangled-name='_ZN22wxSystemColourPropertyD2Ev' filepath='src/propgrid/advprops.cpp' line='892' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxSystemColourPropertyD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-402' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK22wxSystemColourProperty12GetClassInfoEv' filepath='src/propgrid/advprops.cpp' line='842' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK22wxSystemColourProperty12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-403' is-artificial='yes'/>
          <return type-id='type-id-383'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='OnSetValue' mangled-name='_ZN22wxSystemColourProperty10OnSetValueEv' filepath='src/propgrid/advprops.cpp' line='992' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxSystemColourProperty10OnSetValueEv@@WXU_3.2'>
          <parameter type-id='type-id-402' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='8'>
        <function-decl name='StringToValue' mangled-name='_ZNK22wxSystemColourProperty13StringToValueER9wxVariantRK8wxStringi' filepath='src/propgrid/advprops.cpp' line='1358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK22wxSystemColourProperty13StringToValueER9wxVariantRK8wxStringi@@WXU_3.2'>
          <parameter type-id='type-id-403' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='9'>
        <function-decl name='IntToValue' mangled-name='_ZNK22wxSystemColourProperty10IntToValueER9wxVariantii' filepath='src/propgrid/advprops.cpp' line='1184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK22wxSystemColourProperty10IntToValueER9wxVariantii@@WXU_3.2'>
          <parameter type-id='type-id-403' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='10'>
        <function-decl name='ValueToString' mangled-name='_ZNK22wxSystemColourProperty13ValueToStringER9wxVarianti' filepath='src/propgrid/advprops.cpp' line='1101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK22wxSystemColourProperty13ValueToStringER9wxVarianti@@WXU_3.2'>
          <parameter type-id='type-id-403' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='11'>
        <function-decl name='OnMeasureImage' mangled-name='_ZNK22wxSystemColourProperty14OnMeasureImageEi' filepath='src/propgrid/advprops.cpp' line='1129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK22wxSystemColourProperty14OnMeasureImageEi@@WXU_3.2'>
          <parameter type-id='type-id-403' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-287'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <function-decl name='OnEvent' mangled-name='_ZN22wxSystemColourProperty7OnEventEP14wxPropertyGridP8wxWindowR7wxEvent' filepath='src/propgrid/advprops.cpp' line='1208' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxSystemColourProperty7OnEventEP14wxPropertyGridP8wxWindowR7wxEvent@@WXU_3.2'>
          <parameter type-id='type-id-402' is-artificial='yes'/>
          <parameter type-id='type-id-392'/>
          <parameter type-id='type-id-283'/>
          <parameter type-id='type-id-231'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='14'>
        <function-decl name='DoGetEditorClass' mangled-name='_ZNK22wxSystemColourProperty16DoGetEditorClassEv' filepath='src/propgrid/advprops.cpp' line='842' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK22wxSystemColourProperty16DoGetEditorClassEv@@WXU_3.2'>
          <parameter type-id='type-id-403' is-artificial='yes'/>
          <return type-id='type-id-391'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <function-decl name='OnCustomPaint' mangled-name='_ZN22wxSystemColourProperty13OnCustomPaintER4wxDCRK6wxRectR13wxPGPaintData' filepath='src/propgrid/advprops.cpp' line='1298' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxSystemColourProperty13OnCustomPaintER4wxDCRK6wxRectR13wxPGPaintData@@WXU_3.2'>
          <parameter type-id='type-id-402' is-artificial='yes'/>
          <parameter type-id='type-id-404'/>
          <parameter type-id='type-id-405'/>
          <parameter type-id='type-id-406'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='DoSetAttribute' mangled-name='_ZN22wxSystemColourProperty14DoSetAttributeERK8wxStringR9wxVariant' filepath='src/propgrid/advprops.cpp' line='1466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxSystemColourProperty14DoSetAttributeERK8wxStringR9wxVariant@@WXU_3.2'>
          <parameter type-id='type-id-402' is-artificial='yes'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-389'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='26'>
        <function-decl name='ColourToString' mangled-name='_ZNK22wxSystemColourProperty14ColourToStringERK8wxColourii' filepath='src/propgrid/advprops.cpp' line='1071' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK22wxSystemColourProperty14ColourToStringERK8wxColourii@@WXU_3.2'>
          <parameter type-id='type-id-403' is-artificial='yes'/>
          <parameter type-id='type-id-123'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='27'>
        <function-decl name='GetCustomColourIndex' mangled-name='_ZNK22wxSystemColourProperty20GetCustomColourIndexEv' filepath='src/propgrid/advprops.cpp' line='1135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK22wxSystemColourProperty20GetCustomColourIndexEv@@WXU_3.2'>
          <parameter type-id='type-id-403' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='28'>
        <function-decl name='GetColour' mangled-name='_ZNK22wxSystemColourProperty9GetColourEi' filepath='src/propgrid/advprops.cpp' line='1066' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK22wxSystemColourProperty9GetColourEi@@WXU_3.2'>
          <parameter type-id='type-id-403' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-379'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='29'>
        <function-decl name='DoTranslateVal' mangled-name='_ZNK22wxSystemColourProperty14DoTranslateValER21wxColourPropertyValue' filepath='src/propgrid/advprops.cpp' line='965' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK22wxSystemColourProperty14DoTranslateValER21wxColourPropertyValue@@WXU_3.2'>
          <parameter type-id='type-id-403' is-artificial='yes'/>
          <parameter type-id='type-id-407'/>
          <return type-id='type-id-390'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxColourProperty' size-in-bits='3264' visibility='default' filepath='include/wx/propgrid/advprops.h' line='237' column='1' id='type-id-408'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-393'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-380' mangled-name='_ZN16wxColourProperty12ms_classInfoE' visibility='default' filepath='src/propgrid/advprops.cpp' line='1567' column='1' elf-symbol-id='_ZN16wxColourProperty12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <member-function access='private'>
        <function-decl name='Init' mangled-name='_ZN16wxColourProperty4InitE8wxColour' filepath='src/propgrid/advprops.cpp' line='1610' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxColourProperty4InitE8wxColour@@WXU_3.2'>
          <parameter type-id='type-id-409' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-379' name='colour' filepath='src/propgrid/advprops.cpp' line='1610' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxColourProperty' mangled-name='_ZN16wxColourPropertyC2ERK8wxStringS2_RK8wxColour' filepath='src/propgrid/advprops.cpp' line='1572' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxColourPropertyC2ERK8wxStringS2_RK8wxColour@@WXU_3.2'>
          <parameter type-id='type-id-409' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='label' filepath='src/propgrid/advprops.cpp' line='1572' column='1'/>
          <parameter type-id='type-id-126' name='name' filepath='src/propgrid/advprops.cpp' line='1573' column='1'/>
          <parameter type-id='type-id-123' name='value' filepath='src/propgrid/advprops.cpp' line='1574' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='wxCreateObject' mangled-name='_ZN16wxColourProperty14wxCreateObjectEv' filepath='src/propgrid/advprops.cpp' line='1567' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxColourProperty14wxCreateObjectEv@@WXU_3.2'>
          <return type-id='type-id-252'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColourProperty' mangled-name='_ZN16wxColourPropertyD4Ev' filepath='src/propgrid/advprops.cpp' line='1606' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-410' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColourProperty' mangled-name='_ZN16wxColourPropertyD0Ev' filepath='src/propgrid/advprops.cpp' line='1606' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxColourPropertyD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-410' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColourProperty' mangled-name='_ZN16wxColourPropertyD2Ev' filepath='src/propgrid/advprops.cpp' line='1606' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxColourPropertyD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-410' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK16wxColourProperty12GetClassInfoEv' filepath='src/propgrid/advprops.cpp' line='1567' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16wxColourProperty12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-411' is-artificial='yes'/>
          <return type-id='type-id-383'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='10'>
        <function-decl name='ValueToString' mangled-name='_ZNK16wxColourProperty13ValueToStringER9wxVarianti' filepath='src/propgrid/advprops.cpp' line='1621' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16wxColourProperty13ValueToStringER9wxVarianti@@WXU_3.2'>
          <parameter type-id='type-id-411' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='14'>
        <function-decl name='DoGetEditorClass' mangled-name='_ZNK16wxColourProperty16DoGetEditorClassEv' filepath='src/propgrid/advprops.cpp' line='1567' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16wxColourProperty16DoGetEditorClassEv@@WXU_3.2'>
          <parameter type-id='type-id-411' is-artificial='yes'/>
          <return type-id='type-id-391'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='28'>
        <function-decl name='GetColour' mangled-name='_ZNK16wxColourProperty9GetColourEi' filepath='src/propgrid/advprops.cpp' line='1633' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16wxColourProperty9GetColourEi@@WXU_3.2'>
          <parameter type-id='type-id-411' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-379'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='29'>
        <function-decl name='DoTranslateVal' mangled-name='_ZNK16wxColourProperty14DoTranslateValER21wxColourPropertyValue' filepath='src/propgrid/advprops.cpp' line='1638' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16wxColourProperty14DoTranslateValER21wxColourPropertyValue@@WXU_3.2'>
          <parameter type-id='type-id-411' is-artificial='yes'/>
          <parameter type-id='type-id-407'/>
          <return type-id='type-id-390'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxCursorProperty' size-in-bits='3264' visibility='default' filepath='include/wx/propgrid/advprops.h' line='259' column='1' id='type-id-412'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-394'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-380' mangled-name='_ZN16wxCursorProperty12ms_classInfoE' visibility='default' filepath='src/propgrid/advprops.cpp' line='1716' column='1' elf-symbol-id='_ZN16wxCursorProperty12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxCursorProperty' mangled-name='_ZN16wxCursorPropertyC2ERK8wxStringS2_i' filepath='src/propgrid/advprops.cpp' line='1720' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxCursorPropertyC2ERK8wxStringS2_i@@WXU_3.2'>
          <parameter type-id='type-id-413' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='label' filepath='src/propgrid/advprops.cpp' line='1720' column='1'/>
          <parameter type-id='type-id-126' name='name' filepath='src/propgrid/advprops.cpp' line='1720' column='1'/>
          <parameter type-id='type-id-19' name='value' filepath='src/propgrid/advprops.cpp' line='1721' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='wxCreateObject' mangled-name='_ZN16wxCursorProperty14wxCreateObjectEv' filepath='src/propgrid/advprops.cpp' line='1716' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxCursorProperty14wxCreateObjectEv@@WXU_3.2'>
          <return type-id='type-id-252'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxCursorProperty' mangled-name='_ZN16wxCursorPropertyD4Ev' filepath='src/propgrid/advprops.cpp' line='1732' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-414' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxCursorProperty' mangled-name='_ZN16wxCursorPropertyD0Ev' filepath='src/propgrid/advprops.cpp' line='1732' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxCursorPropertyD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-414' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxCursorProperty' mangled-name='_ZN16wxCursorPropertyD2Ev' filepath='src/propgrid/advprops.cpp' line='1732' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxCursorPropertyD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-414' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK16wxCursorProperty12GetClassInfoEv' filepath='src/propgrid/advprops.cpp' line='1716' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16wxCursorProperty12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-415' is-artificial='yes'/>
          <return type-id='type-id-383'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='10'>
        <function-decl name='ValueToString' mangled-name='_ZNK16wxCursorProperty13ValueToStringER9wxVarianti' filepath='src/propgrid/advprops.cpp' line='1736' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16wxCursorProperty13ValueToStringER9wxVarianti@@WXU_3.2'>
          <parameter type-id='type-id-415' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='11'>
        <function-decl name='OnMeasureImage' mangled-name='_ZNK16wxCursorProperty14OnMeasureImageEi' filepath='src/propgrid/advprops.cpp' line='1742' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16wxCursorProperty14OnMeasureImageEi@@WXU_3.2'>
          <parameter type-id='type-id-415' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-287'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <function-decl name='OnCustomPaint' mangled-name='_ZN16wxCursorProperty13OnCustomPaintER4wxDCRK6wxRectR13wxPGPaintData' filepath='src/propgrid/advprops.cpp' line='1755' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxCursorProperty13OnCustomPaintER4wxDCRK6wxRectR13wxPGPaintData@@WXU_3.2'>
          <parameter type-id='type-id-414' is-artificial='yes'/>
          <parameter type-id='type-id-404'/>
          <parameter type-id='type-id-405'/>
          <parameter type-id='type-id-406'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxImageFileProperty' size-in-bits='5184' visibility='default' filepath='include/wx/propgrid/advprops.h' line='283' column='1' id='type-id-416'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-417'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-380' mangled-name='_ZN19wxImageFileProperty12ms_classInfoE' visibility='default' filepath='src/propgrid/advprops.cpp' line='1840' column='1' elf-symbol-id='_ZN19wxImageFileProperty12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='4928'>
        <var-decl name='m_image' type-id='type-id-418' visibility='default' filepath='include/wx/propgrid/advprops.h' line='301' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5056'>
        <var-decl name='m_bitmap' type-id='type-id-419' visibility='default' filepath='include/wx/propgrid/advprops.h' line='307' column='1'/>
      </data-member>
      <member-function access='private'>
        <function-decl name='LoadImageFromFile' mangled-name='_ZN19wxImageFileProperty17LoadImageFromFileEv' filepath='src/propgrid/advprops.cpp' line='1871' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxImageFileProperty17LoadImageFromFileEv@@WXU_3.2'>
          <parameter type-id='type-id-420' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='SetImage' mangled-name='_ZN19wxImageFileProperty8SetImageERK7wxImage' filepath='src/propgrid/advprops.cpp' line='1865' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxImageFileProperty8SetImageERK7wxImage@@WXU_3.2'>
          <parameter type-id='type-id-420' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-421' name='img' filepath='src/propgrid/advprops.cpp' line='1865' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxImageFileProperty' mangled-name='_ZN19wxImageFilePropertyC2ERK8wxStringS2_S2_' filepath='src/propgrid/advprops.cpp' line='1842' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxImageFilePropertyC2ERK8wxStringS2_S2_@@WXU_3.2'>
          <parameter type-id='type-id-420' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='label' filepath='src/propgrid/advprops.cpp' line='1842' column='1'/>
          <parameter type-id='type-id-126' name='name' filepath='src/propgrid/advprops.cpp' line='1842' column='1'/>
          <parameter type-id='type-id-126' name='value' filepath='src/propgrid/advprops.cpp' line='1843' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='wxCreateObject' mangled-name='_ZN19wxImageFileProperty14wxCreateObjectEv' filepath='src/propgrid/advprops.cpp' line='1840' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxImageFileProperty14wxCreateObjectEv@@WXU_3.2'>
          <return type-id='type-id-252'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxImageFileProperty' mangled-name='_ZN19wxImageFilePropertyD4Ev' filepath='src/propgrid/advprops.cpp' line='1851' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-422' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxImageFileProperty' mangled-name='_ZN19wxImageFilePropertyD0Ev' filepath='src/propgrid/advprops.cpp' line='1851' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxImageFilePropertyD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-422' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxImageFileProperty' mangled-name='_ZN19wxImageFilePropertyD2Ev' filepath='src/propgrid/advprops.cpp' line='1851' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxImageFilePropertyD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-422' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK19wxImageFileProperty12GetClassInfoEv' filepath='src/propgrid/advprops.cpp' line='1840' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK19wxImageFileProperty12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-423' is-artificial='yes'/>
          <return type-id='type-id-383'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='OnSetValue' mangled-name='_ZN19wxImageFileProperty10OnSetValueEv' filepath='src/propgrid/advprops.cpp' line='1855' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxImageFileProperty10OnSetValueEv@@WXU_3.2'>
          <parameter type-id='type-id-422' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='11'>
        <function-decl name='OnMeasureImage' mangled-name='_ZNK19wxImageFileProperty14OnMeasureImageEi' filepath='src/propgrid/advprops.cpp' line='1882' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK19wxImageFileProperty14OnMeasureImageEi@@WXU_3.2'>
          <parameter type-id='type-id-423' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-287'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <function-decl name='OnCustomPaint' mangled-name='_ZN19wxImageFileProperty13OnCustomPaintER4wxDCRK6wxRectR13wxPGPaintData' filepath='src/propgrid/advprops.cpp' line='1887' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxImageFileProperty13OnCustomPaintER4wxDCRK6wxRectR13wxPGPaintData@@WXU_3.2'>
          <parameter type-id='type-id-422' is-artificial='yes'/>
          <parameter type-id='type-id-404'/>
          <parameter type-id='type-id-405'/>
          <parameter type-id='type-id-406'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxMultiChoiceProperty' size-in-bits='4160' visibility='default' filepath='include/wx/propgrid/advprops.h' line='317' column='1' id='type-id-424'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-385'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-380' mangled-name='_ZN21wxMultiChoiceProperty12ms_classInfoE' visibility='default' filepath='src/propgrid/advprops.cpp' line='1932' column='1' elf-symbol-id='_ZN21wxMultiChoiceProperty12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='3712'>
        <var-decl name='m_display' type-id='type-id-61' visibility='default' filepath='include/wx/propgrid/advprops.h' line='365' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='4096'>
        <var-decl name='m_userStringMode' type-id='type-id-19' visibility='default' filepath='include/wx/propgrid/advprops.h' line='367' column='1'/>
      </data-member>
      <member-function access='protected' const='yes'>
        <function-decl name='GetValueAsIndices' mangled-name='_ZNK21wxMultiChoiceProperty17GetValueAsIndicesEv' filepath='src/propgrid/advprops.cpp' line='2013' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK21wxMultiChoiceProperty17GetValueAsIndicesEv@@WXU_3.2'>
          <parameter type-id='type-id-425' name='this' is-artificial='yes'/>
          <return type-id='type-id-219'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes'>
        <function-decl name='GenerateValueAsString' mangled-name='_ZNK21wxMultiChoiceProperty21GenerateValueAsStringERK9wxVariant' filepath='src/propgrid/advprops.cpp' line='1990' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK21wxMultiChoiceProperty21GenerateValueAsStringERK9wxVariant@@WXU_3.2'>
          <parameter type-id='type-id-425' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-426' name='value' filepath='src/propgrid/advprops.cpp' line='1990' column='1'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxMultiChoiceProperty' mangled-name='_ZN21wxMultiChoicePropertyC2ERK8wxStringS2_RK13wxArrayString' filepath='src/propgrid/advprops.cpp' line='1959' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN21wxMultiChoicePropertyC2ERK8wxStringS2_RK13wxArrayString@@WXU_3.2'>
          <parameter type-id='type-id-427' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='label' filepath='src/propgrid/advprops.cpp' line='1959' column='1'/>
          <parameter type-id='type-id-126' name='name' filepath='src/propgrid/advprops.cpp' line='1960' column='1'/>
          <parameter type-id='type-id-428' name='value' filepath='src/propgrid/advprops.cpp' line='1961' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxMultiChoiceProperty' mangled-name='_ZN21wxMultiChoicePropertyC2ERK8wxStringS2_RK13wxArrayStringS5_' filepath='src/propgrid/advprops.cpp' line='1947' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN21wxMultiChoicePropertyC2ERK8wxStringS2_RK13wxArrayStringS5_@@WXU_3.2'>
          <parameter type-id='type-id-427' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='label' filepath='src/propgrid/advprops.cpp' line='1947' column='1'/>
          <parameter type-id='type-id-126' name='name' filepath='src/propgrid/advprops.cpp' line='1948' column='1'/>
          <parameter type-id='type-id-428' name='strings' filepath='src/propgrid/advprops.cpp' line='1949' column='1'/>
          <parameter type-id='type-id-428' name='value' filepath='src/propgrid/advprops.cpp' line='1950' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxMultiChoiceProperty' mangled-name='_ZN21wxMultiChoicePropertyC2ERK8wxStringS2_RK11wxPGChoicesRK13wxArrayString' filepath='src/propgrid/advprops.cpp' line='1935' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN21wxMultiChoicePropertyC2ERK8wxStringS2_RK11wxPGChoicesRK13wxArrayString@@WXU_3.2'>
          <parameter type-id='type-id-427' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='label' filepath='src/propgrid/advprops.cpp' line='1935' column='1'/>
          <parameter type-id='type-id-126' name='name' filepath='src/propgrid/advprops.cpp' line='1936' column='1'/>
          <parameter type-id='type-id-429' name='choices' filepath='src/propgrid/advprops.cpp' line='1937' column='1'/>
          <parameter type-id='type-id-428' name='value' filepath='src/propgrid/advprops.cpp' line='1938' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='wxCreateObject' mangled-name='_ZN21wxMultiChoiceProperty14wxCreateObjectEv' filepath='src/propgrid/advprops.cpp' line='1932' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN21wxMultiChoiceProperty14wxCreateObjectEv@@WXU_3.2'>
          <return type-id='type-id-252'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMultiChoiceProperty' mangled-name='_ZN21wxMultiChoicePropertyD4Ev' filepath='src/propgrid/advprops.cpp' line='1971' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-430' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMultiChoiceProperty' mangled-name='_ZN21wxMultiChoicePropertyD0Ev' filepath='src/propgrid/advprops.cpp' line='1971' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN21wxMultiChoicePropertyD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-430' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMultiChoiceProperty' mangled-name='_ZN21wxMultiChoicePropertyD2Ev' filepath='src/propgrid/advprops.cpp' line='1971' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN21wxMultiChoicePropertyD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-430' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK21wxMultiChoiceProperty12GetClassInfoEv' filepath='src/propgrid/advprops.cpp' line='1932' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK21wxMultiChoiceProperty12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-431' is-artificial='yes'/>
          <return type-id='type-id-383'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='OnSetValue' mangled-name='_ZN21wxMultiChoiceProperty10OnSetValueEv' filepath='src/propgrid/advprops.cpp' line='1975' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN21wxMultiChoiceProperty10OnSetValueEv@@WXU_3.2'>
          <parameter type-id='type-id-430' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='8'>
        <function-decl name='StringToValue' mangled-name='_ZNK21wxMultiChoiceProperty13StringToValueER9wxVariantRK8wxStringi' filepath='src/propgrid/advprops.cpp' line='2097' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK21wxMultiChoiceProperty13StringToValueER9wxVariantRK8wxStringi@@WXU_3.2'>
          <parameter type-id='type-id-431' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='10'>
        <function-decl name='ValueToString' mangled-name='_ZNK21wxMultiChoiceProperty13ValueToStringER9wxVarianti' filepath='src/propgrid/advprops.cpp' line='1980' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK21wxMultiChoiceProperty13ValueToStringER9wxVarianti@@WXU_3.2'>
          <parameter type-id='type-id-431' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='14'>
        <function-decl name='DoGetEditorClass' mangled-name='_ZNK21wxMultiChoiceProperty16DoGetEditorClassEv' filepath='src/propgrid/advprops.cpp' line='1932' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK21wxMultiChoiceProperty16DoGetEditorClassEv@@WXU_3.2'>
          <parameter type-id='type-id-431' is-artificial='yes'/>
          <return type-id='type-id-391'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='DoSetAttribute' mangled-name='_ZN21wxMultiChoiceProperty14DoSetAttributeERK8wxStringR9wxVariant' filepath='src/propgrid/advprops.cpp' line='2112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN21wxMultiChoiceProperty14DoSetAttributeERK8wxStringR9wxVariant@@WXU_3.2'>
          <parameter type-id='type-id-430' is-artificial='yes'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-389'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='25'>
        <function-decl name='DisplayEditorDialog' mangled-name='_ZN21wxMultiChoiceProperty19DisplayEditorDialogEP14wxPropertyGridR9wxVariant' filepath='src/propgrid/advprops.cpp' line='2040' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN21wxMultiChoiceProperty19DisplayEditorDialogEP14wxPropertyGridR9wxVariant@@WXU_3.2'>
          <parameter type-id='type-id-430' is-artificial='yes'/>
          <parameter type-id='type-id-392'/>
          <parameter type-id='type-id-389'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxDateProperty' size-in-bits='3712' visibility='default' filepath='include/wx/propgrid/advprops.h' line='377' column='1' id='type-id-432'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-433'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-380' mangled-name='_ZN14wxDateProperty12ms_classInfoE' visibility='default' filepath='src/propgrid/advprops.cpp' line='2138' column='1' elf-symbol-id='_ZN14wxDateProperty12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='3264'>
        <var-decl name='m_format' type-id='type-id-61' visibility='default' filepath='include/wx/propgrid/advprops.h' line='423' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='3648'>
        <var-decl name='m_dpStyle' type-id='type-id-21' visibility='default' filepath='include/wx/propgrid/advprops.h' line='424' column='1'/>
      </data-member>
      <data-member access='protected' static='yes'>
        <var-decl name='ms_defaultDateFormat' type-id='type-id-61' mangled-name='_ZN14wxDateProperty20ms_defaultDateFormatE' visibility='default' filepath='src/propgrid/advprops.cpp' line='2142' column='1' elf-symbol-id='_ZN14wxDateProperty20ms_defaultDateFormatE@@WXU_3.2'/>
      </data-member>
      <member-function access='protected' static='yes'>
        <function-decl name='DetermineDefaultDateFormat' mangled-name='_ZN14wxDateProperty26DetermineDefaultDateFormatEb' filepath='src/propgrid/advprops.cpp' line='2226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxDateProperty26DetermineDefaultDateFormatEb@@WXU_3.2'>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxDateProperty' mangled-name='_ZN14wxDatePropertyC2ERK8wxStringS2_RK10wxDateTime' filepath='src/propgrid/advprops.cpp' line='2145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxDatePropertyC2ERK8wxStringS2_RK10wxDateTime@@WXU_3.2'>
          <parameter type-id='type-id-434' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='label' filepath='src/propgrid/advprops.cpp' line='2145' column='1'/>
          <parameter type-id='type-id-126' name='name' filepath='src/propgrid/advprops.cpp' line='2146' column='1'/>
          <parameter type-id='type-id-147' name='value' filepath='src/propgrid/advprops.cpp' line='2147' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='wxCreateObject' mangled-name='_ZN14wxDateProperty14wxCreateObjectEv' filepath='src/propgrid/advprops.cpp' line='2138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxDateProperty14wxCreateObjectEv@@WXU_3.2'>
          <return type-id='type-id-252'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxDateProperty' mangled-name='_ZN14wxDatePropertyD4Ev' filepath='src/propgrid/advprops.cpp' line='2163' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-435' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxDateProperty' mangled-name='_ZN14wxDatePropertyD0Ev' filepath='src/propgrid/advprops.cpp' line='2163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxDatePropertyD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-435' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxDateProperty' mangled-name='_ZN14wxDatePropertyD2Ev' filepath='src/propgrid/advprops.cpp' line='2163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxDatePropertyD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-435' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK14wxDateProperty12GetClassInfoEv' filepath='src/propgrid/advprops.cpp' line='2138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxDateProperty12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-436' is-artificial='yes'/>
          <return type-id='type-id-383'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='OnSetValue' mangled-name='_ZN14wxDateProperty10OnSetValueEv' filepath='src/propgrid/advprops.cpp' line='2167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxDateProperty10OnSetValueEv@@WXU_3.2'>
          <parameter type-id='type-id-435' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='8'>
        <function-decl name='StringToValue' mangled-name='_ZNK14wxDateProperty13StringToValueER9wxVariantRK8wxStringi' filepath='src/propgrid/advprops.cpp' line='2178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxDateProperty13StringToValueER9wxVariantRK8wxStringi@@WXU_3.2'>
          <parameter type-id='type-id-436' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='10'>
        <function-decl name='ValueToString' mangled-name='_ZNK14wxDateProperty13ValueToStringER9wxVarianti' filepath='src/propgrid/advprops.cpp' line='2196' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxDateProperty13ValueToStringER9wxVarianti@@WXU_3.2'>
          <parameter type-id='type-id-436' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='14'>
        <function-decl name='DoGetEditorClass' mangled-name='_ZNK14wxDateProperty16DoGetEditorClassEv' filepath='src/propgrid/advprops.cpp' line='2138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxDateProperty16DoGetEditorClassEv@@WXU_3.2'>
          <parameter type-id='type-id-436' is-artificial='yes'/>
          <return type-id='type-id-391'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='DoSetAttribute' mangled-name='_ZN14wxDateProperty14DoSetAttributeERK8wxStringR9wxVariant' filepath='src/propgrid/advprops.cpp' line='2242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxDateProperty14DoSetAttributeERK8wxStringR9wxVariant@@WXU_3.2'>
          <parameter type-id='type-id-435' is-artificial='yes'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-389'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxPGSpinCtrlEditor' size-in-bits='576' visibility='default' filepath='include/wx/propgrid/advprops.h' line='456' column='1' id='type-id-437'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-438'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-380' mangled-name='_ZN18wxPGSpinCtrlEditor12ms_classInfoE' visibility='default' filepath='src/propgrid/advprops.cpp' line='216' column='1' elf-symbol-id='_ZN18wxPGSpinCtrlEditor12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_tempString' type-id='type-id-61' visibility='default' filepath='include/wx/propgrid/advprops.h' line='471' column='1'/>
      </data-member>
      <member-function access='public' static='yes'>
        <function-decl name='wxCreateObject' mangled-name='_ZN18wxPGSpinCtrlEditor14wxCreateObjectEv' filepath='src/propgrid/advprops.cpp' line='216' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN18wxPGSpinCtrlEditor14wxCreateObjectEv@@WXU_3.2'>
          <return type-id='type-id-252'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPGSpinCtrlEditor' mangled-name='_ZN18wxPGSpinCtrlEditorD4Ev' filepath='src/propgrid/advprops.cpp' line='222' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-439' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPGSpinCtrlEditor' mangled-name='_ZN18wxPGSpinCtrlEditorD0Ev' filepath='src/propgrid/advprops.cpp' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN18wxPGSpinCtrlEditorD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-439' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPGSpinCtrlEditor' mangled-name='_ZN18wxPGSpinCtrlEditorD2Ev' filepath='src/propgrid/advprops.cpp' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN18wxPGSpinCtrlEditorD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-439' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK18wxPGSpinCtrlEditor12GetClassInfoEv' filepath='src/propgrid/advprops.cpp' line='216' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK18wxPGSpinCtrlEditor12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-440' is-artificial='yes'/>
          <return type-id='type-id-383'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetName' mangled-name='_ZNK18wxPGSpinCtrlEditor7GetNameEv' filepath='src/propgrid/advprops.cpp' line='216' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK18wxPGSpinCtrlEditor7GetNameEv@@WXU_3.2'>
          <parameter type-id='type-id-440' is-artificial='yes'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='6'>
        <function-decl name='CreateControls' mangled-name='_ZNK18wxPGSpinCtrlEditor14CreateControlsEP14wxPropertyGridP12wxPGPropertyRK7wxPointRK6wxSize' filepath='src/propgrid/advprops.cpp' line='228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK18wxPGSpinCtrlEditor14CreateControlsEP14wxPropertyGridP12wxPGPropertyRK7wxPointRK6wxSize@@WXU_3.2'>
          <parameter type-id='type-id-440' is-artificial='yes'/>
          <parameter type-id='type-id-392'/>
          <parameter type-id='type-id-441'/>
          <parameter type-id='type-id-442'/>
          <parameter type-id='type-id-443'/>
          <return type-id='type-id-444'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='9'>
        <function-decl name='OnEvent' mangled-name='_ZNK18wxPGSpinCtrlEditor7OnEventEP14wxPropertyGridP12wxPGPropertyP8wxWindowR7wxEvent' filepath='src/propgrid/advprops.cpp' line='285' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK18wxPGSpinCtrlEditor7OnEventEP14wxPropertyGridP12wxPGPropertyP8wxWindowR7wxEvent@@WXU_3.2'>
          <parameter type-id='type-id-440' is-artificial='yes'/>
          <parameter type-id='type-id-392'/>
          <parameter type-id='type-id-441'/>
          <parameter type-id='type-id-283'/>
          <parameter type-id='type-id-231'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxPGWindowList' size-in-bits='128' visibility='default' filepath='include/wx/propgrid/editors.h' line='27' column='1' id='type-id-444'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_primary' type-id='type-id-283' visibility='default' filepath='include/wx/propgrid/editors.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='m_secondary' type-id='type-id-283' visibility='default' filepath='include/wx/propgrid/editors.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxPGPaintData' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/propgrid/property.h' line='30' column='1' id='type-id-445'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_parent' type-id='type-id-446' visibility='default' filepath='include/wx/propgrid/property.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='m_choiceItem' type-id='type-id-19' visibility='default' filepath='include/wx/propgrid/property.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='m_drawnWidth' type-id='type-id-19' visibility='default' filepath='include/wx/propgrid/property.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='m_drawnHeight' type-id='type-id-19' visibility='default' filepath='include/wx/propgrid/property.h' line='44' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxPGCellData' size-in-bits='1024' visibility='default' filepath='include/wx/propgrid/property.h' line='174' column='1' id='type-id-447'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-291'/>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_text' type-id='type-id-61' visibility='default' filepath='include/wx/propgrid/property.h' line='193' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='512'>
        <var-decl name='m_bitmapBundle' type-id='type-id-87' visibility='default' filepath='include/wx/propgrid/property.h' line='194' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='576'>
        <var-decl name='m_fgCol' type-id='type-id-379' visibility='default' filepath='include/wx/propgrid/property.h' line='195' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='704'>
        <var-decl name='m_bgCol' type-id='type-id-379' visibility='default' filepath='include/wx/propgrid/property.h' line='196' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='832'>
        <var-decl name='m_font' type-id='type-id-448' visibility='default' filepath='include/wx/propgrid/property.h' line='197' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='960'>
        <var-decl name='m_hasValidText' type-id='type-id-3' visibility='default' filepath='include/wx/propgrid/property.h' line='200' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxPGCellData' mangled-name='_ZN12wxPGCellDataC2Ev' filepath='src/propgrid/property.cpp' line='355' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxPGCellDataC2Ev@@WXU_3.2'>
          <parameter type-id='type-id-449' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPGCellData' mangled-name='_ZN12wxPGCellDataD0Ev' filepath='include/wx/propgrid/property.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-450' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPGCellData' mangled-name='_ZN12wxPGCellDataD2Ev' filepath='include/wx/propgrid/property.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-450' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPGCellData' mangled-name='_ZN12wxPGCellDataD4Ev' filepath='include/wx/propgrid/property.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-450' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='wxPGPropertyFlags' filepath='include/wx/propgrid/property.h' line='343' column='1' id='type-id-451'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxPG_PROP_MODIFIED' value='1'/>
      <enumerator name='wxPG_PROP_DISABLED' value='2'/>
      <enumerator name='wxPG_PROP_HIDDEN' value='4'/>
      <enumerator name='wxPG_PROP_CUSTOMIMAGE' value='8'/>
      <enumerator name='wxPG_PROP_NOEDITOR' value='16'/>
      <enumerator name='wxPG_PROP_COLLAPSED' value='32'/>
      <enumerator name='wxPG_PROP_INVALID_VALUE' value='64'/>
      <enumerator name='wxPG_PROP_WAS_MODIFIED' value='512'/>
      <enumerator name='wxPG_PROP_AGGREGATE' value='1024'/>
      <enumerator name='wxPG_PROP_CHILDREN_ARE_COPIES' value='2048'/>
      <enumerator name='wxPG_PROP_PROPERTY' value='4096'/>
      <enumerator name='wxPG_PROP_CATEGORY' value='8192'/>
      <enumerator name='wxPG_PROP_MISC_PARENT' value='16384'/>
      <enumerator name='wxPG_PROP_READONLY' value='32768'/>
      <enumerator name='wxPG_PROP_COMPOSED_VALUE' value='65536'/>
      <enumerator name='wxPG_PROP_USES_COMMON_VALUE' value='131072'/>
      <enumerator name='wxPG_PROP_AUTO_UNSPECIFIED' value='262144'/>
      <enumerator name='wxPG_PROP_CLASS_SPECIFIC_1' value='524288'/>
      <enumerator name='wxPG_PROP_CLASS_SPECIFIC_2' value='1048576'/>
      <enumerator name='wxPG_PROP_BEING_DELETED' value='2097152'/>
      <enumerator name='wxPG_PROP_CLASS_SPECIFIC_3' value='4194304'/>
    </enum-decl>
    <class-decl name='wxPGChoiceEntry' size-in-bits='192' visibility='default' filepath='include/wx/propgrid/property.h' line='645' column='1' id='type-id-452'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-453'/>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_value' type-id='type-id-19' visibility='default' filepath='include/wx/propgrid/property.h' line='678' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxPGChoiceEntry' mangled-name='_ZN15wxPGChoiceEntryC2Ev' filepath='src/propgrid/propgrid.cpp' line='6217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxPGChoiceEntryC2Ev@@WXU_3.2'>
          <parameter type-id='type-id-454' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPGChoiceEntry' mangled-name='_ZN15wxPGChoiceEntryD0Ev' filepath='include/wx/propgrid/property.h' line='662' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-454' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPGChoiceEntry' mangled-name='_ZN15wxPGChoiceEntryD0Ev' filepath='include/wx/propgrid/property.h' line='662' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-454' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPGChoiceEntry' mangled-name='_ZN15wxPGChoiceEntryD0Ev' filepath='include/wx/propgrid/property.h' line='662' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-454' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPGChoiceEntry' mangled-name='_ZN15wxPGChoiceEntryD2Ev' filepath='include/wx/propgrid/property.h' line='662' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-454' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPGChoiceEntry' mangled-name='_ZN15wxPGChoiceEntryD2Ev' filepath='include/wx/propgrid/property.h' line='662' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-454' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPGChoiceEntry' mangled-name='_ZN15wxPGChoiceEntryD2Ev' filepath='include/wx/propgrid/property.h' line='662' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-454' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPGChoiceEntry' mangled-name='_ZN15wxPGChoiceEntryD4Ev' filepath='include/wx/propgrid/property.h' line='662' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-454' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='wxPGChoicesId' type-id='type-id-16' filepath='include/wx/propgrid/property.h' line='682' column='1' id='type-id-455'/>
    <class-decl name='wxPGChoices' size-in-bits='64' visibility='default' filepath='include/wx/propgrid/property.h' line='733' column='1' id='type-id-456'>
      <member-type access='public'>
        <typedef-decl name='ValArrItem' type-id='type-id-21' filepath='include/wx/propgrid/property.h' line='736' column='1' id='type-id-457'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-458' visibility='default' filepath='include/wx/propgrid/property.h' line='997' column='1'/>
      </data-member>
      <member-function access='protected'>
        <function-decl name='Free' mangled-name='_ZN11wxPGChoices4FreeEv' filepath='src/propgrid/property.cpp' line='3185' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxPGChoices4FreeEv@@WXU_3.2'>
          <parameter type-id='type-id-459' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='Init' mangled-name='_ZN11wxPGChoices4InitEv' filepath='src/propgrid/property.cpp' line='3178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxPGChoices4InitEv@@WXU_3.2'>
          <parameter type-id='type-id-459' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='AssignData' mangled-name='_ZN11wxPGChoices10AssignDataEP15wxPGChoicesData' filepath='src/propgrid/property.cpp' line='3165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxPGChoices10AssignDataEP15wxPGChoicesData@@WXU_3.2'>
          <parameter type-id='type-id-459' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-458' name='data' filepath='src/propgrid/property.cpp' line='3165' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='AllocExclusive' mangled-name='_ZN11wxPGChoices14AllocExclusiveEv' filepath='src/propgrid/property.cpp' line='3150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxPGChoices14AllocExclusiveEv@@WXU_3.2'>
          <parameter type-id='type-id-459' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetIndicesForStrings' mangled-name='_ZNK11wxPGChoices20GetIndicesForStringsERK13wxArrayStringPS0_' filepath='src/propgrid/property.cpp' line='3127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK11wxPGChoices20GetIndicesForStringsERK13wxArrayStringPS0_@@WXU_3.2'>
          <parameter type-id='type-id-460' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-428' name='strings' filepath='src/propgrid/property.cpp' line='3127' column='1'/>
          <parameter type-id='type-id-461' name='unmatched' filepath='src/propgrid/property.cpp' line='3128' column='1'/>
          <return type-id='type-id-219'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetValuesForStrings' mangled-name='_ZNK11wxPGChoices19GetValuesForStringsERK13wxArrayString' filepath='src/propgrid/property.cpp' line='3106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK11wxPGChoices19GetValuesForStringsERK13wxArrayString@@WXU_3.2'>
          <parameter type-id='type-id-460' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-428' name='strings' filepath='src/propgrid/property.cpp' line='3106' column='1'/>
          <return type-id='type-id-219'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetLabels' mangled-name='_ZNK11wxPGChoices9GetLabelsEv' filepath='src/propgrid/property.cpp' line='3093' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK11wxPGChoices9GetLabelsEv@@WXU_3.2'>
          <parameter type-id='type-id-460' name='this' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='Index' mangled-name='_ZNK11wxPGChoices5IndexEi' filepath='src/propgrid/property.cpp' line='3077' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK11wxPGChoices5IndexEi@@WXU_3.2'>
          <parameter type-id='type-id-460' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-19' name='val' filepath='src/propgrid/property.cpp' line='3077' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='Index' mangled-name='_ZNK11wxPGChoices5IndexERK8wxString' filepath='src/propgrid/property.cpp' line='3061' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK11wxPGChoices5IndexERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-460' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='str' filepath='src/propgrid/property.cpp' line='3061' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Clear' mangled-name='_ZN11wxPGChoices5ClearEv' filepath='src/propgrid/property.cpp' line='3050' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxPGChoices5ClearEv@@WXU_3.2'>
          <parameter type-id='type-id-459' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='RemoveAt' mangled-name='_ZN11wxPGChoices8RemoveAtEmm' filepath='src/propgrid/property.cpp' line='3039' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxPGChoices8RemoveAtEmm@@WXU_3.2'>
          <parameter type-id='type-id-459' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-71' name='nIndex' filepath='src/propgrid/property.cpp' line='3039' column='1'/>
          <parameter type-id='type-id-71' name='count' filepath='src/propgrid/property.cpp' line='3039' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Add' mangled-name='_ZN11wxPGChoices3AddERK13wxArrayStringRK10wxArrayInt' filepath='src/propgrid/property.cpp' line='3020' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxPGChoices3AddERK13wxArrayStringRK10wxArrayInt@@WXU_3.2'>
          <parameter type-id='type-id-459' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-428' name='labels' filepath='include/wx/propgrid/property.h' line='948' column='1'/>
          <parameter type-id='type-id-462' name='values' filepath='include/wx/propgrid/property.h' line='949' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Add' mangled-name='_ZN11wxPGChoices3AddEPKPKwPKl' filepath='src/propgrid/property.cpp' line='3006' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxPGChoices3AddEPKPKwPKl@@WXU_3.2'>
          <parameter type-id='type-id-459' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-463' name='labels' filepath='src/propgrid/property.cpp' line='3006' column='1'/>
          <parameter type-id='type-id-464' name='values' filepath='src/propgrid/property.cpp' line='3006' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Add' mangled-name='_ZN11wxPGChoices3AddEmPK8wxStringPKl' filepath='src/propgrid/property.cpp' line='2992' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxPGChoices3AddEmPK8wxStringPKl@@WXU_3.2'>
          <parameter type-id='type-id-459' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-71' name='count' filepath='src/propgrid/property.cpp' line='2992' column='1'/>
          <parameter type-id='type-id-465' name='labels' filepath='src/propgrid/property.cpp' line='2992' column='1'/>
          <parameter type-id='type-id-399' name='values' filepath='src/propgrid/property.cpp' line='2992' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='AddAsSorted' mangled-name='_ZN11wxPGChoices11AddAsSortedERK8wxStringi' filepath='src/propgrid/property.cpp' line='2972' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxPGChoices11AddAsSortedERK8wxStringi@@WXU_3.2'>
          <parameter type-id='type-id-459' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='label' filepath='src/propgrid/property.cpp' line='2972' column='1'/>
          <parameter type-id='type-id-19' name='value' filepath='src/propgrid/property.cpp' line='2972' column='1'/>
          <return type-id='type-id-466'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Insert' mangled-name='_ZN11wxPGChoices6InsertERK8wxStringii' filepath='src/propgrid/property.cpp' line='2962' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxPGChoices6InsertERK8wxStringii@@WXU_3.2'>
          <parameter type-id='type-id-459' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='label' filepath='src/propgrid/property.cpp' line='2962' column='1'/>
          <parameter type-id='type-id-19' name='index' filepath='src/propgrid/property.cpp' line='2962' column='1'/>
          <parameter type-id='type-id-19' name='value' filepath='src/propgrid/property.cpp' line='2962' column='1'/>
          <return type-id='type-id-466'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Insert' mangled-name='_ZN11wxPGChoices6InsertERK15wxPGChoiceEntryi' filepath='src/propgrid/property.cpp' line='2953' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxPGChoices6InsertERK15wxPGChoiceEntryi@@WXU_3.2'>
          <parameter type-id='type-id-459' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-467' name='entry' filepath='src/propgrid/property.cpp' line='2953' column='1'/>
          <parameter type-id='type-id-19' name='index' filepath='src/propgrid/property.cpp' line='2953' column='1'/>
          <return type-id='type-id-466'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Add' mangled-name='_ZN11wxPGChoices3AddERK8wxStringRK14wxBitmapBundlei' filepath='src/propgrid/property.cpp' line='2942' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxPGChoices3AddERK8wxStringRK14wxBitmapBundlei@@WXU_3.2'>
          <parameter type-id='type-id-459' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='label' filepath='src/propgrid/property.cpp' line='2942' column='1'/>
          <parameter type-id='type-id-468' name='bitmap' filepath='src/propgrid/property.cpp' line='2942' column='1'/>
          <parameter type-id='type-id-19' name='value' filepath='src/propgrid/property.cpp' line='2942' column='1'/>
          <return type-id='type-id-466'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Add' mangled-name='_ZN11wxPGChoices3AddERK8wxStringi' filepath='src/propgrid/property.cpp' line='2932' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxPGChoices3AddERK8wxStringi@@WXU_3.2'>
          <parameter type-id='type-id-459' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='label' filepath='src/propgrid/property.cpp' line='2972' column='1'/>
          <parameter type-id='type-id-19' name='value' filepath='src/propgrid/property.cpp' line='2972' column='1'/>
          <return type-id='type-id-466'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxPGValidationInfo' size-in-bits='512' visibility='default' filepath='include/wx/propgrid/propgrid.h' line='406' column='1' id='type-id-469'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_pValue' type-id='type-id-470' visibility='default' filepath='include/wx/propgrid/propgrid.h' line='447' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_failureMessage' type-id='type-id-61' visibility='default' filepath='include/wx/propgrid/propgrid.h' line='450' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='m_failureBehavior' type-id='type-id-27' visibility='default' filepath='include/wx/propgrid/propgrid.h' line='453' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='456'>
        <var-decl name='m_isFailing' type-id='type-id-3' visibility='default' filepath='include/wx/propgrid/propgrid.h' line='456' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxPGHashMapS2P_wxImplementation_HashTable' size-in-bits='256' visibility='default' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-471'>
      <base-class access='protected' layout-offset-in-bits='0' type-id='type-id-298'/>
      <member-type access='public'>
        <class-decl name='Iterator' size-in-bits='128' visibility='default' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-472'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-473' visibility='default' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_ht' type-id='type-id-474' visibility='default' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='Node' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-475'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-296'/>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_value' type-id='type-id-476' visibility='default' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-477'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-472'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='128' visibility='default' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-478'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-472'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='Self' type-id='type-id-471' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-479'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_key_type' type-id='type-id-481' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-480'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_pointer' type-id='type-id-483' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-482'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-485' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-484'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='hasher' type-id='type-id-305' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-486'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_equal' type-id='type-id-306' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-487'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_extractor' type-id='type-id-489' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-488'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_type' type-id='type-id-61' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-490'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='pointer' type-id='type-id-492' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-491'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-494' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-493'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-71' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-495'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-496' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-476'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_table' type-id='type-id-497' visibility='default' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_tableBuckets' type-id='type-id-71' visibility='default' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_items' type-id='type-id-71' visibility='default' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_hasher' type-id='type-id-486' visibility='default' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='200'>
        <var-decl name='m_equals' type-id='type-id-487' visibility='default' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='208'>
        <var-decl name='m_getKey' type-id='type-id-488' visibility='default' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxPGHashMapS2P_wxImplementation_KeyEx' size-in-bits='8' visibility='default' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-489'>
      <member-type access='private'>
        <typedef-decl name='const_key_reference' type-id='type-id-499' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-498'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_key_type' type-id='type-id-501' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-500'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_reference' type-id='type-id-503' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-502'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_type' type-id='type-id-505' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-504'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='key_type' type-id='type-id-61' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-506'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='pair_type' type-id='type-id-496' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-507'/>
      </member-type>
    </class-decl>
    <class-decl name='wxPGHashMapS2P_wxImplementation_Pair' size-in-bits='448' visibility='default' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-496'>
      <member-type access='public'>
        <typedef-decl name='const_t1' type-id='type-id-481' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-508'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_t2' type-id='type-id-16' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-509'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t1' type-id='type-id-61' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-510'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t2' type-id='type-id-16' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1' id='type-id-511'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='first' type-id='type-id-510' visibility='default' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='second' type-id='type-id-511' visibility='default' filepath='include/wx/propgrid/propgriddefs.h' line='269' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxPGStringTokenizer' size-in-bits='576' visibility='default' filepath='include/wx/propgrid/propgriddefs.h' line='662' column='1' id='type-id-512'>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_str' type-id='type-id-126' visibility='default' filepath='include/wx/propgrid/propgriddefs.h' line='672' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_curPos' type-id='type-id-513' visibility='default' filepath='include/wx/propgrid/propgriddefs.h' line='673' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_readyToken' type-id='type-id-61' visibility='default' filepath='include/wx/propgrid/propgriddefs.h' line='674' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='512'>
        <var-decl name='m_delimiter' type-id='type-id-514' visibility='default' filepath='include/wx/propgrid/propgriddefs.h' line='675' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='GetNextToken' mangled-name='_ZN19wxPGStringTokenizer12GetNextTokenEv' filepath='src/propgrid/propgrid.cpp' line='6208' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxPGStringTokenizer12GetNextTokenEv@@WXU_3.2'>
          <parameter type-id='type-id-515' name='this' is-artificial='yes'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='HasMoreTokens' mangled-name='_ZN19wxPGStringTokenizer13HasMoreTokensEv' filepath='src/propgrid/propgrid.cpp' line='6151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxPGStringTokenizer13HasMoreTokensEv@@WXU_3.2'>
          <parameter type-id='type-id-515' name='this' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes'>
        <function-decl name='~wxPGStringTokenizer' mangled-name='_ZN19wxPGStringTokenizerD2Ev' filepath='src/propgrid/propgrid.cpp' line='6147' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxPGStringTokenizerD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-515' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxPGStringTokenizer' mangled-name='_ZN19wxPGStringTokenizerC2ERK8wxStringw' filepath='src/propgrid/propgrid.cpp' line='6142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxPGStringTokenizerC2ERK8wxStringw@@WXU_3.2'>
          <parameter type-id='type-id-515' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='str' filepath='include/wx/propgrid/propgriddefs.h' line='665' column='1'/>
          <parameter type-id='type-id-115' name='delimiter' filepath='include/wx/propgrid/propgriddefs.h' line='665' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxIntProperty' size-in-bits='4928' visibility='default' filepath='include/wx/propgrid/props.h' line='186' column='1' id='type-id-516'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-517'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-380' mangled-name='_ZN13wxIntProperty12ms_classInfoE' visibility='default' filepath='src/propgrid/props.cpp' line='359' column='1' elf-symbol-id='_ZN13wxIntProperty12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <member-function access='public' static='yes'>
        <function-decl name='GetClassValidator' mangled-name='_ZN13wxIntProperty17GetClassValidatorEv' filepath='src/propgrid/props.cpp' line='521' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxIntProperty17GetClassValidatorEv@@WXU_3.2'>
          <return type-id='type-id-518'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DoValidation' mangled-name='_ZN13wxIntProperty12DoValidationEPK17wxNumericPropertyRlP18wxPGValidationInfoi' filepath='src/propgrid/props.cpp' line='500' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxIntProperty12DoValidationEPK17wxNumericPropertyRlP18wxPGValidationInfoi@@WXU_3.2'>
          <parameter type-id='type-id-519'/>
          <parameter type-id='type-id-520'/>
          <parameter type-id='type-id-521'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DoValidation' mangled-name='_ZN13wxIntProperty12DoValidationEPK17wxNumericPropertyRxP18wxPGValidationInfoi' filepath='src/propgrid/props.cpp' line='489' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxIntProperty12DoValidationEPK17wxNumericPropertyRxP18wxPGValidationInfoi@@WXU_3.2'>
          <parameter type-id='type-id-519'/>
          <parameter type-id='type-id-522'/>
          <parameter type-id='type-id-521'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='DoValidation' mangled-name='_ZN13wxIntProperty12DoValidationEPK17wxNumericPropertyR16wxLongLongNativeP18wxPGValidationInfoi' filepath='src/propgrid/props.cpp' line='478' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxIntProperty12DoValidationEPK17wxNumericPropertyR16wxLongLongNativeP18wxPGValidationInfoi@@WXU_3.2'>
          <parameter type-id='type-id-519'/>
          <parameter type-id='type-id-523'/>
          <parameter type-id='type-id-521'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxIntProperty' mangled-name='_ZN13wxIntPropertyC2ERK8wxStringS2_RK16wxLongLongNative' filepath='src/propgrid/props.cpp' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxIntPropertyC2ERK8wxStringS2_RK16wxLongLongNative@@WXU_3.2'>
          <parameter type-id='type-id-524' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='label' filepath='src/propgrid/props.cpp' line='368' column='1'/>
          <parameter type-id='type-id-126' name='name' filepath='src/propgrid/props.cpp' line='368' column='1'/>
          <parameter type-id='type-id-525' name='value' filepath='src/propgrid/props.cpp' line='369' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxIntProperty' mangled-name='_ZN13wxIntPropertyC2ERK8wxStringS2_l' filepath='src/propgrid/props.cpp' line='361' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxIntPropertyC2ERK8wxStringS2_l@@WXU_3.2'>
          <parameter type-id='type-id-524' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='label' filepath='include/wx/propgrid/props.h' line='190' column='1'/>
          <parameter type-id='type-id-126' name='name' filepath='include/wx/propgrid/props.h' line='191' column='1'/>
          <parameter type-id='type-id-21' name='value' filepath='include/wx/propgrid/props.h' line='192' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='wxCreateObject' mangled-name='_ZN13wxIntProperty14wxCreateObjectEv' filepath='src/propgrid/props.cpp' line='359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxIntProperty14wxCreateObjectEv@@WXU_3.2'>
          <return type-id='type-id-252'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxIntProperty' mangled-name='_ZN13wxIntPropertyD4Ev' filepath='src/propgrid/props.cpp' line='375' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-526' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxIntProperty' mangled-name='_ZN13wxIntPropertyD0Ev' filepath='src/propgrid/props.cpp' line='375' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxIntPropertyD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-526' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxIntProperty' mangled-name='_ZN13wxIntPropertyD2Ev' filepath='src/propgrid/props.cpp' line='375' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxIntPropertyD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-526' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK13wxIntProperty12GetClassInfoEv' filepath='src/propgrid/props.cpp' line='359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxIntProperty12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-527' is-artificial='yes'/>
          <return type-id='type-id-383'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='7'>
        <function-decl name='ValidateValue' mangled-name='_ZNK13wxIntProperty13ValidateValueER9wxVariantR18wxPGValidationInfo' filepath='src/propgrid/props.cpp' line='509' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxIntProperty13ValidateValueER9wxVariantR18wxPGValidationInfo@@WXU_3.2'>
          <parameter type-id='type-id-527' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-528'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='8'>
        <function-decl name='StringToValue' mangled-name='_ZNK13wxIntProperty13StringToValueER9wxVariantRK8wxStringi' filepath='src/propgrid/props.cpp' line='396' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxIntProperty13StringToValueER9wxVariantRK8wxStringi@@WXU_3.2'>
          <parameter type-id='type-id-527' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='9'>
        <function-decl name='IntToValue' mangled-name='_ZNK13wxIntProperty10IntToValueER9wxVariantii' filepath='src/propgrid/props.cpp' line='467' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxIntProperty10IntToValueER9wxVariantii@@WXU_3.2'>
          <parameter type-id='type-id-527' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='10'>
        <function-decl name='ValueToString' mangled-name='_ZNK13wxIntProperty13ValueToStringER9wxVarianti' filepath='src/propgrid/props.cpp' line='377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxIntProperty13ValueToStringER9wxVarianti@@WXU_3.2'>
          <parameter type-id='type-id-527' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='14'>
        <function-decl name='DoGetEditorClass' mangled-name='_ZNK13wxIntProperty16DoGetEditorClassEv' filepath='src/propgrid/props.cpp' line='359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxIntProperty16DoGetEditorClassEv@@WXU_3.2'>
          <parameter type-id='type-id-527' is-artificial='yes'/>
          <return type-id='type-id-391'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='15'>
        <function-decl name='DoGetValidator' mangled-name='_ZNK13wxIntProperty14DoGetValidatorEv' filepath='src/propgrid/props.cpp' line='535' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxIntProperty14DoGetValidatorEv@@WXU_3.2'>
          <parameter type-id='type-id-527' is-artificial='yes'/>
          <return type-id='type-id-518'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='25'>
        <function-decl name='AddSpinStepValue' mangled-name='_ZNK13wxIntProperty16AddSpinStepValueEl' filepath='src/propgrid/props.cpp' line='540' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxIntProperty16AddSpinStepValueEl@@WXU_3.2'>
          <parameter type-id='type-id-527' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-390'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxBoolProperty' size-in-bits='3264' visibility='default' filepath='include/wx/propgrid/props.h' line='332' column='1' id='type-id-529'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-433'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-380' mangled-name='_ZN14wxBoolProperty12ms_classInfoE' visibility='default' filepath='src/propgrid/props.cpp' line='1068' column='1' elf-symbol-id='_ZN14wxBoolProperty12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxBoolProperty' mangled-name='_ZN14wxBoolPropertyC2ERK8wxStringS2_b' filepath='src/propgrid/props.cpp' line='1082' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxBoolPropertyC2ERK8wxStringS2_b@@WXU_3.2'>
          <parameter type-id='type-id-530' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='label' filepath='include/wx/propgrid/props.h' line='336' column='1'/>
          <parameter type-id='type-id-126' name='name' filepath='include/wx/propgrid/props.h' line='337' column='1'/>
          <parameter type-id='type-id-3' name='value' filepath='include/wx/propgrid/props.h' line='338' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='wxCreateObject' mangled-name='_ZN14wxBoolProperty14wxCreateObjectEv' filepath='src/propgrid/props.cpp' line='1068' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxBoolProperty14wxCreateObjectEv@@WXU_3.2'>
          <return type-id='type-id-252'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBoolProperty' mangled-name='_ZN14wxBoolPropertyD4Ev' filepath='src/propgrid/props.cpp' line='1092' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-531' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBoolProperty' mangled-name='_ZN14wxBoolPropertyD0Ev' filepath='src/propgrid/props.cpp' line='1092' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxBoolPropertyD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-531' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBoolProperty' mangled-name='_ZN14wxBoolPropertyD2Ev' filepath='src/propgrid/props.cpp' line='1092' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxBoolPropertyD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-531' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK14wxBoolProperty12GetClassInfoEv' filepath='src/propgrid/props.cpp' line='1068' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxBoolProperty12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-532' is-artificial='yes'/>
          <return type-id='type-id-383'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='8'>
        <function-decl name='StringToValue' mangled-name='_ZNK14wxBoolProperty13StringToValueER9wxVariantRK8wxStringi' filepath='src/propgrid/props.cpp' line='1130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxBoolProperty13StringToValueER9wxVariantRK8wxStringi@@WXU_3.2'>
          <parameter type-id='type-id-532' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='9'>
        <function-decl name='IntToValue' mangled-name='_ZNK14wxBoolProperty10IntToValueER9wxVariantii' filepath='src/propgrid/props.cpp' line='1152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxBoolProperty10IntToValueER9wxVariantii@@WXU_3.2'>
          <parameter type-id='type-id-532' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='10'>
        <function-decl name='ValueToString' mangled-name='_ZNK14wxBoolProperty13ValueToStringER9wxVarianti' filepath='src/propgrid/props.cpp' line='1094' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxBoolProperty13ValueToStringER9wxVarianti@@WXU_3.2'>
          <parameter type-id='type-id-532' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='14'>
        <function-decl name='DoGetEditorClass' mangled-name='_ZNK14wxBoolProperty16DoGetEditorClassEv' filepath='src/propgrid/props.cpp' line='1070' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxBoolProperty16DoGetEditorClassEv@@WXU_3.2'>
          <parameter type-id='type-id-532' is-artificial='yes'/>
          <return type-id='type-id-391'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='DoSetAttribute' mangled-name='_ZN14wxBoolProperty14DoSetAttributeERK8wxStringR9wxVariant' filepath='src/propgrid/props.cpp' line='1164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxBoolProperty14DoSetAttributeERK8wxStringR9wxVariant@@WXU_3.2'>
          <parameter type-id='type-id-531' is-artificial='yes'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-389'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEnumProperty' size-in-bits='3264' visibility='default' filepath='include/wx/propgrid/props.h' line='362' column='1' id='type-id-394'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-433'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-380' mangled-name='_ZN14wxEnumProperty12ms_classInfoE' visibility='default' filepath='src/propgrid/props.cpp' line='1185' column='1' elf-symbol-id='_ZN14wxEnumProperty12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3232'>
        <var-decl name='m_index' type-id='type-id-19' visibility='default' filepath='include/wx/propgrid/props.h' line='460' column='1'/>
      </data-member>
      <member-function access='protected' const='yes'>
        <function-decl name='GetIndex' mangled-name='_ZNK14wxEnumProperty8GetIndexEv' filepath='src/propgrid/props.cpp' line='1406' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxEnumProperty8GetIndexEv@@WXU_3.2'>
          <parameter type-id='type-id-533' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='SetIndex' mangled-name='_ZN14wxEnumProperty8SetIndexEi' filepath='src/propgrid/props.cpp' line='1401' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxEnumProperty8SetIndexEi@@WXU_3.2'>
          <parameter type-id='type-id-534' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-19' name='index' filepath='src/propgrid/props.cpp' line='1401' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes'>
        <function-decl name='ValueFromInt_' mangled-name='_ZNK14wxEnumProperty13ValueFromInt_ER9wxVariantPiii' filepath='src/propgrid/props.cpp' line='1362' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxEnumProperty13ValueFromInt_ER9wxVariantPiii@@WXU_3.2'>
          <parameter type-id='type-id-533' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-389' name='value' filepath='src/propgrid/props.cpp' line='1362' column='1'/>
          <parameter type-id='type-id-535' name='pIndex' filepath='src/propgrid/props.cpp' line='1362' column='1'/>
          <parameter type-id='type-id-19' name='intVal' filepath='src/propgrid/props.cpp' line='1362' column='1'/>
          <parameter type-id='type-id-19' name='argFlags' filepath='src/propgrid/props.cpp' line='1362' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes'>
        <function-decl name='ValueFromString_' mangled-name='_ZNK14wxEnumProperty16ValueFromString_ER9wxVariantPiRK8wxStringi' filepath='src/propgrid/props.cpp' line='1327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxEnumProperty16ValueFromString_ER9wxVariantPiRK8wxStringi@@WXU_3.2'>
          <parameter type-id='type-id-533' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-389' name='value' filepath='src/propgrid/props.cpp' line='1327' column='1'/>
          <parameter type-id='type-id-535' name='pIndex' filepath='src/propgrid/props.cpp' line='1327' column='1'/>
          <parameter type-id='type-id-126' name='text' filepath='src/propgrid/props.cpp' line='1327' column='1'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxEnumProperty' mangled-name='_ZN14wxEnumPropertyC2ERK8wxStringS2_R11wxPGChoicesi' filepath='src/propgrid/props.cpp' line='1243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxEnumPropertyC2ERK8wxStringS2_R11wxPGChoicesi@@WXU_3.2'>
          <parameter type-id='type-id-534' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='label' filepath='include/wx/propgrid/props.h' line='373' column='1'/>
          <parameter type-id='type-id-126' name='name' filepath='include/wx/propgrid/props.h' line='374' column='1'/>
          <parameter type-id='type-id-536' name='choices' filepath='include/wx/propgrid/props.h' line='375' column='1'/>
          <parameter type-id='type-id-19' name='value' filepath='include/wx/propgrid/props.h' line='376' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxEnumProperty' mangled-name='_ZN14wxEnumPropertyC2ERK8wxStringS2_RK13wxArrayStringRK10wxArrayInti' filepath='src/propgrid/props.cpp' line='1228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxEnumPropertyC2ERK8wxStringS2_RK13wxArrayStringRK10wxArrayInti@@WXU_3.2'>
          <parameter type-id='type-id-534' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='label' filepath='src/propgrid/props.cpp' line='1228' column='1'/>
          <parameter type-id='type-id-126' name='name' filepath='src/propgrid/props.cpp' line='1228' column='1'/>
          <parameter type-id='type-id-428' name='labels' filepath='src/propgrid/props.cpp' line='1229' column='1'/>
          <parameter type-id='type-id-462' name='values' filepath='src/propgrid/props.cpp' line='1229' column='1'/>
          <parameter type-id='type-id-19' name='value' filepath='src/propgrid/props.cpp' line='1229' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxEnumProperty' mangled-name='_ZN14wxEnumPropertyC2ERK8wxStringS2_PKPKcPKlP11wxPGChoicesi' filepath='src/propgrid/props.cpp' line='1201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxEnumPropertyC2ERK8wxStringS2_PKPKcPKlP11wxPGChoicesi@@WXU_3.2'>
          <parameter type-id='type-id-534' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='label' filepath='include/wx/propgrid/props.h' line='379' column='1'/>
          <parameter type-id='type-id-126' name='name' filepath='include/wx/propgrid/props.h' line='380' column='1'/>
          <parameter type-id='type-id-398' name='untranslatedLabels' filepath='include/wx/propgrid/props.h' line='381' column='1'/>
          <parameter type-id='type-id-399' name='values' filepath='include/wx/propgrid/props.h' line='382' column='1'/>
          <parameter type-id='type-id-400' name='choicesCache' filepath='include/wx/propgrid/props.h' line='383' column='1'/>
          <parameter type-id='type-id-19' name='value' filepath='include/wx/propgrid/props.h' line='384' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxEnumProperty' mangled-name='_ZN14wxEnumPropertyC2ERK8wxStringS2_PKPKwPKli' filepath='src/propgrid/props.cpp' line='1187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxEnumPropertyC2ERK8wxStringS2_PKPKwPKli@@WXU_3.2'>
          <parameter type-id='type-id-534' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='label' filepath='include/wx/propgrid/props.h' line='368' column='1'/>
          <parameter type-id='type-id-126' name='name' filepath='include/wx/propgrid/props.h' line='369' column='1'/>
          <parameter type-id='type-id-463' name='labels' filepath='include/wx/propgrid/props.h' line='370' column='1'/>
          <parameter type-id='type-id-399' name='values' filepath='include/wx/propgrid/props.h' line='371' column='1'/>
          <parameter type-id='type-id-19' name='value' filepath='include/wx/propgrid/props.h' line='372' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='wxCreateObject' mangled-name='_ZN14wxEnumProperty14wxCreateObjectEv' filepath='src/propgrid/props.cpp' line='1185' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxEnumProperty14wxCreateObjectEv@@WXU_3.2'>
          <return type-id='type-id-252'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEnumProperty' mangled-name='_ZN14wxEnumPropertyD4Ev' filepath='include/wx/propgrid/props.h' line='399' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-537' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEnumProperty' mangled-name='_ZN14wxEnumPropertyD0Ev' filepath='include/wx/propgrid/props.h' line='399' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxEnumPropertyD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-537' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEnumProperty' mangled-name='_ZN14wxEnumPropertyD0Ev' filepath='include/wx/propgrid/props.h' line='399' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxEnumPropertyD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-537' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEnumProperty' mangled-name='_ZN14wxEnumPropertyD2Ev' filepath='include/wx/propgrid/props.h' line='399' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxEnumPropertyD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-537' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK14wxEnumProperty12GetClassInfoEv' filepath='src/propgrid/props.cpp' line='1185' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxEnumProperty12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-538' is-artificial='yes'/>
          <return type-id='type-id-383'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='OnSetValue' mangled-name='_ZN14wxEnumProperty10OnSetValueEv' filepath='include/wx/propgrid/props.h' line='403' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxEnumProperty10OnSetValueEv@@WXU_3.2'>
          <parameter type-id='type-id-537' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='7'>
        <function-decl name='ValidateValue' mangled-name='_ZNK14wxEnumProperty13ValidateValueER9wxVariantR18wxPGValidationInfo' filepath='include/wx/propgrid/props.h' line='408' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxEnumProperty13ValidateValueER9wxVariantR18wxPGValidationInfo@@WXU_3.2'>
          <parameter type-id='type-id-538' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-528'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='8'>
        <function-decl name='StringToValue' mangled-name='_ZNK14wxEnumProperty13StringToValueER9wxVariantRK8wxStringi' filepath='include/wx/propgrid/props.h' line='405' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxEnumProperty13StringToValueER9wxVariantRK8wxStringi@@WXU_3.2'>
          <parameter type-id='type-id-538' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='9'>
        <function-decl name='IntToValue' mangled-name='_ZNK14wxEnumProperty10IntToValueER9wxVariantii' filepath='include/wx/propgrid/props.h' line='413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxEnumProperty10IntToValueER9wxVariantii@@WXU_3.2'>
          <parameter type-id='type-id-538' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='10'>
        <function-decl name='ValueToString' mangled-name='_ZNK14wxEnumProperty13ValueToStringER9wxVarianti' filepath='include/wx/propgrid/props.h' line='404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxEnumProperty13ValueToStringER9wxVarianti@@WXU_3.2'>
          <parameter type-id='type-id-538' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='14'>
        <function-decl name='DoGetEditorClass' mangled-name='_ZNK14wxEnumProperty16DoGetEditorClassEv' filepath='include/wx/propgrid/props.h' line='364' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxEnumProperty16DoGetEditorClassEv@@WXU_3.2'>
          <parameter type-id='type-id-538' is-artificial='yes'/>
          <return type-id='type-id-391'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='18'>
        <function-decl name='GetChoiceSelection' mangled-name='_ZNK14wxEnumProperty18GetChoiceSelectionEv' filepath='include/wx/propgrid/props.h' line='426' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-538' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='25'>
        <function-decl name='GetIndexForValue' mangled-name='_ZNK14wxEnumProperty16GetIndexForValueEi' filepath='include/wx/propgrid/props.h' line='421' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxEnumProperty16GetIndexForValueEi@@WXU_3.2'>
          <parameter type-id='type-id-538' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEditorDialogProperty' size-in-bits='3712' visibility='default' filepath='include/wx/propgrid/props.h' line='575' column='1' id='type-id-385'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-433'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-380' mangled-name='_ZN22wxEditorDialogProperty12ms_classInfoE' visibility='default' filepath='src/propgrid/props.cpp' line='1958' column='1' elf-symbol-id='_ZN22wxEditorDialogProperty12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='3264'>
        <var-decl name='m_dlgTitle' type-id='type-id-61' visibility='default' filepath='include/wx/propgrid/props.h' line='591' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='3648'>
        <var-decl name='m_dlgStyle' type-id='type-id-21' visibility='default' filepath='include/wx/propgrid/props.h' line='592' column='1'/>
      </data-member>
      <member-function access='protected' constructor='yes'>
        <function-decl name='wxEditorDialogProperty' mangled-name='_ZN22wxEditorDialogPropertyC2ERK8wxStringS2_' filepath='src/propgrid/props.cpp' line='1960' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxEditorDialogPropertyC2ERK8wxStringS2_@@WXU_3.2'>
          <parameter type-id='type-id-539' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='label' filepath='include/wx/propgrid/props.h' line='587' column='1'/>
          <parameter type-id='type-id-126' name='name' filepath='include/wx/propgrid/props.h' line='587' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEditorDialogProperty' mangled-name='_ZN22wxEditorDialogPropertyD4Ev' filepath='include/wx/propgrid/props.h' line='581' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-540' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEditorDialogProperty' mangled-name='_ZN22wxEditorDialogPropertyD0Ev' filepath='include/wx/propgrid/props.h' line='581' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxEditorDialogPropertyD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-540' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEditorDialogProperty' mangled-name='_ZN22wxEditorDialogPropertyD0Ev' filepath='include/wx/propgrid/props.h' line='581' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxEditorDialogPropertyD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-540' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEditorDialogProperty' mangled-name='_ZN22wxEditorDialogPropertyD2Ev' filepath='include/wx/propgrid/props.h' line='581' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxEditorDialogPropertyD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-540' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK22wxEditorDialogProperty12GetClassInfoEv' filepath='src/propgrid/props.cpp' line='1958' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK22wxEditorDialogProperty12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-541' is-artificial='yes'/>
          <return type-id='type-id-383'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='DoSetAttribute' mangled-name='_ZN22wxEditorDialogProperty14DoSetAttributeERK8wxStringR9wxVariant' filepath='include/wx/propgrid/props.h' line='584' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxEditorDialogProperty14DoSetAttributeERK8wxStringR9wxVariant@@WXU_3.2'>
          <parameter type-id='type-id-540' is-artificial='yes'/>
          <parameter type-id='type-id-126'/>
          <parameter type-id='type-id-389'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='22'>
        <function-decl name='GetEditorDialog' mangled-name='_ZNK22wxEditorDialogProperty15GetEditorDialogEv' filepath='include/wx/propgrid/props.h' line='583' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK22wxEditorDialogProperty15GetEditorDialogEv@@WXU_3.2'>
          <parameter type-id='type-id-541' is-artificial='yes'/>
          <return type-id='type-id-542'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='25'>
        <function-decl name='DisplayEditorDialog' mangled-name='_ZN22wxEditorDialogProperty19DisplayEditorDialogEP14wxPropertyGridR9wxVariant' filepath='include/wx/propgrid/props.h' line='589' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-540' is-artificial='yes'/>
          <parameter type-id='type-id-392'/>
          <parameter type-id='type-id-389'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxFileProperty' size-in-bits='4928' visibility='default' filepath='include/wx/propgrid/props.h' line='601' column='1' id='type-id-417'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-385'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-380' mangled-name='_ZN14wxFileProperty12ms_classInfoE' visibility='default' filepath='src/propgrid/props.cpp' line='1989' column='1' elf-symbol-id='_ZN14wxFileProperty12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='3712'>
        <var-decl name='m_wildcard' type-id='type-id-61' visibility='default' filepath='include/wx/propgrid/props.h' line='627' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='4096'>
        <var-decl name='m_basePath' type-id='type-id-61' visibility='default' filepath='include/wx/propgrid/props.h' line='628' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='4480'>
        <var-decl name='m_initialPath' type-id='type-id-61' visibility='default' filepath='include/wx/propgrid/props.h' line='629' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='4864'>
        <var-decl name='m_indFilter' type-id='type-id-19' visibility='default' filepath='include/wx/propgrid/props.h' line='630' column='1'/>
      </data-member>
      <member-function access='public' const='yes'>
        <function-decl name='GetFileName' mangled-name='_ZNK14wxFileProperty11GetFileNameEv' filepath='src/propgrid/props.cpp' line='2078' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxFileProperty11GetFileNameEv@@WXU_3.2'>
          <parameter type-id='type-id-543' name='this' is-artificial='yes'/>
          <return type-id='type-id-275'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='GetClassValidator' mangled-name='_ZN14wxFileProperty17GetClassValidatorEv' filepath='src/propgrid/props.cpp' line='2005' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxFileProperty17GetClassValidatorEv@@WXU_3.2'>
          <return type-id='type-id-518'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxFileProperty' mangled-name='_ZN14wxFilePropertyC2ERK8wxStringS2_S2_' filepath='src/propgrid/props.cpp' line='1991' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxFilePropertyC2ERK8wxStringS2_S2_@@WXU_3.2'>
          <parameter type-id='type-id-544' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-126' name='label' filepath='include/wx/propgrid/props.h' line='606' column='1'/>
          <parameter type-id='type-id-126' name='name' filepath='include/wx/propgrid/props.h' line='607' column='1'/>
          <parameter type-id='type-id-126' name='value' filepath='include/wx/propgrid/props.h' line='608' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='wxCreateObject' mangled-name='_ZN14wxFileProperty14wxCreateObjectEv' filepath='src/propgrid/props.cpp' line='1989' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxFileProperty14wxCreateObjectEv@@WXU_3.2'>
          <return type-id='type-id-252'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFileProperty' mangled-name='_ZN14wxFilePropertyD4Ev' filepath='include/wx/propgrid/props.h' line='609' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-545' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFileProperty' mangled-name='_ZN14wxFilePropertyD0Ev' filepath='include/wx/propgrid/props.h' line='609' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxFilePropertyD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-545' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFileProperty' mangled-name='_ZN14wxFilePropertyD0Ev' filepath='include/wx/propgrid/props.h' line='609' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxFilePropertyD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-545' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFileProperty' mangled-name='_ZN14wxFilePropertyD2Ev' filepath='include/wx/propgrid/props.h' line='609' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxFilePropertyD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-545' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
