<abi-corpus version='2.0' architecture='elf-amd-x86_64' soname='libwx_gtk3u_stc-3.2.so.0'>
  <elf-needed>
    <dependency name='libgdk-3.so.0'/>
    <dependency name='libwx_gtk3u_core-3.2.so.0'/>
    <dependency name='libwx_baseu-3.2.so.0'/>
    <dependency name='libm.so.6'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_ZN16wxStyledTextCtrl10AddTabStopEii' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN16wxStyledTextCtrl10AddTextRawEPKci' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN16wxStyledTextCtrl10AppendTextERK8wxString' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN16wxStyledTextCtrl10BraceMatchEii' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN16wxStyledTextCtrl10DeleteBackEv' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='wxEVT_STC_DRAG_OVER' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_STC_DWELLEND' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_STC_DWELLSTART' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_STC_HOTSPOT_CLICK' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_STC_HOTSPOT_DCLICK' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_STC_HOTSPOT_RELEASE_CLICK' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_STC_INDICATOR_CLICK' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_STC_INDICATOR_RELEASE' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_STC_KEY' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_STC_MACRORECORD' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_STC_MARGINCLICK' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_STC_MARGIN_RIGHT_CLICK' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_STC_MODIFIED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_STC_NEEDSHOWN' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_STC_PAINTED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_STC_ROMODIFYATTEMPT' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_STC_SAVEPOINTLEFT' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_STC_SAVEPOINTREACHED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_STC_START_DRAG' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_STC_STYLENEEDED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_STC_UPDATEUI' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_STC_URIDROPPED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_STC_USERLISTSELECTION' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_STC_ZOOM' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxSTCNameStr' size='10' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/stc/PlatWX.cpp' language='LANG_C_plus_plus_14'>
    <enum-decl name='wxBrushStyle' filepath='include/wx/brush.h' line='20' column='1' id='type-id-1'>
      <underlying-type type-id='type-id-2'/>
      <enumerator name='wxBRUSHSTYLE_INVALID' value='-1'/>
      <enumerator name='wxBRUSHSTYLE_SOLID' value='100'/>
      <enumerator name='wxBRUSHSTYLE_TRANSPARENT' value='106'/>
      <enumerator name='wxBRUSHSTYLE_STIPPLE_MASK_OPAQUE' value='107'/>
      <enumerator name='wxBRUSHSTYLE_STIPPLE_MASK' value='108'/>
      <enumerator name='wxBRUSHSTYLE_STIPPLE' value='110'/>
      <enumerator name='wxBRUSHSTYLE_BDIAGONAL_HATCH' value='111'/>
      <enumerator name='wxBRUSHSTYLE_CROSSDIAG_HATCH' value='112'/>
      <enumerator name='wxBRUSHSTYLE_FDIAGONAL_HATCH' value='113'/>
      <enumerator name='wxBRUSHSTYLE_CROSS_HATCH' value='114'/>
      <enumerator name='wxBRUSHSTYLE_HORIZONTAL_HATCH' value='115'/>
      <enumerator name='wxBRUSHSTYLE_VERTICAL_HATCH' value='116'/>
      <enumerator name='wxBRUSHSTYLE_FIRST_HATCH' value='111'/>
      <enumerator name='wxBRUSHSTYLE_LAST_HATCH' value='116'/>
    </enum-decl>
    <class-decl name='wxBrushBase' size-in-bits='128' visibility='default' filepath='include/wx/brush.h' line='41' column='1' id='type-id-3'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-4'/>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBrushBase' mangled-name='_ZN11wxBrushBaseD4Ev' filepath='include/wx/brush.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-5' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='SetColour' mangled-name='_ZN11wxBrushBase9SetColourERK8wxColour' filepath='include/wx/brush.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-5' is-artificial='yes'/>
          <parameter type-id='type-id-8'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='SetColour' mangled-name='_ZN11wxBrushBase9SetColourEhhh' filepath='include/wx/brush.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-5' is-artificial='yes'/>
          <parameter type-id='type-id-9'/>
          <parameter type-id='type-id-9'/>
          <parameter type-id='type-id-9'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='SetStyle' mangled-name='_ZN11wxBrushBase8SetStyleE12wxBrushStyle' filepath='include/wx/brush.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-5' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <function-decl name='SetStipple' mangled-name='_ZN11wxBrushBase10SetStippleERK8wxBitmap' filepath='include/wx/brush.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-5' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='12'>
        <function-decl name='GetColour' mangled-name='_ZNK11wxBrushBase9GetColourEv' filepath='include/wx/brush.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='13'>
        <function-decl name='GetStyle' mangled-name='_ZNK11wxBrushBase8GetStyleEv' filepath='include/wx/brush.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='14'>
        <function-decl name='GetStipple' mangled-name='_ZNK11wxBrushBase10GetStippleEv' filepath='include/wx/brush.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-13'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='15'>
        <function-decl name='IsHatch' mangled-name='_ZNK11wxBrushBase7IsHatchEv' filepath='include/wx/brush.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxNavigationEnabled&lt;wxWindow&gt;' size-in-bits='5568' visibility='default' filepath='include/wx/containr.h' line='189' column='1' id='type-id-15'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-16'/>
      <data-member access='protected' layout-offset-in-bits='5312'>
        <var-decl name='m_container' type-id='type-id-17' visibility='default' filepath='include/wx/containr.h' line='293' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='71'>
        <function-decl name='SetFocus' mangled-name='_ZN19wxNavigationEnabledI8wxWindowE8SetFocusEv' filepath='include/wx/containr.h' line='250' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-18' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='74'>
        <function-decl name='AcceptsFocus' mangled-name='_ZNK19wxNavigationEnabledI8wxWindowE12AcceptsFocusEv' filepath='include/wx/containr.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='75'>
        <function-decl name='AcceptsFocusRecursively' mangled-name='_ZNK19wxNavigationEnabledI8wxWindowE23AcceptsFocusRecursivelyEv' filepath='include/wx/containr.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='76'>
        <function-decl name='AcceptsFocusFromKeyboard' mangled-name='_ZNK19wxNavigationEnabledI8wxWindowE24AcceptsFocusFromKeyboardEv' filepath='include/wx/containr.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='82'>
        <function-decl name='AddChild' mangled-name='_ZN19wxNavigationEnabledI8wxWindowE8AddChildEP12wxWindowBase' filepath='include/wx/containr.h' line='224' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-18' is-artificial='yes'/>
          <parameter type-id='type-id-20'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='83'>
        <function-decl name='RemoveChild' mangled-name='_ZN19wxNavigationEnabledI8wxWindowE11RemoveChildEP12wxWindowBase' filepath='include/wx/containr.h' line='237' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-18' is-artificial='yes'/>
          <parameter type-id='type-id-20'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxCursorBase' size-in-bits='128' visibility='default' filepath='include/wx/cursor.h' line='25' column='1' id='type-id-21'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-4'/>
      <member-function access='public' const='yes' vtable-offset='8'>
        <function-decl name='GetHotSpot' mangled-name='_ZNK12wxCursorBase10GetHotSpotEv' filepath='include/wx/cursor.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-22' is-artificial='yes'/>
          <return type-id='type-id-23'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='wxRasterOperationMode' filepath='include/wx/dc.h' line='50' column='1' id='type-id-24'>
      <underlying-type type-id='type-id-2'/>
      <enumerator name='wxCLEAR' value='0'/>
      <enumerator name='wxXOR' value='1'/>
      <enumerator name='wxINVERT' value='2'/>
      <enumerator name='wxOR_REVERSE' value='3'/>
      <enumerator name='wxAND_REVERSE' value='4'/>
      <enumerator name='wxCOPY' value='5'/>
      <enumerator name='wxAND' value='6'/>
      <enumerator name='wxAND_INVERT' value='7'/>
      <enumerator name='wxNO_OP' value='8'/>
      <enumerator name='wxNOR' value='9'/>
      <enumerator name='wxEQUIV' value='10'/>
      <enumerator name='wxSRC_INVERT' value='11'/>
      <enumerator name='wxOR_INVERT' value='12'/>
      <enumerator name='wxNAND' value='13'/>
      <enumerator name='wxOR' value='14'/>
      <enumerator name='wxSET' value='15'/>
    </enum-decl>
    <class-decl name='wxDCTextColourChanger' size-in-bits='192' visibility='default' filepath='include/wx/dc.h' line='1452' column='1' id='type-id-25'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_dc' type-id='type-id-26' visibility='default' filepath='include/wx/dc.h' line='1476' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_colFgOld' type-id='type-id-12' visibility='default' filepath='include/wx/dc.h' line='1478' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxDCPenChanger' size-in-bits='192' visibility='default' filepath='include/wx/dc.h' line='1560' column='1' id='type-id-27'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_dc' type-id='type-id-26' visibility='default' filepath='include/wx/dc.h' line='1575' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_penOld' type-id='type-id-28' visibility='default' filepath='include/wx/dc.h' line='1577' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxDCBrushChanger' size-in-bits='192' visibility='default' filepath='include/wx/dc.h' line='1587' column='1' id='type-id-29'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_dc' type-id='type-id-26' visibility='default' filepath='include/wx/dc.h' line='1602' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_brushOld' type-id='type-id-30' visibility='default' filepath='include/wx/dc.h' line='1604' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxOrientation' filepath='include/wx/defs.h' line='1351' column='1' id='type-id-31'>
      <underlying-type type-id='type-id-2'/>
      <enumerator name='wxHORIZONTAL' value='4'/>
      <enumerator name='wxVERTICAL' value='8'/>
      <enumerator name='wxBOTH' value='12'/>
      <enumerator name='wxORIENTATION_MASK' value='12'/>
    </enum-decl>
    <class-decl name='wxArrayVideoModes' size-in-bits='192' visibility='default' filepath='include/wx/display.h' line='24' column='1' id='type-id-32'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-33'/>
    </class-decl>
    <class-decl name='wxDisplay' size-in-bits='64' visibility='default' filepath='include/wx/display.h' line='42' column='1' id='type-id-34'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_impl' type-id='type-id-35' visibility='default' filepath='include/wx/display.h' line='158' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArray_SortFunction&lt;wxDynamicLibraryDetails*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-36'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-38' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-37'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-37' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArray_SortFunction&lt;wxFontEncoding&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-39'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-41' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-40'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-40' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArray_SortFunction&lt;wxVideoMode*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-42'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-44' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-43'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-43' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;wxDynamicLibraryDetails*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-45'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-47' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-46'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-46' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;wxFontEncoding&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-48'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-50' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-49'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-49' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;wxVideoMode*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-51'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-53' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-52'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-52' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxBaseArray&lt;wxDynamicLibraryDetails*, wxSortedArray_SortFunction&lt;wxDynamicLibraryDetails*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-54'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-55'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-46' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-56'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-37' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-57'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-59' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-58'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseArray&lt;wxFontEncoding, wxSortedArray_SortFunction&lt;wxFontEncoding&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-60'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-61'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-49' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-62'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-40' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-63'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-65' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-64'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseArray&lt;wxVideoMode*, wxSortedArray_SortFunction&lt;wxVideoMode*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-66'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-67'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-52' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-68'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-43' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-69'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-71' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-70'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseObjectArray&lt;wxDynamicLibraryDetails, wxObjectArrayTraitsForwxDynamicLibraryDetailsArray&gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='276' column='1' id='type-id-72'>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-54'/>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-38' filepath='include/wx/dynarray.h' line='283' column='1' id='type-id-73'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseObjectArray&lt;wxVideoMode, wxObjectArrayTraitsForwxArrayVideoModes&gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='276' column='1' id='type-id-33'>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-66'/>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-44' filepath='include/wx/dynarray.h' line='283' column='1' id='type-id-74'/>
      </member-type>
    </class-decl>
    <typedef-decl name='wxDllType' type-id='type-id-75' filepath='include/wx/dynlib.h' line='31' column='1' id='type-id-76'/>
    <enum-decl name='wxDynamicLibraryCategory' filepath='include/wx/dynlib.h' line='72' column='1' id='type-id-77'>
      <underlying-type type-id='type-id-2'/>
      <enumerator name='wxDL_LIBRARY' value='0'/>
      <enumerator name='wxDL_MODULE' value='1'/>
    </enum-decl>
    <enum-decl name='wxPluginCategory' filepath='include/wx/dynlib.h' line='78' column='1' id='type-id-78'>
      <underlying-type type-id='type-id-2'/>
      <enumerator name='wxDL_PLUGIN_GUI' value='0'/>
      <enumerator name='wxDL_PLUGIN_BASE' value='1'/>
    </enum-decl>
    <class-decl name='wxDynamicLibraryDetails' size-in-bits='1280' visibility='default' filepath='include/wx/dynlib.h' line='160' column='1' id='type-id-79'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_name' type-id='type-id-80' visibility='default' filepath='include/wx/dynlib.h' line='195' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_path' type-id='type-id-80' visibility='default' filepath='include/wx/dynlib.h' line='196' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='m_version' type-id='type-id-80' visibility='default' filepath='include/wx/dynlib.h' line='197' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1152'>
        <var-decl name='m_address' type-id='type-id-75' visibility='default' filepath='include/wx/dynlib.h' line='199' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1216'>
        <var-decl name='m_length' type-id='type-id-81' visibility='default' filepath='include/wx/dynlib.h' line='200' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxDynamicLibraryDetailsArray' size-in-bits='192' visibility='default' filepath='include/wx/dynlib.h' line='205' column='1' id='type-id-82'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-72'/>
    </class-decl>
    <class-decl name='wxDynamicLibrary' size-in-bits='64' visibility='default' filepath='include/wx/dynlib.h' line='213' column='1' id='type-id-83'>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_handle' type-id='type-id-76' visibility='default' filepath='include/wx/dynlib.h' line='365' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxFontEncodingArray' size-in-bits='192' visibility='default' filepath='include/wx/encconv.h' line='43' column='1' id='type-id-84'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-60'/>
    </class-decl>
    <class-decl name='wxEventTypeTag&lt;wxIconizeEvent&gt;' size-in-bits='32' visibility='default' filepath='include/wx/event.h' line='202' column='1' id='type-id-85'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_type' type-id='type-id-86' visibility='default' filepath='include/wx/event.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTypeTag&lt;wxMoveEvent&gt;' size-in-bits='32' visibility='default' filepath='include/wx/event.h' line='202' column='1' id='type-id-87'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_type' type-id='type-id-86' visibility='default' filepath='include/wx/event.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventFunctorMethod&lt;wxEventTypeTag&lt;wxCommandEvent&gt;, wxSTCListBox, wxCommandEvent, wxSTCListBox&gt;' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='392' column='1' id='type-id-88'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-89'/>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-90'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-91' visibility='default' filepath='include/wx/event.h' line='461' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxEventFunctorMethodI14wxEventTypeTagI14wxCommandEventE12wxSTCListBoxS1_S3_EclEP12wxEvtHandlerR7wxEvent' filepath='include/wx/event.h' line='422' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-92' is-artificial='yes'/>
          <parameter type-id='type-id-93'/>
          <parameter type-id='type-id-94'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI14wxCommandEventE12wxSTCListBoxS1_S3_E10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='439' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-95' is-artificial='yes'/>
          <parameter type-id='type-id-96'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI14wxCommandEventE12wxSTCListBoxS1_S3_E13GetEvtHandlerEv' filepath='include/wx/event.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-95' is-artificial='yes'/>
          <return type-id='type-id-93'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI14wxCommandEventE12wxSTCListBoxS1_S3_E12GetEvtMethodEv' filepath='include/wx/event.h' line='457' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-95' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEventFunctorMethod&lt;wxEventTypeTag&lt;wxDPIChangedEvent&gt;, wxSTCListBox, wxDPIChangedEvent, wxSTCListBox&gt;' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='392' column='1' id='type-id-97'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-89'/>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-98'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-91' visibility='default' filepath='include/wx/event.h' line='461' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxEventFunctorMethodI14wxEventTypeTagI17wxDPIChangedEventE12wxSTCListBoxS1_S3_EclEP12wxEvtHandlerR7wxEvent' filepath='include/wx/event.h' line='422' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-99' is-artificial='yes'/>
          <parameter type-id='type-id-93'/>
          <parameter type-id='type-id-94'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI17wxDPIChangedEventE12wxSTCListBoxS1_S3_E10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='439' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-100' is-artificial='yes'/>
          <parameter type-id='type-id-96'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI17wxDPIChangedEventE12wxSTCListBoxS1_S3_E13GetEvtHandlerEv' filepath='include/wx/event.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-100' is-artificial='yes'/>
          <return type-id='type-id-93'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI17wxDPIChangedEventE12wxSTCListBoxS1_S3_E12GetEvtMethodEv' filepath='include/wx/event.h' line='457' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-100' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEventFunctorMethod&lt;wxEventTypeTag&lt;wxIconizeEvent&gt;, wxSTCPopupWindow, wxIconizeEvent, wxSTCPopupWindow&gt;' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='392' column='1' id='type-id-101'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-89'/>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-102'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-103' visibility='default' filepath='include/wx/event.h' line='461' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxEventFunctorMethodI14wxEventTypeTagI14wxIconizeEventE16wxSTCPopupWindowS1_S3_EclEP12wxEvtHandlerR7wxEvent' filepath='include/wx/event.h' line='422' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-104' is-artificial='yes'/>
          <parameter type-id='type-id-93'/>
          <parameter type-id='type-id-94'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI14wxIconizeEventE16wxSTCPopupWindowS1_S3_E10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='439' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-105' is-artificial='yes'/>
          <parameter type-id='type-id-96'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI14wxIconizeEventE16wxSTCPopupWindowS1_S3_E13GetEvtHandlerEv' filepath='include/wx/event.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-105' is-artificial='yes'/>
          <return type-id='type-id-93'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI14wxIconizeEventE16wxSTCPopupWindowS1_S3_E12GetEvtMethodEv' filepath='include/wx/event.h' line='457' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-105' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEventFunctorMethod&lt;wxEventTypeTag&lt;wxMouseEvent&gt;, wxSTCListBox, wxMouseEvent, wxSTCListBox&gt;' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='392' column='1' id='type-id-106'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-89'/>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-107'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-91' visibility='default' filepath='include/wx/event.h' line='461' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxEventFunctorMethodI14wxEventTypeTagI12wxMouseEventE12wxSTCListBoxS1_S3_EclEP12wxEvtHandlerR7wxEvent' filepath='include/wx/event.h' line='422' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-108' is-artificial='yes'/>
          <parameter type-id='type-id-93'/>
          <parameter type-id='type-id-94'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI12wxMouseEventE12wxSTCListBoxS1_S3_E10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='439' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-109' is-artificial='yes'/>
          <parameter type-id='type-id-96'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI12wxMouseEventE12wxSTCListBoxS1_S3_E13GetEvtHandlerEv' filepath='include/wx/event.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-109' is-artificial='yes'/>
          <return type-id='type-id-93'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI12wxMouseEventE12wxSTCListBoxS1_S3_E12GetEvtMethodEv' filepath='include/wx/event.h' line='457' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-109' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEventFunctorMethod&lt;wxEventTypeTag&lt;wxMoveEvent&gt;, wxSTCPopupWindow, wxMoveEvent, wxSTCPopupWindow&gt;' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='392' column='1' id='type-id-110'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-89'/>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-111'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-103' visibility='default' filepath='include/wx/event.h' line='461' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxEventFunctorMethodI14wxEventTypeTagI11wxMoveEventE16wxSTCPopupWindowS1_S3_EclEP12wxEvtHandlerR7wxEvent' filepath='include/wx/event.h' line='422' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-112' is-artificial='yes'/>
          <parameter type-id='type-id-93'/>
          <parameter type-id='type-id-94'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI11wxMoveEventE16wxSTCPopupWindowS1_S3_E10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='439' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-113' is-artificial='yes'/>
          <parameter type-id='type-id-96'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI11wxMoveEventE16wxSTCPopupWindowS1_S3_E13GetEvtHandlerEv' filepath='include/wx/event.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-113' is-artificial='yes'/>
          <return type-id='type-id-93'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI11wxMoveEventE16wxSTCPopupWindowS1_S3_E12GetEvtMethodEv' filepath='include/wx/event.h' line='457' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-113' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEventFunctorMethod&lt;wxEventTypeTag&lt;wxPaintEvent&gt;, wxSTCListBoxWin, wxPaintEvent, wxSTCListBoxWin&gt;' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='392' column='1' id='type-id-114'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-89'/>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-115'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-116' visibility='default' filepath='include/wx/event.h' line='461' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxEventFunctorMethodI14wxEventTypeTagI12wxPaintEventE15wxSTCListBoxWinS1_S3_EclEP12wxEvtHandlerR7wxEvent' filepath='include/wx/event.h' line='422' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <parameter type-id='type-id-93'/>
          <parameter type-id='type-id-94'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI12wxPaintEventE15wxSTCListBoxWinS1_S3_E10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='439' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-118' is-artificial='yes'/>
          <parameter type-id='type-id-96'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI12wxPaintEventE15wxSTCListBoxWinS1_S3_E13GetEvtHandlerEv' filepath='include/wx/event.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-118' is-artificial='yes'/>
          <return type-id='type-id-93'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI12wxPaintEventE15wxSTCListBoxWinS1_S3_E12GetEvtMethodEv' filepath='include/wx/event.h' line='457' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-118' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEventFunctorMethod&lt;wxEventTypeTag&lt;wxSysColourChangedEvent&gt;, wxSTCListBox, wxSysColourChangedEvent, wxSTCListBox&gt;' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='392' column='1' id='type-id-119'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-89'/>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-120'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-91' visibility='default' filepath='include/wx/event.h' line='461' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxEventFunctorMethodI14wxEventTypeTagI23wxSysColourChangedEventE12wxSTCListBoxS1_S3_EclEP12wxEvtHandlerR7wxEvent' filepath='include/wx/event.h' line='422' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-121' is-artificial='yes'/>
          <parameter type-id='type-id-93'/>
          <parameter type-id='type-id-94'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI23wxSysColourChangedEventE12wxSTCListBoxS1_S3_E10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='439' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-96'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI23wxSysColourChangedEventE12wxSTCListBoxS1_S3_E13GetEvtHandlerEv' filepath='include/wx/event.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <return type-id='type-id-93'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI23wxSysColourChangedEventE12wxSTCListBoxS1_S3_E12GetEvtMethodEv' filepath='include/wx/event.h' line='457' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='wxBitmapType' filepath='include/wx/gdicmn.h' line='47' column='1' id='type-id-123'>
      <underlying-type type-id='type-id-2'/>
      <enumerator name='wxBITMAP_TYPE_INVALID' value='0'/>
      <enumerator name='wxBITMAP_TYPE_BMP' value='1'/>
      <enumerator name='wxBITMAP_TYPE_BMP_RESOURCE' value='2'/>
      <enumerator name='wxBITMAP_TYPE_RESOURCE' value='2'/>
      <enumerator name='wxBITMAP_TYPE_ICO' value='3'/>
      <enumerator name='wxBITMAP_TYPE_ICO_RESOURCE' value='4'/>
      <enumerator name='wxBITMAP_TYPE_CUR' value='5'/>
      <enumerator name='wxBITMAP_TYPE_CUR_RESOURCE' value='6'/>
      <enumerator name='wxBITMAP_TYPE_XBM' value='7'/>
      <enumerator name='wxBITMAP_TYPE_XBM_DATA' value='8'/>
      <enumerator name='wxBITMAP_TYPE_XPM' value='9'/>
      <enumerator name='wxBITMAP_TYPE_XPM_DATA' value='10'/>
      <enumerator name='wxBITMAP_TYPE_TIFF' value='11'/>
      <enumerator name='wxBITMAP_TYPE_TIF' value='11'/>
      <enumerator name='wxBITMAP_TYPE_TIFF_RESOURCE' value='12'/>
      <enumerator name='wxBITMAP_TYPE_TIF_RESOURCE' value='12'/>
      <enumerator name='wxBITMAP_TYPE_GIF' value='13'/>
      <enumerator name='wxBITMAP_TYPE_GIF_RESOURCE' value='14'/>
      <enumerator name='wxBITMAP_TYPE_PNG' value='15'/>
      <enumerator name='wxBITMAP_TYPE_PNG_RESOURCE' value='16'/>
      <enumerator name='wxBITMAP_TYPE_JPEG' value='17'/>
      <enumerator name='wxBITMAP_TYPE_JPEG_RESOURCE' value='18'/>
      <enumerator name='wxBITMAP_TYPE_PNM' value='19'/>
      <enumerator name='wxBITMAP_TYPE_PNM_RESOURCE' value='20'/>
      <enumerator name='wxBITMAP_TYPE_PCX' value='21'/>
      <enumerator name='wxBITMAP_TYPE_PCX_RESOURCE' value='22'/>
      <enumerator name='wxBITMAP_TYPE_PICT' value='23'/>
      <enumerator name='wxBITMAP_TYPE_PICT_RESOURCE' value='24'/>
      <enumerator name='wxBITMAP_TYPE_ICON' value='25'/>
      <enumerator name='wxBITMAP_TYPE_ICON_RESOURCE' value='26'/>
      <enumerator name='wxBITMAP_TYPE_ANI' value='27'/>
      <enumerator name='wxBITMAP_TYPE_IFF' value='28'/>
      <enumerator name='wxBITMAP_TYPE_TGA' value='29'/>
      <enumerator name='wxBITMAP_TYPE_MACCURSOR' value='30'/>
      <enumerator name='wxBITMAP_TYPE_MACCURSOR_RESOURCE' value='31'/>
      <enumerator name='wxBITMAP_TYPE_MAX' value='32'/>
      <enumerator name='wxBITMAP_TYPE_ANY' value='50'/>
    </enum-decl>
    <enum-decl name='wxPolygonFillMode' filepath='include/wx/gdicmn.h' line='90' column='1' id='type-id-124'>
      <underlying-type type-id='type-id-2'/>
      <enumerator name='wxODDEVEN_RULE' value='1'/>
      <enumerator name='wxWINDING_RULE' value='2'/>
    </enum-decl>
    <enum-decl name='wxStockCursor' filepath='include/wx/gdicmn.h' line='97' column='1' id='type-id-125'>
      <underlying-type type-id='type-id-2'/>
      <enumerator name='wxCURSOR_NONE' value='0'/>
      <enumerator name='wxCURSOR_ARROW' value='1'/>
      <enumerator name='wxCURSOR_RIGHT_ARROW' value='2'/>
      <enumerator name='wxCURSOR_BULLSEYE' value='3'/>
      <enumerator name='wxCURSOR_CHAR' value='4'/>
      <enumerator name='wxCURSOR_CROSS' value='5'/>
      <enumerator name='wxCURSOR_HAND' value='6'/>
      <enumerator name='wxCURSOR_IBEAM' value='7'/>
      <enumerator name='wxCURSOR_LEFT_BUTTON' value='8'/>
      <enumerator name='wxCURSOR_MAGNIFIER' value='9'/>
      <enumerator name='wxCURSOR_MIDDLE_BUTTON' value='10'/>
      <enumerator name='wxCURSOR_NO_ENTRY' value='11'/>
      <enumerator name='wxCURSOR_PAINT_BRUSH' value='12'/>
      <enumerator name='wxCURSOR_PENCIL' value='13'/>
      <enumerator name='wxCURSOR_POINT_LEFT' value='14'/>
      <enumerator name='wxCURSOR_POINT_RIGHT' value='15'/>
      <enumerator name='wxCURSOR_QUESTION_ARROW' value='16'/>
      <enumerator name='wxCURSOR_RIGHT_BUTTON' value='17'/>
      <enumerator name='wxCURSOR_SIZENESW' value='18'/>
      <enumerator name='wxCURSOR_SIZENS' value='19'/>
      <enumerator name='wxCURSOR_SIZENWSE' value='20'/>
      <enumerator name='wxCURSOR_SIZEWE' value='21'/>
      <enumerator name='wxCURSOR_SIZING' value='22'/>
      <enumerator name='wxCURSOR_SPRAYCAN' value='23'/>
      <enumerator name='wxCURSOR_WAIT' value='24'/>
      <enumerator name='wxCURSOR_WATCH' value='25'/>
      <enumerator name='wxCURSOR_BLANK' value='26'/>
      <enumerator name='wxCURSOR_DEFAULT' value='27'/>
      <enumerator name='wxCURSOR_ARROWWAIT' value='28'/>
      <enumerator name='wxCURSOR_MAX' value='29'/>
    </enum-decl>
    <typedef-decl name='wxDash' type-id='type-id-126' filepath='include/wx/gdicmn.h' line='903' column='1' id='type-id-127'/>
    <class-decl name='_wxHashTable_NodeBase' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='68' column='1' id='type-id-128'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_next' type-id='type-id-129' visibility='default' filepath='include/wx/hashmap.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_wxHashTableBase2' size-in-bits='8' visibility='default' filepath='include/wx/hashmap.h' line='80' column='1' id='type-id-130'>
      <member-type access='public'>
        <typedef-decl name='NodeDtor' type-id='type-id-132' filepath='include/wx/hashmap.h' line='83' column='1' id='type-id-131'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='BucketFromNode' type-id='type-id-134' filepath='include/wx/hashmap.h' line='84' column='1' id='type-id-133'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='ProcessNode' type-id='type-id-136' filepath='include/wx/hashmap.h' line='85' column='1' id='type-id-135'/>
      </member-type>
    </class-decl>
    <class-decl name='wxIntegerHash' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='515' column='1' id='type-id-137'/>
    <class-decl name='wxIntegerEqual' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='532' column='1' id='type-id-138'/>
    <class-decl name='wxObjectList' size-in-bits='384' visibility='default' filepath='include/wx/list.h' line='1164' column='1' id='type-id-139'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-140'/>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/list.h' line='1164' column='1' id='type-id-141'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-143' filepath='include/wx/list.h' line='1164' column='1' id='type-id-142'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-141' filepath='include/wx/list.h' line='1164' column='1' id='type-id-144'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-146' filepath='include/wx/list.h' line='1164' column='1' id='type-id-145'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-145' filepath='include/wx/list.h' line='1164' column='1' id='type-id-147'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-149' filepath='include/wx/list.h' line='1164' column='1' id='type-id-148'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-150' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-150' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_reverse_iterator' size-in-bits='128' visibility='default' filepath='include/wx/list.h' line='1164' column='1' id='type-id-151'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-143' filepath='include/wx/list.h' line='1164' column='1' id='type-id-152'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-151' filepath='include/wx/list.h' line='1164' column='1' id='type-id-153'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-155' filepath='include/wx/list.h' line='1164' column='1' id='type-id-154'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-154' filepath='include/wx/list.h' line='1164' column='1' id='type-id-156'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-149' filepath='include/wx/list.h' line='1164' column='1' id='type-id-157'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-158' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-158' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='128' visibility='default' filepath='include/wx/list.h' line='1164' column='1' id='type-id-159'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-143' filepath='include/wx/list.h' line='1164' column='1' id='type-id-160'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-159' filepath='include/wx/list.h' line='1164' column='1' id='type-id-161'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-163' filepath='include/wx/list.h' line='1164' column='1' id='type-id-162'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-162' filepath='include/wx/list.h' line='1164' column='1' id='type-id-164'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-149' filepath='include/wx/list.h' line='1164' column='1' id='type-id-165'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-166' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-166' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator' size-in-bits='128' visibility='default' filepath='include/wx/list.h' line='1164' column='1' id='type-id-167'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-143' filepath='include/wx/list.h' line='1164' column='1' id='type-id-168'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-167' filepath='include/wx/list.h' line='1164' column='1' id='type-id-169'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-171' filepath='include/wx/list.h' line='1164' column='1' id='type-id-170'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-170' filepath='include/wx/list.h' line='1164' column='1' id='type-id-172'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-149' filepath='include/wx/list.h' line='1164' column='1' id='type-id-173'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-174' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-174' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-176' filepath='include/wx/list.h' line='1164' column='1' id='type-id-175'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-178' filepath='include/wx/list.h' line='1164' column='1' id='type-id-177'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-81' filepath='include/wx/list.h' line='1164' column='1' id='type-id-179'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-149' filepath='include/wx/list.h' line='1164' column='1' id='type-id-180'/>
      </member-type>
      <member-function access='protected' vtable-offset='2'>
        <function-decl name='CreateNode' mangled-name='_ZN12wxObjectList10CreateNodeEP10wxNodeBaseS1_PvRK9wxListKey' filepath='include/wx/list.h' line='1164' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-181' is-artificial='yes'/>
          <parameter type-id='type-id-182'/>
          <parameter type-id='type-id-182'/>
          <parameter type-id='type-id-75'/>
          <parameter type-id='type-id-183'/>
          <return type-id='type-id-182'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='Find' mangled-name='_ZNK12wxObjectList4FindERK9wxListKey' filepath='include/wx/list.h' line='1164' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-184' is-artificial='yes'/>
          <parameter type-id='type-id-183'/>
          <return type-id='type-id-185'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='wxSortFuncFor_wxObjectList' type-id='type-id-186' filepath='include/wx/list.h' line='1164' column='1' id='type-id-187'/>
    <class-decl name='wxMenuItemList' size-in-bits='384' visibility='default' filepath='include/wx/menu.h' line='37' column='1' id='type-id-188'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-140'/>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/menu.h' line='37' column='1' id='type-id-189'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-191' filepath='include/wx/menu.h' line='37' column='1' id='type-id-190'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-189' filepath='include/wx/menu.h' line='37' column='1' id='type-id-192'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-194' filepath='include/wx/menu.h' line='37' column='1' id='type-id-193'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-193' filepath='include/wx/menu.h' line='37' column='1' id='type-id-195'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-197' filepath='include/wx/menu.h' line='37' column='1' id='type-id-196'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-198' visibility='default' filepath='include/wx/menu.h' line='37' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-198' visibility='default' filepath='include/wx/menu.h' line='37' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_reverse_iterator' size-in-bits='128' visibility='default' filepath='include/wx/menu.h' line='37' column='1' id='type-id-199'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-191' filepath='include/wx/menu.h' line='37' column='1' id='type-id-200'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-199' filepath='include/wx/menu.h' line='37' column='1' id='type-id-201'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-203' filepath='include/wx/menu.h' line='37' column='1' id='type-id-202'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-202' filepath='include/wx/menu.h' line='37' column='1' id='type-id-204'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-197' filepath='include/wx/menu.h' line='37' column='1' id='type-id-205'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-206' visibility='default' filepath='include/wx/menu.h' line='37' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-206' visibility='default' filepath='include/wx/menu.h' line='37' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='128' visibility='default' filepath='include/wx/menu.h' line='37' column='1' id='type-id-207'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-191' filepath='include/wx/menu.h' line='37' column='1' id='type-id-208'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-207' filepath='include/wx/menu.h' line='37' column='1' id='type-id-209'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-211' filepath='include/wx/menu.h' line='37' column='1' id='type-id-210'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-210' filepath='include/wx/menu.h' line='37' column='1' id='type-id-212'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-197' filepath='include/wx/menu.h' line='37' column='1' id='type-id-213'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-214' visibility='default' filepath='include/wx/menu.h' line='37' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-214' visibility='default' filepath='include/wx/menu.h' line='37' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator' size-in-bits='128' visibility='default' filepath='include/wx/menu.h' line='37' column='1' id='type-id-215'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-191' filepath='include/wx/menu.h' line='37' column='1' id='type-id-216'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-215' filepath='include/wx/menu.h' line='37' column='1' id='type-id-217'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-219' filepath='include/wx/menu.h' line='37' column='1' id='type-id-218'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-218' filepath='include/wx/menu.h' line='37' column='1' id='type-id-220'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-197' filepath='include/wx/menu.h' line='37' column='1' id='type-id-221'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-222' visibility='default' filepath='include/wx/menu.h' line='37' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-222' visibility='default' filepath='include/wx/menu.h' line='37' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-224' filepath='include/wx/menu.h' line='37' column='1' id='type-id-223'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-226' filepath='include/wx/menu.h' line='37' column='1' id='type-id-225'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-81' filepath='include/wx/menu.h' line='37' column='1' id='type-id-227'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-197' filepath='include/wx/menu.h' line='37' column='1' id='type-id-228'/>
      </member-type>
      <member-function access='protected' vtable-offset='2'>
        <function-decl name='CreateNode' mangled-name='_ZN14wxMenuItemList10CreateNodeEP10wxNodeBaseS1_PvRK9wxListKey' filepath='include/wx/menu.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-229' is-artificial='yes'/>
          <parameter type-id='type-id-182'/>
          <parameter type-id='type-id-182'/>
          <parameter type-id='type-id-75'/>
          <parameter type-id='type-id-183'/>
          <return type-id='type-id-182'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='Find' mangled-name='_ZNK14wxMenuItemList4FindERK9wxListKey' filepath='include/wx/menu.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-230' is-artificial='yes'/>
          <parameter type-id='type-id-183'/>
          <return type-id='type-id-231'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='wxSortFuncFor_wxMenuItemList' type-id='type-id-232' filepath='include/wx/menu.h' line='37' column='1' id='type-id-233'/>
    <class-decl name='wxNonOwnedWindowBase' size-in-bits='5312' visibility='default' filepath='include/wx/nonownedwnd.h' line='25' column='1' id='type-id-234'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-16'/>
      <member-function access='public' vtable-offset='151'>
        <function-decl name='InheritAttributes' mangled-name='_ZN20wxNonOwnedWindowBase17InheritAttributesEv' filepath='include/wx/nonownedwnd.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-235' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='185'>
        <function-decl name='AdjustForParentClientOrigin' mangled-name='_ZNK20wxNonOwnedWindowBase27AdjustForParentClientOriginERiS0_i' filepath='include/wx/nonownedwnd.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-236' is-artificial='yes'/>
          <parameter type-id='type-id-237'/>
          <parameter type-id='type-id-237'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='206'>
        <function-decl name='DoClearShape' mangled-name='_ZN20wxNonOwnedWindowBase12DoClearShapeEv' filepath='include/wx/nonownedwnd.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-235' is-artificial='yes'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='207'>
        <function-decl name='DoSetRegionShape' mangled-name='_ZN20wxNonOwnedWindowBase16DoSetRegionShapeERK8wxRegion' filepath='include/wx/nonownedwnd.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-235' is-artificial='yes'/>
          <parameter type-id='type-id-238'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='208'>
        <function-decl name='DoSetPathShape' mangled-name='_ZN20wxNonOwnedWindowBase14DoSetPathShapeERK14wxGraphicsPath' filepath='include/wx/nonownedwnd.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-235' is-artificial='yes'/>
          <parameter type-id='type-id-239'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='wxPenQuality' filepath='include/wx/pen.h' line='18' column='1' id='type-id-240'>
      <underlying-type type-id='type-id-2'/>
      <enumerator name='wxPEN_QUALITY_DEFAULT' value='0'/>
      <enumerator name='wxPEN_QUALITY_LOW' value='1'/>
      <enumerator name='wxPEN_QUALITY_HIGH' value='2'/>
    </enum-decl>
    <class-decl name='wxPenBase' size-in-bits='128' visibility='default' filepath='include/wx/pen.h' line='63' column='1' id='type-id-241'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-4'/>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPenBase' mangled-name='_ZN9wxPenBaseD4Ev' filepath='include/wx/pen.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-242' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='SetColour' mangled-name='_ZN9wxPenBase9SetColourERK8wxColour' filepath='include/wx/pen.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-242' is-artificial='yes'/>
          <parameter type-id='type-id-8'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='SetColour' mangled-name='_ZN9wxPenBase9SetColourEhhh' filepath='include/wx/pen.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-242' is-artificial='yes'/>
          <parameter type-id='type-id-9'/>
          <parameter type-id='type-id-9'/>
          <parameter type-id='type-id-9'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='SetWidth' mangled-name='_ZN9wxPenBase8SetWidthEi' filepath='include/wx/pen.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-242' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <function-decl name='SetStyle' mangled-name='_ZN9wxPenBase8SetStyleE10wxPenStyle' filepath='include/wx/pen.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-242' is-artificial='yes'/>
          <parameter type-id='type-id-243'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <function-decl name='SetStipple' mangled-name='_ZN9wxPenBase10SetStippleERK8wxBitmap' filepath='include/wx/pen.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-242' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <function-decl name='SetDashes' mangled-name='_ZN9wxPenBase9SetDashesEiPKa' filepath='include/wx/pen.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-242' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-244'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <function-decl name='SetJoin' mangled-name='_ZN9wxPenBase7SetJoinE9wxPenJoin' filepath='include/wx/pen.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-242' is-artificial='yes'/>
          <parameter type-id='type-id-245'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <function-decl name='SetCap' mangled-name='_ZN9wxPenBase6SetCapE8wxPenCap' filepath='include/wx/pen.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-242' is-artificial='yes'/>
          <parameter type-id='type-id-246'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <function-decl name='SetQuality' mangled-name='_ZN9wxPenBase10SetQualityE12wxPenQuality' filepath='include/wx/pen.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-242' is-artificial='yes'/>
          <parameter type-id='type-id-240'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='17'>
        <function-decl name='GetColour' mangled-name='_ZNK9wxPenBase9GetColourEv' filepath='include/wx/pen.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-247' is-artificial='yes'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='18'>
        <function-decl name='GetStipple' mangled-name='_ZNK9wxPenBase10GetStippleEv' filepath='include/wx/pen.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-247' is-artificial='yes'/>
          <return type-id='type-id-13'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='19'>
        <function-decl name='GetStyle' mangled-name='_ZNK9wxPenBase8GetStyleEv' filepath='include/wx/pen.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-247' is-artificial='yes'/>
          <return type-id='type-id-243'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='20'>
        <function-decl name='GetJoin' mangled-name='_ZNK9wxPenBase7GetJoinEv' filepath='include/wx/pen.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-247' is-artificial='yes'/>
          <return type-id='type-id-245'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='21'>
        <function-decl name='GetCap' mangled-name='_ZNK9wxPenBase6GetCapEv' filepath='include/wx/pen.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-247' is-artificial='yes'/>
          <return type-id='type-id-246'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='22'>
        <function-decl name='GetQuality' mangled-name='_ZNK9wxPenBase10GetQualityEv' filepath='include/wx/pen.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-247' is-artificial='yes'/>
          <return type-id='type-id-240'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='23'>
        <function-decl name='GetWidth' mangled-name='_ZNK9wxPenBase8GetWidthEv' filepath='include/wx/pen.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-247' is-artificial='yes'/>
          <return type-id='type-id-6'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='24'>
        <function-decl name='GetDashes' mangled-name='_ZNK9wxPenBase9GetDashesEPPa' filepath='include/wx/pen.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-247' is-artificial='yes'/>
          <parameter type-id='type-id-248'/>
          <return type-id='type-id-6'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='wxPenStyle' filepath='include/wx/peninfobase.h' line='17' column='1' id='type-id-243'>
      <underlying-type type-id='type-id-2'/>
      <enumerator name='wxPENSTYLE_INVALID' value='-1'/>
      <enumerator name='wxPENSTYLE_SOLID' value='100'/>
      <enumerator name='wxPENSTYLE_DOT' value='101'/>
      <enumerator name='wxPENSTYLE_LONG_DASH' value='102'/>
      <enumerator name='wxPENSTYLE_SHORT_DASH' value='103'/>
      <enumerator name='wxPENSTYLE_DOT_DASH' value='104'/>
      <enumerator name='wxPENSTYLE_USER_DASH' value='105'/>
      <enumerator name='wxPENSTYLE_TRANSPARENT' value='106'/>
      <enumerator name='wxPENSTYLE_STIPPLE_MASK_OPAQUE' value='107'/>
      <enumerator name='wxPENSTYLE_STIPPLE_MASK' value='108'/>
      <enumerator name='wxPENSTYLE_STIPPLE' value='110'/>
      <enumerator name='wxPENSTYLE_BDIAGONAL_HATCH' value='111'/>
      <enumerator name='wxPENSTYLE_CROSSDIAG_HATCH' value='112'/>
      <enumerator name='wxPENSTYLE_FDIAGONAL_HATCH' value='113'/>
      <enumerator name='wxPENSTYLE_CROSS_HATCH' value='114'/>
      <enumerator name='wxPENSTYLE_HORIZONTAL_HATCH' value='115'/>
      <enumerator name='wxPENSTYLE_VERTICAL_HATCH' value='116'/>
      <enumerator name='wxPENSTYLE_FIRST_HATCH' value='111'/>
      <enumerator name='wxPENSTYLE_LAST_HATCH' value='116'/>
    </enum-decl>
    <enum-decl name='wxPenJoin' filepath='include/wx/peninfobase.h' line='44' column='1' id='type-id-245'>
      <underlying-type type-id='type-id-2'/>
      <enumerator name='wxJOIN_INVALID' value='-1'/>
      <enumerator name='wxJOIN_BEVEL' value='120'/>
      <enumerator name='wxJOIN_MITER' value='121'/>
      <enumerator name='wxJOIN_ROUND' value='122'/>
    </enum-decl>
    <enum-decl name='wxPenCap' filepath='include/wx/peninfobase.h' line='53' column='1' id='type-id-246'>
      <underlying-type type-id='type-id-2'/>
      <enumerator name='wxCAP_INVALID' value='-1'/>
      <enumerator name='wxCAP_ROUND' value='130'/>
      <enumerator name='wxCAP_PROJECTING' value='131'/>
      <enumerator name='wxCAP_BUTT' value='132'/>
    </enum-decl>
    <class-decl name='wxPixelFormat&lt;unsigned char, 32, 0, 1, 2, 3, unsigned int&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/rawbmp.h' line='116' column='1' id='type-id-249'>
      <member-type access='public'>
        <typedef-decl name='ChannelType' type-id='type-id-9' filepath='include/wx/rawbmp.h' line='119' column='1' id='type-id-250'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='PixelType' type-id='type-id-252' filepath='include/wx/rawbmp.h' line='122' column='1' id='type-id-251'/>
      </member-type>
      <member-type access='public'>
        <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='include/wx/rawbmp.h' line='132' column='1' id='type-id-253'>
          <underlying-type type-id='type-id-2'/>
          <enumerator name='RED' value='0'/>
          <enumerator name='GREEN' value='1'/>
          <enumerator name='BLUE' value='2'/>
          <enumerator name='ALPHA' value='3'/>
        </enum-decl>
      </member-type>
      <data-member access='public' static='yes'>
        <var-decl name='BitsPerPixel' type-id='type-id-254' mangled-name='_ZN13wxPixelFormatIhLm32ELi0ELi1ELi2ELi3EjE12BitsPerPixelE' visibility='default' filepath='include/wx/rawbmp.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='SizePixel' type-id='type-id-254' mangled-name='_ZN13wxPixelFormatIhLm32ELi0ELi1ELi2ELi3EjE9SizePixelE' visibility='default' filepath='include/wx/rawbmp.h' line='128' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxPixelDataBase' size-in-bits='160' visibility='default' filepath='include/wx/rawbmp.h' line='228' column='1' id='type-id-255'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_ptOrigin' type-id='type-id-23' visibility='default' filepath='include/wx/rawbmp.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='m_width' type-id='type-id-6' visibility='default' filepath='include/wx/rawbmp.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='m_height' type-id='type-id-6' visibility='default' filepath='include/wx/rawbmp.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='m_stride' type-id='type-id-6' visibility='default' filepath='include/wx/rawbmp.h' line='258' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxPixelDataOut&lt;wxBitmap&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/rawbmp.h' line='503' column='1' id='type-id-256'>
      <member-type access='public'>
        <class-decl name='wxPixelDataIn&lt;wxPixelFormat&lt;unsigned char, 32, 0, 1, 2, 3, unsigned int&gt; &gt;' size-in-bits='384' visibility='default' filepath='include/wx/rawbmp.h' line='506' column='1' id='type-id-257'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-255'/>
          <member-type access='public'>
            <class-decl name='Iterator' size-in-bits='64' visibility='default' filepath='include/wx/rawbmp.h' line='512' column='1' id='type-id-258'>
              <member-type access='public'>
                <typedef-decl name='ChannelType' type-id='type-id-250' filepath='include/wx/rawbmp.h' line='519' column='1' id='type-id-259'/>
              </member-type>
              <member-type access='public'>
                <typedef-decl name='PixelData' type-id='type-id-257' filepath='include/wx/rawbmp.h' line='522' column='1' id='type-id-260'/>
              </member-type>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='m_ptr' type-id='type-id-261' visibility='default' filepath='include/wx/rawbmp.h' line='633' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <data-member access='public' layout-offset-in-bits='192'>
            <var-decl name='m_bmp' type-id='type-id-262' visibility='default' filepath='include/wx/rawbmp.h' line='686' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='320'>
            <var-decl name='m_pixels' type-id='type-id-258' visibility='default' filepath='include/wx/rawbmp.h' line='689' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
    </class-decl>
    <class-decl name='wxPixelData&lt;wxBitmap, wxPixelFormat&lt;unsigned char, 32, 0, 1, 2, 3, unsigned int&gt; &gt;' size-in-bits='384' visibility='default' filepath='include/wx/rawbmp.h' line='925' column='1' id='type-id-263'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-257'/>
    </class-decl>
    <class-decl name='wxAnyScrollHelperBase' size-in-bits='256' visibility='default' filepath='include/wx/scrolwin.h' line='69' column='1' id='type-id-264'>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_win' type-id='type-id-265' visibility='default' filepath='include/wx/scrolwin.h' line='103' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_targetWindow' type-id='type-id-265' visibility='default' filepath='include/wx/scrolwin.h' line='104' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_kbdScrollingEnabled' type-id='type-id-14' visibility='default' filepath='include/wx/scrolwin.h' line='107' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAnyScrollHelperBase' mangled-name='_ZN21wxAnyScrollHelperBaseD4Ev' filepath='include/wx/scrolwin.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-266' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='OnDraw' mangled-name='_ZN21wxAnyScrollHelperBase6OnDrawER4wxDC' filepath='include/wx/scrolwin.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-266' is-artificial='yes'/>
          <parameter type-id='type-id-26'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <function-decl name='DoPrepareDC' mangled-name='_ZN21wxAnyScrollHelperBase11DoPrepareDCER4wxDC' filepath='include/wx/scrolwin.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-266' is-artificial='yes'/>
          <parameter type-id='type-id-26'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxSizerItemList' size-in-bits='384' visibility='default' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-267'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-140'/>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-268'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-270' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-269'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-268' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-271'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-273' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-272'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-272' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-274'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-276' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-275'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-277' visibility='default' filepath='include/wx/sizer.h' line='516' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-277' visibility='default' filepath='include/wx/sizer.h' line='516' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_reverse_iterator' size-in-bits='128' visibility='default' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-278'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-270' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-279'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-278' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-280'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-282' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-281'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-281' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-283'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-276' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-284'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-285' visibility='default' filepath='include/wx/sizer.h' line='516' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-285' visibility='default' filepath='include/wx/sizer.h' line='516' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='128' visibility='default' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-286'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-270' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-287'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-286' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-288'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-290' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-289'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-289' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-291'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-276' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-292'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-293' visibility='default' filepath='include/wx/sizer.h' line='516' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-293' visibility='default' filepath='include/wx/sizer.h' line='516' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator' size-in-bits='128' visibility='default' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-294'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-270' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-295'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-294' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-296'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-298' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-297'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-297' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-299'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-276' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-300'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-301' visibility='default' filepath='include/wx/sizer.h' line='516' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-301' visibility='default' filepath='include/wx/sizer.h' line='516' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-303' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-302'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-305' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-304'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-81' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-306'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-276' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-307'/>
      </member-type>
      <member-function access='protected' vtable-offset='2'>
        <function-decl name='CreateNode' mangled-name='_ZN15wxSizerItemList10CreateNodeEP10wxNodeBaseS1_PvRK9wxListKey' filepath='include/wx/sizer.h' line='516' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-308' is-artificial='yes'/>
          <parameter type-id='type-id-182'/>
          <parameter type-id='type-id-182'/>
          <parameter type-id='type-id-75'/>
          <parameter type-id='type-id-183'/>
          <return type-id='type-id-182'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='Find' mangled-name='_ZNK15wxSizerItemList4FindERK9wxListKey' filepath='include/wx/sizer.h' line='516' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-309' is-artificial='yes'/>
          <parameter type-id='type-id-183'/>
          <return type-id='type-id-310'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='wxSortFuncFor_wxSizerItemList' type-id='type-id-311' filepath='include/wx/sizer.h' line='516' column='1' id='type-id-312'/>
    <class-decl name='wxSystemThemedControlBase' size-in-bits='64' visibility='default' filepath='include/wx/systhemectrl.h' line='21' column='1' id='type-id-313'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxSystemThemedControlBase' mangled-name='_ZN25wxSystemThemedControlBaseD0Ev' filepath='include/wx/systhemectrl.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-314' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxSystemThemedControlBase' mangled-name='_ZN25wxSystemThemedControlBaseD2Ev' filepath='include/wx/systhemectrl.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-314' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxSystemThemedControlBase' mangled-name='_ZN25wxSystemThemedControlBaseD4Ev' filepath='include/wx/systhemectrl.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-314' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='2'>
        <function-decl name='DoEnableSystemTheme' mangled-name='_ZN25wxSystemThemedControlBase19DoEnableSystemThemeEbP8wxWindow' filepath='include/wx/systhemectrl.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-314' is-artificial='yes'/>
          <parameter type-id='type-id-14'/>
          <parameter type-id='type-id-265'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxSystemThemedControl&lt;wxVListBox&gt;' size-in-bits='6592' visibility='default' filepath='include/wx/systhemectrl.h' line='64' column='1' id='type-id-315'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-316'/>
      <base-class access='public' layout-offset-in-bits='6528' type-id='type-id-313'/>
    </class-decl>
    <typedef-decl name='wxMilliClock_t' type-id='type-id-317' filepath='include/wx/time.h' line='25' column='1' id='type-id-318'/>
    <typedef-decl name='wxInt8' type-id='type-id-319' filepath='include/wx/types.h' line='42' column='1' id='type-id-126'/>
    <class-decl name='wxVector&lt;wxDynamicLibraryDetails*&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-55'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-81' filepath='include/wx/vector.h' line='179' column='1' id='type-id-320'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-322' filepath='include/wx/vector.h' line='181' column='1' id='type-id-321'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-324' filepath='include/wx/vector.h' line='184' column='1' id='type-id-323'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-326' filepath='include/wx/vector.h' line='185' column='1' id='type-id-325'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-327' filepath='include/wx/vector.h' line='187' column='1' id='type-id-59'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-328'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-329'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-320' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-320' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-324' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVector&lt;wxFontEncoding&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-61'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-81' filepath='include/wx/vector.h' line='179' column='1' id='type-id-330'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-332' filepath='include/wx/vector.h' line='181' column='1' id='type-id-331'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_pointer' type-id='type-id-334' filepath='include/wx/vector.h' line='183' column='1' id='type-id-333'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-336' filepath='include/wx/vector.h' line='184' column='1' id='type-id-335'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-334' filepath='include/wx/vector.h' line='185' column='1' id='type-id-337'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-338' filepath='include/wx/vector.h' line='187' column='1' id='type-id-65'/>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator' size-in-bits='64' visibility='default' filepath='include/wx/vector.h' line='189' column='1' id='type-id-339'>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-341' filepath='include/wx/vector.h' line='195' column='1' id='type-id-340'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-332' filepath='include/wx/vector.h' line='196' column='1' id='type-id-342'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='pointer' type-id='type-id-344' filepath='include/wx/vector.h' line='197' column='1' id='type-id-343'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-346' filepath='include/wx/vector.h' line='198' column='1' id='type-id-345'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_ptr' type-id='type-id-344' visibility='default' filepath='include/wx/vector.h' line='245' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_reverse_iterator' size-in-bits='64' visibility='default' filepath='include/wx/vector.h' line='250' column='1' id='type-id-347'>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-341' filepath='include/wx/vector.h' line='256' column='1' id='type-id-348'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-332' filepath='include/wx/vector.h' line='257' column='1' id='type-id-349'/>
          </member-type>
          <data-member access='protected' layout-offset-in-bits='0'>
            <var-decl name='m_ptr' type-id='type-id-350' visibility='default' filepath='include/wx/vector.h' line='308' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_INITIAL_SIZE' type-id='type-id-351' mangled-name='_ZN8wxVectorI14wxFontEncodingE18ALLOC_INITIAL_SIZEE' visibility='default' filepath='include/wx/vector.h' line='592' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-330' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-330' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-336' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVector&lt;wxString&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-352'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-81' filepath='include/wx/vector.h' line='179' column='1' id='type-id-353'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-80' filepath='include/wx/vector.h' line='181' column='1' id='type-id-354'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-356' filepath='include/wx/vector.h' line='184' column='1' id='type-id-355'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-358' filepath='include/wx/vector.h' line='185' column='1' id='type-id-357'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-359'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-360'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_INITIAL_SIZE' type-id='type-id-361' mangled-name='_ZN8wxVectorI8wxStringE18ALLOC_INITIAL_SIZEE' visibility='default' filepath='include/wx/vector.h' line='592' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-353' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-353' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-356' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVector&lt;wxVideoMode*&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-67'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-81' filepath='include/wx/vector.h' line='179' column='1' id='type-id-362'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-364' filepath='include/wx/vector.h' line='181' column='1' id='type-id-363'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-366' filepath='include/wx/vector.h' line='184' column='1' id='type-id-365'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-368' filepath='include/wx/vector.h' line='185' column='1' id='type-id-367'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-369' filepath='include/wx/vector.h' line='187' column='1' id='type-id-71'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-370'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-371'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-362' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-362' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-366' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVideoMode' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/vidmode.h' line='18' column='1' id='type-id-372'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='w' type-id='type-id-6' visibility='default' filepath='include/wx/vidmode.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='h' type-id='type-id-6' visibility='default' filepath='include/wx/vidmode.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bpp' type-id='type-id-6' visibility='default' filepath='include/wx/vidmode.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='refresh' type-id='type-id-6' visibility='default' filepath='include/wx/vidmode.h' line='69' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVarVScrollHelper' size-in-bits='640' visibility='default' filepath='include/wx/vscroll.h' line='295' column='1' id='type-id-373'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-374'/>
      <member-function access='public' const='yes' vtable-offset='9'>
        <function-decl name='GetOrientationTargetSize' mangled-name='_ZNK18wxVarVScrollHelper24GetOrientationTargetSizeEv' filepath='include/wx/vscroll.h' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-375' is-artificial='yes'/>
          <return type-id='type-id-6'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='10'>
        <function-decl name='GetNonOrientationTargetSize' mangled-name='_ZNK18wxVarVScrollHelper27GetNonOrientationTargetSizeEv' filepath='include/wx/vscroll.h' line='331' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-375' is-artificial='yes'/>
          <return type-id='type-id-6'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='11'>
        <function-decl name='GetOrientation' mangled-name='_ZNK18wxVarVScrollHelper14GetOrientationEv' filepath='include/wx/vscroll.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-375' is-artificial='yes'/>
          <return type-id='type-id-31'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='16'>
        <function-decl name='OnGetUnitSize' mangled-name='_ZNK18wxVarVScrollHelper13OnGetUnitSizeEm' filepath='include/wx/vscroll.h' line='339' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-375' is-artificial='yes'/>
          <parameter type-id='type-id-81'/>
          <return type-id='type-id-376'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='17'>
        <function-decl name='OnGetUnitsSizeHint' mangled-name='_ZNK18wxVarVScrollHelper18OnGetUnitsSizeHintEmm' filepath='include/wx/vscroll.h' line='345' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-375' is-artificial='yes'/>
          <parameter type-id='type-id-81'/>
          <parameter type-id='type-id-81'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='18'>
        <function-decl name='EstimateTotalSize' mangled-name='_ZNK18wxVarVScrollHelper17EstimateTotalSizeEv' filepath='include/wx/vscroll.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-375' is-artificial='yes'/>
          <return type-id='type-id-376'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <function-decl name='ScrollRows' mangled-name='_ZN18wxVarVScrollHelper10ScrollRowsEi' filepath='include/wx/vscroll.h' line='312' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-377' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='ScrollRowPages' mangled-name='_ZN18wxVarVScrollHelper14ScrollRowPagesEi' filepath='include/wx/vscroll.h' line='314' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-377' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='21'>
        <function-decl name='RefreshRow' mangled-name='_ZN18wxVarVScrollHelper10RefreshRowEm' filepath='include/wx/vscroll.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-377' is-artificial='yes'/>
          <parameter type-id='type-id-81'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <function-decl name='RefreshRows' mangled-name='_ZN18wxVarVScrollHelper11RefreshRowsEmm' filepath='include/wx/vscroll.h' line='319' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-377' is-artificial='yes'/>
          <parameter type-id='type-id-81'/>
          <parameter type-id='type-id-81'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='23'>
        <function-decl name='OnGetRowHeight' mangled-name='_ZNK18wxVarVScrollHelper14OnGetRowHeightEm' filepath='include/wx/vscroll.h' line='338' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-375' is-artificial='yes'/>
          <parameter type-id='type-id-81'/>
          <return type-id='type-id-376'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='24'>
        <function-decl name='OnGetRowsHeightHint' mangled-name='_ZNK18wxVarVScrollHelper19OnGetRowsHeightHintEmm' filepath='include/wx/vscroll.h' line='341' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-375' is-artificial='yes'/>
          <parameter type-id='type-id-81'/>
          <parameter type-id='type-id-81'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='25'>
        <function-decl name='EstimateTotalHeight' mangled-name='_ZNK18wxVarVScrollHelper19EstimateTotalHeightEv' filepath='include/wx/vscroll.h' line='349' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-375' is-artificial='yes'/>
          <return type-id='type-id-376'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxWindowUpdateLocker' size-in-bits='64' visibility='default' filepath='include/wx/wupdlock.h' line='19' column='1' id='type-id-378'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_win' type-id='type-id-265' visibility='default' filepath='include/wx/wupdlock.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxXPMDecoder' size-in-bits='8' visibility='default' filepath='include/wx/xpmdecod.h' line='23' column='1' id='type-id-379'/>
    <class-decl name='SurfaceImpl' size-in-bits='384' visibility='default' filepath='src/stc/PlatWX.cpp' line='203' column='1' id='type-id-380'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-381'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='hdc' type-id='type-id-382' visibility='default' filepath='src/stc/PlatWX.cpp' line='205' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='hdcOwned' type-id='type-id-14' visibility='default' filepath='src/stc/PlatWX.cpp' line='206' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='bitmap' type-id='type-id-13' visibility='default' filepath='src/stc/PlatWX.cpp' line='207' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='x' type-id='type-id-6' visibility='default' filepath='src/stc/PlatWX.cpp' line='208' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='288'>
        <var-decl name='y' type-id='type-id-6' visibility='default' filepath='src/stc/PlatWX.cpp' line='209' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='unicodeMode' type-id='type-id-14' visibility='default' filepath='src/stc/PlatWX.cpp' line='210' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~SurfaceImpl' mangled-name='_ZN11SurfaceImplD0Ev' filepath='src/stc/PlatWX.cpp' line='269' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~SurfaceImpl' mangled-name='_ZN11SurfaceImplD2Ev' filepath='src/stc/PlatWX.cpp' line='269' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~SurfaceImpl' mangled-name='_ZN11SurfaceImplD4Ev' filepath='src/stc/PlatWX.cpp' line='269' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='Init' mangled-name='_ZN11SurfaceImpl4InitEPv' filepath='src/stc/PlatWX.cpp' line='273' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-384'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <function-decl name='Init' mangled-name='_ZN11SurfaceImpl4InitEPvS0_' filepath='src/stc/PlatWX.cpp' line='286' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-385'/>
          <parameter type-id='type-id-384'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='4'>
        <function-decl name='InitPixMap' mangled-name='_ZN11SurfaceImpl10InitPixMapEiiP7SurfacePv' filepath='src/stc/PlatWX.cpp' line='291' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-386'/>
          <parameter type-id='type-id-384'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='Release' mangled-name='_ZN11SurfaceImpl7ReleaseEv' filepath='src/stc/PlatWX.cpp' line='306' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='Initialised' mangled-name='_ZN11SurfaceImpl11InitialisedEv' filepath='src/stc/PlatWX.cpp' line='320' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='PenColour' mangled-name='_ZN11SurfaceImpl9PenColourE13ColourDesired' filepath='src/stc/PlatWX.cpp' line='325' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-387'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='LogPixelsY' mangled-name='_ZN11SurfaceImpl10LogPixelsYEv' filepath='src/stc/PlatWX.cpp' line='339' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <return type-id='type-id-6'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='DeviceHeightFont' mangled-name='_ZN11SurfaceImpl16DeviceHeightFontEi' filepath='src/stc/PlatWX.cpp' line='343' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-6'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='MoveTo' mangled-name='_ZN11SurfaceImpl6MoveToEii' filepath='src/stc/PlatWX.cpp' line='347' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <function-decl name='LineTo' mangled-name='_ZN11SurfaceImpl6LineToEii' filepath='src/stc/PlatWX.cpp' line='352' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <function-decl name='Polygon' mangled-name='_ZN11SurfaceImpl7PolygonEP5Pointi13ColourDesiredS2_' filepath='src/stc/PlatWX.cpp' line='358' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-388'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-387'/>
          <parameter type-id='type-id-387'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <function-decl name='RectangleDraw' mangled-name='_ZN11SurfaceImpl13RectangleDrawE10PRectangle13ColourDesiredS1_' filepath='src/stc/PlatWX.cpp' line='371' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-387'/>
          <parameter type-id='type-id-387'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <function-decl name='FillRectangle' mangled-name='_ZN11SurfaceImpl13FillRectangleE10PRectangle13ColourDesired' filepath='src/stc/PlatWX.cpp' line='377' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-387'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <function-decl name='FillRectangle' mangled-name='_ZN11SurfaceImpl13FillRectangleE10PRectangleR7Surface' filepath='src/stc/PlatWX.cpp' line='383' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-390'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <function-decl name='RoundedRectangle' mangled-name='_ZN11SurfaceImpl16RoundedRectangleE10PRectangle13ColourDesiredS1_' filepath='src/stc/PlatWX.cpp' line='394' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-387'/>
          <parameter type-id='type-id-387'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <function-decl name='AlphaRectangle' mangled-name='_ZN11SurfaceImpl14AlphaRectangleE10PRectanglei13ColourDesirediS1_ii' filepath='src/stc/PlatWX.cpp' line='406' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-387'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-387'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <function-decl name='DrawRGBAImage' mangled-name='_ZN11SurfaceImpl13DrawRGBAImageE10PRectangleiiPKh' filepath='src/stc/PlatWX.cpp' line='545' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-391'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <function-decl name='Ellipse' mangled-name='_ZN11SurfaceImpl7EllipseE10PRectangle13ColourDesiredS1_' filepath='src/stc/PlatWX.cpp' line='554' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-387'/>
          <parameter type-id='type-id-387'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='Copy' mangled-name='_ZN11SurfaceImpl4CopyE10PRectangle5PointR7Surface' filepath='src/stc/PlatWX.cpp' line='560' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-392'/>
          <parameter type-id='type-id-390'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='21'>
        <function-decl name='DrawTextNoClip' mangled-name='_ZN11SurfaceImpl14DrawTextNoClipE10PRectangleR4FontfPKci13ColourDesiredS5_' filepath='src/stc/PlatWX.cpp' line='567' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-393'/>
          <parameter type-id='type-id-394'/>
          <parameter type-id='type-id-395'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-387'/>
          <parameter type-id='type-id-387'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <function-decl name='DrawTextClipped' mangled-name='_ZN11SurfaceImpl15DrawTextClippedE10PRectangleR4FontfPKci13ColourDesiredS5_' filepath='src/stc/PlatWX.cpp' line='580' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-393'/>
          <parameter type-id='type-id-394'/>
          <parameter type-id='type-id-395'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-387'/>
          <parameter type-id='type-id-387'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='23'>
        <function-decl name='DrawTextTransparent' mangled-name='_ZN11SurfaceImpl19DrawTextTransparentE10PRectangleR4FontfPKci13ColourDesired' filepath='src/stc/PlatWX.cpp' line='595' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-393'/>
          <parameter type-id='type-id-394'/>
          <parameter type-id='type-id-395'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-387'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='24'>
        <function-decl name='MeasureWidths' mangled-name='_ZN11SurfaceImpl13MeasureWidthsER4FontPKciPf' filepath='src/stc/PlatWX.cpp' line='611' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-393'/>
          <parameter type-id='type-id-395'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-396'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='25'>
        <function-decl name='WidthText' mangled-name='_ZN11SurfaceImpl9WidthTextER4FontPKci' filepath='src/stc/PlatWX.cpp' line='656' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-393'/>
          <parameter type-id='type-id-395'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-394'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='26'>
        <function-decl name='WidthChar' mangled-name='_ZN11SurfaceImpl9WidthCharER4Fontc' filepath='src/stc/PlatWX.cpp' line='666' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-393'/>
          <parameter type-id='type-id-397'/>
          <return type-id='type-id-394'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='27'>
        <function-decl name='Ascent' mangled-name='_ZN11SurfaceImpl6AscentER4Font' filepath='src/stc/PlatWX.cpp' line='678' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-393'/>
          <return type-id='type-id-394'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='28'>
        <function-decl name='Descent' mangled-name='_ZN11SurfaceImpl7DescentER4Font' filepath='src/stc/PlatWX.cpp' line='687' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-393'/>
          <return type-id='type-id-394'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='29'>
        <function-decl name='InternalLeading' mangled-name='_ZN11SurfaceImpl15InternalLeadingER4Font' filepath='src/stc/PlatWX.cpp' line='694' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-393'/>
          <return type-id='type-id-394'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='30'>
        <function-decl name='ExternalLeading' mangled-name='_ZN11SurfaceImpl15ExternalLeadingER4Font' filepath='src/stc/PlatWX.cpp' line='698' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-393'/>
          <return type-id='type-id-394'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='31'>
        <function-decl name='Height' mangled-name='_ZN11SurfaceImpl6HeightER4Font' filepath='src/stc/PlatWX.cpp' line='705' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-393'/>
          <return type-id='type-id-394'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='32'>
        <function-decl name='AverageCharWidth' mangled-name='_ZN11SurfaceImpl16AverageCharWidthER4Font' filepath='src/stc/PlatWX.cpp' line='710' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-393'/>
          <return type-id='type-id-394'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='33'>
        <function-decl name='SetClip' mangled-name='_ZN11SurfaceImpl7SetClipE10PRectangle' filepath='src/stc/PlatWX.cpp' line='715' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='34'>
        <function-decl name='FlushCachedState' mangled-name='_ZN11SurfaceImpl16FlushCachedStateEv' filepath='src/stc/PlatWX.cpp' line='719' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='35'>
        <function-decl name='SetUnicodeMode' mangled-name='_ZN11SurfaceImpl14SetUnicodeModeEb' filepath='src/stc/PlatWX.cpp' line='722' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-14'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='36'>
        <function-decl name='SetDBCSMode' mangled-name='_ZN11SurfaceImpl11SetDBCSModeEi' filepath='src/stc/PlatWX.cpp' line='726' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-383' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxSTCListBoxVisualData' size-in-bits='1664' visibility='default' filepath='src/stc/PlatWX.cpp' line='2304' column='1' id='type-id-398'>
      <member-type access='private'>
        <class-decl name='ImgList' size-in-bits='256' visibility='default' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-399'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-400'/>
          <member-type access='public'>
            <class-decl name='Insert_Result' size-in-bits='192' visibility='default' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-401'>
              <member-type access='public'>
                <typedef-decl name='const_t1' type-id='type-id-403' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-402'/>
              </member-type>
              <member-type access='public'>
                <typedef-decl name='const_t2' type-id='type-id-405' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-404'/>
              </member-type>
              <member-type access='public'>
                <typedef-decl name='t1' type-id='type-id-407' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-406'/>
              </member-type>
              <member-type access='public'>
                <typedef-decl name='t2' type-id='type-id-14' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-408'/>
              </member-type>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='first' type-id='type-id-406' visibility='default' filepath='src/stc/PlatWX.cpp' line='2346' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='128'>
                <var-decl name='second' type-id='type-id-408' visibility='default' filepath='src/stc/PlatWX.cpp' line='2346' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='mapped_type' type-id='type-id-262' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-409'/>
          </member-type>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='ImgList_wxImplementation_HashTable' size-in-bits='256' visibility='default' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-400'>
          <base-class access='protected' layout-offset-in-bits='0' type-id='type-id-130'/>
          <member-type access='public'>
            <class-decl name='Iterator' size-in-bits='128' visibility='default' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-410'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='m_node' type-id='type-id-411' visibility='default' filepath='src/stc/PlatWX.cpp' line='2346' column='1'/>
              </data-member>
              <data-member access='public' layout-offset-in-bits='64'>
                <var-decl name='m_ht' type-id='type-id-412' visibility='default' filepath='src/stc/PlatWX.cpp' line='2346' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <member-type access='public'>
            <class-decl name='Node' size-in-bits='256' is-struct='yes' visibility='default' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-413'>
              <base-class access='public' layout-offset-in-bits='0' type-id='type-id-128'/>
              <data-member access='public' layout-offset-in-bits='64'>
                <var-decl name='m_value' type-id='type-id-414' visibility='default' filepath='src/stc/PlatWX.cpp' line='2346' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <member-type access='public'>
            <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-415'>
              <base-class access='public' layout-offset-in-bits='0' type-id='type-id-410'/>
            </class-decl>
          </member-type>
          <member-type access='public'>
            <class-decl name='iterator' size-in-bits='128' visibility='default' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-407'>
              <base-class access='public' layout-offset-in-bits='0' type-id='type-id-410'/>
            </class-decl>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='Self' type-id='type-id-400' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-416'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_key_type' type-id='type-id-254' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-417'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_pointer' type-id='type-id-419' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-418'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_reference' type-id='type-id-421' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-420'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='hasher' type-id='type-id-137' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-422'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='key_equal' type-id='type-id-138' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-423'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='key_extractor' type-id='type-id-425' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-424'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='key_type' type-id='type-id-6' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-426'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='pointer' type-id='type-id-428' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-427'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-430' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-429'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='size_type' type-id='type-id-81' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-431'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-432' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-414'/>
          </member-type>
          <data-member access='protected' layout-offset-in-bits='0'>
            <var-decl name='m_table' type-id='type-id-433' visibility='default' filepath='src/stc/PlatWX.cpp' line='2346' column='1'/>
          </data-member>
          <data-member access='protected' layout-offset-in-bits='64'>
            <var-decl name='m_tableBuckets' type-id='type-id-81' visibility='default' filepath='src/stc/PlatWX.cpp' line='2346' column='1'/>
          </data-member>
          <data-member access='protected' layout-offset-in-bits='128'>
            <var-decl name='m_items' type-id='type-id-81' visibility='default' filepath='src/stc/PlatWX.cpp' line='2346' column='1'/>
          </data-member>
          <data-member access='protected' layout-offset-in-bits='192'>
            <var-decl name='m_hasher' type-id='type-id-422' visibility='default' filepath='src/stc/PlatWX.cpp' line='2346' column='1'/>
          </data-member>
          <data-member access='protected' layout-offset-in-bits='200'>
            <var-decl name='m_equals' type-id='type-id-423' visibility='default' filepath='src/stc/PlatWX.cpp' line='2346' column='1'/>
          </data-member>
          <data-member access='protected' layout-offset-in-bits='208'>
            <var-decl name='m_getKey' type-id='type-id-424' visibility='default' filepath='src/stc/PlatWX.cpp' line='2346' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='ImgList_wxImplementation_KeyEx' size-in-bits='8' visibility='default' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-425'>
          <member-type access='private'>
            <typedef-decl name='const_key_reference' type-id='type-id-435' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-434'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_key_type' type-id='type-id-437' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-436'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_pair_reference' type-id='type-id-439' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-438'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='const_pair_type' type-id='type-id-441' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-440'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='key_type' type-id='type-id-6' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-442'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pair_type' type-id='type-id-432' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-443'/>
          </member-type>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='ImgList_wxImplementation_Pair' size-in-bits='192' visibility='default' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-432'>
          <member-type access='public'>
            <typedef-decl name='const_t1' type-id='type-id-254' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-444'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_t2' type-id='type-id-446' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-445'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t1' type-id='type-id-6' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-447'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t2' type-id='type-id-262' filepath='src/stc/PlatWX.cpp' line='2346' column='1' id='type-id-448'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='first' type-id='type-id-447' visibility='default' filepath='src/stc/PlatWX.cpp' line='2346' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='second' type-id='type-id-448' visibility='default' filepath='src/stc/PlatWX.cpp' line='2346' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_desiredVisibleRows' type-id='type-id-6' visibility='default' filepath='src/stc/PlatWX.cpp' line='2348' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_imgList' type-id='type-id-399' visibility='default' filepath='src/stc/PlatWX.cpp' line='2349' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_imgAreaSize' type-id='type-id-449' visibility='default' filepath='src/stc/PlatWX.cpp' line='2350' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='m_borderColour' type-id='type-id-12' visibility='default' filepath='src/stc/PlatWX.cpp' line='2352' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='m_bgColour' type-id='type-id-12' visibility='default' filepath='src/stc/PlatWX.cpp' line='2353' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='704'>
        <var-decl name='m_textColour' type-id='type-id-12' visibility='default' filepath='src/stc/PlatWX.cpp' line='2354' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='832'>
        <var-decl name='m_highlightBgColour' type-id='type-id-12' visibility='default' filepath='src/stc/PlatWX.cpp' line='2355' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='960'>
        <var-decl name='m_highlightTextColour' type-id='type-id-12' visibility='default' filepath='src/stc/PlatWX.cpp' line='2356' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1088'>
        <var-decl name='m_useDefaultBgColour' type-id='type-id-14' visibility='default' filepath='src/stc/PlatWX.cpp' line='2357' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1096'>
        <var-decl name='m_useDefaultTextColour' type-id='type-id-14' visibility='default' filepath='src/stc/PlatWX.cpp' line='2358' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1104'>
        <var-decl name='m_useDefaultHighlightBgColour' type-id='type-id-14' visibility='default' filepath='src/stc/PlatWX.cpp' line='2359' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1112'>
        <var-decl name='m_useDefaultHighlightTextColour' type-id='type-id-14' visibility='default' filepath='src/stc/PlatWX.cpp' line='2360' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1120'>
        <var-decl name='m_hasListCtrlAppearance' type-id='type-id-14' visibility='default' filepath='src/stc/PlatWX.cpp' line='2362' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1152'>
        <var-decl name='m_currentBgColour' type-id='type-id-12' visibility='default' filepath='src/stc/PlatWX.cpp' line='2363' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1280'>
        <var-decl name='m_currentTextColour' type-id='type-id-12' visibility='default' filepath='src/stc/PlatWX.cpp' line='2364' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1408'>
        <var-decl name='m_useDefaultCurrentBgColour' type-id='type-id-14' visibility='default' filepath='src/stc/PlatWX.cpp' line='2365' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1416'>
        <var-decl name='m_useDefaultCurrentTextColour' type-id='type-id-14' visibility='default' filepath='src/stc/PlatWX.cpp' line='2366' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1472'>
        <var-decl name='m_listType' type-id='type-id-450' visibility='default' filepath='src/stc/PlatWX.cpp' line='2368' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1536'>
        <var-decl name='m_posStart' type-id='type-id-450' visibility='default' filepath='src/stc/PlatWX.cpp' line='2369' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1600'>
        <var-decl name='m_startLen' type-id='type-id-450' visibility='default' filepath='src/stc/PlatWX.cpp' line='2370' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxSTCListBoxVisualData' mangled-name='_ZN22wxSTCListBoxVisualDataD0Ev' filepath='src/stc/PlatWX.cpp' line='2386' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-451' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxSTCListBoxVisualData' mangled-name='_ZN22wxSTCListBoxVisualDataD2Ev' filepath='src/stc/PlatWX.cpp' line='2386' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-451' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxSTCListBoxVisualData' mangled-name='_ZN22wxSTCListBoxVisualDataD4Ev' filepath='src/stc/PlatWX.cpp' line='2386' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-451' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxSTCListBox' size-in-bits='7552' visibility='default' filepath='src/stc/PlatWX.cpp' line='2638' column='1' id='type-id-452'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-315'/>
      <data-member access='protected' layout-offset-in-bits='6592'>
        <var-decl name='m_visualData' type-id='type-id-451' visibility='default' filepath='src/stc/PlatWX.cpp' line='2685' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6656'>
        <var-decl name='m_labels' type-id='type-id-352' visibility='default' filepath='src/stc/PlatWX.cpp' line='2686' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6848'>
        <var-decl name='m_imageNos' type-id='type-id-453' visibility='default' filepath='src/stc/PlatWX.cpp' line='2687' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7040'>
        <var-decl name='m_maxStrWidth' type-id='type-id-81' visibility='default' filepath='src/stc/PlatWX.cpp' line='2688' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7104'>
        <var-decl name='m_currentRow' type-id='type-id-6' visibility='default' filepath='src/stc/PlatWX.cpp' line='2689' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7168'>
        <var-decl name='m_doubleClickAction' type-id='type-id-454' visibility='default' filepath='src/stc/PlatWX.cpp' line='2691' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7232'>
        <var-decl name='m_doubleClickActionData' type-id='type-id-75' visibility='default' filepath='src/stc/PlatWX.cpp' line='2692' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7296'>
        <var-decl name='m_aveCharWidth' type-id='type-id-6' visibility='default' filepath='src/stc/PlatWX.cpp' line='2693' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7328'>
        <var-decl name='m_borderSize' type-id='type-id-6' visibility='default' filepath='src/stc/PlatWX.cpp' line='2696' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7360'>
        <var-decl name='m_textHeight' type-id='type-id-6' visibility='default' filepath='src/stc/PlatWX.cpp' line='2697' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7392'>
        <var-decl name='m_itemHeight' type-id='type-id-6' visibility='default' filepath='src/stc/PlatWX.cpp' line='2698' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7424'>
        <var-decl name='m_textTopGap' type-id='type-id-6' visibility='default' filepath='src/stc/PlatWX.cpp' line='2699' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7456'>
        <var-decl name='m_imagePadding' type-id='type-id-6' visibility='default' filepath='src/stc/PlatWX.cpp' line='2703' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7488'>
        <var-decl name='m_textBoxToTextGap' type-id='type-id-6' visibility='default' filepath='src/stc/PlatWX.cpp' line='2704' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7520'>
        <var-decl name='m_textExtraVerticalPadding' type-id='type-id-6' visibility='default' filepath='src/stc/PlatWX.cpp' line='2705' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='71'>
        <function-decl name='SetFocus' mangled-name='_ZN12wxSTCListBox8SetFocusEv' filepath='src/stc/PlatWX.cpp' line='2750' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='74'>
        <function-decl name='AcceptsFocus' mangled-name='_ZNK12wxSTCListBox12AcceptsFocusEv' filepath='src/stc/PlatWX.cpp' line='2744' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-455' is-artificial='yes'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='207'>
        <function-decl name='OnDrawItem' mangled-name='_ZNK12wxSTCListBox10OnDrawItemER4wxDCRK6wxRectm' filepath='src/stc/PlatWX.cpp' line='3024' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-455' is-artificial='yes'/>
          <parameter type-id='type-id-26'/>
          <parameter type-id='type-id-456'/>
          <parameter type-id='type-id-81'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='208'>
        <function-decl name='OnMeasureItem' mangled-name='_ZNK12wxSTCListBox13OnMeasureItemEm' filepath='src/stc/PlatWX.cpp' line='2984' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-455' is-artificial='yes'/>
          <parameter type-id='type-id-81'/>
          <return type-id='type-id-376'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='210'>
        <function-decl name='OnDrawBackground' mangled-name='_ZNK12wxSTCListBox16OnDrawBackgroundER4wxDCRK6wxRectm' filepath='src/stc/PlatWX.cpp' line='3061' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-455' is-artificial='yes'/>
          <parameter type-id='type-id-26'/>
          <parameter type-id='type-id-456'/>
          <parameter type-id='type-id-81'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='213'>
        <function-decl name='SetListBoxFont' mangled-name='_ZN12wxSTCListBox14SetListBoxFontER4Font' filepath='src/stc/PlatWX.cpp' line='2759' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-91' is-artificial='yes'/>
          <parameter type-id='type-id-393'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='214'>
        <function-decl name='OnDrawItemText' mangled-name='_ZNK12wxSTCListBox14OnDrawItemTextER4wxDCRK6wxRectRK8wxStringRK8wxColour' filepath='src/stc/PlatWX.cpp' line='3013' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-455' is-artificial='yes'/>
          <parameter type-id='type-id-26'/>
          <parameter type-id='type-id-456'/>
          <parameter type-id='type-id-457'/>
          <parameter type-id='type-id-8'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxSTCListBoxWin' size-in-bits='5696' visibility='default' filepath='src/stc/PlatWX.cpp' line='3213' column='1' id='type-id-458'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-459'/>
      <data-member access='private' layout-offset-in-bits='5632'>
        <var-decl name='m_visualData' type-id='type-id-451' visibility='default' filepath='src/stc/PlatWX.cpp' line='3223' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='DynamicLibraryImpl' size-in-bits='128' visibility='default' filepath='src/stc/PlatWX.cpp' line='3427' column='1' id='type-id-460'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-461'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_dynlib' type-id='type-id-83' visibility='default' filepath='src/stc/PlatWX.cpp' line='3453' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='FindFunction' mangled-name='_ZN18DynamicLibraryImpl12FindFunctionEPKc' filepath='src/stc/PlatWX.cpp' line='3434' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-462' is-artificial='yes'/>
          <parameter type-id='type-id-395'/>
          <return type-id='type-id-463'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <function-decl name='IsValid' mangled-name='_ZN18DynamicLibraryImpl7IsValidEv' filepath='src/stc/PlatWX.cpp' line='3448' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-462' is-artificial='yes'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='ListBoxImpl' size-in-bits='320' visibility='default' filepath='src/stc/PlatWX.h' line='21' column='1' id='type-id-464'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-465'/>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_listBox' type-id='type-id-91' visibility='default' filepath='src/stc/PlatWX.h' line='23' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_visualData' type-id='type-id-451' visibility='default' filepath='src/stc/PlatWX.h' line='24' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~ListBoxImpl' mangled-name='_ZN11ListBoxImplD0Ev' filepath='src/stc/PlatWX.cpp' line='3279' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-466' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~ListBoxImpl' mangled-name='_ZN11ListBoxImplD2Ev' filepath='src/stc/PlatWX.cpp' line='3279' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-466' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~ListBoxImpl' mangled-name='_ZN11ListBoxImplD4Ev' filepath='src/stc/PlatWX.cpp' line='3279' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-466' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='SetFont' mangled-name='_ZN11ListBoxImpl7SetFontER4Font' filepath='src/stc/PlatWX.cpp' line='3284' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-466' is-artificial='yes'/>
          <parameter type-id='type-id-393'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <function-decl name='Create' mangled-name='_ZN11ListBoxImpl6CreateER6Windowi5Pointibi' filepath='src/stc/PlatWX.cpp' line='3289' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-466' is-artificial='yes'/>
          <parameter type-id='type-id-467'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-392'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-14'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='4'>
        <function-decl name='SetAverageCharWidth' mangled-name='_ZN11ListBoxImpl19SetAverageCharWidthEi' filepath='src/stc/PlatWX.cpp' line='3297' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-466' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='SetVisibleRows' mangled-name='_ZN11ListBoxImpl14SetVisibleRowsEi' filepath='src/stc/PlatWX.cpp' line='3302' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-466' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='6'>
        <function-decl name='GetVisibleRows' mangled-name='_ZNK11ListBoxImpl14GetVisibleRowsEv' filepath='src/stc/PlatWX.cpp' line='3307' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-468' is-artificial='yes'/>
          <return type-id='type-id-6'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='GetDesiredRect' mangled-name='_ZN11ListBoxImpl14GetDesiredRectEv' filepath='src/stc/PlatWX.cpp' line='3311' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-466' is-artificial='yes'/>
          <return type-id='type-id-389'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='CaretFromEdge' mangled-name='_ZN11ListBoxImpl13CaretFromEdgeEv' filepath='src/stc/PlatWX.cpp' line='3316' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-466' is-artificial='yes'/>
          <return type-id='type-id-6'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='Clear' mangled-name='_ZN11ListBoxImpl5ClearEv' filepath='src/stc/PlatWX.cpp' line='3321' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-466' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='Append' mangled-name='_ZN11ListBoxImpl6AppendEPci' filepath='src/stc/PlatWX.cpp' line='3326' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-466' is-artificial='yes'/>
          <parameter type-id='type-id-469'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <function-decl name='Length' mangled-name='_ZN11ListBoxImpl6LengthEv' filepath='src/stc/PlatWX.cpp' line='3336' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-466' is-artificial='yes'/>
          <return type-id='type-id-6'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <function-decl name='Select' mangled-name='_ZN11ListBoxImpl6SelectEi' filepath='src/stc/PlatWX.cpp' line='3341' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-466' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <function-decl name='GetSelection' mangled-name='_ZN11ListBoxImpl12GetSelectionEv' filepath='src/stc/PlatWX.cpp' line='3346' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-466' is-artificial='yes'/>
          <return type-id='type-id-6'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <function-decl name='Find' mangled-name='_ZN11ListBoxImpl4FindEPKc' filepath='src/stc/PlatWX.cpp' line='3351' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-466' is-artificial='yes'/>
          <parameter type-id='type-id-395'/>
          <return type-id='type-id-6'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <function-decl name='GetValue' mangled-name='_ZN11ListBoxImpl8GetValueEiPci' filepath='src/stc/PlatWX.cpp' line='3357' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-466' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-469'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <function-decl name='RegisterImage' mangled-name='_ZN11ListBoxImpl13RegisterImageEiPKc' filepath='src/stc/PlatWX.cpp' line='3367' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-466' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-395'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <function-decl name='RegisterRGBAImage' mangled-name='_ZN11ListBoxImpl17RegisterRGBAImageEiiiPKh' filepath='src/stc/PlatWX.cpp' line='3372' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-466' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-391'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <function-decl name='ClearRegisteredImages' mangled-name='_ZN11ListBoxImpl21ClearRegisteredImagesEv' filepath='src/stc/PlatWX.cpp' line='3379' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-466' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <function-decl name='SetDoubleClickAction' mangled-name='_ZN11ListBoxImpl20SetDoubleClickActionEPFvPvES0_' filepath='src/stc/PlatWX.cpp' line='3384' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-466' is-artificial='yes'/>
          <parameter type-id='type-id-454'/>
          <parameter type-id='type-id-75'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='SetList' mangled-name='_ZN11ListBoxImpl7SetListEPKccc' filepath='src/stc/PlatWX.cpp' line='3331' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-466' is-artificial='yes'/>
          <parameter type-id='type-id-395'/>
          <parameter type-id='type-id-397'/>
          <parameter type-id='type-id-397'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxSTCPopupBase' size-in-bits='5440' visibility='default' filepath='src/stc/PlatWX.h' line='97' column='1' id='type-id-470'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-471'/>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxSTCPopupBase' mangled-name='_ZN14wxSTCPopupBaseD0Ev' filepath='src/stc/PlatWX.cpp' line='2086' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-472' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxSTCPopupBase' mangled-name='_ZN14wxSTCPopupBaseD2Ev' filepath='src/stc/PlatWX.cpp' line='2086' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-472' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxSTCPopupBase' mangled-name='_ZN14wxSTCPopupBaseD4Ev' filepath='src/stc/PlatWX.cpp' line='2086' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-472' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='FontID' type-id='type-id-75' filepath='src/stc/scintilla/include/Platform.h' line='87' column='1' id='type-id-473'/>
    <typedef-decl name='SurfaceID' type-id='type-id-75' filepath='src/stc/scintilla/include/Platform.h' line='88' column='1' id='type-id-385'/>
    <typedef-decl name='WindowID' type-id='type-id-75' filepath='src/stc/scintilla/include/Platform.h' line='89' column='1' id='type-id-384'/>
    <typedef-decl name='MenuID' type-id='type-id-75' filepath='src/stc/scintilla/include/Platform.h' line='90' column='1' id='type-id-474'/>
    <typedef-decl name='Function' type-id='type-id-75' filepath='src/stc/scintilla/include/Platform.h' line='92' column='1' id='type-id-463'/>
    <class-decl name='PRectangle' size-in-bits='128' visibility='default' filepath='src/stc/scintilla/include/Platform.h' line='121' column='1' id='type-id-389'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='left' type-id='type-id-394' visibility='default' filepath='src/stc/scintilla/include/Platform.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='top' type-id='type-id-394' visibility='default' filepath='src/stc/scintilla/include/Platform.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='right' type-id='type-id-394' visibility='default' filepath='src/stc/scintilla/include/Platform.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='bottom' type-id='type-id-394' visibility='default' filepath='src/stc/scintilla/include/Platform.h' line='126' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ColourDesired' size-in-bits='64' visibility='default' filepath='src/stc/scintilla/include/Platform.h' line='176' column='1' id='type-id-387'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='co' type-id='type-id-475' visibility='default' filepath='src/stc/scintilla/include/Platform.h' line='177' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='FontParameters' size-in-bits='256' is-struct='yes' visibility='default' filepath='src/stc/scintilla/include/Platform.h' line='241' column='1' id='type-id-476'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='faceName' type-id='type-id-395' visibility='default' filepath='src/stc/scintilla/include/Platform.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-477' visibility='default' filepath='src/stc/scintilla/include/Platform.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='weight' type-id='type-id-6' visibility='default' filepath='src/stc/scintilla/include/Platform.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='italic' type-id='type-id-14' visibility='default' filepath='src/stc/scintilla/include/Platform.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='extraFontFlag' type-id='type-id-6' visibility='default' filepath='src/stc/scintilla/include/Platform.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='technology' type-id='type-id-6' visibility='default' filepath='src/stc/scintilla/include/Platform.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='characterSet' type-id='type-id-6' visibility='default' filepath='src/stc/scintilla/include/Platform.h' line='248' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Surface' size-in-bits='64' visibility='default' filepath='src/stc/scintilla/include/Platform.h' line='294' column='1' id='type-id-381'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~Surface' mangled-name='_ZN7SurfaceD0Ev' filepath='src/stc/scintilla/include/Platform.h' line='301' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~Surface' mangled-name='_ZN7SurfaceD2Ev' filepath='src/stc/scintilla/include/Platform.h' line='301' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~Surface' mangled-name='_ZN7SurfaceD4Ev' filepath='src/stc/scintilla/include/Platform.h' line='301' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='Init' mangled-name='_ZN7Surface4InitEPv' filepath='src/stc/scintilla/include/Platform.h' line='304' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-384'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <function-decl name='Init' mangled-name='_ZN7Surface4InitEPvS0_' filepath='src/stc/scintilla/include/Platform.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-385'/>
          <parameter type-id='type-id-384'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='4'>
        <function-decl name='InitPixMap' mangled-name='_ZN7Surface10InitPixMapEiiPS_Pv' filepath='src/stc/scintilla/include/Platform.h' line='306' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-386'/>
          <parameter type-id='type-id-384'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='Release' mangled-name='_ZN7Surface7ReleaseEv' filepath='src/stc/scintilla/include/Platform.h' line='308' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='Initialised' mangled-name='_ZN7Surface11InitialisedEv' filepath='src/stc/scintilla/include/Platform.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='PenColour' mangled-name='_ZN7Surface9PenColourE13ColourDesired' filepath='src/stc/scintilla/include/Platform.h' line='310' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-387'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='LogPixelsY' mangled-name='_ZN7Surface10LogPixelsYEv' filepath='src/stc/scintilla/include/Platform.h' line='311' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <return type-id='type-id-6'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='DeviceHeightFont' mangled-name='_ZN7Surface16DeviceHeightFontEi' filepath='src/stc/scintilla/include/Platform.h' line='312' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-6'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='MoveTo' mangled-name='_ZN7Surface6MoveToEii' filepath='src/stc/scintilla/include/Platform.h' line='313' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <function-decl name='LineTo' mangled-name='_ZN7Surface6LineToEii' filepath='src/stc/scintilla/include/Platform.h' line='314' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <function-decl name='Polygon' mangled-name='_ZN7Surface7PolygonEP5Pointi13ColourDesiredS2_' filepath='src/stc/scintilla/include/Platform.h' line='315' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-388'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-387'/>
          <parameter type-id='type-id-387'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <function-decl name='RectangleDraw' mangled-name='_ZN7Surface13RectangleDrawE10PRectangle13ColourDesiredS1_' filepath='src/stc/scintilla/include/Platform.h' line='316' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-387'/>
          <parameter type-id='type-id-387'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <function-decl name='FillRectangle' mangled-name='_ZN7Surface13FillRectangleE10PRectangle13ColourDesired' filepath='src/stc/scintilla/include/Platform.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-387'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <function-decl name='FillRectangle' mangled-name='_ZN7Surface13FillRectangleE10PRectangleRS_' filepath='src/stc/scintilla/include/Platform.h' line='318' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-390'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <function-decl name='RoundedRectangle' mangled-name='_ZN7Surface16RoundedRectangleE10PRectangle13ColourDesiredS1_' filepath='src/stc/scintilla/include/Platform.h' line='319' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-387'/>
          <parameter type-id='type-id-387'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <function-decl name='AlphaRectangle' mangled-name='_ZN7Surface14AlphaRectangleE10PRectanglei13ColourDesirediS1_ii' filepath='src/stc/scintilla/include/Platform.h' line='320' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-387'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-387'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <function-decl name='DrawRGBAImage' mangled-name='_ZN7Surface13DrawRGBAImageE10PRectangleiiPKh' filepath='src/stc/scintilla/include/Platform.h' line='322' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-391'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <function-decl name='Ellipse' mangled-name='_ZN7Surface7EllipseE10PRectangle13ColourDesiredS1_' filepath='src/stc/scintilla/include/Platform.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-387'/>
          <parameter type-id='type-id-387'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='Copy' mangled-name='_ZN7Surface4CopyE10PRectangle5PointRS_' filepath='src/stc/scintilla/include/Platform.h' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-392'/>
          <parameter type-id='type-id-390'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='21'>
        <function-decl name='DrawTextNoClip' mangled-name='_ZN7Surface14DrawTextNoClipE10PRectangleR4FontfPKci13ColourDesiredS5_' filepath='src/stc/scintilla/include/Platform.h' line='326' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-393'/>
          <parameter type-id='type-id-394'/>
          <parameter type-id='type-id-395'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-387'/>
          <parameter type-id='type-id-387'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <function-decl name='DrawTextClipped' mangled-name='_ZN7Surface15DrawTextClippedE10PRectangleR4FontfPKci13ColourDesiredS5_' filepath='src/stc/scintilla/include/Platform.h' line='327' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-393'/>
          <parameter type-id='type-id-394'/>
          <parameter type-id='type-id-395'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-387'/>
          <parameter type-id='type-id-387'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='23'>
        <function-decl name='DrawTextTransparent' mangled-name='_ZN7Surface19DrawTextTransparentE10PRectangleR4FontfPKci13ColourDesired' filepath='src/stc/scintilla/include/Platform.h' line='328' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <parameter type-id='type-id-393'/>
          <parameter type-id='type-id-394'/>
          <parameter type-id='type-id-395'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-387'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='24'>
        <function-decl name='MeasureWidths' mangled-name='_ZN7Surface13MeasureWidthsER4FontPKciPf' filepath='src/stc/scintilla/include/Platform.h' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-393'/>
          <parameter type-id='type-id-395'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-396'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='25'>
        <function-decl name='WidthText' mangled-name='_ZN7Surface9WidthTextER4FontPKci' filepath='src/stc/scintilla/include/Platform.h' line='330' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-393'/>
          <parameter type-id='type-id-395'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-394'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='26'>
        <function-decl name='WidthChar' mangled-name='_ZN7Surface9WidthCharER4Fontc' filepath='src/stc/scintilla/include/Platform.h' line='331' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-393'/>
          <parameter type-id='type-id-397'/>
          <return type-id='type-id-394'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='27'>
        <function-decl name='Ascent' mangled-name='_ZN7Surface6AscentER4Font' filepath='src/stc/scintilla/include/Platform.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-393'/>
          <return type-id='type-id-394'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='28'>
        <function-decl name='Descent' mangled-name='_ZN7Surface7DescentER4Font' filepath='src/stc/scintilla/include/Platform.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-393'/>
          <return type-id='type-id-394'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='29'>
        <function-decl name='InternalLeading' mangled-name='_ZN7Surface15InternalLeadingER4Font' filepath='src/stc/scintilla/include/Platform.h' line='334' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-393'/>
          <return type-id='type-id-394'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='30'>
        <function-decl name='ExternalLeading' mangled-name='_ZN7Surface15ExternalLeadingER4Font' filepath='src/stc/scintilla/include/Platform.h' line='335' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-393'/>
          <return type-id='type-id-394'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='31'>
        <function-decl name='Height' mangled-name='_ZN7Surface6HeightER4Font' filepath='src/stc/scintilla/include/Platform.h' line='336' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-393'/>
          <return type-id='type-id-394'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='32'>
        <function-decl name='AverageCharWidth' mangled-name='_ZN7Surface16AverageCharWidthER4Font' filepath='src/stc/scintilla/include/Platform.h' line='337' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-393'/>
          <return type-id='type-id-394'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='33'>
        <function-decl name='SetClip' mangled-name='_ZN7Surface7SetClipE10PRectangle' filepath='src/stc/scintilla/include/Platform.h' line='339' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-389'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='34'>
        <function-decl name='FlushCachedState' mangled-name='_ZN7Surface16FlushCachedStateEv' filepath='src/stc/scintilla/include/Platform.h' line='340' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='35'>
        <function-decl name='SetUnicodeMode' mangled-name='_ZN7Surface14SetUnicodeModeEb' filepath='src/stc/scintilla/include/Platform.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-14'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='36'>
        <function-decl name='SetDBCSMode' mangled-name='_ZN7Surface11SetDBCSModeEi' filepath='src/stc/scintilla/include/Platform.h' line='343' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-386' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='CallBackAction' type-id='type-id-478' filepath='src/stc/scintilla/include/Platform.h' line='349' column='1' id='type-id-454'/>
    <class-decl name='Menu' size-in-bits='64' visibility='default' filepath='src/stc/scintilla/include/Platform.h' line='422' column='1' id='type-id-479'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='mid' type-id='type-id-474' visibility='default' filepath='src/stc/scintilla/include/Platform.h' line='423' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ElapsedTime' size-in-bits='128' visibility='default' filepath='src/stc/scintilla/include/Platform.h' line='432' column='1' id='type-id-480'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='bigBit' type-id='type-id-475' visibility='default' filepath='src/stc/scintilla/include/Platform.h' line='433' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='littleBit' type-id='type-id-475' visibility='default' filepath='src/stc/scintilla/include/Platform.h' line='434' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='DynamicLibrary' size-in-bits='64' visibility='default' filepath='src/stc/scintilla/include/Platform.h' line='443' column='1' id='type-id-461'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~DynamicLibrary' mangled-name='_ZN14DynamicLibraryD0Ev' filepath='src/stc/scintilla/include/Platform.h' line='445' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-481' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~DynamicLibrary' mangled-name='_ZN14DynamicLibraryD2Ev' filepath='src/stc/scintilla/include/Platform.h' line='445' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-481' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~DynamicLibrary' mangled-name='_ZN14DynamicLibraryD4Ev' filepath='src/stc/scintilla/include/Platform.h' line='445' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-481' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='FindFunction' mangled-name='_ZN14DynamicLibrary12FindFunctionEPKc' filepath='src/stc/scintilla/include/Platform.h' line='448' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-481' is-artificial='yes'/>
          <parameter type-id='type-id-395'/>
          <return type-id='type-id-463'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <function-decl name='IsValid' mangled-name='_ZN14DynamicLibrary7IsValidEv' filepath='src/stc/scintilla/include/Platform.h' line='451' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-481' is-artificial='yes'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='Platform' size-in-bits='8' visibility='default' filepath='src/stc/scintilla/include/Platform.h' line='471' column='1' id='type-id-482'/>
    <pointer-type-def type-id='type-id-387' size-in-bits='64' id='type-id-483'/>
    <qualified-type-def type-id='type-id-483' const='yes' id='type-id-484'/>
    <pointer-type-def type-id='type-id-461' size-in-bits='64' id='type-id-481'/>
    <pointer-type-def type-id='type-id-460' size-in-bits='64' id='type-id-462'/>
    <qualified-type-def type-id='type-id-462' const='yes' id='type-id-485'/>
    <pointer-type-def type-id='type-id-480' size-in-bits='64' id='type-id-486'/>
    <qualified-type-def type-id='type-id-486' const='yes' id='type-id-487'/>
    <reference-type-def kind='lvalue' type-id='type-id-488' size-in-bits='64' id='type-id-393'/>
    <pointer-type-def type-id='type-id-488' size-in-bits='64' id='type-id-489'/>
    <qualified-type-def type-id='type-id-489' const='yes' id='type-id-490'/>
    <pointer-type-def type-id='type-id-476' size-in-bits='64' id='type-id-491'/>
    <pointer-type-def type-id='type-id-465' size-in-bits='64' id='type-id-492'/>
    <pointer-type-def type-id='type-id-464' size-in-bits='64' id='type-id-466'/>
    <qualified-type-def type-id='type-id-466' const='yes' id='type-id-493'/>
    <pointer-type-def type-id='type-id-479' size-in-bits='64' id='type-id-494'/>
    <qualified-type-def type-id='type-id-494' const='yes' id='type-id-495'/>
    <reference-type-def kind='lvalue' type-id='type-id-389' size-in-bits='64' id='type-id-496'/>
    <pointer-type-def type-id='type-id-389' size-in-bits='64' id='type-id-497'/>
    <qualified-type-def type-id='type-id-497' const='yes' id='type-id-498'/>
    <reference-type-def kind='lvalue' type-id='type-id-482' size-in-bits='64' id='type-id-499'/>
    <pointer-type-def type-id='type-id-482' size-in-bits='64' id='type-id-500'/>
    <reference-type-def kind='lvalue' type-id='type-id-381' size-in-bits='64' id='type-id-390'/>
    <pointer-type-def type-id='type-id-381' size-in-bits='64' id='type-id-386'/>
    <pointer-type-def type-id='type-id-380' size-in-bits='64' id='type-id-383'/>
    <qualified-type-def type-id='type-id-383' const='yes' id='type-id-501'/>
    <reference-type-def kind='lvalue' type-id='type-id-502' size-in-bits='64' id='type-id-467'/>
    <pointer-type-def type-id='type-id-502' size-in-bits='64' id='type-id-503'/>
    <qualified-type-def type-id='type-id-503' const='yes' id='type-id-504'/>
    <pointer-type-def type-id='type-id-394' size-in-bits='64' id='type-id-396'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-505'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-129'/>
    <pointer-type-def type-id='type-id-506' size-in-bits='64' id='type-id-136'/>
    <qualified-type-def type-id='type-id-129' const='yes' id='type-id-507'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-433'/>
    <reference-type-def kind='lvalue' type-id='type-id-14' size-in-bits='64' id='type-id-508'/>
    <qualified-type-def type-id='type-id-387' const='yes' id='type-id-509'/>
    <reference-type-def kind='lvalue' type-id='type-id-509' size-in-bits='64' id='type-id-510'/>
    <pointer-type-def type-id='type-id-509' size-in-bits='64' id='type-id-511'/>
    <qualified-type-def type-id='type-id-511' const='yes' id='type-id-512'/>
    <qualified-type-def type-id='type-id-488' const='yes' id='type-id-513'/>
    <reference-type-def kind='lvalue' type-id='type-id-513' size-in-bits='64' id='type-id-514'/>
    <qualified-type-def type-id='type-id-476' const='yes' id='type-id-515'/>
    <reference-type-def kind='lvalue' type-id='type-id-515' size-in-bits='64' id='type-id-516'/>
    <qualified-type-def type-id='type-id-465' const='yes' id='type-id-517'/>
    <pointer-type-def type-id='type-id-517' size-in-bits='64' id='type-id-518'/>
    <qualified-type-def type-id='type-id-464' const='yes' id='type-id-519'/>
    <pointer-type-def type-id='type-id-519' size-in-bits='64' id='type-id-468'/>
    <qualified-type-def type-id='type-id-389' const='yes' id='type-id-520'/>
    <pointer-type-def type-id='type-id-520' size-in-bits='64' id='type-id-521'/>
    <qualified-type-def type-id='type-id-521' const='yes' id='type-id-522'/>
    <qualified-type-def type-id='type-id-482' const='yes' id='type-id-523'/>
    <reference-type-def kind='lvalue' type-id='type-id-523' size-in-bits='64' id='type-id-524'/>
    <qualified-type-def type-id='type-id-381' const='yes' id='type-id-525'/>
    <reference-type-def kind='lvalue' type-id='type-id-525' size-in-bits='64' id='type-id-526'/>
    <qualified-type-def type-id='type-id-502' const='yes' id='type-id-527'/>
    <reference-type-def kind='lvalue' type-id='type-id-527' size-in-bits='64' id='type-id-528'/>
    <pointer-type-def type-id='type-id-527' size-in-bits='64' id='type-id-529'/>
    <qualified-type-def type-id='type-id-529' const='yes' id='type-id-530'/>
    <qualified-type-def type-id='type-id-14' const='yes' id='type-id-405'/>
    <qualified-type-def type-id='type-id-264' const='yes' id='type-id-531'/>
    <pointer-type-def type-id='type-id-531' size-in-bits='64' id='type-id-532'/>
    <qualified-type-def type-id='type-id-532' const='yes' id='type-id-533'/>
    <qualified-type-def type-id='type-id-54' const='yes' id='type-id-534'/>
    <pointer-type-def type-id='type-id-534' size-in-bits='64' id='type-id-535'/>
    <qualified-type-def type-id='type-id-60' const='yes' id='type-id-536'/>
    <pointer-type-def type-id='type-id-536' size-in-bits='64' id='type-id-537'/>
    <qualified-type-def type-id='type-id-537' const='yes' id='type-id-538'/>
    <qualified-type-def type-id='type-id-66' const='yes' id='type-id-539'/>
    <pointer-type-def type-id='type-id-539' size-in-bits='64' id='type-id-540'/>
    <qualified-type-def type-id='type-id-72' const='yes' id='type-id-541'/>
    <reference-type-def kind='lvalue' type-id='type-id-541' size-in-bits='64' id='type-id-542'/>
    <pointer-type-def type-id='type-id-541' size-in-bits='64' id='type-id-543'/>
    <qualified-type-def type-id='type-id-33' const='yes' id='type-id-544'/>
    <reference-type-def kind='lvalue' type-id='type-id-544' size-in-bits='64' id='type-id-545'/>
    <pointer-type-def type-id='type-id-544' size-in-bits='64' id='type-id-546'/>
    <pointer-type-def type-id='type-id-446' size-in-bits='64' id='type-id-547'/>
    <qualified-type-def type-id='type-id-548' const='yes' id='type-id-549'/>
    <pointer-type-def type-id='type-id-549' size-in-bits='64' id='type-id-550'/>
    <qualified-type-def type-id='type-id-550' const='yes' id='type-id-551'/>
    <qualified-type-def type-id='type-id-552' const='yes' id='type-id-553'/>
    <pointer-type-def type-id='type-id-553' size-in-bits='64' id='type-id-554'/>
    <qualified-type-def type-id='type-id-30' const='yes' id='type-id-555'/>
    <reference-type-def kind='lvalue' type-id='type-id-555' size-in-bits='64' id='type-id-556'/>
    <pointer-type-def type-id='type-id-555' size-in-bits='64' id='type-id-557'/>
    <qualified-type-def type-id='type-id-3' const='yes' id='type-id-558'/>
    <pointer-type-def type-id='type-id-558' size-in-bits='64' id='type-id-11'/>
    <qualified-type-def type-id='type-id-559' const='yes' id='type-id-560'/>
    <pointer-type-def type-id='type-id-560' size-in-bits='64' id='type-id-561'/>
    <qualified-type-def type-id='type-id-562' const='yes' id='type-id-563'/>
    <qualified-type-def type-id='type-id-564' const='yes' id='type-id-565'/>
    <pointer-type-def type-id='type-id-565' size-in-bits='64' id='type-id-566'/>
    <qualified-type-def type-id='type-id-566' const='yes' id='type-id-567'/>
    <pointer-type-def type-id='type-id-568' size-in-bits='64' id='type-id-569'/>
    <qualified-type-def type-id='type-id-21' const='yes' id='type-id-570'/>
    <pointer-type-def type-id='type-id-570' size-in-bits='64' id='type-id-22'/>
    <qualified-type-def type-id='type-id-571' const='yes' id='type-id-572'/>
    <qualified-type-def type-id='type-id-29' const='yes' id='type-id-573'/>
    <reference-type-def kind='lvalue' type-id='type-id-573' size-in-bits='64' id='type-id-574'/>
    <qualified-type-def type-id='type-id-27' const='yes' id='type-id-575'/>
    <reference-type-def kind='lvalue' type-id='type-id-575' size-in-bits='64' id='type-id-576'/>
    <qualified-type-def type-id='type-id-25' const='yes' id='type-id-577'/>
    <reference-type-def kind='lvalue' type-id='type-id-577' size-in-bits='64' id='type-id-578'/>
    <qualified-type-def type-id='type-id-127' const='yes' id='type-id-579'/>
    <pointer-type-def type-id='type-id-579' size-in-bits='64' id='type-id-244'/>
    <qualified-type-def type-id='type-id-34' const='yes' id='type-id-580'/>
    <reference-type-def kind='lvalue' type-id='type-id-580' size-in-bits='64' id='type-id-581'/>
    <pointer-type-def type-id='type-id-580' size-in-bits='64' id='type-id-582'/>
    <qualified-type-def type-id='type-id-83' const='yes' id='type-id-583'/>
    <reference-type-def kind='lvalue' type-id='type-id-583' size-in-bits='64' id='type-id-584'/>
    <pointer-type-def type-id='type-id-583' size-in-bits='64' id='type-id-585'/>
    <qualified-type-def type-id='type-id-585' const='yes' id='type-id-586'/>
    <qualified-type-def type-id='type-id-79' const='yes' id='type-id-587'/>
    <reference-type-def kind='lvalue' type-id='type-id-587' size-in-bits='64' id='type-id-588'/>
    <pointer-type-def type-id='type-id-587' size-in-bits='64' id='type-id-589'/>
    <qualified-type-def type-id='type-id-88' const='yes' id='type-id-590'/>
    <pointer-type-def type-id='type-id-590' size-in-bits='64' id='type-id-95'/>
    <qualified-type-def type-id='type-id-97' const='yes' id='type-id-591'/>
    <pointer-type-def type-id='type-id-591' size-in-bits='64' id='type-id-100'/>
    <qualified-type-def type-id='type-id-101' const='yes' id='type-id-592'/>
    <pointer-type-def type-id='type-id-592' size-in-bits='64' id='type-id-105'/>
    <qualified-type-def type-id='type-id-106' const='yes' id='type-id-593'/>
    <pointer-type-def type-id='type-id-593' size-in-bits='64' id='type-id-109'/>
    <qualified-type-def type-id='type-id-110' const='yes' id='type-id-594'/>
    <pointer-type-def type-id='type-id-594' size-in-bits='64' id='type-id-113'/>
    <qualified-type-def type-id='type-id-114' const='yes' id='type-id-595'/>
    <pointer-type-def type-id='type-id-595' size-in-bits='64' id='type-id-118'/>
    <qualified-type-def type-id='type-id-119' const='yes' id='type-id-596'/>
    <pointer-type-def type-id='type-id-596' size-in-bits='64' id='type-id-122'/>
    <reference-type-def kind='lvalue' type-id='type-id-597' size-in-bits='64' id='type-id-598'/>
    <reference-type-def kind='lvalue' type-id='type-id-599' size-in-bits='64' id='type-id-600'/>
    <qualified-type-def type-id='type-id-85' const='yes' id='type-id-601'/>
    <reference-type-def kind='lvalue' type-id='type-id-601' size-in-bits='64' id='type-id-602'/>
    <pointer-type-def type-id='type-id-601' size-in-bits='64' id='type-id-603'/>
    <qualified-type-def type-id='type-id-603' const='yes' id='type-id-604'/>
    <reference-type-def kind='lvalue' type-id='type-id-605' size-in-bits='64' id='type-id-606'/>
    <qualified-type-def type-id='type-id-87' const='yes' id='type-id-607'/>
    <reference-type-def kind='lvalue' type-id='type-id-607' size-in-bits='64' id='type-id-608'/>
    <pointer-type-def type-id='type-id-607' size-in-bits='64' id='type-id-609'/>
    <qualified-type-def type-id='type-id-609' const='yes' id='type-id-610'/>
    <reference-type-def kind='lvalue' type-id='type-id-611' size-in-bits='64' id='type-id-612'/>
    <reference-type-def kind='lvalue' type-id='type-id-613' size-in-bits='64' id='type-id-614'/>
    <qualified-type-def type-id='type-id-332' const='yes' id='type-id-615'/>
    <reference-type-def kind='lvalue' type-id='type-id-615' size-in-bits='64' id='type-id-616'/>
    <qualified-type-def type-id='type-id-617' const='yes' id='type-id-618'/>
    <reference-type-def kind='lvalue' type-id='type-id-618' size-in-bits='64' id='type-id-239'/>
    <qualified-type-def type-id='type-id-619' const='yes' id='type-id-620'/>
    <pointer-type-def type-id='type-id-620' size-in-bits='64' id='type-id-621'/>
    <qualified-type-def type-id='type-id-621' const='yes' id='type-id-622'/>
    <qualified-type-def type-id='type-id-623' const='yes' id='type-id-624'/>
    <reference-type-def kind='lvalue' type-id='type-id-624' size-in-bits='64' id='type-id-625'/>
    <pointer-type-def type-id='type-id-624' size-in-bits='64' id='type-id-626'/>
    <qualified-type-def type-id='type-id-138' const='yes' id='type-id-627'/>
    <pointer-type-def type-id='type-id-627' size-in-bits='64' id='type-id-628'/>
    <qualified-type-def type-id='type-id-628' const='yes' id='type-id-629'/>
    <qualified-type-def type-id='type-id-137' const='yes' id='type-id-630'/>
    <pointer-type-def type-id='type-id-630' size-in-bits='64' id='type-id-631'/>
    <qualified-type-def type-id='type-id-631' const='yes' id='type-id-632'/>
    <qualified-type-def type-id='type-id-633' const='yes' id='type-id-634'/>
    <pointer-type-def type-id='type-id-634' size-in-bits='64' id='type-id-635'/>
    <qualified-type-def type-id='type-id-636' const='yes' id='type-id-637'/>
    <pointer-type-def type-id='type-id-637' size-in-bits='64' id='type-id-638'/>
    <qualified-type-def type-id='type-id-639' const='yes' id='type-id-640'/>
    <reference-type-def kind='lvalue' type-id='type-id-640' size-in-bits='64' id='type-id-641'/>
    <qualified-type-def type-id='type-id-642' const='yes' id='type-id-643'/>
    <pointer-type-def type-id='type-id-643' size-in-bits='64' id='type-id-644'/>
    <qualified-type-def type-id='type-id-645' const='yes' id='type-id-646'/>
    <pointer-type-def type-id='type-id-646' size-in-bits='64' id='type-id-647'/>
    <qualified-type-def type-id='type-id-648' const='yes' id='type-id-649'/>
    <pointer-type-def type-id='type-id-649' size-in-bits='64' id='type-id-650'/>
    <pointer-type-def type-id='type-id-650' size-in-bits='64' id='type-id-651'/>
    <qualified-type-def type-id='type-id-188' const='yes' id='type-id-652'/>
    <reference-type-def kind='lvalue' type-id='type-id-652' size-in-bits='64' id='type-id-653'/>
    <pointer-type-def type-id='type-id-652' size-in-bits='64' id='type-id-230'/>
    <qualified-type-def type-id='type-id-189' const='yes' id='type-id-654'/>
    <reference-type-def kind='lvalue' type-id='type-id-654' size-in-bits='64' id='type-id-655'/>
    <pointer-type-def type-id='type-id-654' size-in-bits='64' id='type-id-656'/>
    <qualified-type-def type-id='type-id-192' const='yes' id='type-id-657'/>
    <reference-type-def kind='lvalue' type-id='type-id-657' size-in-bits='64' id='type-id-658'/>
    <qualified-type-def type-id='type-id-196' const='yes' id='type-id-659'/>
    <reference-type-def kind='lvalue' type-id='type-id-659' size-in-bits='64' id='type-id-194'/>
    <qualified-type-def type-id='type-id-199' const='yes' id='type-id-660'/>
    <pointer-type-def type-id='type-id-660' size-in-bits='64' id='type-id-661'/>
    <qualified-type-def type-id='type-id-201' const='yes' id='type-id-662'/>
    <reference-type-def kind='lvalue' type-id='type-id-662' size-in-bits='64' id='type-id-663'/>
    <qualified-type-def type-id='type-id-205' const='yes' id='type-id-664'/>
    <reference-type-def kind='lvalue' type-id='type-id-664' size-in-bits='64' id='type-id-203'/>
    <qualified-type-def type-id='type-id-207' const='yes' id='type-id-665'/>
    <reference-type-def kind='lvalue' type-id='type-id-665' size-in-bits='64' id='type-id-666'/>
    <pointer-type-def type-id='type-id-665' size-in-bits='64' id='type-id-667'/>
    <qualified-type-def type-id='type-id-209' const='yes' id='type-id-668'/>
    <reference-type-def kind='lvalue' type-id='type-id-668' size-in-bits='64' id='type-id-669'/>
    <qualified-type-def type-id='type-id-215' const='yes' id='type-id-670'/>
    <reference-type-def kind='lvalue' type-id='type-id-670' size-in-bits='64' id='type-id-671'/>
    <pointer-type-def type-id='type-id-670' size-in-bits='64' id='type-id-672'/>
    <qualified-type-def type-id='type-id-217' const='yes' id='type-id-673'/>
    <reference-type-def kind='lvalue' type-id='type-id-673' size-in-bits='64' id='type-id-674'/>
    <qualified-type-def type-id='type-id-228' const='yes' id='type-id-675'/>
    <reference-type-def kind='lvalue' type-id='type-id-675' size-in-bits='64' id='type-id-224'/>
    <qualified-type-def type-id='type-id-15' const='yes' id='type-id-676'/>
    <reference-type-def kind='lvalue' type-id='type-id-676' size-in-bits='64' id='type-id-677'/>
    <pointer-type-def type-id='type-id-676' size-in-bits='64' id='type-id-19'/>
    <qualified-type-def type-id='type-id-234' const='yes' id='type-id-678'/>
    <pointer-type-def type-id='type-id-678' size-in-bits='64' id='type-id-236'/>
    <pointer-type-def type-id='type-id-679' size-in-bits='64' id='type-id-680'/>
    <qualified-type-def type-id='type-id-139' const='yes' id='type-id-681'/>
    <reference-type-def kind='lvalue' type-id='type-id-681' size-in-bits='64' id='type-id-682'/>
    <pointer-type-def type-id='type-id-681' size-in-bits='64' id='type-id-184'/>
    <qualified-type-def type-id='type-id-184' const='yes' id='type-id-683'/>
    <qualified-type-def type-id='type-id-141' const='yes' id='type-id-684'/>
    <reference-type-def kind='lvalue' type-id='type-id-684' size-in-bits='64' id='type-id-685'/>
    <pointer-type-def type-id='type-id-684' size-in-bits='64' id='type-id-686'/>
    <qualified-type-def type-id='type-id-144' const='yes' id='type-id-687'/>
    <reference-type-def kind='lvalue' type-id='type-id-687' size-in-bits='64' id='type-id-688'/>
    <qualified-type-def type-id='type-id-148' const='yes' id='type-id-689'/>
    <reference-type-def kind='lvalue' type-id='type-id-689' size-in-bits='64' id='type-id-146'/>
    <qualified-type-def type-id='type-id-151' const='yes' id='type-id-690'/>
    <pointer-type-def type-id='type-id-690' size-in-bits='64' id='type-id-691'/>
    <qualified-type-def type-id='type-id-153' const='yes' id='type-id-692'/>
    <reference-type-def kind='lvalue' type-id='type-id-692' size-in-bits='64' id='type-id-693'/>
    <qualified-type-def type-id='type-id-157' const='yes' id='type-id-694'/>
    <reference-type-def kind='lvalue' type-id='type-id-694' size-in-bits='64' id='type-id-155'/>
    <qualified-type-def type-id='type-id-159' const='yes' id='type-id-695'/>
    <reference-type-def kind='lvalue' type-id='type-id-695' size-in-bits='64' id='type-id-696'/>
    <pointer-type-def type-id='type-id-695' size-in-bits='64' id='type-id-697'/>
    <qualified-type-def type-id='type-id-161' const='yes' id='type-id-698'/>
    <reference-type-def kind='lvalue' type-id='type-id-698' size-in-bits='64' id='type-id-699'/>
    <qualified-type-def type-id='type-id-167' const='yes' id='type-id-700'/>
    <reference-type-def kind='lvalue' type-id='type-id-700' size-in-bits='64' id='type-id-701'/>
    <pointer-type-def type-id='type-id-700' size-in-bits='64' id='type-id-702'/>
    <qualified-type-def type-id='type-id-169' const='yes' id='type-id-703'/>
    <reference-type-def kind='lvalue' type-id='type-id-703' size-in-bits='64' id='type-id-704'/>
    <qualified-type-def type-id='type-id-180' const='yes' id='type-id-705'/>
    <reference-type-def kind='lvalue' type-id='type-id-705' size-in-bits='64' id='type-id-176'/>
    <qualified-type-def type-id='type-id-706' const='yes' id='type-id-707'/>
    <reference-type-def kind='lvalue' type-id='type-id-707' size-in-bits='64' id='type-id-708'/>
    <pointer-type-def type-id='type-id-707' size-in-bits='64' id='type-id-709'/>
    <qualified-type-def type-id='type-id-710' const='yes' id='type-id-711'/>
    <pointer-type-def type-id='type-id-711' size-in-bits='64' id='type-id-712'/>
    <qualified-type-def type-id='type-id-28' const='yes' id='type-id-713'/>
    <reference-type-def kind='lvalue' type-id='type-id-713' size-in-bits='64' id='type-id-714'/>
    <pointer-type-def type-id='type-id-713' size-in-bits='64' id='type-id-715'/>
    <qualified-type-def type-id='type-id-241' const='yes' id='type-id-716'/>
    <pointer-type-def type-id='type-id-716' size-in-bits='64' id='type-id-247'/>
    <qualified-type-def type-id='type-id-255' const='yes' id='type-id-717'/>
    <pointer-type-def type-id='type-id-717' size-in-bits='64' id='type-id-718'/>
    <qualified-type-def type-id='type-id-718' const='yes' id='type-id-719'/>
    <qualified-type-def type-id='type-id-257' const='yes' id='type-id-720'/>
    <pointer-type-def type-id='type-id-720' size-in-bits='64' id='type-id-721'/>
    <qualified-type-def type-id='type-id-721' const='yes' id='type-id-722'/>
    <qualified-type-def type-id='type-id-258' const='yes' id='type-id-723'/>
    <pointer-type-def type-id='type-id-723' size-in-bits='64' id='type-id-724'/>
    <qualified-type-def type-id='type-id-724' const='yes' id='type-id-725'/>
    <qualified-type-def type-id='type-id-260' const='yes' id='type-id-726'/>
    <reference-type-def kind='lvalue' type-id='type-id-726' size-in-bits='64' id='type-id-727'/>
    <qualified-type-def type-id='type-id-728' const='yes' id='type-id-729'/>
    <qualified-type-def type-id='type-id-471' const='yes' id='type-id-730'/>
    <pointer-type-def type-id='type-id-730' size-in-bits='64' id='type-id-731'/>
    <qualified-type-def type-id='type-id-732' const='yes' id='type-id-733'/>
    <pointer-type-def type-id='type-id-733' size-in-bits='64' id='type-id-734'/>
    <qualified-type-def type-id='type-id-452' const='yes' id='type-id-735'/>
    <pointer-type-def type-id='type-id-735' size-in-bits='64' id='type-id-455'/>
    <qualified-type-def type-id='type-id-455' const='yes' id='type-id-736'/>
    <qualified-type-def type-id='type-id-398' const='yes' id='type-id-737'/>
    <pointer-type-def type-id='type-id-737' size-in-bits='64' id='type-id-738'/>
    <qualified-type-def type-id='type-id-738' const='yes' id='type-id-739'/>
    <qualified-type-def type-id='type-id-399' const='yes' id='type-id-740'/>
    <pointer-type-def type-id='type-id-740' size-in-bits='64' id='type-id-741'/>
    <qualified-type-def type-id='type-id-741' const='yes' id='type-id-742'/>
    <qualified-type-def type-id='type-id-400' const='yes' id='type-id-743'/>
    <pointer-type-def type-id='type-id-743' size-in-bits='64' id='type-id-744'/>
    <qualified-type-def type-id='type-id-744' const='yes' id='type-id-745'/>
    <qualified-type-def type-id='type-id-410' const='yes' id='type-id-746'/>
    <reference-type-def kind='lvalue' type-id='type-id-746' size-in-bits='64' id='type-id-747'/>
    <pointer-type-def type-id='type-id-746' size-in-bits='64' id='type-id-748'/>
    <qualified-type-def type-id='type-id-748' const='yes' id='type-id-749'/>
    <qualified-type-def type-id='type-id-416' const='yes' id='type-id-750'/>
    <reference-type-def kind='lvalue' type-id='type-id-750' size-in-bits='64' id='type-id-751'/>
    <pointer-type-def type-id='type-id-750' size-in-bits='64' id='type-id-752'/>
    <qualified-type-def type-id='type-id-415' const='yes' id='type-id-753'/>
    <pointer-type-def type-id='type-id-753' size-in-bits='64' id='type-id-754'/>
    <qualified-type-def type-id='type-id-754' const='yes' id='type-id-755'/>
    <qualified-type-def type-id='type-id-422' const='yes' id='type-id-756'/>
    <reference-type-def kind='lvalue' type-id='type-id-756' size-in-bits='64' id='type-id-757'/>
    <qualified-type-def type-id='type-id-407' const='yes' id='type-id-403'/>
    <reference-type-def kind='lvalue' type-id='type-id-403' size-in-bits='64' id='type-id-758'/>
    <pointer-type-def type-id='type-id-403' size-in-bits='64' id='type-id-759'/>
    <qualified-type-def type-id='type-id-759' const='yes' id='type-id-760'/>
    <qualified-type-def type-id='type-id-423' const='yes' id='type-id-761'/>
    <reference-type-def kind='lvalue' type-id='type-id-761' size-in-bits='64' id='type-id-762'/>
    <qualified-type-def type-id='type-id-424' const='yes' id='type-id-763'/>
    <reference-type-def kind='lvalue' type-id='type-id-763' size-in-bits='64' id='type-id-764'/>
    <qualified-type-def type-id='type-id-426' const='yes' id='type-id-765'/>
    <reference-type-def kind='lvalue' type-id='type-id-765' size-in-bits='64' id='type-id-766'/>
    <qualified-type-def type-id='type-id-414' const='yes' id='type-id-767'/>
    <reference-type-def kind='lvalue' type-id='type-id-767' size-in-bits='64' id='type-id-421'/>
    <pointer-type-def type-id='type-id-767' size-in-bits='64' id='type-id-419'/>
    <qualified-type-def type-id='type-id-425' const='yes' id='type-id-768'/>
    <pointer-type-def type-id='type-id-768' size-in-bits='64' id='type-id-769'/>
    <qualified-type-def type-id='type-id-769' const='yes' id='type-id-770'/>
    <qualified-type-def type-id='type-id-442' const='yes' id='type-id-437'/>
    <qualified-type-def type-id='type-id-443' const='yes' id='type-id-441'/>
    <qualified-type-def type-id='type-id-432' const='yes' id='type-id-771'/>
    <qualified-type-def type-id='type-id-459' const='yes' id='type-id-772'/>
    <pointer-type-def type-id='type-id-772' size-in-bits='64' id='type-id-773'/>
    <qualified-type-def type-id='type-id-774' const='yes' id='type-id-775'/>
    <qualified-type-def type-id='type-id-776' const='yes' id='type-id-777'/>
    <pointer-type-def type-id='type-id-777' size-in-bits='64' id='type-id-778'/>
    <qualified-type-def type-id='type-id-779' const='yes' id='type-id-780'/>
    <pointer-type-def type-id='type-id-780' size-in-bits='64' id='type-id-781'/>
    <pointer-type-def type-id='type-id-781' size-in-bits='64' id='type-id-782'/>
    <qualified-type-def type-id='type-id-267' const='yes' id='type-id-783'/>
    <reference-type-def kind='lvalue' type-id='type-id-783' size-in-bits='64' id='type-id-784'/>
    <pointer-type-def type-id='type-id-783' size-in-bits='64' id='type-id-309'/>
    <qualified-type-def type-id='type-id-268' const='yes' id='type-id-785'/>
    <reference-type-def kind='lvalue' type-id='type-id-785' size-in-bits='64' id='type-id-786'/>
    <pointer-type-def type-id='type-id-785' size-in-bits='64' id='type-id-787'/>
    <qualified-type-def type-id='type-id-271' const='yes' id='type-id-788'/>
    <reference-type-def kind='lvalue' type-id='type-id-788' size-in-bits='64' id='type-id-789'/>
    <qualified-type-def type-id='type-id-275' const='yes' id='type-id-790'/>
    <reference-type-def kind='lvalue' type-id='type-id-790' size-in-bits='64' id='type-id-273'/>
    <qualified-type-def type-id='type-id-278' const='yes' id='type-id-791'/>
    <pointer-type-def type-id='type-id-791' size-in-bits='64' id='type-id-792'/>
    <qualified-type-def type-id='type-id-280' const='yes' id='type-id-793'/>
    <reference-type-def kind='lvalue' type-id='type-id-793' size-in-bits='64' id='type-id-794'/>
    <qualified-type-def type-id='type-id-284' const='yes' id='type-id-795'/>
    <reference-type-def kind='lvalue' type-id='type-id-795' size-in-bits='64' id='type-id-282'/>
    <qualified-type-def type-id='type-id-286' const='yes' id='type-id-796'/>
    <reference-type-def kind='lvalue' type-id='type-id-796' size-in-bits='64' id='type-id-797'/>
    <pointer-type-def type-id='type-id-796' size-in-bits='64' id='type-id-798'/>
    <qualified-type-def type-id='type-id-288' const='yes' id='type-id-799'/>
    <reference-type-def kind='lvalue' type-id='type-id-799' size-in-bits='64' id='type-id-800'/>
    <qualified-type-def type-id='type-id-294' const='yes' id='type-id-801'/>
    <reference-type-def kind='lvalue' type-id='type-id-801' size-in-bits='64' id='type-id-802'/>
    <pointer-type-def type-id='type-id-801' size-in-bits='64' id='type-id-803'/>
    <qualified-type-def type-id='type-id-296' const='yes' id='type-id-804'/>
    <reference-type-def kind='lvalue' type-id='type-id-804' size-in-bits='64' id='type-id-805'/>
    <qualified-type-def type-id='type-id-307' const='yes' id='type-id-806'/>
    <reference-type-def kind='lvalue' type-id='type-id-806' size-in-bits='64' id='type-id-303'/>
    <qualified-type-def type-id='type-id-807' const='yes' id='type-id-808'/>
    <qualified-type-def type-id='type-id-315' const='yes' id='type-id-809'/>
    <reference-type-def kind='lvalue' type-id='type-id-809' size-in-bits='64' id='type-id-810'/>
    <qualified-type-def type-id='type-id-313' const='yes' id='type-id-811'/>
    <reference-type-def kind='lvalue' type-id='type-id-811' size-in-bits='64' id='type-id-812'/>
    <pointer-type-def type-id='type-id-811' size-in-bits='64' id='type-id-813'/>
    <qualified-type-def type-id='type-id-316' const='yes' id='type-id-814'/>
    <pointer-type-def type-id='type-id-814' size-in-bits='64' id='type-id-815'/>
    <qualified-type-def type-id='type-id-815' const='yes' id='type-id-816'/>
    <qualified-type-def type-id='type-id-817' const='yes' id='type-id-818'/>
    <pointer-type-def type-id='type-id-818' size-in-bits='64' id='type-id-819'/>
    <qualified-type-def type-id='type-id-374' const='yes' id='type-id-820'/>
    <pointer-type-def type-id='type-id-820' size-in-bits='64' id='type-id-821'/>
    <qualified-type-def type-id='type-id-821' const='yes' id='type-id-822'/>
    <qualified-type-def type-id='type-id-373' const='yes' id='type-id-823'/>
    <pointer-type-def type-id='type-id-823' size-in-bits='64' id='type-id-375'/>
    <qualified-type-def type-id='type-id-375' const='yes' id='type-id-824'/>
    <qualified-type-def type-id='type-id-825' const='yes' id='type-id-826'/>
    <qualified-type-def type-id='type-id-55' const='yes' id='type-id-827'/>
    <reference-type-def kind='lvalue' type-id='type-id-827' size-in-bits='64' id='type-id-828'/>
    <pointer-type-def type-id='type-id-827' size-in-bits='64' id='type-id-829'/>
    <qualified-type-def type-id='type-id-321' const='yes' id='type-id-830'/>
    <reference-type-def kind='lvalue' type-id='type-id-830' size-in-bits='64' id='type-id-327'/>
    <pointer-type-def type-id='type-id-830' size-in-bits='64' id='type-id-326'/>
    <qualified-type-def type-id='type-id-61' const='yes' id='type-id-831'/>
    <reference-type-def kind='lvalue' type-id='type-id-831' size-in-bits='64' id='type-id-832'/>
    <pointer-type-def type-id='type-id-831' size-in-bits='64' id='type-id-833'/>
    <qualified-type-def type-id='type-id-833' const='yes' id='type-id-834'/>
    <qualified-type-def type-id='type-id-347' const='yes' id='type-id-835'/>
    <reference-type-def kind='lvalue' type-id='type-id-835' size-in-bits='64' id='type-id-836'/>
    <pointer-type-def type-id='type-id-835' size-in-bits='64' id='type-id-837'/>
    <qualified-type-def type-id='type-id-349' const='yes' id='type-id-838'/>
    <pointer-type-def type-id='type-id-838' size-in-bits='64' id='type-id-350'/>
    <qualified-type-def type-id='type-id-339' const='yes' id='type-id-839'/>
    <reference-type-def kind='lvalue' type-id='type-id-839' size-in-bits='64' id='type-id-840'/>
    <pointer-type-def type-id='type-id-839' size-in-bits='64' id='type-id-841'/>
    <qualified-type-def type-id='type-id-330' const='yes' id='type-id-351'/>
    <qualified-type-def type-id='type-id-331' const='yes' id='type-id-842'/>
    <reference-type-def kind='lvalue' type-id='type-id-842' size-in-bits='64' id='type-id-338'/>
    <pointer-type-def type-id='type-id-842' size-in-bits='64' id='type-id-334'/>
    <qualified-type-def type-id='type-id-352' const='yes' id='type-id-843'/>
    <reference-type-def kind='lvalue' type-id='type-id-843' size-in-bits='64' id='type-id-844'/>
    <pointer-type-def type-id='type-id-843' size-in-bits='64' id='type-id-845'/>
    <qualified-type-def type-id='type-id-845' const='yes' id='type-id-846'/>
    <qualified-type-def type-id='type-id-353' const='yes' id='type-id-361'/>
    <qualified-type-def type-id='type-id-354' const='yes' id='type-id-847'/>
    <reference-type-def kind='lvalue' type-id='type-id-847' size-in-bits='64' id='type-id-848'/>
    <pointer-type-def type-id='type-id-847' size-in-bits='64' id='type-id-358'/>
    <qualified-type-def type-id='type-id-67' const='yes' id='type-id-849'/>
    <reference-type-def kind='lvalue' type-id='type-id-849' size-in-bits='64' id='type-id-850'/>
    <pointer-type-def type-id='type-id-849' size-in-bits='64' id='type-id-851'/>
    <qualified-type-def type-id='type-id-363' const='yes' id='type-id-852'/>
    <reference-type-def kind='lvalue' type-id='type-id-852' size-in-bits='64' id='type-id-369'/>
    <pointer-type-def type-id='type-id-852' size-in-bits='64' id='type-id-368'/>
    <qualified-type-def type-id='type-id-372' const='yes' id='type-id-853'/>
    <reference-type-def kind='lvalue' type-id='type-id-853' size-in-bits='64' id='type-id-854'/>
    <pointer-type-def type-id='type-id-853' size-in-bits='64' id='type-id-855'/>
    <qualified-type-def type-id='type-id-378' const='yes' id='type-id-856'/>
    <reference-type-def kind='lvalue' type-id='type-id-856' size-in-bits='64' id='type-id-857'/>
    <pointer-type-def type-id='type-id-858' size-in-bits='64' id='type-id-232'/>
    <pointer-type-def type-id='type-id-859' size-in-bits='64' id='type-id-186'/>
    <pointer-type-def type-id='type-id-860' size-in-bits='64' id='type-id-311'/>
    <pointer-type-def type-id='type-id-861' size-in-bits='64' id='type-id-50'/>
    <pointer-type-def type-id='type-id-862' size-in-bits='64' id='type-id-38'/>
    <pointer-type-def type-id='type-id-863' size-in-bits='64' id='type-id-47'/>
    <pointer-type-def type-id='type-id-864' size-in-bits='64' id='type-id-41'/>
    <pointer-type-def type-id='type-id-865' size-in-bits='64' id='type-id-44'/>
    <pointer-type-def type-id='type-id-866' size-in-bits='64' id='type-id-53'/>
    <pointer-type-def type-id='type-id-867' size-in-bits='64' id='type-id-134'/>
    <pointer-type-def type-id='type-id-868' size-in-bits='64' id='type-id-132'/>
    <pointer-type-def type-id='type-id-869' size-in-bits='64' id='type-id-478'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-266'/>
    <reference-type-def kind='lvalue' type-id='type-id-870' size-in-bits='64' id='type-id-871'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-872'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-873'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-874'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-875'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-876'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-877'/>
    <reference-type-def kind='lvalue' type-id='type-id-72' size-in-bits='64' id='type-id-878'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-879'/>
    <reference-type-def kind='lvalue' type-id='type-id-33' size-in-bits='64' id='type-id-880'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-881'/>
    <reference-type-def kind='lvalue' type-id='type-id-262' size-in-bits='64' id='type-id-882'/>
    <pointer-type-def type-id='type-id-262' size-in-bits='64' id='type-id-13'/>
    <qualified-type-def type-id='type-id-13' const='yes' id='type-id-883'/>
    <pointer-type-def type-id='type-id-548' size-in-bits='64' id='type-id-884'/>
    <pointer-type-def type-id='type-id-552' size-in-bits='64' id='type-id-885'/>
    <qualified-type-def type-id='type-id-885' const='yes' id='type-id-886'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-887'/>
    <qualified-type-def type-id='type-id-887' const='yes' id='type-id-888'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-5'/>
    <pointer-type-def type-id='type-id-559' size-in-bits='64' id='type-id-889'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-890'/>
    <pointer-type-def type-id='type-id-564' size-in-bits='64' id='type-id-891'/>
    <qualified-type-def type-id='type-id-891' const='yes' id='type-id-892'/>
    <pointer-type-def type-id='type-id-893' size-in-bits='64' id='type-id-894'/>
    <qualified-type-def type-id='type-id-894' const='yes' id='type-id-895'/>
    <qualified-type-def type-id='type-id-382' const='yes' id='type-id-896'/>
    <reference-type-def kind='lvalue' type-id='type-id-29' size-in-bits='64' id='type-id-897'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-898'/>
    <qualified-type-def type-id='type-id-898' const='yes' id='type-id-899'/>
    <reference-type-def kind='lvalue' type-id='type-id-27' size-in-bits='64' id='type-id-900'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-901'/>
    <qualified-type-def type-id='type-id-901' const='yes' id='type-id-902'/>
    <reference-type-def kind='lvalue' type-id='type-id-25' size-in-bits='64' id='type-id-903'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-904'/>
    <qualified-type-def type-id='type-id-904' const='yes' id='type-id-905'/>
    <pointer-type-def type-id='type-id-906' size-in-bits='64' id='type-id-907'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-908'/>
    <pointer-type-def type-id='type-id-908' size-in-bits='64' id='type-id-248'/>
    <reference-type-def kind='lvalue' type-id='type-id-34' size-in-bits='64' id='type-id-909'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-910'/>
    <qualified-type-def type-id='type-id-910' const='yes' id='type-id-911'/>
    <reference-type-def kind='lvalue' type-id='type-id-912' size-in-bits='64' id='type-id-913'/>
    <pointer-type-def type-id='type-id-912' size-in-bits='64' id='type-id-914'/>
    <pointer-type-def type-id='type-id-915' size-in-bits='64' id='type-id-35'/>
    <reference-type-def kind='lvalue' type-id='type-id-83' size-in-bits='64' id='type-id-916'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-917'/>
    <qualified-type-def type-id='type-id-917' const='yes' id='type-id-918'/>
    <reference-type-def kind='lvalue' type-id='type-id-79' size-in-bits='64' id='type-id-919'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-322'/>
    <qualified-type-def type-id='type-id-322' const='yes' id='type-id-920'/>
    <reference-type-def kind='lvalue' type-id='type-id-920' size-in-bits='64' id='type-id-921'/>
    <reference-type-def kind='lvalue' type-id='type-id-322' size-in-bits='64' id='type-id-922'/>
    <pointer-type-def type-id='type-id-322' size-in-bits='64' id='type-id-923'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-92'/>
    <qualified-type-def type-id='type-id-92' const='yes' id='type-id-924'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-99'/>
    <qualified-type-def type-id='type-id-99' const='yes' id='type-id-925'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-104'/>
    <qualified-type-def type-id='type-id-104' const='yes' id='type-id-926'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-108'/>
    <qualified-type-def type-id='type-id-108' const='yes' id='type-id-927'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-112'/>
    <qualified-type-def type-id='type-id-112' const='yes' id='type-id-928'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-117'/>
    <qualified-type-def type-id='type-id-117' const='yes' id='type-id-929'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-121'/>
    <qualified-type-def type-id='type-id-121' const='yes' id='type-id-930'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-931'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-932'/>
    <qualified-type-def type-id='type-id-93' const='yes' id='type-id-933'/>
    <qualified-type-def type-id='type-id-934' const='yes' id='type-id-935'/>
    <reference-type-def kind='lvalue' type-id='type-id-332' size-in-bits='64' id='type-id-936'/>
    <pointer-type-def type-id='type-id-332' size-in-bits='64' id='type-id-937'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-938'/>
    <pointer-type-def type-id='type-id-939' size-in-bits='64' id='type-id-940'/>
    <qualified-type-def type-id='type-id-940' const='yes' id='type-id-941'/>
    <reference-type-def kind='lvalue' type-id='type-id-619' size-in-bits='64' id='type-id-942'/>
    <pointer-type-def type-id='type-id-619' size-in-bits='64' id='type-id-943'/>
    <pointer-type-def type-id='type-id-623' size-in-bits='64' id='type-id-944'/>
    <qualified-type-def type-id='type-id-944' const='yes' id='type-id-945'/>
    <reference-type-def kind='lvalue' type-id='type-id-946' size-in-bits='64' id='type-id-947'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-948'/>
    <qualified-type-def type-id='type-id-948' const='yes' id='type-id-949'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-950'/>
    <qualified-type-def type-id='type-id-950' const='yes' id='type-id-951'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-952'/>
    <qualified-type-def type-id='type-id-952' const='yes' id='type-id-953'/>
    <pointer-type-def type-id='type-id-636' size-in-bits='64' id='type-id-954'/>
    <qualified-type-def type-id='type-id-954' const='yes' id='type-id-955'/>
    <pointer-type-def type-id='type-id-956' size-in-bits='64' id='type-id-957'/>
    <pointer-type-def type-id='type-id-639' size-in-bits='64' id='type-id-958'/>
    <qualified-type-def type-id='type-id-958' const='yes' id='type-id-959'/>
    <pointer-type-def type-id='type-id-960' size-in-bits='64' id='type-id-961'/>
    <qualified-type-def type-id='type-id-961' const='yes' id='type-id-962'/>
    <qualified-type-def type-id='type-id-963' const='yes' id='type-id-964'/>
    <pointer-type-def type-id='type-id-965' size-in-bits='64' id='type-id-966'/>
    <pointer-type-def type-id='type-id-645' size-in-bits='64' id='type-id-967'/>
    <qualified-type-def type-id='type-id-967' const='yes' id='type-id-968'/>
    <pointer-type-def type-id='type-id-648' size-in-bits='64' id='type-id-197'/>
    <reference-type-def kind='lvalue' type-id='type-id-188' size-in-bits='64' id='type-id-969'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-229'/>
    <qualified-type-def type-id='type-id-229' const='yes' id='type-id-970'/>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' id='type-id-971'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' id='type-id-198'/>
    <reference-type-def kind='lvalue' type-id='type-id-192' size-in-bits='64' id='type-id-972'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-973'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-206'/>
    <reference-type-def kind='lvalue' type-id='type-id-201' size-in-bits='64' id='type-id-974'/>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-975'/>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' id='type-id-214'/>
    <reference-type-def kind='lvalue' type-id='type-id-209' size-in-bits='64' id='type-id-976'/>
    <reference-type-def kind='lvalue' type-id='type-id-213' size-in-bits='64' id='type-id-211'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-977'/>
    <pointer-type-def type-id='type-id-216' size-in-bits='64' id='type-id-222'/>
    <reference-type-def kind='lvalue' type-id='type-id-217' size-in-bits='64' id='type-id-978'/>
    <reference-type-def kind='lvalue' type-id='type-id-221' size-in-bits='64' id='type-id-219'/>
    <reference-type-def kind='lvalue' type-id='type-id-228' size-in-bits='64' id='type-id-226'/>
    <reference-type-def kind='lvalue' type-id='type-id-979' size-in-bits='64' id='type-id-980'/>
    <pointer-type-def type-id='type-id-979' size-in-bits='64' id='type-id-981'/>
    <reference-type-def kind='lvalue' type-id='type-id-15' size-in-bits='64' id='type-id-982'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-18'/>
    <qualified-type-def type-id='type-id-18' const='yes' id='type-id-983'/>
    <qualified-type-def type-id='type-id-182' const='yes' id='type-id-984'/>
    <pointer-type-def type-id='type-id-985' size-in-bits='64' id='type-id-986'/>
    <pointer-type-def type-id='type-id-234' size-in-bits='64' id='type-id-235'/>
    <reference-type-def kind='lvalue' type-id='type-id-139' size-in-bits='64' id='type-id-987'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-181'/>
    <qualified-type-def type-id='type-id-181' const='yes' id='type-id-988'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-989'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-150'/>
    <reference-type-def kind='lvalue' type-id='type-id-144' size-in-bits='64' id='type-id-990'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-991'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-158'/>
    <reference-type-def kind='lvalue' type-id='type-id-153' size-in-bits='64' id='type-id-992'/>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-993'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-166'/>
    <reference-type-def kind='lvalue' type-id='type-id-161' size-in-bits='64' id='type-id-994'/>
    <reference-type-def kind='lvalue' type-id='type-id-165' size-in-bits='64' id='type-id-163'/>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-995'/>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-174'/>
    <reference-type-def kind='lvalue' type-id='type-id-169' size-in-bits='64' id='type-id-996'/>
    <reference-type-def kind='lvalue' type-id='type-id-173' size-in-bits='64' id='type-id-171'/>
    <reference-type-def kind='lvalue' type-id='type-id-180' size-in-bits='64' id='type-id-178'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-185'/>
    <reference-type-def kind='lvalue' type-id='type-id-997' size-in-bits='64' id='type-id-998'/>
    <pointer-type-def type-id='type-id-999' size-in-bits='64' id='type-id-1000'/>
    <pointer-type-def type-id='type-id-706' size-in-bits='64' id='type-id-1001'/>
    <pointer-type-def type-id='type-id-710' size-in-bits='64' id='type-id-1002'/>
    <qualified-type-def type-id='type-id-1002' const='yes' id='type-id-1003'/>
    <pointer-type-def type-id='type-id-1004' size-in-bits='64' id='type-id-1005'/>
    <qualified-type-def type-id='type-id-1005' const='yes' id='type-id-1006'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-1007'/>
    <qualified-type-def type-id='type-id-1007' const='yes' id='type-id-1008'/>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-242'/>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' id='type-id-1009'/>
    <qualified-type-def type-id='type-id-1009' const='yes' id='type-id-1010'/>
    <reference-type-def kind='lvalue' type-id='type-id-255' size-in-bits='64' id='type-id-1011'/>
    <pointer-type-def type-id='type-id-255' size-in-bits='64' id='type-id-1012'/>
    <qualified-type-def type-id='type-id-1012' const='yes' id='type-id-1013'/>
    <pointer-type-def type-id='type-id-257' size-in-bits='64' id='type-id-1014'/>
    <qualified-type-def type-id='type-id-1014' const='yes' id='type-id-1015'/>
    <reference-type-def kind='lvalue' type-id='type-id-258' size-in-bits='64' id='type-id-1016'/>
    <pointer-type-def type-id='type-id-258' size-in-bits='64' id='type-id-1017'/>
    <qualified-type-def type-id='type-id-1017' const='yes' id='type-id-1018'/>
    <reference-type-def kind='lvalue' type-id='type-id-259' size-in-bits='64' id='type-id-1019'/>
    <pointer-type-def type-id='type-id-259' size-in-bits='64' id='type-id-261'/>
    <reference-type-def kind='lvalue' type-id='type-id-260' size-in-bits='64' id='type-id-1020'/>
    <reference-type-def kind='lvalue' type-id='type-id-251' size-in-bits='64' id='type-id-1021'/>
    <pointer-type-def type-id='type-id-471' size-in-bits='64' id='type-id-1022'/>
    <qualified-type-def type-id='type-id-1022' const='yes' id='type-id-1023'/>
    <pointer-type-def type-id='type-id-732' size-in-bits='64' id='type-id-1024'/>
    <qualified-type-def type-id='type-id-1025' const='yes' id='type-id-1026'/>
    <pointer-type-def type-id='type-id-452' size-in-bits='64' id='type-id-91'/>
    <qualified-type-def type-id='type-id-91' const='yes' id='type-id-1027'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-1028'/>
    <pointer-type-def type-id='type-id-398' size-in-bits='64' id='type-id-451'/>
    <qualified-type-def type-id='type-id-451' const='yes' id='type-id-1029'/>
    <pointer-type-def type-id='type-id-399' size-in-bits='64' id='type-id-1030'/>
    <qualified-type-def type-id='type-id-1030' const='yes' id='type-id-1031'/>
    <pointer-type-def type-id='type-id-401' size-in-bits='64' id='type-id-1032'/>
    <reference-type-def kind='lvalue' type-id='type-id-402' size-in-bits='64' id='type-id-1033'/>
    <reference-type-def kind='lvalue' type-id='type-id-404' size-in-bits='64' id='type-id-1034'/>
    <reference-type-def kind='lvalue' type-id='type-id-409' size-in-bits='64' id='type-id-1035'/>
    <pointer-type-def type-id='type-id-400' size-in-bits='64' id='type-id-1036'/>
    <qualified-type-def type-id='type-id-1036' const='yes' id='type-id-1037'/>
    <pointer-type-def type-id='type-id-410' size-in-bits='64' id='type-id-1038'/>
    <qualified-type-def type-id='type-id-1038' const='yes' id='type-id-1039'/>
    <pointer-type-def type-id='type-id-413' size-in-bits='64' id='type-id-411'/>
    <qualified-type-def type-id='type-id-411' const='yes' id='type-id-1040'/>
    <pointer-type-def type-id='type-id-416' size-in-bits='64' id='type-id-412'/>
    <reference-type-def kind='lvalue' type-id='type-id-415' size-in-bits='64' id='type-id-1041'/>
    <pointer-type-def type-id='type-id-415' size-in-bits='64' id='type-id-1042'/>
    <qualified-type-def type-id='type-id-1042' const='yes' id='type-id-1043'/>
    <reference-type-def kind='lvalue' type-id='type-id-417' size-in-bits='64' id='type-id-1044'/>
    <reference-type-def kind='lvalue' type-id='type-id-407' size-in-bits='64' id='type-id-1045'/>
    <pointer-type-def type-id='type-id-407' size-in-bits='64' id='type-id-1046'/>
    <qualified-type-def type-id='type-id-1046' const='yes' id='type-id-1047'/>
    <reference-type-def kind='lvalue' type-id='type-id-414' size-in-bits='64' id='type-id-430'/>
    <pointer-type-def type-id='type-id-414' size-in-bits='64' id='type-id-428'/>
    <pointer-type-def type-id='type-id-425' size-in-bits='64' id='type-id-1048'/>
    <qualified-type-def type-id='type-id-1048' const='yes' id='type-id-1049'/>
    <reference-type-def kind='lvalue' type-id='type-id-436' size-in-bits='64' id='type-id-435'/>
    <reference-type-def kind='lvalue' type-id='type-id-440' size-in-bits='64' id='type-id-439'/>
    <pointer-type-def type-id='type-id-432' size-in-bits='64' id='type-id-1050'/>
    <qualified-type-def type-id='type-id-1050' const='yes' id='type-id-1051'/>
    <reference-type-def kind='lvalue' type-id='type-id-444' size-in-bits='64' id='type-id-1052'/>
    <reference-type-def kind='lvalue' type-id='type-id-445' size-in-bits='64' id='type-id-1053'/>
    <pointer-type-def type-id='type-id-458' size-in-bits='64' id='type-id-116'/>
    <qualified-type-def type-id='type-id-116' const='yes' id='type-id-1054'/>
    <pointer-type-def type-id='type-id-470' size-in-bits='64' id='type-id-472'/>
    <qualified-type-def type-id='type-id-472' const='yes' id='type-id-1055'/>
    <pointer-type-def type-id='type-id-459' size-in-bits='64' id='type-id-103'/>
    <qualified-type-def type-id='type-id-103' const='yes' id='type-id-1056'/>
    <qualified-type-def type-id='type-id-1057' const='yes' id='type-id-1058'/>
    <pointer-type-def type-id='type-id-779' size-in-bits='64' id='type-id-276'/>
    <qualified-type-def type-id='type-id-276' const='yes' id='type-id-1059'/>
    <reference-type-def kind='lvalue' type-id='type-id-267' size-in-bits='64' id='type-id-1060'/>
    <pointer-type-def type-id='type-id-267' size-in-bits='64' id='type-id-308'/>
    <qualified-type-def type-id='type-id-308' const='yes' id='type-id-1061'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-1062'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' id='type-id-277'/>
    <reference-type-def kind='lvalue' type-id='type-id-271' size-in-bits='64' id='type-id-1063'/>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-1064'/>
    <pointer-type-def type-id='type-id-279' size-in-bits='64' id='type-id-285'/>
    <reference-type-def kind='lvalue' type-id='type-id-280' size-in-bits='64' id='type-id-1065'/>
    <pointer-type-def type-id='type-id-286' size-in-bits='64' id='type-id-1066'/>
    <pointer-type-def type-id='type-id-287' size-in-bits='64' id='type-id-293'/>
    <reference-type-def kind='lvalue' type-id='type-id-288' size-in-bits='64' id='type-id-1067'/>
    <reference-type-def kind='lvalue' type-id='type-id-292' size-in-bits='64' id='type-id-290'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-1068'/>
    <pointer-type-def type-id='type-id-295' size-in-bits='64' id='type-id-301'/>
    <reference-type-def kind='lvalue' type-id='type-id-296' size-in-bits='64' id='type-id-1069'/>
    <reference-type-def kind='lvalue' type-id='type-id-300' size-in-bits='64' id='type-id-298'/>
    <reference-type-def kind='lvalue' type-id='type-id-307' size-in-bits='64' id='type-id-305'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-1070'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-1071'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-1072'/>
    <reference-type-def kind='lvalue' type-id='type-id-1073' size-in-bits='64' id='type-id-1074'/>
    <pointer-type-def type-id='type-id-1075' size-in-bits='64' id='type-id-1076'/>
    <reference-type-def kind='lvalue' type-id='type-id-315' size-in-bits='64' id='type-id-1077'/>
    <pointer-type-def type-id='type-id-315' size-in-bits='64' id='type-id-1078'/>
    <qualified-type-def type-id='type-id-1078' const='yes' id='type-id-1079'/>
    <reference-type-def kind='lvalue' type-id='type-id-313' size-in-bits='64' id='type-id-1080'/>
    <pointer-type-def type-id='type-id-313' size-in-bits='64' id='type-id-314'/>
    <pointer-type-def type-id='type-id-316' size-in-bits='64' id='type-id-1081'/>
    <pointer-type-def type-id='type-id-817' size-in-bits='64' id='type-id-1082'/>
    <qualified-type-def type-id='type-id-1082' const='yes' id='type-id-1083'/>
    <pointer-type-def type-id='type-id-374' size-in-bits='64' id='type-id-1084'/>
    <qualified-type-def type-id='type-id-1084' const='yes' id='type-id-1085'/>
    <pointer-type-def type-id='type-id-373' size-in-bits='64' id='type-id-377'/>
    <qualified-type-def type-id='type-id-377' const='yes' id='type-id-1086'/>
    <reference-type-def kind='lvalue' type-id='type-id-55' size-in-bits='64' id='type-id-1087'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-1088'/>
    <reference-type-def kind='lvalue' type-id='type-id-321' size-in-bits='64' id='type-id-1089'/>
    <pointer-type-def type-id='type-id-321' size-in-bits='64' id='type-id-324'/>
    <reference-type-def kind='lvalue' type-id='type-id-61' size-in-bits='64' id='type-id-1090'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-1091'/>
    <qualified-type-def type-id='type-id-1091' const='yes' id='type-id-1092'/>
    <reference-type-def kind='lvalue' type-id='type-id-347' size-in-bits='64' id='type-id-1093'/>
    <pointer-type-def type-id='type-id-347' size-in-bits='64' id='type-id-1094'/>
    <reference-type-def kind='lvalue' type-id='type-id-339' size-in-bits='64' id='type-id-1095'/>
    <pointer-type-def type-id='type-id-339' size-in-bits='64' id='type-id-1096'/>
    <reference-type-def kind='lvalue' type-id='type-id-342' size-in-bits='64' id='type-id-346'/>
    <pointer-type-def type-id='type-id-342' size-in-bits='64' id='type-id-344'/>
    <reference-type-def kind='lvalue' type-id='type-id-331' size-in-bits='64' id='type-id-1097'/>
    <pointer-type-def type-id='type-id-331' size-in-bits='64' id='type-id-336'/>
    <reference-type-def kind='lvalue' type-id='type-id-352' size-in-bits='64' id='type-id-1098'/>
    <pointer-type-def type-id='type-id-352' size-in-bits='64' id='type-id-1099'/>
    <qualified-type-def type-id='type-id-1099' const='yes' id='type-id-1100'/>
    <reference-type-def kind='lvalue' type-id='type-id-354' size-in-bits='64' id='type-id-1101'/>
    <pointer-type-def type-id='type-id-354' size-in-bits='64' id='type-id-356'/>
    <reference-type-def kind='lvalue' type-id='type-id-67' size-in-bits='64' id='type-id-1102'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-1103'/>
    <reference-type-def kind='lvalue' type-id='type-id-363' size-in-bits='64' id='type-id-1104'/>
    <pointer-type-def type-id='type-id-363' size-in-bits='64' id='type-id-366'/>
    <reference-type-def kind='lvalue' type-id='type-id-372' size-in-bits='64' id='type-id-1105'/>
    <pointer-type-def type-id='type-id-372' size-in-bits='64' id='type-id-364'/>
    <qualified-type-def type-id='type-id-364' const='yes' id='type-id-1106'/>
    <reference-type-def kind='lvalue' type-id='type-id-1106' size-in-bits='64' id='type-id-1107'/>
    <reference-type-def kind='lvalue' type-id='type-id-364' size-in-bits='64' id='type-id-1108'/>
    <pointer-type-def type-id='type-id-364' size-in-bits='64' id='type-id-1109'/>
    <reference-type-def kind='lvalue' type-id='type-id-378' size-in-bits='64' id='type-id-1110'/>
    <pointer-type-def type-id='type-id-378' size-in-bits='64' id='type-id-1111'/>
    <qualified-type-def type-id='type-id-1111' const='yes' id='type-id-1112'/>
    <pointer-type-def type-id='type-id-379' size-in-bits='64' id='type-id-1113'/>
    <qualified-type-def type-id='type-id-1113' const='yes' id='type-id-1114'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-231'/>
    <qualified-type-def type-id='type-id-231' const='yes' id='type-id-1115'/>
    <pointer-type-def type-id='type-id-270' size-in-bits='64' id='type-id-310'/>
    <qualified-type-def type-id='type-id-310' const='yes' id='type-id-1116'/>
    <class-decl name='wxBitmapBase' visibility='default' is-declaration-only='yes' id='type-id-548'>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK12wxBitmapBase12GetClassInfoEv' filepath='include/wx/bitmap.h' line='298' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-550' is-artificial='yes'/>
          <return type-id='type-id-1117'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <function-decl name='SetScaleFactor' mangled-name='_ZN12wxBitmapBase14SetScaleFactorEd' filepath='include/wx/bitmap.h' line='202' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-884' is-artificial='yes'/>
          <parameter type-id='type-id-1118'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='14'>
        <function-decl name='GetScaleFactor' mangled-name='_ZNK12wxBitmapBase14GetScaleFactorEv' filepath='include/wx/bitmap.h' line='203' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-550' is-artificial='yes'/>
          <return type-id='type-id-1118'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='23'>
        <function-decl name='HasAlpha' mangled-name='_ZNK12wxBitmapBase8HasAlphaEv' filepath='include/wx/bitmap.h' line='255' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-550' is-artificial='yes'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='24'>
        <function-decl name='UseAlpha' mangled-name='_ZN12wxBitmapBase8UseAlphaEb' filepath='include/wx/bitmap.h' line='256' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-884' is-artificial='yes'/>
          <parameter type-id='type-id-14'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='28'>
        <function-decl name='QuantizeColour' mangled-name='_ZNK12wxBitmapBase14QuantizeColourERK8wxColour' filepath='include/wx/bitmap.h' line='288' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-550' is-artificial='yes'/>
          <parameter type-id='type-id-8'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='29'>
        <function-decl name='DoCreate' mangled-name='_ZN12wxBitmapBase8DoCreateERK6wxSizedi' filepath='include/wx/bitmap.h' line='294' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-884' is-artificial='yes'/>
          <parameter type-id='type-id-1119'/>
          <parameter type-id='type-id-1118'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxBoxSizer' visibility='default' is-declaration-only='yes' id='type-id-552'>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK10wxBoxSizer12GetClassInfoEv' filepath='include/wx/sizer.h' line='1055' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-554' is-artificial='yes'/>
          <return type-id='type-id-1117'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='AddSpacer' mangled-name='_ZN10wxBoxSizer9AddSpacerEi' filepath='include/wx/sizer.h' line='982' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-885' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-276'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <function-decl name='InformFirstDirection' mangled-name='_ZN10wxBoxSizer20InformFirstDirectionEiii' filepath='include/wx/sizer.h' line='994' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-885' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <function-decl name='CalcMin' mangled-name='_ZN10wxBoxSizer7CalcMinEv' filepath='include/wx/sizer.h' line='991' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-885' is-artificial='yes'/>
          <return type-id='type-id-449'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <function-decl name='RepositionChildren' mangled-name='_ZN10wxBoxSizer18RepositionChildrenERK6wxSize' filepath='include/wx/sizer.h' line='992' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-885' is-artificial='yes'/>
          <parameter type-id='type-id-1119'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='28'>
        <function-decl name='DoInsert' mangled-name='_ZN10wxBoxSizer8DoInsertEmP11wxSizerItem' filepath='include/wx/sizer.h' line='1000' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-885' is-artificial='yes'/>
          <parameter type-id='type-id-81'/>
          <parameter type-id='type-id-276'/>
          <return type-id='type-id-276'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxBrush' visibility='default' is-declaration-only='yes' id='type-id-30'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBrush' mangled-name='_ZN7wxBrushD0Ev' filepath='include/wx/gtk/brush.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-887' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBrush' mangled-name='_ZN7wxBrushD1Ev' filepath='include/wx/gtk/brush.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-887' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBrush' mangled-name='_ZN7wxBrushD4Ev' filepath='include/wx/gtk/brush.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-887' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK7wxBrush12GetClassInfoEv' filepath='include/wx/gtk/brush.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-557' is-artificial='yes'/>
          <return type-id='type-id-1117'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='6'>
        <function-decl name='CreateGDIRefData' mangled-name='_ZNK7wxBrush16CreateGDIRefDataEv' filepath='include/wx/gtk/brush.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-557' is-artificial='yes'/>
          <return type-id='type-id-1120'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='7'>
        <function-decl name='CloneGDIRefData' mangled-name='_ZNK7wxBrush15CloneGDIRefDataEPK12wxGDIRefData' filepath='include/wx/gtk/brush.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-557' is-artificial='yes'/>
          <parameter type-id='type-id-1121'/>
          <return type-id='type-id-1120'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='SetColour' mangled-name='_ZN7wxBrush9SetColourERK8wxColour' filepath='include/wx/gtk/brush.h' line='35' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-887' is-artificial='yes'/>
          <parameter type-id='type-id-8'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='SetColour' mangled-name='_ZN7wxBrush9SetColourEhhh' filepath='include/wx/gtk/brush.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-887' is-artificial='yes'/>
          <parameter type-id='type-id-9'/>
          <parameter type-id='type-id-9'/>
          <parameter type-id='type-id-9'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='SetStyle' mangled-name='_ZN7wxBrush8SetStyleE12wxBrushStyle' filepath='include/wx/gtk/brush.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-887' is-artificial='yes'/>
          <parameter type-id='type-id-1'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <function-decl name='SetStipple' mangled-name='_ZN7wxBrush10SetStippleERK8wxBitmap' filepath='include/wx/gtk/brush.h' line='38' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-887' is-artificial='yes'/>
          <parameter type-id='type-id-10'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='12'>
        <function-decl name='GetColour' mangled-name='_ZNK7wxBrush9GetColourEv' filepath='include/wx/gtk/brush.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-557' is-artificial='yes'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='13'>
        <function-decl name='GetStyle' mangled-name='_ZNK7wxBrush8GetStyleEv' filepath='include/wx/gtk/brush.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-557' is-artificial='yes'/>
          <return type-id='type-id-1'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='14'>
        <function-decl name='GetStipple' mangled-name='_ZNK7wxBrush10GetStippleEv' filepath='include/wx/gtk/brush.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-557' is-artificial='yes'/>
          <return type-id='type-id-13'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxClientDataContainer' visibility='default' is-declaration-only='yes' id='type-id-559'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxClientDataContainer' mangled-name='_ZN21wxClientDataContainerD2Ev' filepath='include/wx/clntdata.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-889' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxClientDataContainer' mangled-name='_ZN21wxClientDataContainerD4Ev' filepath='include/wx/clntdata.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-889' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='2'>
        <function-decl name='DoSetClientObject' mangled-name='_ZN21wxClientDataContainer17DoSetClientObjectEP12wxClientData' filepath='include/wx/clntdata.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-889' is-artificial='yes'/>
          <parameter type-id='type-id-1122'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='3'>
        <function-decl name='DoGetClientObject' mangled-name='_ZNK21wxClientDataContainer17DoGetClientObjectEv' filepath='include/wx/clntdata.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-561' is-artificial='yes'/>
          <return type-id='type-id-1122'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='4'>
        <function-decl name='DoSetClientData' mangled-name='_ZN21wxClientDataContainer15DoSetClientDataEPv' filepath='include/wx/clntdata.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-889' is-artificial='yes'/>
          <parameter type-id='type-id-75'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='5'>
        <function-decl name='DoGetClientData' mangled-name='_ZNK21wxClientDataContainer15DoGetClientDataEv' filepath='include/wx/clntdata.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-561' is-artificial='yes'/>
          <return type-id='type-id-75'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxControlContainer' visibility='default' is-declaration-only='yes' id='type-id-17'>
      <member-function access='protected' vtable-offset='2'>
        <function-decl name='SetFocusToChild' mangled-name='_ZN18wxControlContainer15SetFocusToChildEv' filepath='include/wx/containr.h' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-890' is-artificial='yes'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxControlContainerBase' visibility='default' is-declaration-only='yes' id='type-id-564'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlContainerBase' mangled-name='_ZN22wxControlContainerBaseD0Ev' filepath='include/wx/containr.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-891' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlContainerBase' mangled-name='_ZN22wxControlContainerBaseD2Ev' filepath='include/wx/containr.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-891' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlContainerBase' mangled-name='_ZN22wxControlContainerBaseD4Ev' filepath='include/wx/containr.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-891' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='2'>
        <function-decl name='SetFocusToChild' mangled-name='_ZN22wxControlContainerBase15SetFocusToChildEv' filepath='include/wx/containr.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-891' is-artificial='yes'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxDisplayFactory' visibility='default' is-declaration-only='yes' id='type-id-912'/>
    <class-decl name='wxDisplayImpl' visibility='default' is-declaration-only='yes' id='type-id-915'/>
    <class-decl name='wxGCDC' visibility='default' is-declaration-only='yes' id='type-id-939'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxGCDC' mangled-name='_ZN6wxGCDCD1Ev' filepath='include/wx/dcgraph.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-940' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxGCDC' mangled-name='_ZN6wxGCDCD4Ev' filepath='include/wx/dcgraph.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-940' is-artificial='yes'/>
          <parameter type-id='type-id-6' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxGraphicsPath' visibility='default' is-declaration-only='yes' id='type-id-617'/>
    <class-decl name='wxIconizeEvent' visibility='default' is-declaration-only='yes' id='type-id-619'/>
    <class-decl name='wxImage' visibility='default' is-declaration-only='yes' id='type-id-623'>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK7wxImage12GetClassInfoEv' filepath='include/wx/image.h' line='710' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-626' is-artificial='yes'/>
          <return type-id='type-id-1117'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='3'>
        <function-decl name='CreateRefData' mangled-name='_ZNK7wxImage13CreateRefDataEv' filepath='include/wx/image.h' line='672' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-626' is-artificial='yes'/>
          <return type-id='type-id-1123'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='4'>
        <function-decl name='CloneRefData' mangled-name='_ZNK7wxImage12CloneRefDataEPK12wxRefCounter' filepath='include/wx/image.h' line='673' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-626' is-artificial='yes'/>
          <parameter type-id='type-id-1124'/>
          <return type-id='type-id-1123'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='LoadFile' mangled-name='_ZN7wxImage8LoadFileERK8wxString12wxBitmapTypei' filepath='include/wx/image.h' line='474' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-944' is-artificial='yes'/>
          <parameter type-id='type-id-457'/>
          <parameter type-id='type-id-123'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='LoadFile' mangled-name='_ZN7wxImage8LoadFileERK8wxStringS2_i' filepath='include/wx/image.h' line='475' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-944' is-artificial='yes'/>
          <parameter type-id='type-id-457'/>
          <parameter type-id='type-id-457'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='LoadFile' mangled-name='_ZN7wxImage8LoadFileER13wxInputStream12wxBitmapTypei' filepath='include/wx/image.h' line='480' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-944' is-artificial='yes'/>
          <parameter type-id='type-id-947'/>
          <parameter type-id='type-id-123'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='LoadFile' mangled-name='_ZN7wxImage8LoadFileER13wxInputStreamRK8wxStringi' filepath='include/wx/image.h' line='481' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-944' is-artificial='yes'/>
          <parameter type-id='type-id-947'/>
          <parameter type-id='type-id-457'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='9'>
        <function-decl name='SaveFile' mangled-name='_ZNK7wxImage8SaveFileERK8wxString' filepath='include/wx/image.h' line='484' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-626' is-artificial='yes'/>
          <parameter type-id='type-id-457'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='10'>
        <function-decl name='SaveFile' mangled-name='_ZNK7wxImage8SaveFileERK8wxString12wxBitmapType' filepath='include/wx/image.h' line='485' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-626' is-artificial='yes'/>
          <parameter type-id='type-id-457'/>
          <parameter type-id='type-id-123'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='11'>
        <function-decl name='SaveFile' mangled-name='_ZNK7wxImage8SaveFileERK8wxStringS2_' filepath='include/wx/image.h' line='486' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-626' is-artificial='yes'/>
          <parameter type-id='type-id-457'/>
          <parameter type-id='type-id-457'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='12'>
        <function-decl name='SaveFile' mangled-name='_ZNK7wxImage8SaveFileER14wxOutputStream12wxBitmapType' filepath='include/wx/image.h' line='489' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-626' is-artificial='yes'/>
          <parameter type-id='type-id-998'/>
          <parameter type-id='type-id-123'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='13'>
        <function-decl name='SaveFile' mangled-name='_ZNK7wxImage8SaveFileER14wxOutputStreamRK8wxString' filepath='include/wx/image.h' line='490' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-626' is-artificial='yes'/>
          <parameter type-id='type-id-998'/>
          <parameter type-id='type-id-457'/>
          <return type-id='type-id-14'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxInputStream' visibility='default' is-declaration-only='yes' id='type-id-946'/>
    <class-decl name='wxMBConvStrictUTF8' visibility='default' is-declaration-only='yes' id='type-id-633'>
      <member-function access='public' const='yes' vtable-offset='0'>
        <function-decl name='ToWChar' mangled-name='_ZNK18wxMBConvStrictUTF87ToWCharEPwmPKcm' filepath='include/wx/strconv.h' line='347' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-635' is-artificial='yes'/>
          <parameter type-id='type-id-1125'/>
          <parameter type-id='type-id-81'/>
          <parameter type-id='type-id-395'/>
          <parameter type-id='type-id-81'/>
          <return type-id='type-id-81'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='1'>
