<abi-corpus version='2.0' architecture='elf-amd-x86_64' soname='libwx_baseu_xml-3.2.so.0'>
  <elf-needed>
    <dependency name='libwx_baseu-3.2.so.0'/>
    <dependency name='libexpat.so.1'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_ZN12wxXmlDoctype5ClearEv' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN13wxXmlDocument10DetachRootEv' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN13wxXmlDocument11SetFileTypeE14wxTextFileType' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN13wxXmlDocument14AppendToPrologEP9wxXmlNode' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN13wxXmlDocument21GetLibraryVersionInfoEv' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_ZN9wxXmlNodeD2Ev' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' alias='_ZN9wxXmlNodeD1Ev@@WXU_3.2' is-defined='yes'/>
    <elf-symbol name='_ZN9wxXmlNodeaSERKS_' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNK12wxXmlDoctype13GetFullStringEv' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNK12wxXmlDoctype7IsValidEv' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNK13wxXmlDocument12GetClassInfoEv' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNK13wxXmlDocument4SaveER14wxOutputStreami' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNK13wxXmlDocument4SaveERK8wxStringi' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNK13wxXmlDocument7GetRootEv' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNK9wxXmlNode12GetAttributeERK8wxStringPS0_' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNK9wxXmlNode12GetAttributeERK8wxStringS2_' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNK9wxXmlNode12HasAttributeERK8wxString' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNK9wxXmlNode14GetNodeContentEv' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNK9wxXmlNode16IsWhitespaceOnlyEv' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNK9wxXmlNode8GetDepthEPS_' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZNSt7__cxx1112basic_stringIwSt11char_traitsIwESaIwEE12_M_constructIPKwEEvT_S8_St20forward_iterator_tag' version='WXU_3.2' is-default-version='yes' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='_ZN13wxXmlDocument12ms_classInfoE' size='48' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTI13wxXmlDocument' size='24' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTI14wxXmlAttribute' size='16' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTI9wxXmlNode' size='16' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS13wxXmlDocument' size='16' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS14wxXmlAttribute' size='17' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS9wxXmlNode' size='11' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV13wxXmlDocument' size='88' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV14wxXmlAttribute' size='32' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV9wxXmlNode' size='88' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/xml/xml.cpp' language='LANG_C_plus_plus_14'>
    <type-decl name='__float128' size-in-bits='128' id='type-id-1'/>
    <type-decl name='__int128' size-in-bits='128' id='type-id-2'/>
    <type-decl name='bool' size-in-bits='8' id='type-id-3'/>
    <type-decl name='char' size-in-bits='8' id='type-id-4'/>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='128' id='type-id-5'>
      <subrange length='16' type-id='type-id-6' id='type-id-7'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='8' id='type-id-8'>
      <subrange length='1' type-id='type-id-6' id='type-id-9'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='160' id='type-id-10'>
      <subrange length='20' type-id='type-id-6' id='type-id-11'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='32' id='type-id-12'>
      <subrange length='4' type-id='type-id-6' id='type-id-13'/>
    </array-type-def>
    <class-decl name='typedef __va_list_tag __va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-16' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='type-id-17'/>
    <type-decl name='float' size-in-bits='32' id='type-id-18'/>
    <type-decl name='int' size-in-bits='32' id='type-id-19'/>
    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='8192' id='type-id-20'>
      <subrange length='256' type-id='type-id-6' id='type-id-21'/>
    </array-type-def>
    <type-decl name='long double' size-in-bits='128' id='type-id-22'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-23'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-24'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-25'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-26'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-27'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-28'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-29'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-15'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-6'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-30'/>
    <type-decl name='variadic parameter type' id='type-id-31'/>
    <type-decl name='void' id='type-id-32'/>
    <type-decl name='wchar_t' size-in-bits='32' id='type-id-33'/>
    <array-type-def dimensions='1' type-id='type-id-33' size-in-bits='128' id='type-id-34'>
      <subrange length='4' type-id='type-id-6' id='type-id-13'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-35' size-in-bits='64' id='type-id-36'>
      <subrange length='2' type-id='type-id-6' id='type-id-37'/>
    </array-type-def>
    <class-decl name='wxScopedCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='66' column='1' id='type-id-38'>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-4' filepath='include/wx/buffer.h' line='69' column='1' id='type-id-39'/>
      </member-type>
      <member-type access='protected'>
        <class-decl name='Data' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='164' column='1' id='type-id-40'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-41'/>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-42' visibility='default' filepath='include/wx/buffer.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxScopedCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='66' column='1' id='type-id-43'>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-33' filepath='include/wx/buffer.h' line='69' column='1' id='type-id-44'/>
      </member-type>
      <member-type access='protected'>
        <class-decl name='Data' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='164' column='1' id='type-id-45'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-41'/>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-46' visibility='default' filepath='include/wx/buffer.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxScopedCharBuffer' type-id='type-id-38' filepath='include/wx/buffer.h' line='241' column='1' id='type-id-47'/>
    <typedef-decl name='wxScopedWCharBuffer' type-id='type-id-43' filepath='include/wx/buffer.h' line='242' column='1' id='type-id-48'/>
    <class-decl name='wxCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='247' column='1' id='type-id-49'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-38'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-4' filepath='include/wx/buffer.h' line='253' column='1' id='type-id-50'/>
      </member-type>
    </class-decl>
    <class-decl name='wxCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='247' column='1' id='type-id-51'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-43'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-33' filepath='include/wx/buffer.h' line='253' column='1' id='type-id-52'/>
      </member-type>
    </class-decl>
    <class-decl name='wxCharBuffer' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='357' column='1' id='type-id-53'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-49'/>
      <member-type access='public'>
        <typedef-decl name='wxCharTypeBufferBase' type-id='type-id-49' filepath='include/wx/buffer.h' line='360' column='1' id='type-id-54'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='wxScopedCharTypeBufferBase' type-id='type-id-38' filepath='include/wx/buffer.h' line='361' column='1' id='type-id-55'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWCharBuffer' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='374' column='1' id='type-id-56'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-51'/>
      <member-type access='public'>
        <typedef-decl name='wxCharTypeBufferBase' type-id='type-id-51' filepath='include/wx/buffer.h' line='377' column='1' id='type-id-57'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='wxScopedCharTypeBufferBase' type-id='type-id-43' filepath='include/wx/buffer.h' line='378' column='1' id='type-id-58'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWritableCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='393' column='1' id='type-id-59'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-49'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-39' filepath='include/wx/buffer.h' line='396' column='1' id='type-id-60'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWritableCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='393' column='1' id='type-id-61'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-51'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-44' filepath='include/wx/buffer.h' line='396' column='1' id='type-id-62'/>
      </member-type>
    </class-decl>
    <typedef-decl name='wxWritableCharBuffer' type-id='type-id-59' filepath='include/wx/buffer.h' line='410' column='1' id='type-id-63'/>
    <typedef-decl name='wxWritableWCharBuffer' type-id='type-id-61' filepath='include/wx/buffer.h' line='411' column='1' id='type-id-64'/>
    <typedef-decl name='wxChar' type-id='type-id-33' filepath='include/wx/chartype.h' line='123' column='1' id='type-id-35'/>
    <typedef-decl name='wxStringCharType' type-id='type-id-33' filepath='include/wx/chartype.h' line='170' column='1' id='type-id-65'/>
    <class-decl name='wxObjectEventFunctor' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='258' column='1' id='type-id-66'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-67'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-68' visibility='default' filepath='include/wx/event.h' line='288' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxObjectEventFunctorclEP12wxEvtHandlerR7wxEvent' filepath='include/wx/event.h' line='4105' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-69' is-artificial='yes'/>
          <parameter type-id='type-id-68'/>
          <parameter type-id='type-id-70'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxObjectEventFunctor10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-71' is-artificial='yes'/>
          <parameter type-id='type-id-72'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxObjectEventFunctor13GetEvtHandlerEv' filepath='include/wx/event.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-71' is-artificial='yes'/>
          <return type-id='type-id-68'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxObjectEventFunctor12GetEvtMethodEv' filepath='include/wx/event.h' line='284' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-71' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='_wxHashTable_NodeBase' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='68' column='1' id='type-id-73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_next' type-id='type-id-74' visibility='default' filepath='include/wx/hashmap.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_wxHashTableBase2' size-in-bits='8' visibility='default' filepath='include/wx/hashmap.h' line='80' column='1' id='type-id-75'>
      <member-type access='public'>
        <typedef-decl name='NodeDtor' type-id='type-id-77' filepath='include/wx/hashmap.h' line='83' column='1' id='type-id-76'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='BucketFromNode' type-id='type-id-79' filepath='include/wx/hashmap.h' line='84' column='1' id='type-id-78'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='ProcessNode' type-id='type-id-81' filepath='include/wx/hashmap.h' line='85' column='1' id='type-id-80'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringHash' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='566' column='1' id='type-id-82'/>
    <class-decl name='wxStringEqual' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='589' column='1' id='type-id-83'/>
    <class-decl name='wxStringToStringHashMap' size-in-bits='256' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-84'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-85'/>
      <member-type access='public'>
        <class-decl name='Insert_Result' size-in-bits='192' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-86'>
          <member-type access='public'>
            <typedef-decl name='const_t1' type-id='type-id-88' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-87'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_t2' type-id='type-id-90' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-89'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t1' type-id='type-id-92' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-91'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t2' type-id='type-id-3' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-93'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='first' type-id='type-id-91' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='second' type-id='type-id-93' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='mapped_type' type-id='type-id-95' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-94'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringToStringHashMap_wxImplementation_HashTable' size-in-bits='256' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-85'>
      <base-class access='protected' layout-offset-in-bits='0' type-id='type-id-75'/>
      <member-type access='public'>
        <class-decl name='Iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-96'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-97' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_ht' type-id='type-id-98' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='Node' size-in-bits='832' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-99'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-73'/>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_value' type-id='type-id-100' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-101'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-96'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-92'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-96'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='Self' type-id='type-id-85' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-102'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_key_type' type-id='type-id-104' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-103'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_pointer' type-id='type-id-106' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-105'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-108' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-107'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='hasher' type-id='type-id-82' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-109'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_equal' type-id='type-id-83' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-110'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_extractor' type-id='type-id-112' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-111'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_type' type-id='type-id-95' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-113'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='pointer' type-id='type-id-115' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-114'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-117' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-116'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-119' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-118'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-120' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-100'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_table' type-id='type-id-121' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_tableBuckets' type-id='type-id-119' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_items' type-id='type-id-119' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_hasher' type-id='type-id-109' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='200'>
        <var-decl name='m_equals' type-id='type-id-110' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='208'>
        <var-decl name='m_getKey' type-id='type-id-111' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxStringToStringHashMap_wxImplementation_KeyEx' size-in-bits='8' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-112'>
      <member-type access='private'>
        <typedef-decl name='const_key_reference' type-id='type-id-123' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-122'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_key_type' type-id='type-id-125' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-124'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_reference' type-id='type-id-127' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-126'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_type' type-id='type-id-129' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-128'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='key_type' type-id='type-id-95' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-130'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='pair_type' type-id='type-id-120' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-131'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringToStringHashMap_wxImplementation_Pair' size-in-bits='768' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-120'>
      <member-type access='public'>
        <typedef-decl name='const_t1' type-id='type-id-104' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-132'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_t2' type-id='type-id-104' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-133'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t1' type-id='type-id-95' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-134'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t2' type-id='type-id-95' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-135'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='first' type-id='type-id-134' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='second' type-id='type-id-135' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxStringToNumHashMap' size-in-bits='256' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-136'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-137'/>
      <member-type access='public'>
        <class-decl name='Insert_Result' size-in-bits='192' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-138'>
          <member-type access='public'>
            <typedef-decl name='const_t1' type-id='type-id-140' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-139'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_t2' type-id='type-id-90' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-141'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t1' type-id='type-id-143' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-142'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t2' type-id='type-id-3' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-144'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='first' type-id='type-id-142' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='second' type-id='type-id-144' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='mapped_type' type-id='type-id-146' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-145'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringToNumHashMap_wxImplementation_HashTable' size-in-bits='256' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-137'>
      <base-class access='protected' layout-offset-in-bits='0' type-id='type-id-75'/>
      <member-type access='public'>
        <class-decl name='Iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-147'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-148' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_ht' type-id='type-id-149' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='Node' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-150'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-73'/>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_value' type-id='type-id-151' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-152'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-147'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-143'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-147'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='Self' type-id='type-id-137' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-153'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_key_type' type-id='type-id-104' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-154'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_pointer' type-id='type-id-156' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-155'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-158' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-157'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='hasher' type-id='type-id-82' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-159'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_equal' type-id='type-id-83' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-160'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_extractor' type-id='type-id-162' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-161'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_type' type-id='type-id-95' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-163'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='pointer' type-id='type-id-165' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-164'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-167' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-166'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-119' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-168'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-169' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-151'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_table' type-id='type-id-121' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_tableBuckets' type-id='type-id-119' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_items' type-id='type-id-119' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_hasher' type-id='type-id-159' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='200'>
        <var-decl name='m_equals' type-id='type-id-160' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='208'>
        <var-decl name='m_getKey' type-id='type-id-161' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxStringToNumHashMap_wxImplementation_KeyEx' size-in-bits='8' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-162'>
      <member-type access='private'>
        <typedef-decl name='const_key_reference' type-id='type-id-171' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-170'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_key_type' type-id='type-id-173' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-172'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_reference' type-id='type-id-175' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-174'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_type' type-id='type-id-177' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-176'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='key_type' type-id='type-id-95' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-178'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='pair_type' type-id='type-id-169' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-179'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringToNumHashMap_wxImplementation_Pair' size-in-bits='448' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-169'>
      <member-type access='public'>
        <typedef-decl name='const_t1' type-id='type-id-104' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-180'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_t2' type-id='type-id-182' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-181'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t1' type-id='type-id-95' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-183'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t2' type-id='type-id-146' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-184'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='first' type-id='type-id-183' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='second' type-id='type-id-184' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxLogLevel' type-id='type-id-6' filepath='include/wx/log.h' line='22' column='1' id='type-id-185'/>
    <class-decl name='wxLogRecordInfo' size-in-bits='512' visibility='default' filepath='include/wx/log.h' line='141' column='1' id='type-id-186'>
      <member-type access='private'>
        <class-decl name='ExtraData' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/wx/log.h' line='289' column='1' id='type-id-187'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='numValues' type-id='type-id-136' visibility='default' filepath='include/wx/log.h' line='291' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='strValues' type-id='type-id-84' visibility='default' filepath='include/wx/log.h' line='292' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='filename' type-id='type-id-188' visibility='default' filepath='include/wx/log.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='line' type-id='type-id-19' visibility='default' filepath='include/wx/log.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='func' type-id='type-id-188' visibility='default' filepath='include/wx/log.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='component' type-id='type-id-188' visibility='default' filepath='include/wx/log.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='timestampMS' type-id='type-id-24' visibility='default' filepath='include/wx/log.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='timestamp' type-id='type-id-189' visibility='default' filepath='include/wx/log.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='threadId' type-id='type-id-190' visibility='default' filepath='include/wx/log.h' line='224' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='m_data' type-id='type-id-191' visibility='default' filepath='include/wx/log.h' line='296' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxLogger' size-in-bits='960' visibility='default' filepath='include/wx/log.h' line='897' column='1' id='type-id-192'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_level' type-id='type-id-193' visibility='default' filepath='include/wx/log.h' line='1198' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_info' type-id='type-id-186' visibility='default' filepath='include/wx/log.h' line='1199' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='m_optKey' type-id='type-id-95' visibility='default' filepath='include/wx/log.h' line='1201' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxLongLong' type-id='type-id-194' filepath='include/wx/longlong.h' line='90' column='1' id='type-id-195'/>
    <class-decl name='wxLongLongNative' size-in-bits='64' visibility='default' filepath='include/wx/longlong.h' line='106' column='1' id='type-id-194'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_ll' type-id='type-id-24' visibility='default' filepath='include/wx/longlong.h' line='343' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxULongLongNative' size-in-bits='64' visibility='default' filepath='include/wx/longlong.h' line='347' column='1' id='type-id-196'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_ll' type-id='type-id-25' visibility='default' filepath='include/wx/longlong.h' line='562' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRefCounter' size-in-bits='128' visibility='default' filepath='include/wx/object.h' line='228' column='1' id='type-id-197'>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_count' type-id='type-id-19' visibility='default' filepath='include/wx/object.h' line='245' column='1'/>
      </data-member>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRefCounter' mangled-name='_ZN12wxRefCounterD4Ev' filepath='include/wx/object.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-198' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='wxObjectRefData' type-id='type-id-197' filepath='include/wx/object.h' line='258' column='1' id='type-id-199'/>
    <typedef-decl name='wxObjectConstructorFn' type-id='type-id-200' filepath='include/wx/rtti.h' line='39' column='1' id='type-id-201'/>
    <class-decl name='wxClassInfo' size-in-bits='384' visibility='default' filepath='include/wx/rtti.h' line='41' column='1' id='type-id-202'>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-203'>
          <member-type access='private'>
            <typedef-decl name='Node' type-id='type-id-205' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-204'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-203' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-206'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-208' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-207'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-209' visibility='default' filepath='include/wx/rtti.h' line='106' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_table' type-id='type-id-210' visibility='default' filepath='include/wx/rtti.h' line='106' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_className' type-id='type-id-211' visibility='default' filepath='include/wx/rtti.h' line='109' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_objectSize' type-id='type-id-19' visibility='default' filepath='include/wx/rtti.h' line='110' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_objectConstructor' type-id='type-id-201' visibility='default' filepath='include/wx/rtti.h' line='111' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_baseInfo1' type-id='type-id-208' visibility='default' filepath='include/wx/rtti.h' line='115' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_baseInfo2' type-id='type-id-208' visibility='default' filepath='include/wx/rtti.h' line='116' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='sm_first' type-id='type-id-212' mangled-name='_ZN11wxClassInfo8sm_firstE' visibility='default' filepath='include/wx/rtti.h' line='121' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='m_next' type-id='type-id-212' visibility='default' filepath='include/wx/rtti.h' line='122' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxScopedPtr&lt;wxMBConv&gt;' size-in-bits='64' visibility='default' filepath='include/wx/scopedptr.h' line='38' column='1' id='type-id-213'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_ptr' type-id='type-id-214' visibility='default' filepath='include/wx/scopedptr.h' line='97' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxCStrData' size-in-bits='192' visibility='default' filepath='include/wx/string.h' line='152' column='1' id='type-id-215'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_str' type-id='type-id-216' visibility='default' filepath='include/wx/string.h' line='245' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_offset' type-id='type-id-119' visibility='default' filepath='include/wx/string.h' line='252' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_owned' type-id='type-id-3' visibility='default' filepath='include/wx/string.h' line='254' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxString' size-in-bits='384' visibility='default' filepath='include/wx/string.h' line='301' column='1' id='type-id-95'>
      <member-type access='private'>
        <class-decl name='SubstrBufFromType&lt;wchar_t const*&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='337' column='1' id='type-id-217'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='data' type-id='type-id-218' visibility='default' filepath='include/wx/string.h' line='339' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='len' type-id='type-id-119' visibility='default' filepath='include/wx/string.h' line='340' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='SubstrBufFromType&lt;wxScopedCharTypeBuffer&lt;wchar_t&gt; &gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='337' column='1' id='type-id-219'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='data' type-id='type-id-43' visibility='default' filepath='include/wx/string.h' line='339' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='len' type-id='type-id-119' visibility='default' filepath='include/wx/string.h' line='340' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='SubstrBufFromWC' type-id='type-id-217' filepath='include/wx/string.h' line='354' column='1' id='type-id-220'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='SubstrBufFromMB' type-id='type-id-219' filepath='include/wx/string.h' line='355' column='1' id='type-id-221'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-119' filepath='include/wx/string.h' line='752' column='1' id='type-id-222'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-224' filepath='include/wx/string.h' line='753' column='1' id='type-id-223'/>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='963' column='1' id='type-id-225'>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-227' filepath='include/wx/string.h' line='965' column='1' id='type-id-226'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-229' filepath='include/wx/string.h' line='965' column='1' id='type-id-228'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='underlying_iterator' type-id='type-id-231' filepath='include/wx/string.h' line='965' column='1' id='type-id-230'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-230' visibility='default' filepath='include/wx/string.h' line='965' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='994' column='1' id='type-id-232'>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-227' filepath='include/wx/string.h' line='998' column='1' id='type-id-233'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-235' filepath='include/wx/string.h' line='998' column='1' id='type-id-234'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='underlying_iterator' type-id='type-id-237' filepath='include/wx/string.h' line='998' column='1' id='type-id-236'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-236' visibility='default' filepath='include/wx/string.h' line='998' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator_impl&lt;wxString::const_iterator&gt;' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='1060' column='1' id='type-id-238'>
          <member-type access='public'>
            <typedef-decl name='iterator_type' type-id='type-id-232' filepath='include/wx/string.h' line='1063' column='1' id='type-id-239'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-233' filepath='include/wx/string.h' line='1067' column='1' id='type-id-240'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-234' filepath='include/wx/string.h' line='1068' column='1' id='type-id-241'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-239' visibility='default' filepath='include/wx/string.h' line='1115' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator_impl&lt;wxString::iterator&gt;' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='1060' column='1' id='type-id-242'>
          <member-type access='public'>
            <typedef-decl name='iterator_type' type-id='type-id-225' filepath='include/wx/string.h' line='1063' column='1' id='type-id-243'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-226' filepath='include/wx/string.h' line='1067' column='1' id='type-id-244'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-228' filepath='include/wx/string.h' line='1068' column='1' id='type-id-245'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-243' visibility='default' filepath='include/wx/string.h' line='1115' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reverse_iterator' type-id='type-id-242' filepath='include/wx/string.h' line='1118' column='1' id='type-id-246'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reverse_iterator' type-id='type-id-238' filepath='include/wx/string.h' line='1119' column='1' id='type-id-247'/>
      </member-type>
      <member-type access='public'>
        <enum-decl name='caseCompare' filepath='include/wx/string.h' line='2386' column='1' id='type-id-248'>
          <underlying-type type-id='type-id-28'/>
          <enumerator name='exact' value='0'/>
          <enumerator name='ignoreCase' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='stripType' filepath='include/wx/string.h' line='2388' column='1' id='type-id-249'>
          <underlying-type type-id='type-id-28'/>
          <enumerator name='leading' value='1'/>
          <enumerator name='trailing' value='2'/>
          <enumerator name='both' value='3'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='ConvertedBuffer&lt;char&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='3599' column='1' id='type-id-250'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_str' type-id='type-id-251' visibility='default' filepath='include/wx/string.h' line='3625' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_len' type-id='type-id-119' visibility='default' filepath='include/wx/string.h' line='3626' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' static='yes'>
        <var-decl name='npos' type-id='type-id-252' mangled-name='_ZN8wxString4nposE' visibility='default' filepath='include/wx/string.h' line='308' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_impl' type-id='type-id-253' visibility='default' filepath='include/wx/string.h' line='3589' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_convertedToChar' type-id='type-id-250' visibility='default' filepath='include/wx/string.h' line='3677' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxStdWideString' type-id='type-id-254' filepath='include/wx/stringimpl.h' line='70' column='1' id='type-id-255'/>
    <typedef-decl name='wxStdString' type-id='type-id-255' filepath='include/wx/stringimpl.h' line='76' column='1' id='type-id-256'/>
    <typedef-decl name='wxStringImpl' type-id='type-id-256' filepath='include/wx/stringimpl.h' line='90' column='1' id='type-id-253'/>
    <class-decl name='wxStringOperationsWchar' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/stringops.h' line='27' column='1' id='type-id-257'>
      <member-type access='public'>
        <class-decl name='SingleCharBuffer' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/stringops.h' line='64' column='1' id='type-id-258'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='data' type-id='type-id-36' visibility='default' filepath='include/wx/stringops.h' line='66' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
    </class-decl>
    <class-decl name='wxFormatString' size-in-bits='320' visibility='default' filepath='include/wx/strvararg.h' line='137' column='1' id='type-id-259'>
      <member-type access='public'>
        <enum-decl name='ArgumentType' filepath='include/wx/strvararg.h' line='161' column='1' id='type-id-260'>
          <underlying-type type-id='type-id-28'/>
          <enumerator name='Arg_Unused' value='0'/>
          <enumerator name='Arg_Char' value='1'/>
          <enumerator name='Arg_Pointer' value='2'/>
          <enumerator name='Arg_String' value='6'/>
          <enumerator name='Arg_Int' value='9'/>
          <enumerator name='Arg_LongInt' value='16'/>
          <enumerator name='Arg_LongLongInt' value='16'/>
          <enumerator name='Arg_Double' value='64'/>
          <enumerator name='Arg_LongDouble' value='128'/>
          <enumerator name='Arg_Size_t' value='16'/>
          <enumerator name='Arg_IntPtr' value='512'/>
          <enumerator name='Arg_ShortIntPtr' value='1024'/>
          <enumerator name='Arg_LongIntPtr' value='2048'/>
          <enumerator name='Arg_Unknown' value='32768'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_convertedWChar' type-id='type-id-48' visibility='default' filepath='include/wx/strvararg.h' line='232' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_char' type-id='type-id-47' visibility='default' filepath='include/wx/strvararg.h' line='236' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_wchar' type-id='type-id-48' visibility='default' filepath='include/wx/strvararg.h' line='237' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_str' type-id='type-id-261' visibility='default' filepath='include/wx/strvararg.h' line='242' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_cstr' type-id='type-id-262' visibility='default' filepath='include/wx/strvararg.h' line='243' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxFormatStringArgument' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='250' column='1' id='type-id-263'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_str' type-id='type-id-264' visibility='default' filepath='include/wx/strvararg.h' line='253' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxFormatStringArgumentFinder&lt;const wxFormatString&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='277' column='1' id='type-id-265'/>
    <class-decl name='wxArgNormalizer&lt;int&gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='474' column='1' id='type-id-266'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_value' type-id='type-id-19' visibility='default' filepath='include/wx/strvararg.h' line='492' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArgNormalizerWchar&lt;int&gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='500' column='1' id='type-id-267'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-266'/>
    </class-decl>
    <class-decl name='wxArgNormalizerWchar&lt;const wxString&amp;&gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='553' column='1' id='type-id-268'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_value' type-id='type-id-269' visibility='default' filepath='include/wx/strvararg.h' line='565' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArgNormalizerWchar&lt;const wxCStrData&amp;&gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='570' column='1' id='type-id-270'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_value' type-id='type-id-271' visibility='default' filepath='include/wx/strvararg.h' line='582' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArgNormalizerWchar&lt;wxString&gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='755' column='1' id='type-id-272'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-268'/>
    </class-decl>
    <class-decl name='wxArgNormalizerWchar&lt;wxCStrData&gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='756' column='1' id='type-id-273'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-270'/>
    </class-decl>
    <enum-decl name='wxTextFileType' filepath='include/wx/textbuf.h' line='24' column='1' id='type-id-274'>
      <underlying-type type-id='type-id-28'/>
      <enumerator name='wxTextFileType_None' value='0'/>
      <enumerator name='wxTextFileType_Unix' value='1'/>
      <enumerator name='wxTextFileType_Dos' value='2'/>
      <enumerator name='wxTextFileType_Mac' value='3'/>
      <enumerator name='wxTextFileType_Os2' value='4'/>
    </enum-decl>
    <enum-decl name='wxMutexError' filepath='include/wx/thread.h' line='28' column='1' id='type-id-275'>
      <underlying-type type-id='type-id-28'/>
      <enumerator name='wxMUTEX_NO_ERROR' value='0'/>
      <enumerator name='wxMUTEX_INVALID' value='1'/>
      <enumerator name='wxMUTEX_DEAD_LOCK' value='2'/>
      <enumerator name='wxMUTEX_BUSY' value='3'/>
      <enumerator name='wxMUTEX_UNLOCKED' value='4'/>
      <enumerator name='wxMUTEX_TIMEOUT' value='5'/>
      <enumerator name='wxMUTEX_MISC_ERROR' value='6'/>
    </enum-decl>
    <enum-decl name='wxThreadError' filepath='include/wx/thread.h' line='57' column='1' id='type-id-276'>
      <underlying-type type-id='type-id-28'/>
      <enumerator name='wxTHREAD_NO_ERROR' value='0'/>
      <enumerator name='wxTHREAD_NO_RESOURCE' value='1'/>
      <enumerator name='wxTHREAD_RUNNING' value='2'/>
      <enumerator name='wxTHREAD_NOT_RUNNING' value='3'/>
      <enumerator name='wxTHREAD_KILLED' value='4'/>
      <enumerator name='wxTHREAD_MISC_ERROR' value='5'/>
    </enum-decl>
    <enum-decl name='wxThreadKind' filepath='include/wx/thread.h' line='67' column='1' id='type-id-277'>
      <underlying-type type-id='type-id-28'/>
      <enumerator name='wxTHREAD_DETACHED' value='0'/>
      <enumerator name='wxTHREAD_JOINABLE' value='1'/>
    </enum-decl>
    <enum-decl name='wxMutexType' filepath='include/wx/thread.h' line='112' column='1' id='type-id-278'>
      <underlying-type type-id='type-id-28'/>
      <enumerator name='wxMUTEX_DEFAULT' value='0'/>
      <enumerator name='wxMUTEX_RECURSIVE' value='1'/>
    </enum-decl>
    <class-decl name='wxMutex' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='137' column='1' id='type-id-279'>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_internal' type-id='type-id-280' visibility='default' filepath='include/wx/thread.h' line='174' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxCriticalSectionType' filepath='include/wx/thread.h' line='231' column='1' id='type-id-281'>
      <underlying-type type-id='type-id-28'/>
      <enumerator name='wxCRITSEC_DEFAULT' value='0'/>
      <enumerator name='wxCRITSEC_NON_RECURSIVE' value='1'/>
    </enum-decl>
    <class-decl name='wxCriticalSection' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='242' column='1' id='type-id-282'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_mutex' type-id='type-id-279' visibility='default' filepath='include/wx/thread.h' line='259' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='Leave' mangled-name='_ZN17wxCriticalSection5LeaveEv' filepath='include/wx/thread.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxCriticalSection5LeaveEv@@WXU_3.2'>
          <parameter type-id='type-id-283' name='this' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Enter' mangled-name='_ZN17wxCriticalSection5EnterEv' filepath='include/wx/thread.h' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxCriticalSection5EnterEv@@WXU_3.2'>
          <parameter type-id='type-id-283' name='this' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxCriticalSectionLocker' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='301' column='1' id='type-id-284'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_critsect' type-id='type-id-285' visibility='default' filepath='include/wx/thread.h' line='316' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxThreadIdType' type-id='type-id-6' filepath='include/wx/thread.h' line='448' column='1' id='type-id-190'/>
    <class-decl name='wxThreadHelperThread' size-in-bits='320' visibility='default' filepath='include/wx/thread.h' line='658' column='1' id='type-id-286'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-287'/>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_owner' type-id='type-id-288' visibility='default' filepath='include/wx/thread.h' line='673' column='1'/>
      </data-member>
      <member-function access='protected' vtable-offset='3'>
        <function-decl name='Entry' mangled-name='_ZN20wxThreadHelperThread5EntryEv' filepath='include/wx/thread.h' line='761' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-289' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxThreadHelper' size-in-bits='256' visibility='default' filepath='include/wx/thread.h' line='686' column='1' id='type-id-290'>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_thread' type-id='type-id-291' visibility='default' filepath='include/wx/thread.h' line='748' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_kind' type-id='type-id-277' visibility='default' filepath='include/wx/thread.h' line='749' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_critSection' type-id='type-id-282' visibility='default' filepath='include/wx/thread.h' line='750' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThreadHelper' mangled-name='_ZN14wxThreadHelperD4Ev' filepath='include/wx/thread.h' line='714' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-292' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='Entry' mangled-name='_ZN14wxThreadHelper5EntryEv' filepath='include/wx/thread.h' line='735' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-292' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxTypeIdentifier' size-in-bits='64' visibility='default' filepath='include/wx/typeinfo.h' line='63' column='1' id='type-id-293'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_className' type-id='type-id-188' visibility='default' filepath='include/wx/typeinfo.h' line='81' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxUint16' type-id='type-id-30' filepath='include/wx/types.h' line='57' column='1' id='type-id-294'/>
    <typedef-decl name='wxInt32' type-id='type-id-19' filepath='include/wx/types.h' line='145' column='1' id='type-id-295'/>
    <typedef-decl name='wxUint32' type-id='type-id-15' filepath='include/wx/types.h' line='146' column='1' id='type-id-296'/>
    <typedef-decl name='wxUIntPtr' type-id='type-id-6' filepath='include/wx/types.h' line='365' column='1' id='type-id-146'/>
    <class-decl name='wxUniChar' size-in-bits='32' visibility='default' filepath='include/wx/unichar.h' line='29' column='1' id='type-id-235'>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-296' filepath='include/wx/unichar.h' line='35' column='1' id='type-id-297'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_value' type-id='type-id-297' visibility='default' filepath='include/wx/unichar.h' line='212' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxUniChar' mangled-name='_ZN9wxUniCharC2ERK12wxUniCharRef' filepath='include/wx/unichar.h' line='328' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxUniCharC2ERK12wxUniCharRef@@WXU_3.2'>
          <parameter type-id='type-id-298' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-299' name='c' filepath='include/wx/unichar.h' line='328' column='1'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxUniCharRef' size-in-bits='64' visibility='default' filepath='include/wx/unichar.h' line='220' column='1' id='type-id-229'>
      <member-type access='private'>
        <typedef-decl name='iterator' type-id='type-id-231' filepath='include/wx/unichar.h' line='223' column='1' id='type-id-300'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_pos' type-id='type-id-300' visibility='default' filepath='include/wx/unichar.h' line='325' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVersionInfo' size-in-bits='1280' visibility='default' filepath='include/wx/versioninfo.h' line='19' column='1' id='type-id-301'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_name' type-id='type-id-95' visibility='default' filepath='include/wx/versioninfo.h' line='93' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_description' type-id='type-id-95' visibility='default' filepath='include/wx/versioninfo.h' line='94' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='m_copyright' type-id='type-id-95' visibility='default' filepath='include/wx/versioninfo.h' line='95' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1152'>
        <var-decl name='m_major' type-id='type-id-19' visibility='default' filepath='include/wx/versioninfo.h' line='97' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1184'>
        <var-decl name='m_minor' type-id='type-id-19' visibility='default' filepath='include/wx/versioninfo.h' line='98' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1216'>
        <var-decl name='m_micro' type-id='type-id-19' visibility='default' filepath='include/wx/versioninfo.h' line='99' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1248'>
        <var-decl name='m_revision' type-id='type-id-19' visibility='default' filepath='include/wx/versioninfo.h' line='100' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxXmlNodeType' filepath='include/wx/xml/xml.h' line='40' column='1' id='type-id-302'>
      <underlying-type type-id='type-id-28'/>
      <enumerator name='wxXML_ELEMENT_NODE' value='1'/>
      <enumerator name='wxXML_ATTRIBUTE_NODE' value='2'/>
      <enumerator name='wxXML_TEXT_NODE' value='3'/>
      <enumerator name='wxXML_CDATA_SECTION_NODE' value='4'/>
      <enumerator name='wxXML_ENTITY_REF_NODE' value='5'/>
      <enumerator name='wxXML_ENTITY_NODE' value='6'/>
      <enumerator name='wxXML_PI_NODE' value='7'/>
      <enumerator name='wxXML_COMMENT_NODE' value='8'/>
      <enumerator name='wxXML_DOCUMENT_NODE' value='9'/>
      <enumerator name='wxXML_DOCUMENT_TYPE_NODE' value='10'/>
      <enumerator name='wxXML_DOCUMENT_FRAG_NODE' value='11'/>
      <enumerator name='wxXML_NOTATION_NODE' value='12'/>
      <enumerator name='wxXML_HTML_DOCUMENT_NODE' value='13'/>
    </enum-decl>
    <class-decl name='wxXmlAttribute' size-in-bits='896' visibility='default' filepath='include/wx/xml/xml.h' line='63' column='1' id='type-id-303'>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_name' type-id='type-id-95' visibility='default' filepath='include/wx/xml/xml.h' line='81' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='m_value' type-id='type-id-95' visibility='default' filepath='include/wx/xml/xml.h' line='82' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='832'>
        <var-decl name='m_next' type-id='type-id-304' visibility='default' filepath='include/wx/xml/xml.h' line='83' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxXmlAttribute' mangled-name='_ZN14wxXmlAttributeD0Ev' filepath='include/wx/xml/xml.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-304' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxXmlAttribute' mangled-name='_ZN14wxXmlAttributeD2Ev' filepath='include/wx/xml/xml.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-304' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxXmlAttribute' mangled-name='_ZN14wxXmlAttributeD4Ev' filepath='include/wx/xml/xml.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-304' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxXmlNode' size-in-bits='1216' visibility='default' filepath='include/wx/xml/xml.h' line='102' column='1' id='type-id-305'>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_type' type-id='type-id-302' visibility='default' filepath='include/wx/xml/xml.h' line='211' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_name' type-id='type-id-95' visibility='default' filepath='include/wx/xml/xml.h' line='212' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='512'>
        <var-decl name='m_content' type-id='type-id-95' visibility='default' filepath='include/wx/xml/xml.h' line='213' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='896'>
        <var-decl name='m_attrs' type-id='type-id-304' visibility='default' filepath='include/wx/xml/xml.h' line='214' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='960'>
        <var-decl name='m_parent' type-id='type-id-306' visibility='default' filepath='include/wx/xml/xml.h' line='215' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1024'>
        <var-decl name='m_children' type-id='type-id-306' visibility='default' filepath='include/wx/xml/xml.h' line='215' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1088'>
        <var-decl name='m_next' type-id='type-id-306' visibility='default' filepath='include/wx/xml/xml.h' line='215' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1152'>
        <var-decl name='m_lineNo' type-id='type-id-19' visibility='default' filepath='include/wx/xml/xml.h' line='216' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1184'>
        <var-decl name='m_noConversion' type-id='type-id-3' visibility='default' filepath='include/wx/xml/xml.h' line='217' column='1'/>
      </data-member>
      <member-function access='public' const='yes'>
        <function-decl name='IsWhitespaceOnly' mangled-name='_ZNK9wxXmlNode16IsWhitespaceOnlyEv' filepath='src/xml/xml.cpp' line='395' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9wxXmlNode16IsWhitespaceOnlyEv@@WXU_3.2'>
          <parameter type-id='type-id-307' name='this' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetDepth' mangled-name='_ZNK9wxXmlNode8GetDepthEPS_' filepath='src/xml/xml.cpp' line='378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9wxXmlNode8GetDepthEPS_@@WXU_3.2'>
          <parameter type-id='type-id-307' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-306' name='grandparent' filepath='src/xml/xml.cpp' line='378' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetNodeContent' mangled-name='_ZNK9wxXmlNode14GetNodeContentEv' filepath='src/xml/xml.cpp' line='364' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9wxXmlNode14GetNodeContentEv@@WXU_3.2'>
          <parameter type-id='type-id-307' name='this' is-artificial='yes'/>
          <return type-id='type-id-95'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='DeleteProperty' mangled-name='_ZN9wxXmlNode14DeletePropertyERK8wxString' filepath='src/xml/xml.cpp' line='329' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxXmlNode14DeletePropertyERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-308' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-269' name='name' filepath='src/xml/xml.cpp' line='329' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='AddProperty' mangled-name='_ZN9wxXmlNode11AddPropertyEP14wxXmlAttribute' filepath='src/xml/xml.cpp' line='317' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxXmlNode11AddPropertyEP14wxXmlAttribute@@WXU_3.2'>
          <parameter type-id='type-id-308' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-304' name='attr' filepath='src/xml/xml.cpp' line='317' column='1'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='AddProperty' mangled-name='_ZN9wxXmlNode11AddPropertyERK8wxStringS2_' filepath='src/xml/xml.cpp' line='312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxXmlNode11AddPropertyERK8wxStringS2_@@WXU_3.2'>
          <parameter type-id='type-id-308' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-269' name='name' filepath='src/xml/xml.cpp' line='312' column='1'/>
          <parameter type-id='type-id-269' name='value' filepath='src/xml/xml.cpp' line='312' column='1'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetAttribute' mangled-name='_ZNK9wxXmlNode12GetAttributeERK8wxStringS2_' filepath='src/xml/xml.cpp' line='179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9wxXmlNode12GetAttributeERK8wxStringS2_@@WXU_3.2'>
          <parameter type-id='type-id-307' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-269' name='attrName' filepath='src/xml/xml.cpp' line='179' column='1'/>
          <parameter type-id='type-id-269' name='defaultVal' filepath='src/xml/xml.cpp' line='179' column='1'/>
          <return type-id='type-id-95'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetAttribute' mangled-name='_ZNK9wxXmlNode12GetAttributeERK8wxStringPS0_' filepath='src/xml/xml.cpp' line='160' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9wxXmlNode12GetAttributeERK8wxStringPS0_@@WXU_3.2'>
          <parameter type-id='type-id-307' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-269' name='attrName' filepath='src/xml/xml.cpp' line='160' column='1'/>
          <parameter type-id='type-id-309' name='value' filepath='src/xml/xml.cpp' line='160' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='HasAttribute' mangled-name='_ZNK9wxXmlNode12HasAttributeERK8wxString' filepath='src/xml/xml.cpp' line='147' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9wxXmlNode12HasAttributeERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-307' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-269' name='attrName' filepath='src/xml/xml.cpp' line='147' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='DoCopy' mangled-name='_ZN9wxXmlNode6DoCopyERKS_' filepath='src/xml/xml.cpp' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxXmlNode6DoCopyERKS_@@WXU_3.2'>
          <parameter type-id='type-id-308' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-310' name='node' filepath='src/xml/xml.cpp' line='122' column='1'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='DoFree' mangled-name='_ZN9wxXmlNode6DoFreeEv' filepath='src/xml/xml.cpp' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxXmlNode6DoFreeEv@@WXU_3.2'>
          <parameter type-id='type-id-308' name='this' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='operator=' mangled-name='_ZN9wxXmlNodeaSERKS_' filepath='src/xml/xml.cpp' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxXmlNodeaSERKS_@@WXU_3.2'>
          <parameter type-id='type-id-308' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-310' name='node' filepath='src/xml/xml.cpp' line='94' column='1'/>
          <return type-id='type-id-311'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxXmlNode' mangled-name='_ZN9wxXmlNodeC2ERKS_' filepath='src/xml/xml.cpp' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxXmlNodeC2ERKS_@@WXU_3.2'>
          <parameter type-id='type-id-308' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-310' name='node' filepath='src/xml/xml.cpp' line='122' column='1'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxXmlNode' mangled-name='_ZN9wxXmlNodeC2E13wxXmlNodeTypeRK8wxStringS3_i' filepath='src/xml/xml.cpp' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxXmlNodeC2E13wxXmlNodeTypeRK8wxStringS3_i@@WXU_3.2'>
          <parameter type-id='type-id-308' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-302' name='type' filepath='src/xml/xml.cpp' line='71' column='1'/>
          <parameter type-id='type-id-269' name='name' filepath='src/xml/xml.cpp' line='71' column='1'/>
          <parameter type-id='type-id-269' name='content' filepath='src/xml/xml.cpp' line='72' column='1'/>
          <parameter type-id='type-id-19' name='lineNo' filepath='src/xml/xml.cpp' line='73' column='1'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxXmlNode' mangled-name='_ZN9wxXmlNodeC2EPS_13wxXmlNodeTypeRK8wxStringS4_P14wxXmlAttributeS0_i' filepath='src/xml/xml.cpp' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxXmlNodeC2EPS_13wxXmlNodeTypeRK8wxStringS4_P14wxXmlAttributeS0_i@@WXU_3.2'>
          <parameter type-id='type-id-308' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-306' name='parent' filepath='src/xml/xml.cpp' line='48' column='1'/>
          <parameter type-id='type-id-302' name='type' filepath='src/xml/xml.cpp' line='48' column='1'/>
          <parameter type-id='type-id-269' name='name' filepath='src/xml/xml.cpp' line='49' column='1'/>
          <parameter type-id='type-id-269' name='content' filepath='src/xml/xml.cpp' line='49' column='1'/>
          <parameter type-id='type-id-304' name='attrs' filepath='src/xml/xml.cpp' line='50' column='1'/>
          <parameter type-id='type-id-306' name='next' filepath='src/xml/xml.cpp' line='50' column='1'/>
          <parameter type-id='type-id-19' name='lineNo' filepath='src/xml/xml.cpp' line='50' column='1'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxXmlNode' mangled-name='_ZN9wxXmlNodeD4Ev' filepath='src/xml/xml.cpp' line='89' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-306' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxXmlNode' mangled-name='_ZN9wxXmlNodeD0Ev' filepath='src/xml/xml.cpp' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxXmlNodeD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-306' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxXmlNode' mangled-name='_ZN9wxXmlNodeD2Ev' filepath='src/xml/xml.cpp' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxXmlNodeD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-306' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='AddChild' mangled-name='_ZN9wxXmlNode8AddChildEPS_' filepath='src/xml/xml.cpp' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxXmlNode8AddChildEPS_@@WXU_3.2'>
          <parameter type-id='type-id-306' is-artificial='yes'/>
          <parameter type-id='type-id-306'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <function-decl name='InsertChild' mangled-name='_ZN9wxXmlNode11InsertChildEPS_S0_' filepath='src/xml/xml.cpp' line='203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxXmlNode11InsertChildEPS_S0_@@WXU_3.2'>
          <parameter type-id='type-id-306' is-artificial='yes'/>
          <parameter type-id='type-id-306'/>
          <parameter type-id='type-id-306'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='4'>
        <function-decl name='InsertChildAfter' mangled-name='_ZN9wxXmlNode16InsertChildAfterEPS_S0_' filepath='src/xml/xml.cpp' line='242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxXmlNode16InsertChildAfterEPS_S0_@@WXU_3.2'>
          <parameter type-id='type-id-306' is-artificial='yes'/>
          <parameter type-id='type-id-306'/>
          <parameter type-id='type-id-306'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='RemoveChild' mangled-name='_ZN9wxXmlNode11RemoveChildEPS_' filepath='src/xml/xml.cpp' line='268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxXmlNode11RemoveChildEPS_@@WXU_3.2'>
          <parameter type-id='type-id-306' is-artificial='yes'/>
          <parameter type-id='type-id-306'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='AddAttribute' mangled-name='_ZN9wxXmlNode12AddAttributeERK8wxStringS2_' filepath='src/xml/xml.cpp' line='297' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxXmlNode12AddAttributeERK8wxStringS2_@@WXU_3.2'>
          <parameter type-id='type-id-306' is-artificial='yes'/>
          <parameter type-id='type-id-269'/>
          <parameter type-id='type-id-269'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='DeleteAttribute' mangled-name='_ZN9wxXmlNode15DeleteAttributeERK8wxString' filepath='src/xml/xml.cpp' line='307' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxXmlNode15DeleteAttributeERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-306' is-artificial='yes'/>
          <parameter type-id='type-id-269'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='AddAttribute' mangled-name='_ZN9wxXmlNode12AddAttributeEP14wxXmlAttribute' filepath='src/xml/xml.cpp' line='302' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxXmlNode12AddAttributeEP14wxXmlAttribute@@WXU_3.2'>
          <parameter type-id='type-id-306' is-artificial='yes'/>
          <parameter type-id='type-id-304'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxXmlDoctype' size-in-bits='1152' visibility='default' filepath='include/wx/xml/xml.h' line='240' column='1' id='type-id-312'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_rootName' type-id='type-id-95' visibility='default' filepath='include/wx/xml/xml.h' line='264' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_systemId' type-id='type-id-95' visibility='default' filepath='include/wx/xml/xml.h' line='265' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='m_publicId' type-id='type-id-95' visibility='default' filepath='include/wx/xml/xml.h' line='266' column='1'/>
      </data-member>
      <member-function access='public' const='yes'>
        <function-decl name='IsValid' mangled-name='_ZNK12wxXmlDoctype7IsValidEv' filepath='src/xml/xml.cpp' line='447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxXmlDoctype7IsValidEv@@WXU_3.2'>
          <parameter type-id='type-id-313' name='this' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetFullString' mangled-name='_ZNK12wxXmlDoctype13GetFullStringEv' filepath='src/xml/xml.cpp' line='413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxXmlDoctype13GetFullStringEv@@WXU_3.2'>
          <parameter type-id='type-id-313' name='this' is-artificial='yes'/>
          <return type-id='type-id-95'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Clear' mangled-name='_ZN12wxXmlDoctype5ClearEv' filepath='src/xml/xml.cpp' line='406' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxXmlDoctype5ClearEv@@WXU_3.2'>
          <parameter type-id='type-id-314' name='this' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxXmlDocument' size-in-bits='2560' visibility='default' filepath='include/wx/xml/xml.h' line='284' column='1' id='type-id-315'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-316'/>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_version' type-id='type-id-95' visibility='default' filepath='include/wx/xml/xml.h' line='349' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='512'>
        <var-decl name='m_fileEncoding' type-id='type-id-95' visibility='default' filepath='include/wx/xml/xml.h' line='350' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='896'>
        <var-decl name='m_doctype' type-id='type-id-312' visibility='default' filepath='include/wx/xml/xml.h' line='354' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2048'>
        <var-decl name='m_docNode' type-id='type-id-306' visibility='default' filepath='include/wx/xml/xml.h' line='355' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2112'>
        <var-decl name='m_fileType' type-id='type-id-274' visibility='default' filepath='include/wx/xml/xml.h' line='356' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2176'>
        <var-decl name='m_eol' type-id='type-id-95' visibility='default' filepath='include/wx/xml/xml.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-202' mangled-name='_ZN13wxXmlDocument12ms_classInfoE' visibility='default' filepath='src/xml/xml.cpp' line='37' column='1' elf-symbol-id='_ZN13wxXmlDocument12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <member-function access='public' static='yes'>
        <function-decl name='GetLibraryVersionInfo' mangled-name='_ZN13wxXmlDocument21GetLibraryVersionInfoEv' filepath='src/xml/xml.cpp' line='1245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxXmlDocument21GetLibraryVersionInfoEv@@WXU_3.2'>
          <return type-id='type-id-301'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='AppendToProlog' mangled-name='_ZN13wxXmlDocument14AppendToPrologEP9wxXmlNode' filepath='src/xml/xml.cpp' line='616' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxXmlDocument14AppendToPrologEP9wxXmlNode@@WXU_3.2'>
          <parameter type-id='type-id-317' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-306' name='node' filepath='src/xml/xml.cpp' line='616' column='1'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetFileType' mangled-name='_ZN13wxXmlDocument11SetFileTypeE14wxTextFileType' filepath='src/xml/xml.cpp' line='610' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxXmlDocument11SetFileTypeE14wxTextFileType@@WXU_3.2'>
          <parameter type-id='type-id-317' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-274' name='fileType' filepath='src/xml/xml.cpp' line='610' column='1'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetRoot' mangled-name='_ZN13wxXmlDocument7SetRootEP9wxXmlNode' filepath='src/xml/xml.cpp' line='573' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxXmlDocument7SetRootEP9wxXmlNode@@WXU_3.2'>
          <parameter type-id='type-id-317' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-306' name='node' filepath='src/xml/xml.cpp' line='616' column='1'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='DetachRoot' mangled-name='_ZN13wxXmlDocument10DetachRootEv' filepath='src/xml/xml.cpp' line='546' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxXmlDocument10DetachRootEv@@WXU_3.2'>
          <parameter type-id='type-id-317' name='this' is-artificial='yes'/>
          <return type-id='type-id-306'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetRoot' mangled-name='_ZNK13wxXmlDocument7GetRootEv' filepath='src/xml/xml.cpp' line='534' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxXmlDocument7GetRootEv@@WXU_3.2'>
          <parameter type-id='type-id-318' name='this' is-artificial='yes'/>
          <return type-id='type-id-306'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='DoCopy' mangled-name='_ZN13wxXmlDocument6DoCopyERKS_' filepath='src/xml/xml.cpp' line='501' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxXmlDocument6DoCopyERKS_@@WXU_3.2'>
          <parameter type-id='type-id-317' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-319' name='doc' filepath='src/xml/xml.cpp' line='501' column='1'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='operator=' mangled-name='_ZN13wxXmlDocumentaSERKS_' filepath='src/xml/xml.cpp' line='494' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxXmlDocumentaSERKS_@@WXU_3.2'>
          <parameter type-id='type-id-317' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-319' name='doc' filepath='src/xml/xml.cpp' line='494' column='1'/>
          <return type-id='type-id-320'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxXmlDocument' mangled-name='_ZN13wxXmlDocumentC2ERKS_' filepath='src/xml/xml.cpp' line='488' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxXmlDocumentC2ERKS_@@WXU_3.2'>
          <parameter type-id='type-id-317' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-319' name='doc' filepath='src/xml/xml.cpp' line='501' column='1'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxXmlDocument' mangled-name='_ZN13wxXmlDocumentC2ER13wxInputStreamRK8wxString' filepath='src/xml/xml.cpp' line='477' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxXmlDocumentC2ER13wxInputStreamRK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-317' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-321' name='stream' filepath='src/xml/xml.cpp' line='477' column='1'/>
          <parameter type-id='type-id-269' name='encoding' filepath='src/xml/xml.cpp' line='477' column='1'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxXmlDocument' mangled-name='_ZN13wxXmlDocumentC2ERK8wxStringS2_' filepath='src/xml/xml.cpp' line='466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxXmlDocumentC2ERK8wxStringS2_@@WXU_3.2'>
          <parameter type-id='type-id-317' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-269' name='filename' filepath='src/xml/xml.cpp' line='466' column='1'/>
          <parameter type-id='type-id-269' name='encoding' filepath='src/xml/xml.cpp' line='466' column='1'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxXmlDocument' mangled-name='_ZN13wxXmlDocumentC2Ev' filepath='src/xml/xml.cpp' line='456' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxXmlDocumentC2Ev@@WXU_3.2'>
          <parameter type-id='type-id-317' name='this' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxXmlDocument' mangled-name='_ZN13wxXmlDocumentD0Ev' filepath='include/wx/xml/xml.h' line='292' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-322' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxXmlDocument' mangled-name='_ZN13wxXmlDocumentD2Ev' filepath='include/wx/xml/xml.h' line='292' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-322' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxXmlDocument' mangled-name='_ZN13wxXmlDocumentD4Ev' filepath='include/wx/xml/xml.h' line='292' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-322' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK13wxXmlDocument12GetClassInfoEv' filepath='src/xml/xml.cpp' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxXmlDocument12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-323' is-artificial='yes'/>
          <return type-id='type-id-212'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='Load' mangled-name='_ZN13wxXmlDocument4LoadERK8wxStringS2_i' filepath='src/xml/xml.cpp' line='518' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxXmlDocument4LoadERK8wxStringS2_i@@WXU_3.2'>
          <parameter type-id='type-id-322' is-artificial='yes'/>
          <parameter type-id='type-id-269'/>
          <parameter type-id='type-id-269'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='Load' mangled-name='_ZN13wxXmlDocument4LoadER13wxInputStreamRK8wxStringi' filepath='src/xml/xml.cpp' line='880' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxXmlDocument4LoadER13wxInputStreamRK8wxStringi@@WXU_3.2'>
          <parameter type-id='type-id-322' is-artificial='yes'/>
          <parameter type-id='type-id-321'/>
          <parameter type-id='type-id-269'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='7'>
        <function-decl name='Save' mangled-name='_ZNK13wxXmlDocument4SaveERK8wxStringi' filepath='src/xml/xml.cpp' line='526' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxXmlDocument4SaveERK8wxStringi@@WXU_3.2'>
          <parameter type-id='type-id-323' is-artificial='yes'/>
          <parameter type-id='type-id-269'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='8'>
        <function-decl name='Save' mangled-name='_ZNK13wxXmlDocument4SaveER14wxOutputStreami' filepath='src/xml/xml.cpp' line='1196' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxXmlDocument4SaveER14wxOutputStreami@@WXU_3.2'>
          <parameter type-id='type-id-323' is-artificial='yes'/>
          <parameter type-id='type-id-324'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxBuildOptionsChecker' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/xml/xml.cpp' line='34' column='1' id='type-id-325'/>
    <class-decl name='wxXmlParsingContext' size-in-bits='1216' is-struct='yes' visibility='default' filepath='src/xml/xml.cpp' line='665' column='1' id='type-id-326'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parser' type-id='type-id-327' visibility='default' filepath='src/xml/xml.cpp' line='676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='conv' type-id='type-id-214' visibility='default' filepath='src/xml/xml.cpp' line='677' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='node' type-id='type-id-306' visibility='default' filepath='src/xml/xml.cpp' line='678' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='lastChild' type-id='type-id-306' visibility='default' filepath='src/xml/xml.cpp' line='679' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lastAsText' type-id='type-id-306' visibility='default' filepath='src/xml/xml.cpp' line='680' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='encoding' type-id='type-id-95' visibility='default' filepath='src/xml/xml.cpp' line='681' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='version' type-id='type-id-95' visibility='default' filepath='src/xml/xml.cpp' line='682' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='doctype' type-id='type-id-328' visibility='default' filepath='src/xml/xml.cpp' line='683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='removeWhiteOnlyNodes' type-id='type-id-3' visibility='default' filepath='src/xml/xml.cpp' line='684' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='XML_Parser' type-id='type-id-329' filepath='/usr/include/expat.h' line='52' column='1' id='type-id-327'/>
    <enum-decl name='XML_Status' filepath='/usr/include/expat.h' line='71' column='1' id='type-id-330'>
      <underlying-type type-id='type-id-28'/>
      <enumerator name='XML_STATUS_ERROR' value='0'/>
      <enumerator name='XML_STATUS_OK' value='1'/>
      <enumerator name='XML_STATUS_SUSPENDED' value='2'/>
    </enum-decl>
    <enum-decl name='XML_Error' filepath='/usr/include/expat.h' line='80' column='1' id='type-id-331'>
      <underlying-type type-id='type-id-28'/>
      <enumerator name='XML_ERROR_NONE' value='0'/>
      <enumerator name='XML_ERROR_NO_MEMORY' value='1'/>
      <enumerator name='XML_ERROR_SYNTAX' value='2'/>
      <enumerator name='XML_ERROR_NO_ELEMENTS' value='3'/>
      <enumerator name='XML_ERROR_INVALID_TOKEN' value='4'/>
      <enumerator name='XML_ERROR_UNCLOSED_TOKEN' value='5'/>
      <enumerator name='XML_ERROR_PARTIAL_CHAR' value='6'/>
      <enumerator name='XML_ERROR_TAG_MISMATCH' value='7'/>
      <enumerator name='XML_ERROR_DUPLICATE_ATTRIBUTE' value='8'/>
      <enumerator name='XML_ERROR_JUNK_AFTER_DOC_ELEMENT' value='9'/>
      <enumerator name='XML_ERROR_PARAM_ENTITY_REF' value='10'/>
      <enumerator name='XML_ERROR_UNDEFINED_ENTITY' value='11'/>
      <enumerator name='XML_ERROR_RECURSIVE_ENTITY_REF' value='12'/>
      <enumerator name='XML_ERROR_ASYNC_ENTITY' value='13'/>
      <enumerator name='XML_ERROR_BAD_CHAR_REF' value='14'/>
      <enumerator name='XML_ERROR_BINARY_ENTITY_REF' value='15'/>
      <enumerator name='XML_ERROR_ATTRIBUTE_EXTERNAL_ENTITY_REF' value='16'/>
      <enumerator name='XML_ERROR_MISPLACED_XML_PI' value='17'/>
      <enumerator name='XML_ERROR_UNKNOWN_ENCODING' value='18'/>
      <enumerator name='XML_ERROR_INCORRECT_ENCODING' value='19'/>
      <enumerator name='XML_ERROR_UNCLOSED_CDATA_SECTION' value='20'/>
      <enumerator name='XML_ERROR_EXTERNAL_ENTITY_HANDLING' value='21'/>
      <enumerator name='XML_ERROR_NOT_STANDALONE' value='22'/>
      <enumerator name='XML_ERROR_UNEXPECTED_STATE' value='23'/>
      <enumerator name='XML_ERROR_ENTITY_DECLARED_IN_PE' value='24'/>
      <enumerator name='XML_ERROR_FEATURE_REQUIRES_XML_DTD' value='25'/>
      <enumerator name='XML_ERROR_CANT_CHANGE_FEATURE_ONCE_PARSING' value='26'/>
      <enumerator name='XML_ERROR_UNBOUND_PREFIX' value='27'/>
      <enumerator name='XML_ERROR_UNDECLARING_PREFIX' value='28'/>
      <enumerator name='XML_ERROR_INCOMPLETE_PE' value='29'/>
      <enumerator name='XML_ERROR_XML_DECL' value='30'/>
      <enumerator name='XML_ERROR_TEXT_DECL' value='31'/>
      <enumerator name='XML_ERROR_PUBLICID' value='32'/>
      <enumerator name='XML_ERROR_SUSPENDED' value='33'/>
      <enumerator name='XML_ERROR_NOT_SUSPENDED' value='34'/>
      <enumerator name='XML_ERROR_ABORTED' value='35'/>
      <enumerator name='XML_ERROR_FINISHED' value='36'/>
      <enumerator name='XML_ERROR_SUSPEND_PE' value='37'/>
      <enumerator name='XML_ERROR_RESERVED_PREFIX_XML' value='38'/>
      <enumerator name='XML_ERROR_RESERVED_PREFIX_XMLNS' value='39'/>
      <enumerator name='XML_ERROR_RESERVED_NAMESPACE_URI' value='40'/>
      <enumerator name='XML_ERROR_INVALID_ARGUMENT' value='41'/>
      <enumerator name='XML_ERROR_NO_BUFFER' value='42'/>
      <enumerator name='XML_ERROR_AMPLIFICATION_LIMIT_BREACH' value='43'/>
    </enum-decl>
    <typedef-decl name='XML_StartElementHandler' type-id='type-id-332' filepath='/usr/include/expat.h' line='287' column='1' id='type-id-333'/>
    <typedef-decl name='XML_EndElementHandler' type-id='type-id-334' filepath='/usr/include/expat.h' line='291' column='1' id='type-id-335'/>
    <typedef-decl name='XML_CharacterDataHandler' type-id='type-id-336' filepath='/usr/include/expat.h' line='295' column='1' id='type-id-337'/>
    <typedef-decl name='XML_ProcessingInstructionHandler' type-id='type-id-338' filepath='/usr/include/expat.h' line='299' column='1' id='type-id-339'/>
    <typedef-decl name='XML_CommentHandler' type-id='type-id-334' filepath='/usr/include/expat.h' line='304' column='1' id='type-id-340'/>
    <typedef-decl name='XML_StartCdataSectionHandler' type-id='type-id-341' filepath='/usr/include/expat.h' line='306' column='1' id='type-id-342'/>
    <typedef-decl name='XML_EndCdataSectionHandler' type-id='type-id-341' filepath='/usr/include/expat.h' line='307' column='1' id='type-id-343'/>
    <typedef-decl name='XML_DefaultHandler' type-id='type-id-336' filepath='/usr/include/expat.h' line='322' column='1' id='type-id-344'/>
    <typedef-decl name='XML_StartDoctypeDeclHandler' type-id='type-id-345' filepath='/usr/include/expat.h' line='328' column='1' id='type-id-346'/>
    <typedef-decl name='XML_EndDoctypeDeclHandler' type-id='type-id-341' filepath='/usr/include/expat.h' line='338' column='1' id='type-id-347'/>
    <class-decl name='XML_Encoding' size-in-bits='8384' is-struct='yes' naming-typedef-id='type-id-348' visibility='default' filepath='/usr/include/expat.h' line='521' column='1' id='type-id-349'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='map' type-id='type-id-20' visibility='default' filepath='/usr/include/expat.h' line='522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='data' type-id='type-id-16' visibility='default' filepath='/usr/include/expat.h' line='523' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='convert' type-id='type-id-350' visibility='default' filepath='/usr/include/expat.h' line='524' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='release' type-id='type-id-341' visibility='default' filepath='/usr/include/expat.h' line='525' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='XML_Encoding' type-id='type-id-349' filepath='/usr/include/expat.h' line='526' column='1' id='type-id-348'/>
    <typedef-decl name='XML_UnknownEncodingHandler' type-id='type-id-351' filepath='/usr/include/expat.h' line='543' column='1' id='type-id-352'/>
    <typedef-decl name='XML_Char' type-id='type-id-4' filepath='/usr/include/expat_external.h' line='149' column='1' id='type-id-353'/>
    <typedef-decl name='XML_LChar' type-id='type-id-4' filepath='/usr/include/expat_external.h' line='150' column='1' id='type-id-354'/>
    <typedef-decl name='XML_Size' type-id='type-id-6' filepath='/usr/include/expat_external.h' line='158' column='1' id='type-id-355'/>
    <class-decl name='lconv' size-in-bits='768' is-struct='yes' visibility='default' filepath='/usr/include/locale.h' line='51' column='1' id='type-id-356'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='decimal_point' type-id='type-id-251' visibility='default' filepath='/usr/include/locale.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thousands_sep' type-id='type-id-251' visibility='default' filepath='/usr/include/locale.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='grouping' type-id='type-id-251' visibility='default' filepath='/usr/include/locale.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='int_curr_symbol' type-id='type-id-251' visibility='default' filepath='/usr/include/locale.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='currency_symbol' type-id='type-id-251' visibility='default' filepath='/usr/include/locale.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mon_decimal_point' type-id='type-id-251' visibility='default' filepath='/usr/include/locale.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mon_thousands_sep' type-id='type-id-251' visibility='default' filepath='/usr/include/locale.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mon_grouping' type-id='type-id-251' visibility='default' filepath='/usr/include/locale.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='positive_sign' type-id='type-id-251' visibility='default' filepath='/usr/include/locale.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='negative_sign' type-id='type-id-251' visibility='default' filepath='/usr/include/locale.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='int_frac_digits' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <var-decl name='frac_digits' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='p_cs_precedes' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='664'>
        <var-decl name='p_sep_by_space' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='n_cs_precedes' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='680'>
        <var-decl name='n_sep_by_space' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='688'>
        <var-decl name='p_sign_posn' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='696'>
        <var-decl name='n_sign_posn' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='int_p_cs_precedes' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='712'>
        <var-decl name='int_p_sep_by_space' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='720'>
        <var-decl name='int_n_cs_precedes' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='728'>
        <var-decl name='int_n_sep_by_space' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='int_p_sign_posn' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='744'>
        <var-decl name='int_n_sign_posn' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='fpos_t' type-id='type-id-357' filepath='/usr/include/stdio.h' line='86' column='1' id='type-id-358'/>
    <class-decl name='div_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-359' visibility='default' filepath='/usr/include/stdlib.h' line='60' column='1' id='type-id-360'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-19' visibility='default' filepath='/usr/include/stdlib.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rem' type-id='type-id-19' visibility='default' filepath='/usr/include/stdlib.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='div_t' type-id='type-id-360' filepath='/usr/include/stdlib.h' line='63' column='1' id='type-id-359'/>
    <class-decl name='ldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-361' visibility='default' filepath='/usr/include/stdlib.h' line='68' column='1' id='type-id-362'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-23' visibility='default' filepath='/usr/include/stdlib.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-23' visibility='default' filepath='/usr/include/stdlib.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ldiv_t' type-id='type-id-362' filepath='/usr/include/stdlib.h' line='71' column='1' id='type-id-361'/>
    <class-decl name='lldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-363' visibility='default' filepath='/usr/include/stdlib.h' line='78' column='1' id='type-id-364'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-24' visibility='default' filepath='/usr/include/stdlib.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-24' visibility='default' filepath='/usr/include/stdlib.h' line='80' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='lldiv_t' type-id='type-id-364' filepath='/usr/include/stdlib.h' line='81' column='1' id='type-id-363'/>
    <typedef-decl name='__compar_fn_t' type-id='type-id-365' filepath='/usr/include/stdlib.h' line='816' column='1' id='type-id-366'/>
    <typedef-decl name='__off_t' type-id='type-id-23' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-367'/>
    <typedef-decl name='__off64_t' type-id='type-id-23' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1' id='type-id-368'/>
    <typedef-decl name='__time_t' type-id='type-id-23' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='160' column='1' id='type-id-369'/>
    <typedef-decl name='FILE' type-id='type-id-370' filepath='/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-371'/>
    <typedef-decl name='__FILE' type-id='type-id-370' filepath='/usr/include/x86_64-linux-gnu/bits/types/__FILE.h' line='5' column='1' id='type-id-372'/>
    <class-decl name='_G_fpos64_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='10' column='1' id='type-id-373'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__pos' type-id='type-id-368' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__state' type-id='type-id-374' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='13' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__fpos64_t' type-id='type-id-373' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='14' column='1' id='type-id-357'/>
    <class-decl name='__mbstate_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-374' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='14' column='1' id='type-id-375'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='17' column='1' id='type-id-376'>
          <data-member access='public'>
            <var-decl name='__wch' type-id='type-id-15' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='18' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='__wchb' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='19' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='type-id-376' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='20' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__mbstate_t' type-id='type-id-375' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='21' column='1' id='type-id-374'/>
    <typedef-decl name='mbstate_t' type-id='type-id-374' filepath='/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h' line='6' column='1' id='type-id-377'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-32' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='43' column='1' id='type-id-378'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='49' column='1' id='type-id-370'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-251' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-251' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-251' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-251' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-251' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-251' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-251' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-251' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-251' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-251' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-251' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-379' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-380' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-367' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-30' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-27' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-8' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-381' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-368' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-382' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-383' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-380' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-16' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-119' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-10' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='7' column='1' id='type-id-384'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-23' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-188' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='time_t' type-id='type-id-369' filepath='/usr/include/x86_64-linux-gnu/bits/types/time_t.h' line='10' column='1' id='type-id-189'/>
    <typedef-decl name='wint_t' type-id='type-id-15' filepath='/usr/include/x86_64-linux-gnu/bits/types/wint_t.h' line='20' column='1' id='type-id-385'/>
    <typedef-decl name='ptrdiff_t' type-id='type-id-23' filepath='/usr/lib/gcc/x86_64-linux-gnu/11/include/stddef.h' line='143' column='1' id='type-id-227'/>
    <typedef-decl name='size_t' type-id='type-id-6' filepath='/usr/lib/gcc/x86_64-linux-gnu/11/include/stddef.h' line='209' column='1' id='type-id-119'/>
    <pointer-type-def type-id='type-id-371' size-in-bits='64' id='type-id-386'/>
    <pointer-type-def type-id='type-id-348' size-in-bits='64' id='type-id-387'/>
    <pointer-type-def type-id='type-id-388' size-in-bits='64' id='type-id-329'/>
    <pointer-type-def type-id='type-id-370' size-in-bits='64' id='type-id-380'/>
    <pointer-type-def type-id='type-id-389' size-in-bits='64' id='type-id-382'/>
    <pointer-type-def type-id='type-id-378' size-in-bits='64' id='type-id-381'/>
    <pointer-type-def type-id='type-id-390' size-in-bits='64' id='type-id-379'/>
    <pointer-type-def type-id='type-id-391' size-in-bits='64' id='type-id-383'/>
    <pointer-type-def type-id='type-id-372' size-in-bits='64' id='type-id-392'/>
    <reference-type-def kind='lvalue' type-id='type-id-393' size-in-bits='64' id='type-id-394'/>
    <reference-type-def kind='lvalue' type-id='type-id-395' size-in-bits='64' id='type-id-396'/>
    <reference-type-def kind='lvalue' type-id='type-id-397' size-in-bits='64' id='type-id-398'/>
    <pointer-type-def type-id='type-id-397' size-in-bits='64' id='type-id-399'/>
    <reference-type-def kind='lvalue' type-id='type-id-400' size-in-bits='64' id='type-id-401'/>
    <pointer-type-def type-id='type-id-400' size-in-bits='64' id='type-id-402'/>
    <reference-type-def kind='lvalue' type-id='type-id-403' size-in-bits='64' id='type-id-404'/>
    <pointer-type-def type-id='type-id-403' size-in-bits='64' id='type-id-405'/>
    <qualified-type-def type-id='type-id-405' const='yes' id='type-id-406'/>
    <reference-type-def kind='lvalue' type-id='type-id-407' size-in-bits='64' id='type-id-408'/>
    <pointer-type-def type-id='type-id-407' size-in-bits='64' id='type-id-409'/>
    <qualified-type-def type-id='type-id-409' const='yes' id='type-id-410'/>
    <reference-type-def kind='lvalue' type-id='type-id-411' size-in-bits='64' id='type-id-412'/>
    <pointer-type-def type-id='type-id-411' size-in-bits='64' id='type-id-413'/>
    <pointer-type-def type-id='type-id-414' size-in-bits='64' id='type-id-415'/>
    <pointer-type-def type-id='type-id-416' size-in-bits='64' id='type-id-417'/>
    <qualified-type-def type-id='type-id-417' const='yes' id='type-id-418'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-419'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-74'/>
    <pointer-type-def type-id='type-id-420' size-in-bits='64' id='type-id-81'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-121'/>
    <reference-type-def kind='lvalue' type-id='type-id-3' size-in-bits='64' id='type-id-421'/>
    <reference-type-def kind='lvalue' type-id='type-id-4' size-in-bits='64' id='type-id-422'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-251'/>
    <qualified-type-def type-id='type-id-251' const='yes' id='type-id-423'/>
    <reference-type-def kind='lvalue' type-id='type-id-423' size-in-bits='64' id='type-id-424'/>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-425'/>
    <qualified-type-def type-id='type-id-353' const='yes' id='type-id-426'/>
    <pointer-type-def type-id='type-id-426' size-in-bits='64' id='type-id-427'/>
    <pointer-type-def type-id='type-id-427' size-in-bits='64' id='type-id-428'/>
    <qualified-type-def type-id='type-id-354' const='yes' id='type-id-429'/>
    <pointer-type-def type-id='type-id-429' size-in-bits='64' id='type-id-430'/>
    <qualified-type-def type-id='type-id-393' const='yes' id='type-id-431'/>
    <reference-type-def kind='lvalue' type-id='type-id-431' size-in-bits='64' id='type-id-432'/>
    <qualified-type-def type-id='type-id-395' const='yes' id='type-id-433'/>
    <reference-type-def kind='lvalue' type-id='type-id-433' size-in-bits='64' id='type-id-434'/>
    <qualified-type-def type-id='type-id-397' const='yes' id='type-id-435'/>
    <pointer-type-def type-id='type-id-435' size-in-bits='64' id='type-id-436'/>
    <qualified-type-def type-id='type-id-400' const='yes' id='type-id-437'/>
    <pointer-type-def type-id='type-id-437' size-in-bits='64' id='type-id-438'/>
    <qualified-type-def type-id='type-id-403' const='yes' id='type-id-439'/>
    <reference-type-def kind='lvalue' type-id='type-id-439' size-in-bits='64' id='type-id-440'/>
    <pointer-type-def type-id='type-id-439' size-in-bits='64' id='type-id-441'/>
    <qualified-type-def type-id='type-id-441' const='yes' id='type-id-442'/>
    <qualified-type-def type-id='type-id-407' const='yes' id='type-id-443'/>
    <reference-type-def kind='lvalue' type-id='type-id-443' size-in-bits='64' id='type-id-444'/>
    <pointer-type-def type-id='type-id-443' size-in-bits='64' id='type-id-445'/>
    <qualified-type-def type-id='type-id-445' const='yes' id='type-id-446'/>
    <qualified-type-def type-id='type-id-411' const='yes' id='type-id-447'/>
    <reference-type-def kind='lvalue' type-id='type-id-447' size-in-bits='64' id='type-id-448'/>
    <pointer-type-def type-id='type-id-447' size-in-bits='64' id='type-id-449'/>
    <qualified-type-def type-id='type-id-450' const='yes' id='type-id-451'/>
    <reference-type-def kind='lvalue' type-id='type-id-451' size-in-bits='64' id='type-id-452'/>
    <qualified-type-def type-id='type-id-414' const='yes' id='type-id-453'/>
    <reference-type-def kind='lvalue' type-id='type-id-453' size-in-bits='64' id='type-id-454'/>
    <pointer-type-def type-id='type-id-453' size-in-bits='64' id='type-id-455'/>
    <qualified-type-def type-id='type-id-416' const='yes' id='type-id-456'/>
    <reference-type-def kind='lvalue' type-id='type-id-456' size-in-bits='64' id='type-id-457'/>
    <pointer-type-def type-id='type-id-456' size-in-bits='64' id='type-id-458'/>
    <qualified-type-def type-id='type-id-3' const='yes' id='type-id-90'/>
    <qualified-type-def type-id='type-id-4' const='yes' id='type-id-459'/>
    <reference-type-def kind='lvalue' type-id='type-id-459' size-in-bits='64' id='type-id-460'/>
    <pointer-type-def type-id='type-id-459' size-in-bits='64' id='type-id-188'/>
    <qualified-type-def type-id='type-id-188' const='yes' id='type-id-461'/>
    <reference-type-def kind='lvalue' type-id='type-id-461' size-in-bits='64' id='type-id-462'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-463'/>
    <qualified-type-def type-id='type-id-358' const='yes' id='type-id-464'/>
    <pointer-type-def type-id='type-id-464' size-in-bits='64' id='type-id-465'/>
    <qualified-type-def type-id='type-id-19' const='yes' id='type-id-466'/>
    <qualified-type-def type-id='type-id-377' const='yes' id='type-id-467'/>
    <pointer-type-def type-id='type-id-467' size-in-bits='64' id='type-id-468'/>
    <qualified-type-def type-id='type-id-119' const='yes' id='type-id-252'/>
    <qualified-type-def type-id='type-id-469' const='yes' id='type-id-470'/>
    <reference-type-def kind='lvalue' type-id='type-id-470' size-in-bits='64' id='type-id-471'/>
    <pointer-type-def type-id='type-id-470' size-in-bits='64' id='type-id-472'/>
    <qualified-type-def type-id='type-id-473' const='yes' id='type-id-474'/>
    <reference-type-def kind='lvalue' type-id='type-id-474' size-in-bits='64' id='type-id-475'/>
    <qualified-type-def type-id='type-id-476' const='yes' id='type-id-477'/>
    <reference-type-def kind='lvalue' type-id='type-id-477' size-in-bits='64' id='type-id-478'/>
    <pointer-type-def type-id='type-id-477' size-in-bits='64' id='type-id-479'/>
    <qualified-type-def type-id='type-id-479' const='yes' id='type-id-480'/>
    <qualified-type-def type-id='type-id-481' const='yes' id='type-id-482'/>
    <reference-type-def kind='lvalue' type-id='type-id-482' size-in-bits='64' id='type-id-483'/>
    <qualified-type-def type-id='type-id-237' const='yes' id='type-id-484'/>
    <reference-type-def kind='lvalue' type-id='type-id-484' size-in-bits='64' id='type-id-485'/>
    <qualified-type-def type-id='type-id-486' const='yes' id='type-id-487'/>
    <qualified-type-def type-id='type-id-488' const='yes' id='type-id-489'/>
    <reference-type-def kind='lvalue' type-id='type-id-489' size-in-bits='64' id='type-id-490'/>
    <pointer-type-def type-id='type-id-489' size-in-bits='64' id='type-id-491'/>
    <qualified-type-def type-id='type-id-492' const='yes' id='type-id-493'/>
    <reference-type-def kind='lvalue' type-id='type-id-493' size-in-bits='64' id='type-id-494'/>
    <qualified-type-def type-id='type-id-495' const='yes' id='type-id-496'/>
    <reference-type-def kind='lvalue' type-id='type-id-496' size-in-bits='64' id='type-id-497'/>
    <qualified-type-def type-id='type-id-498' const='yes' id='type-id-499'/>
    <reference-type-def kind='lvalue' type-id='type-id-499' size-in-bits='64' id='type-id-500'/>
    <qualified-type-def type-id='type-id-501' const='yes' id='type-id-502'/>
    <reference-type-def kind='lvalue' type-id='type-id-502' size-in-bits='64' id='type-id-503'/>
    <qualified-type-def type-id='type-id-504' const='yes' id='type-id-505'/>
    <reference-type-def kind='lvalue' type-id='type-id-505' size-in-bits='64' id='type-id-506'/>
    <pointer-type-def type-id='type-id-505' size-in-bits='64' id='type-id-507'/>
    <qualified-type-def type-id='type-id-508' const='yes' id='type-id-509'/>
    <reference-type-def kind='lvalue' type-id='type-id-509' size-in-bits='64' id='type-id-510'/>
    <pointer-type-def type-id='type-id-509' size-in-bits='64' id='type-id-511'/>
    <qualified-type-def type-id='type-id-512' const='yes' id='type-id-513'/>
    <reference-type-def kind='lvalue' type-id='type-id-513' size-in-bits='64' id='type-id-514'/>
    <pointer-type-def type-id='type-id-513' size-in-bits='64' id='type-id-515'/>
    <qualified-type-def type-id='type-id-516' const='yes' id='type-id-517'/>
    <reference-type-def kind='lvalue' type-id='type-id-517' size-in-bits='64' id='type-id-518'/>
    <pointer-type-def type-id='type-id-517' size-in-bits='64' id='type-id-519'/>
    <qualified-type-def type-id='type-id-520' const='yes' id='type-id-521'/>
    <reference-type-def kind='lvalue' type-id='type-id-521' size-in-bits='64' id='type-id-522'/>
    <pointer-type-def type-id='type-id-521' size-in-bits='64' id='type-id-523'/>
    <qualified-type-def type-id='type-id-524' const='yes' id='type-id-525'/>
    <reference-type-def kind='lvalue' type-id='type-id-525' size-in-bits='64' id='type-id-526'/>
    <qualified-type-def type-id='type-id-527' const='yes' id='type-id-528'/>
    <pointer-type-def type-id='type-id-528' size-in-bits='64' id='type-id-529'/>
    <qualified-type-def type-id='type-id-530' const='yes' id='type-id-531'/>
    <pointer-type-def type-id='type-id-531' size-in-bits='64' id='type-id-532'/>
    <qualified-type-def type-id='type-id-533' const='yes' id='type-id-534'/>
    <reference-type-def kind='lvalue' type-id='type-id-534' size-in-bits='64' id='type-id-535'/>
    <qualified-type-def type-id='type-id-536' const='yes' id='type-id-537'/>
    <pointer-type-def type-id='type-id-537' size-in-bits='64' id='type-id-538'/>
    <qualified-type-def type-id='type-id-538' const='yes' id='type-id-539'/>
    <qualified-type-def type-id='type-id-384' const='yes' id='type-id-540'/>
    <pointer-type-def type-id='type-id-540' size-in-bits='64' id='type-id-541'/>
    <qualified-type-def type-id='type-id-29' const='yes' id='type-id-542'/>
    <pointer-type-def type-id='type-id-542' size-in-bits='64' id='type-id-543'/>
    <qualified-type-def type-id='type-id-33' const='yes' id='type-id-544'/>
    <reference-type-def kind='lvalue' type-id='type-id-544' size-in-bits='64' id='type-id-545'/>
    <pointer-type-def type-id='type-id-544' size-in-bits='64' id='type-id-218'/>
    <qualified-type-def type-id='type-id-218' const='yes' id='type-id-546'/>
    <reference-type-def kind='lvalue' type-id='type-id-546' size-in-bits='64' id='type-id-547'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-548'/>
    <qualified-type-def type-id='type-id-266' const='yes' id='type-id-549'/>
    <pointer-type-def type-id='type-id-549' size-in-bits='64' id='type-id-550'/>
    <qualified-type-def type-id='type-id-550' const='yes' id='type-id-551'/>
    <qualified-type-def type-id='type-id-270' const='yes' id='type-id-552'/>
    <pointer-type-def type-id='type-id-552' size-in-bits='64' id='type-id-553'/>
    <qualified-type-def type-id='type-id-268' const='yes' id='type-id-554'/>
    <pointer-type-def type-id='type-id-554' size-in-bits='64' id='type-id-555'/>
    <qualified-type-def type-id='type-id-215' const='yes' id='type-id-556'/>
    <reference-type-def kind='lvalue' type-id='type-id-556' size-in-bits='64' id='type-id-271'/>
    <pointer-type-def type-id='type-id-556' size-in-bits='64' id='type-id-557'/>
    <qualified-type-def type-id='type-id-557' const='yes' id='type-id-262'/>
    <qualified-type-def type-id='type-id-35' const='yes' id='type-id-558'/>
    <pointer-type-def type-id='type-id-558' size-in-bits='64' id='type-id-211'/>
    <qualified-type-def type-id='type-id-53' const='yes' id='type-id-559'/>
    <qualified-type-def type-id='type-id-54' const='yes' id='type-id-560'/>
    <reference-type-def kind='lvalue' type-id='type-id-560' size-in-bits='64' id='type-id-561'/>
    <qualified-type-def type-id='type-id-55' const='yes' id='type-id-562'/>
    <reference-type-def kind='lvalue' type-id='type-id-562' size-in-bits='64' id='type-id-563'/>
    <qualified-type-def type-id='type-id-49' const='yes' id='type-id-564'/>
    <reference-type-def kind='lvalue' type-id='type-id-564' size-in-bits='64' id='type-id-565'/>
    <qualified-type-def type-id='type-id-50' const='yes' id='type-id-566'/>
    <pointer-type-def type-id='type-id-566' size-in-bits='64' id='type-id-567'/>
    <qualified-type-def type-id='type-id-51' const='yes' id='type-id-568'/>
    <reference-type-def kind='lvalue' type-id='type-id-568' size-in-bits='64' id='type-id-569'/>
    <qualified-type-def type-id='type-id-52' const='yes' id='type-id-570'/>
    <pointer-type-def type-id='type-id-570' size-in-bits='64' id='type-id-571'/>
    <qualified-type-def type-id='type-id-202' const='yes' id='type-id-572'/>
    <reference-type-def kind='lvalue' type-id='type-id-572' size-in-bits='64' id='type-id-573'/>
    <pointer-type-def type-id='type-id-572' size-in-bits='64' id='type-id-208'/>
    <qualified-type-def type-id='type-id-203' const='yes' id='type-id-574'/>
    <pointer-type-def type-id='type-id-574' size-in-bits='64' id='type-id-575'/>
    <qualified-type-def type-id='type-id-206' const='yes' id='type-id-576'/>
    <reference-type-def kind='lvalue' type-id='type-id-576' size-in-bits='64' id='type-id-577'/>
    <qualified-type-def type-id='type-id-282' const='yes' id='type-id-578'/>
    <reference-type-def kind='lvalue' type-id='type-id-578' size-in-bits='64' id='type-id-579'/>
    <qualified-type-def type-id='type-id-284' const='yes' id='type-id-580'/>
    <reference-type-def kind='lvalue' type-id='type-id-580' size-in-bits='64' id='type-id-581'/>
    <qualified-type-def type-id='type-id-67' const='yes' id='type-id-582'/>
    <reference-type-def kind='lvalue' type-id='type-id-582' size-in-bits='64' id='type-id-72'/>
    <qualified-type-def type-id='type-id-583' const='yes' id='type-id-584'/>
    <pointer-type-def type-id='type-id-584' size-in-bits='64' id='type-id-585'/>
    <qualified-type-def type-id='type-id-586' const='yes' id='type-id-587'/>
    <pointer-type-def type-id='type-id-587' size-in-bits='64' id='type-id-588'/>
    <qualified-type-def type-id='type-id-259' const='yes' id='type-id-589'/>
    <reference-type-def kind='lvalue' type-id='type-id-589' size-in-bits='64' id='type-id-590'/>
    <pointer-type-def type-id='type-id-589' size-in-bits='64' id='type-id-264'/>
    <qualified-type-def type-id='type-id-264' const='yes' id='type-id-591'/>
    <qualified-type-def type-id='type-id-263' const='yes' id='type-id-592'/>
    <reference-type-def kind='lvalue' type-id='type-id-592' size-in-bits='64' id='type-id-593'/>
    <pointer-type-def type-id='type-id-592' size-in-bits='64' id='type-id-594'/>
    <qualified-type-def type-id='type-id-594' const='yes' id='type-id-595'/>
    <qualified-type-def type-id='type-id-185' const='yes' id='type-id-193'/>
    <qualified-type-def type-id='type-id-186' const='yes' id='type-id-596'/>
    <reference-type-def kind='lvalue' type-id='type-id-596' size-in-bits='64' id='type-id-597'/>
    <pointer-type-def type-id='type-id-596' size-in-bits='64' id='type-id-598'/>
    <qualified-type-def type-id='type-id-192' const='yes' id='type-id-599'/>
    <reference-type-def kind='lvalue' type-id='type-id-599' size-in-bits='64' id='type-id-600'/>
    <qualified-type-def type-id='type-id-194' const='yes' id='type-id-601'/>
    <reference-type-def kind='lvalue' type-id='type-id-601' size-in-bits='64' id='type-id-602'/>
    <pointer-type-def type-id='type-id-601' size-in-bits='64' id='type-id-603'/>
    <qualified-type-def type-id='type-id-603' const='yes' id='type-id-604'/>
    <qualified-type-def type-id='type-id-605' const='yes' id='type-id-606'/>
    <reference-type-def kind='lvalue' type-id='type-id-606' size-in-bits='64' id='type-id-607'/>
    <pointer-type-def type-id='type-id-606' size-in-bits='64' id='type-id-608'/>
    <qualified-type-def type-id='type-id-609' const='yes' id='type-id-610'/>
    <pointer-type-def type-id='type-id-610' size-in-bits='64' id='type-id-611'/>
    <qualified-type-def type-id='type-id-612' const='yes' id='type-id-613'/>
    <pointer-type-def type-id='type-id-613' size-in-bits='64' id='type-id-614'/>
    <qualified-type-def type-id='type-id-279' const='yes' id='type-id-615'/>
    <reference-type-def kind='lvalue' type-id='type-id-615' size-in-bits='64' id='type-id-616'/>
    <pointer-type-def type-id='type-id-615' size-in-bits='64' id='type-id-617'/>
    <qualified-type-def type-id='type-id-316' const='yes' id='type-id-618'/>
    <pointer-type-def type-id='type-id-618' size-in-bits='64' id='type-id-619'/>
    <qualified-type-def type-id='type-id-66' const='yes' id='type-id-620'/>
    <pointer-type-def type-id='type-id-620' size-in-bits='64' id='type-id-71'/>
    <qualified-type-def type-id='type-id-199' const='yes' id='type-id-621'/>
    <pointer-type-def type-id='type-id-621' size-in-bits='64' id='type-id-622'/>
    <qualified-type-def type-id='type-id-197' const='yes' id='type-id-623'/>
    <reference-type-def kind='lvalue' type-id='type-id-623' size-in-bits='64' id='type-id-624'/>
    <pointer-type-def type-id='type-id-623' size-in-bits='64' id='type-id-625'/>
    <qualified-type-def type-id='type-id-47' const='yes' id='type-id-626'/>
    <reference-type-def kind='lvalue' type-id='type-id-626' size-in-bits='64' id='type-id-627'/>
    <qualified-type-def type-id='type-id-38' const='yes' id='type-id-628'/>
    <reference-type-def kind='lvalue' type-id='type-id-628' size-in-bits='64' id='type-id-629'/>
    <pointer-type-def type-id='type-id-628' size-in-bits='64' id='type-id-630'/>
    <qualified-type-def type-id='type-id-630' const='yes' id='type-id-631'/>
    <qualified-type-def type-id='type-id-39' const='yes' id='type-id-632'/>
    <pointer-type-def type-id='type-id-632' size-in-bits='64' id='type-id-633'/>
    <qualified-type-def type-id='type-id-40' const='yes' id='type-id-634'/>
    <pointer-type-def type-id='type-id-634' size-in-bits='64' id='type-id-635'/>
    <qualified-type-def type-id='type-id-635' const='yes' id='type-id-636'/>
    <qualified-type-def type-id='type-id-43' const='yes' id='type-id-637'/>
    <reference-type-def kind='lvalue' type-id='type-id-637' size-in-bits='64' id='type-id-638'/>
    <pointer-type-def type-id='type-id-637' size-in-bits='64' id='type-id-639'/>
    <qualified-type-def type-id='type-id-639' const='yes' id='type-id-640'/>
    <qualified-type-def type-id='type-id-44' const='yes' id='type-id-641'/>
    <pointer-type-def type-id='type-id-641' size-in-bits='64' id='type-id-642'/>
    <qualified-type-def type-id='type-id-45' const='yes' id='type-id-643'/>
    <pointer-type-def type-id='type-id-643' size-in-bits='64' id='type-id-644'/>
    <qualified-type-def type-id='type-id-644' const='yes' id='type-id-645'/>
    <qualified-type-def type-id='type-id-213' const='yes' id='type-id-646'/>
    <reference-type-def kind='lvalue' type-id='type-id-646' size-in-bits='64' id='type-id-647'/>
    <pointer-type-def type-id='type-id-646' size-in-bits='64' id='type-id-648'/>
    <qualified-type-def type-id='type-id-648' const='yes' id='type-id-649'/>
    <qualified-type-def type-id='type-id-48' const='yes' id='type-id-650'/>
    <reference-type-def kind='lvalue' type-id='type-id-650' size-in-bits='64' id='type-id-651'/>
    <qualified-type-def type-id='type-id-255' const='yes' id='type-id-652'/>
    <reference-type-def kind='lvalue' type-id='type-id-652' size-in-bits='64' id='type-id-653'/>
    <qualified-type-def type-id='type-id-95' const='yes' id='type-id-104'/>
    <reference-type-def kind='lvalue' type-id='type-id-104' size-in-bits='64' id='type-id-269'/>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-216'/>
    <qualified-type-def type-id='type-id-216' const='yes' id='type-id-261'/>
    <qualified-type-def type-id='type-id-250' const='yes' id='type-id-654'/>
    <pointer-type-def type-id='type-id-654' size-in-bits='64' id='type-id-655'/>
    <qualified-type-def type-id='type-id-655' const='yes' id='type-id-656'/>
    <qualified-type-def type-id='type-id-220' const='yes' id='type-id-657'/>
    <qualified-type-def type-id='type-id-232' const='yes' id='type-id-658'/>
    <reference-type-def kind='lvalue' type-id='type-id-658' size-in-bits='64' id='type-id-659'/>
    <pointer-type-def type-id='type-id-658' size-in-bits='64' id='type-id-660'/>
    <qualified-type-def type-id='type-id-660' const='yes' id='type-id-661'/>
    <qualified-type-def type-id='type-id-225' const='yes' id='type-id-662'/>
    <reference-type-def kind='lvalue' type-id='type-id-662' size-in-bits='64' id='type-id-663'/>
    <pointer-type-def type-id='type-id-662' size-in-bits='64' id='type-id-664'/>
    <qualified-type-def type-id='type-id-664' const='yes' id='type-id-665'/>
    <qualified-type-def type-id='type-id-238' const='yes' id='type-id-666'/>
    <reference-type-def kind='lvalue' type-id='type-id-666' size-in-bits='64' id='type-id-667'/>
    <pointer-type-def type-id='type-id-666' size-in-bits='64' id='type-id-668'/>
    <qualified-type-def type-id='type-id-242' const='yes' id='type-id-669'/>
    <reference-type-def kind='lvalue' type-id='type-id-669' size-in-bits='64' id='type-id-670'/>
    <pointer-type-def type-id='type-id-669' size-in-bits='64' id='type-id-671'/>
    <qualified-type-def type-id='type-id-222' const='yes' id='type-id-672'/>
    <qualified-type-def type-id='type-id-65' const='yes' id='type-id-673'/>
    <pointer-type-def type-id='type-id-673' size-in-bits='64' id='type-id-674'/>
    <qualified-type-def type-id='type-id-83' const='yes' id='type-id-675'/>
    <pointer-type-def type-id='type-id-675' size-in-bits='64' id='type-id-676'/>
    <qualified-type-def type-id='type-id-82' const='yes' id='type-id-677'/>
    <pointer-type-def type-id='type-id-677' size-in-bits='64' id='type-id-678'/>
    <qualified-type-def type-id='type-id-253' const='yes' id='type-id-679'/>
    <reference-type-def kind='lvalue' type-id='type-id-679' size-in-bits='64' id='type-id-680'/>
    <qualified-type-def type-id='type-id-258' const='yes' id='type-id-681'/>
    <pointer-type-def type-id='type-id-681' size-in-bits='64' id='type-id-682'/>
    <qualified-type-def type-id='type-id-682' const='yes' id='type-id-683'/>
    <qualified-type-def type-id='type-id-136' const='yes' id='type-id-684'/>
    <pointer-type-def type-id='type-id-684' size-in-bits='64' id='type-id-685'/>
    <qualified-type-def type-id='type-id-137' const='yes' id='type-id-686'/>
    <pointer-type-def type-id='type-id-686' size-in-bits='64' id='type-id-687'/>
    <qualified-type-def type-id='type-id-147' const='yes' id='type-id-688'/>
    <reference-type-def kind='lvalue' type-id='type-id-688' size-in-bits='64' id='type-id-689'/>
    <pointer-type-def type-id='type-id-688' size-in-bits='64' id='type-id-690'/>
    <qualified-type-def type-id='type-id-153' const='yes' id='type-id-691'/>
    <reference-type-def kind='lvalue' type-id='type-id-691' size-in-bits='64' id='type-id-692'/>
    <pointer-type-def type-id='type-id-691' size-in-bits='64' id='type-id-693'/>
    <qualified-type-def type-id='type-id-152' const='yes' id='type-id-694'/>
    <pointer-type-def type-id='type-id-694' size-in-bits='64' id='type-id-695'/>
    <qualified-type-def type-id='type-id-159' const='yes' id='type-id-696'/>
    <reference-type-def kind='lvalue' type-id='type-id-696' size-in-bits='64' id='type-id-697'/>
    <qualified-type-def type-id='type-id-143' const='yes' id='type-id-140'/>
    <reference-type-def kind='lvalue' type-id='type-id-140' size-in-bits='64' id='type-id-698'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-699'/>
    <qualified-type-def type-id='type-id-160' const='yes' id='type-id-700'/>
    <reference-type-def kind='lvalue' type-id='type-id-700' size-in-bits='64' id='type-id-701'/>
    <qualified-type-def type-id='type-id-161' const='yes' id='type-id-702'/>
    <reference-type-def kind='lvalue' type-id='type-id-702' size-in-bits='64' id='type-id-703'/>
    <qualified-type-def type-id='type-id-163' const='yes' id='type-id-704'/>
    <reference-type-def kind='lvalue' type-id='type-id-704' size-in-bits='64' id='type-id-705'/>
    <qualified-type-def type-id='type-id-151' const='yes' id='type-id-706'/>
    <reference-type-def kind='lvalue' type-id='type-id-706' size-in-bits='64' id='type-id-158'/>
    <pointer-type-def type-id='type-id-706' size-in-bits='64' id='type-id-156'/>
    <qualified-type-def type-id='type-id-162' const='yes' id='type-id-707'/>
    <pointer-type-def type-id='type-id-707' size-in-bits='64' id='type-id-708'/>
    <qualified-type-def type-id='type-id-178' const='yes' id='type-id-173'/>
    <qualified-type-def type-id='type-id-179' const='yes' id='type-id-177'/>
    <qualified-type-def type-id='type-id-84' const='yes' id='type-id-709'/>
    <pointer-type-def type-id='type-id-709' size-in-bits='64' id='type-id-710'/>
    <qualified-type-def type-id='type-id-85' const='yes' id='type-id-711'/>
    <pointer-type-def type-id='type-id-711' size-in-bits='64' id='type-id-712'/>
    <qualified-type-def type-id='type-id-96' const='yes' id='type-id-713'/>
    <reference-type-def kind='lvalue' type-id='type-id-713' size-in-bits='64' id='type-id-714'/>
    <pointer-type-def type-id='type-id-713' size-in-bits='64' id='type-id-715'/>
    <qualified-type-def type-id='type-id-102' const='yes' id='type-id-716'/>
    <reference-type-def kind='lvalue' type-id='type-id-716' size-in-bits='64' id='type-id-717'/>
    <pointer-type-def type-id='type-id-716' size-in-bits='64' id='type-id-718'/>
    <qualified-type-def type-id='type-id-101' const='yes' id='type-id-719'/>
    <pointer-type-def type-id='type-id-719' size-in-bits='64' id='type-id-720'/>
    <qualified-type-def type-id='type-id-109' const='yes' id='type-id-721'/>
    <reference-type-def kind='lvalue' type-id='type-id-721' size-in-bits='64' id='type-id-722'/>
    <qualified-type-def type-id='type-id-92' const='yes' id='type-id-88'/>
    <reference-type-def kind='lvalue' type-id='type-id-88' size-in-bits='64' id='type-id-723'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-724'/>
    <qualified-type-def type-id='type-id-110' const='yes' id='type-id-725'/>
    <reference-type-def kind='lvalue' type-id='type-id-725' size-in-bits='64' id='type-id-726'/>
    <qualified-type-def type-id='type-id-111' const='yes' id='type-id-727'/>
    <reference-type-def kind='lvalue' type-id='type-id-727' size-in-bits='64' id='type-id-728'/>
    <qualified-type-def type-id='type-id-113' const='yes' id='type-id-729'/>
    <reference-type-def kind='lvalue' type-id='type-id-729' size-in-bits='64' id='type-id-730'/>
    <qualified-type-def type-id='type-id-100' const='yes' id='type-id-731'/>
    <reference-type-def kind='lvalue' type-id='type-id-731' size-in-bits='64' id='type-id-108'/>
    <pointer-type-def type-id='type-id-731' size-in-bits='64' id='type-id-106'/>
    <qualified-type-def type-id='type-id-112' const='yes' id='type-id-732'/>
    <pointer-type-def type-id='type-id-732' size-in-bits='64' id='type-id-733'/>
    <qualified-type-def type-id='type-id-130' const='yes' id='type-id-125'/>
    <qualified-type-def type-id='type-id-131' const='yes' id='type-id-129'/>
    <qualified-type-def type-id='type-id-290' const='yes' id='type-id-734'/>
    <pointer-type-def type-id='type-id-734' size-in-bits='64' id='type-id-735'/>
    <qualified-type-def type-id='type-id-286' const='yes' id='type-id-736'/>
    <reference-type-def kind='lvalue' type-id='type-id-736' size-in-bits='64' id='type-id-737'/>
    <qualified-type-def type-id='type-id-293' const='yes' id='type-id-738'/>
    <reference-type-def kind='lvalue' type-id='type-id-738' size-in-bits='64' id='type-id-739'/>
    <pointer-type-def type-id='type-id-738' size-in-bits='64' id='type-id-740'/>
    <qualified-type-def type-id='type-id-740' const='yes' id='type-id-741'/>
    <qualified-type-def type-id='type-id-146' const='yes' id='type-id-182'/>
    <qualified-type-def type-id='type-id-196' const='yes' id='type-id-742'/>
    <reference-type-def kind='lvalue' type-id='type-id-742' size-in-bits='64' id='type-id-743'/>
    <pointer-type-def type-id='type-id-742' size-in-bits='64' id='type-id-744'/>
    <qualified-type-def type-id='type-id-235' const='yes' id='type-id-224'/>
    <reference-type-def kind='lvalue' type-id='type-id-224' size-in-bits='64' id='type-id-745'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-746'/>
    <qualified-type-def type-id='type-id-746' const='yes' id='type-id-747'/>
    <qualified-type-def type-id='type-id-229' const='yes' id='type-id-748'/>
    <reference-type-def kind='lvalue' type-id='type-id-748' size-in-bits='64' id='type-id-299'/>
    <pointer-type-def type-id='type-id-748' size-in-bits='64' id='type-id-749'/>
    <qualified-type-def type-id='type-id-749' const='yes' id='type-id-750'/>
    <qualified-type-def type-id='type-id-301' const='yes' id='type-id-751'/>
    <pointer-type-def type-id='type-id-751' size-in-bits='64' id='type-id-752'/>
    <qualified-type-def type-id='type-id-57' const='yes' id='type-id-753'/>
    <reference-type-def kind='lvalue' type-id='type-id-753' size-in-bits='64' id='type-id-754'/>
    <qualified-type-def type-id='type-id-58' const='yes' id='type-id-755'/>
    <reference-type-def kind='lvalue' type-id='type-id-755' size-in-bits='64' id='type-id-756'/>
    <qualified-type-def type-id='type-id-60' const='yes' id='type-id-757'/>
    <pointer-type-def type-id='type-id-757' size-in-bits='64' id='type-id-758'/>
    <qualified-type-def type-id='type-id-62' const='yes' id='type-id-759'/>
    <pointer-type-def type-id='type-id-759' size-in-bits='64' id='type-id-760'/>
    <qualified-type-def type-id='type-id-303' const='yes' id='type-id-761'/>
    <pointer-type-def type-id='type-id-761' size-in-bits='64' id='type-id-762'/>
    <qualified-type-def type-id='type-id-762' const='yes' id='type-id-763'/>
    <qualified-type-def type-id='type-id-312' const='yes' id='type-id-764'/>
    <reference-type-def kind='lvalue' type-id='type-id-764' size-in-bits='64' id='type-id-765'/>
    <pointer-type-def type-id='type-id-764' size-in-bits='64' id='type-id-766'/>
    <qualified-type-def type-id='type-id-766' const='yes' id='type-id-313'/>
    <qualified-type-def type-id='type-id-315' const='yes' id='type-id-767'/>
    <reference-type-def kind='lvalue' type-id='type-id-767' size-in-bits='64' id='type-id-319'/>
    <pointer-type-def type-id='type-id-767' size-in-bits='64' id='type-id-323'/>
    <qualified-type-def type-id='type-id-323' const='yes' id='type-id-318'/>
    <qualified-type-def type-id='type-id-305' const='yes' id='type-id-768'/>
    <reference-type-def kind='lvalue' type-id='type-id-768' size-in-bits='64' id='type-id-310'/>
    <pointer-type-def type-id='type-id-768' size-in-bits='64' id='type-id-769'/>
    <qualified-type-def type-id='type-id-769' const='yes' id='type-id-307'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-770'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-771'/>
    <pointer-type-def type-id='type-id-358' size-in-bits='64' id='type-id-772'/>
    <pointer-type-def type-id='type-id-773' size-in-bits='64' id='type-id-351'/>
    <pointer-type-def type-id='type-id-774' size-in-bits='64' id='type-id-350'/>
    <pointer-type-def type-id='type-id-775' size-in-bits='64' id='type-id-365'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-776'/>
    <pointer-type-def type-id='type-id-356' size-in-bits='64' id='type-id-777'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-778'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-779'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-780'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-781'/>
    <pointer-type-def type-id='type-id-377' size-in-bits='64' id='type-id-782'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-783'/>
    <reference-type-def kind='lvalue' type-id='type-id-469' size-in-bits='64' id='type-id-784'/>
    <reference-type-def kind='rvalue' type-id='type-id-469' size-in-bits='64' id='type-id-785'/>
    <pointer-type-def type-id='type-id-469' size-in-bits='64' id='type-id-786'/>
    <pointer-type-def type-id='type-id-787' size-in-bits='64' id='type-id-788'/>
    <pointer-type-def type-id='type-id-789' size-in-bits='64' id='type-id-790'/>
    <reference-type-def kind='lvalue' type-id='type-id-473' size-in-bits='64' id='type-id-791'/>
    <reference-type-def kind='lvalue' type-id='type-id-792' size-in-bits='64' id='type-id-793'/>
    <reference-type-def kind='lvalue' type-id='type-id-476' size-in-bits='64' id='type-id-794'/>
    <reference-type-def kind='rvalue' type-id='type-id-476' size-in-bits='64' id='type-id-795'/>
    <pointer-type-def type-id='type-id-476' size-in-bits='64' id='type-id-796'/>
    <qualified-type-def type-id='type-id-796' const='yes' id='type-id-797'/>
    <pointer-type-def type-id='type-id-798' size-in-bits='64' id='type-id-799'/>
    <qualified-type-def type-id='type-id-799' const='yes' id='type-id-800'/>
    <pointer-type-def type-id='type-id-801' size-in-bits='64' id='type-id-802'/>
    <reference-type-def kind='lvalue' type-id='type-id-481' size-in-bits='64' id='type-id-803'/>
    <reference-type-def kind='lvalue' type-id='type-id-486' size-in-bits='64' id='type-id-804'/>
    <reference-type-def kind='lvalue' type-id='type-id-488' size-in-bits='64' id='type-id-805'/>
    <reference-type-def kind='rvalue' type-id='type-id-488' size-in-bits='64' id='type-id-806'/>
    <pointer-type-def type-id='type-id-488' size-in-bits='64' id='type-id-807'/>
    <reference-type-def kind='lvalue' type-id='type-id-492' size-in-bits='64' id='type-id-808'/>
    <reference-type-def kind='rvalue' type-id='type-id-492' size-in-bits='64' id='type-id-809'/>
    <pointer-type-def type-id='type-id-492' size-in-bits='64' id='type-id-810'/>
    <reference-type-def kind='lvalue' type-id='type-id-495' size-in-bits='64' id='type-id-811'/>
    <reference-type-def kind='rvalue' type-id='type-id-495' size-in-bits='64' id='type-id-812'/>
    <pointer-type-def type-id='type-id-495' size-in-bits='64' id='type-id-813'/>
    <qualified-type-def type-id='type-id-813' const='yes' id='type-id-814'/>
    <reference-type-def kind='lvalue' type-id='type-id-498' size-in-bits='64' id='type-id-815'/>
    <reference-type-def kind='lvalue' type-id='type-id-501' size-in-bits='64' id='type-id-816'/>
    <reference-type-def kind='lvalue' type-id='type-id-504' size-in-bits='64' id='type-id-817'/>
    <pointer-type-def type-id='type-id-504' size-in-bits='64' id='type-id-818'/>
    <reference-type-def kind='lvalue' type-id='type-id-512' size-in-bits='64' id='type-id-819'/>
    <pointer-type-def type-id='type-id-512' size-in-bits='64' id='type-id-820'/>
    <reference-type-def kind='lvalue' type-id='type-id-520' size-in-bits='64' id='type-id-821'/>
    <pointer-type-def type-id='type-id-520' size-in-bits='64' id='type-id-822'/>
    <pointer-type-def type-id='type-id-527' size-in-bits='64' id='type-id-823'/>
    <pointer-type-def type-id='type-id-530' size-in-bits='64' id='type-id-824'/>
    <reference-type-def kind='rvalue' type-id='type-id-825' size-in-bits='64' id='type-id-826'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-827'/>
    <pointer-type-def type-id='type-id-828' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-829'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-830'/>
    <pointer-type-def type-id='type-id-831' size-in-bits='64' id='type-id-832'/>
    <pointer-type-def type-id='type-id-833' size-in-bits='64' id='type-id-77'/>
    <pointer-type-def type-id='type-id-834' size-in-bits='64' id='type-id-341'/>
    <pointer-type-def type-id='type-id-835' size-in-bits='64' id='type-id-334'/>
    <pointer-type-def type-id='type-id-836' size-in-bits='64' id='type-id-338'/>
    <pointer-type-def type-id='type-id-837' size-in-bits='64' id='type-id-332'/>
    <pointer-type-def type-id='type-id-838' size-in-bits='64' id='type-id-345'/>
    <pointer-type-def type-id='type-id-839' size-in-bits='64' id='type-id-336'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-16'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-840'/>
    <reference-type-def kind='lvalue' type-id='type-id-33' size-in-bits='64' id='type-id-841'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-842'/>
    <qualified-type-def type-id='type-id-842' const='yes' id='type-id-843'/>
    <reference-type-def kind='lvalue' type-id='type-id-843' size-in-bits='64' id='type-id-844'/>
    <pointer-type-def type-id='type-id-842' size-in-bits='64' id='type-id-845'/>
    <pointer-type-def type-id='type-id-266' size-in-bits='64' id='type-id-846'/>
    <qualified-type-def type-id='type-id-846' const='yes' id='type-id-847'/>
    <pointer-type-def type-id='type-id-270' size-in-bits='64' id='type-id-848'/>
    <qualified-type-def type-id='type-id-848' const='yes' id='type-id-849'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-850'/>
    <qualified-type-def type-id='type-id-850' const='yes' id='type-id-851'/>
    <pointer-type-def type-id='type-id-267' size-in-bits='64' id='type-id-852'/>
    <qualified-type-def type-id='type-id-852' const='yes' id='type-id-853'/>
    <pointer-type-def type-id='type-id-273' size-in-bits='64' id='type-id-854'/>
    <qualified-type-def type-id='type-id-854' const='yes' id='type-id-855'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-856'/>
    <qualified-type-def type-id='type-id-856' const='yes' id='type-id-857'/>
    <pointer-type-def type-id='type-id-325' size-in-bits='64' id='type-id-858'/>
    <qualified-type-def type-id='type-id-858' const='yes' id='type-id-859'/>
    <pointer-type-def type-id='type-id-860' size-in-bits='64' id='type-id-861'/>
    <qualified-type-def type-id='type-id-861' const='yes' id='type-id-862'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-863'/>
    <qualified-type-def type-id='type-id-863' const='yes' id='type-id-864'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-865'/>
    <reference-type-def kind='lvalue' type-id='type-id-49' size-in-bits='64' id='type-id-866'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-867'/>
    <reference-type-def kind='lvalue' type-id='type-id-51' size-in-bits='64' id='type-id-868'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-869'/>
    <reference-type-def kind='lvalue' type-id='type-id-202' size-in-bits='64' id='type-id-870'/>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' id='type-id-212'/>
    <qualified-type-def type-id='type-id-212' const='yes' id='type-id-871'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-872'/>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-209'/>
    <reference-type-def kind='lvalue' type-id='type-id-206' size-in-bits='64' id='type-id-873'/>
    <reference-type-def kind='lvalue' type-id='type-id-282' size-in-bits='64' id='type-id-285'/>
    <pointer-type-def type-id='type-id-282' size-in-bits='64' id='type-id-874'/>
    <qualified-type-def type-id='type-id-874' const='yes' id='type-id-283'/>
    <reference-type-def kind='lvalue' type-id='type-id-284' size-in-bits='64' id='type-id-875'/>
    <pointer-type-def type-id='type-id-284' size-in-bits='64' id='type-id-876'/>
    <qualified-type-def type-id='type-id-876' const='yes' id='type-id-877'/>
    <reference-type-def kind='lvalue' type-id='type-id-878' size-in-bits='64' id='type-id-70'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-879'/>
    <pointer-type-def type-id='type-id-880' size-in-bits='64' id='type-id-68'/>
    <pointer-type-def type-id='type-id-583' size-in-bits='64' id='type-id-881'/>
    <qualified-type-def type-id='type-id-881' const='yes' id='type-id-882'/>
    <pointer-type-def type-id='type-id-586' size-in-bits='64' id='type-id-883'/>
    <qualified-type-def type-id='type-id-883' const='yes' id='type-id-884'/>
    <reference-type-def kind='lvalue' type-id='type-id-259' size-in-bits='64' id='type-id-885'/>
    <pointer-type-def type-id='type-id-259' size-in-bits='64' id='type-id-886'/>
    <qualified-type-def type-id='type-id-886' const='yes' id='type-id-887'/>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' id='type-id-888'/>
    <qualified-type-def type-id='type-id-888' const='yes' id='type-id-889'/>
    <pointer-type-def type-id='type-id-890' size-in-bits='64' id='type-id-210'/>
    <reference-type-def kind='lvalue' type-id='type-id-891' size-in-bits='64' id='type-id-321'/>
    <reference-type-def kind='lvalue' type-id='type-id-186' size-in-bits='64' id='type-id-892'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-893'/>
    <qualified-type-def type-id='type-id-893' const='yes' id='type-id-894'/>
    <pointer-type-def type-id='type-id-187' size-in-bits='64' id='type-id-191'/>
    <reference-type-def kind='lvalue' type-id='type-id-192' size-in-bits='64' id='type-id-895'/>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' id='type-id-896'/>
    <qualified-type-def type-id='type-id-896' const='yes' id='type-id-897'/>
    <reference-type-def kind='lvalue' type-id='type-id-194' size-in-bits='64' id='type-id-898'/>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-899'/>
    <reference-type-def kind='lvalue' type-id='type-id-605' size-in-bits='64' id='type-id-900'/>
    <pointer-type-def type-id='type-id-605' size-in-bits='64' id='type-id-214'/>
    <pointer-type-def type-id='type-id-609' size-in-bits='64' id='type-id-901'/>
    <pointer-type-def type-id='type-id-612' size-in-bits='64' id='type-id-902'/>
    <qualified-type-def type-id='type-id-902' const='yes' id='type-id-903'/>
    <reference-type-def kind='lvalue' type-id='type-id-279' size-in-bits='64' id='type-id-904'/>
    <pointer-type-def type-id='type-id-279' size-in-bits='64' id='type-id-905'/>
    <pointer-type-def type-id='type-id-906' size-in-bits='64' id='type-id-280'/>
    <pointer-type-def type-id='type-id-316' size-in-bits='64' id='type-id-907'/>
    <pointer-type-def type-id='type-id-908' size-in-bits='64' id='type-id-200'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-69'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-909'/>
    <reference-type-def kind='lvalue' type-id='type-id-910' size-in-bits='64' id='type-id-324'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-911'/>
    <qualified-type-def type-id='type-id-911' const='yes' id='type-id-912'/>
    <reference-type-def kind='lvalue' type-id='type-id-197' size-in-bits='64' id='type-id-913'/>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' id='type-id-198'/>
    <reference-type-def kind='lvalue' type-id='type-id-38' size-in-bits='64' id='type-id-914'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-915'/>
    <qualified-type-def type-id='type-id-915' const='yes' id='type-id-916'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-917'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-42'/>
    <qualified-type-def type-id='type-id-42' const='yes' id='type-id-918'/>
    <reference-type-def kind='lvalue' type-id='type-id-43' size-in-bits='64' id='type-id-919'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-920'/>
    <qualified-type-def type-id='type-id-920' const='yes' id='type-id-921'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-922'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-46'/>
    <reference-type-def kind='lvalue' type-id='type-id-213' size-in-bits='64' id='type-id-923'/>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-924'/>
    <qualified-type-def type-id='type-id-924' const='yes' id='type-id-925'/>
    <reference-type-def kind='lvalue' type-id='type-id-95' size-in-bits='64' id='type-id-926'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-309'/>
    <qualified-type-def type-id='type-id-309' const='yes' id='type-id-927'/>
    <pointer-type-def type-id='type-id-250' size-in-bits='64' id='type-id-928'/>
    <qualified-type-def type-id='type-id-928' const='yes' id='type-id-929'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-930'/>
    <qualified-type-def type-id='type-id-930' const='yes' id='type-id-931'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-932'/>
    <reference-type-def kind='lvalue' type-id='type-id-232' size-in-bits='64' id='type-id-933'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' id='type-id-934'/>
    <qualified-type-def type-id='type-id-934' const='yes' id='type-id-935'/>
    <reference-type-def kind='lvalue' type-id='type-id-225' size-in-bits='64' id='type-id-936'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-937'/>
    <qualified-type-def type-id='type-id-937' const='yes' id='type-id-938'/>
    <reference-type-def kind='lvalue' type-id='type-id-238' size-in-bits='64' id='type-id-939'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-940'/>
    <reference-type-def kind='lvalue' type-id='type-id-242' size-in-bits='64' id='type-id-941'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-942'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-943'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-944'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-945'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-946'/>
    <reference-type-def kind='lvalue' type-id='type-id-139' size-in-bits='64' id='type-id-947'/>
    <reference-type-def kind='lvalue' type-id='type-id-141' size-in-bits='64' id='type-id-948'/>
    <reference-type-def kind='lvalue' type-id='type-id-145' size-in-bits='64' id='type-id-949'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-950'/>
    <qualified-type-def type-id='type-id-950' const='yes' id='type-id-951'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-952'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-148'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-149'/>
    <reference-type-def kind='lvalue' type-id='type-id-152' size-in-bits='64' id='type-id-953'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-954'/>
    <reference-type-def kind='lvalue' type-id='type-id-154' size-in-bits='64' id='type-id-955'/>
    <reference-type-def kind='lvalue' type-id='type-id-143' size-in-bits='64' id='type-id-956'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-957'/>
    <reference-type-def kind='lvalue' type-id='type-id-151' size-in-bits='64' id='type-id-167'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-165'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-958'/>
    <reference-type-def kind='lvalue' type-id='type-id-172' size-in-bits='64' id='type-id-171'/>
    <reference-type-def kind='lvalue' type-id='type-id-176' size-in-bits='64' id='type-id-175'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-959'/>
    <reference-type-def kind='lvalue' type-id='type-id-180' size-in-bits='64' id='type-id-960'/>
    <reference-type-def kind='lvalue' type-id='type-id-181' size-in-bits='64' id='type-id-961'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-962'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-963'/>
    <reference-type-def kind='lvalue' type-id='type-id-87' size-in-bits='64' id='type-id-964'/>
    <reference-type-def kind='lvalue' type-id='type-id-89' size-in-bits='64' id='type-id-965'/>
    <reference-type-def kind='lvalue' type-id='type-id-94' size-in-bits='64' id='type-id-966'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-967'/>
    <qualified-type-def type-id='type-id-967' const='yes' id='type-id-968'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-969'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-97'/>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-98'/>
    <reference-type-def kind='lvalue' type-id='type-id-101' size-in-bits='64' id='type-id-970'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-971'/>
    <reference-type-def kind='lvalue' type-id='type-id-103' size-in-bits='64' id='type-id-972'/>
    <reference-type-def kind='lvalue' type-id='type-id-92' size-in-bits='64' id='type-id-973'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-974'/>
    <reference-type-def kind='lvalue' type-id='type-id-100' size-in-bits='64' id='type-id-117'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-115'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-975'/>
    <reference-type-def kind='lvalue' type-id='type-id-124' size-in-bits='64' id='type-id-123'/>
    <reference-type-def kind='lvalue' type-id='type-id-128' size-in-bits='64' id='type-id-127'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-976'/>
    <reference-type-def kind='lvalue' type-id='type-id-132' size-in-bits='64' id='type-id-977'/>
    <reference-type-def kind='lvalue' type-id='type-id-133' size-in-bits='64' id='type-id-978'/>
    <pointer-type-def type-id='type-id-287' size-in-bits='64' id='type-id-291'/>
    <reference-type-def kind='lvalue' type-id='type-id-290' size-in-bits='64' id='type-id-288'/>
    <pointer-type-def type-id='type-id-290' size-in-bits='64' id='type-id-292'/>
    <reference-type-def kind='lvalue' type-id='type-id-286' size-in-bits='64' id='type-id-979'/>
    <pointer-type-def type-id='type-id-286' size-in-bits='64' id='type-id-289'/>
    <pointer-type-def type-id='type-id-293' size-in-bits='64' id='type-id-980'/>
    <qualified-type-def type-id='type-id-980' const='yes' id='type-id-981'/>
    <pointer-type-def type-id='type-id-146' size-in-bits='64' id='type-id-982'/>
    <reference-type-def kind='lvalue' type-id='type-id-196' size-in-bits='64' id='type-id-983'/>
    <pointer-type-def type-id='type-id-196' size-in-bits='64' id='type-id-984'/>
    <reference-type-def kind='lvalue' type-id='type-id-235' size-in-bits='64' id='type-id-985'/>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-986'/>
    <qualified-type-def type-id='type-id-986' const='yes' id='type-id-298'/>
    <reference-type-def kind='lvalue' type-id='type-id-229' size-in-bits='64' id='type-id-987'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-988'/>
    <qualified-type-def type-id='type-id-988' const='yes' id='type-id-989'/>
    <pointer-type-def type-id='type-id-301' size-in-bits='64' id='type-id-990'/>
    <qualified-type-def type-id='type-id-990' const='yes' id='type-id-991'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-992'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-993'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-994'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-995'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-996'/>
    <pointer-type-def type-id='type-id-303' size-in-bits='64' id='type-id-304'/>
    <qualified-type-def type-id='type-id-304' const='yes' id='type-id-997'/>
    <pointer-type-def type-id='type-id-312' size-in-bits='64' id='type-id-328'/>
    <qualified-type-def type-id='type-id-328' const='yes' id='type-id-314'/>
    <reference-type-def kind='lvalue' type-id='type-id-315' size-in-bits='64' id='type-id-320'/>
    <pointer-type-def type-id='type-id-315' size-in-bits='64' id='type-id-322'/>
    <qualified-type-def type-id='type-id-322' const='yes' id='type-id-317'/>
    <reference-type-def kind='lvalue' type-id='type-id-305' size-in-bits='64' id='type-id-311'/>
    <pointer-type-def type-id='type-id-305' size-in-bits='64' id='type-id-306'/>
    <qualified-type-def type-id='type-id-306' const='yes' id='type-id-308'/>
    <pointer-type-def type-id='type-id-326' size-in-bits='64' id='type-id-998'/>
    <qualified-type-def type-id='type-id-998' const='yes' id='type-id-999'/>
    <class-decl name='XML_ParserStruct' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-388'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-389'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-390'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-391'/>
    <class-decl name='wxCSConv' visibility='default' is-declaration-only='yes' id='type-id-860'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxCSConv' mangled-name='_ZN8wxCSConvD1Ev' filepath='include/wx/strconv.h' line='502' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-861' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxCSConv' mangled-name='_ZN8wxCSConvD4Ev' filepath='include/wx/strconv.h' line='502' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-861' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEvent' visibility='default' is-declaration-only='yes' id='type-id-878'/>
    <class-decl name='wxEventFunctor' visibility='default' is-declaration-only='yes' id='type-id-67'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-879' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD4Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-879' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEvtHandler' visibility='default' is-declaration-only='yes' id='type-id-880'/>
    <class-decl name='wxFileInputStream' visibility='default' is-declaration-only='yes' id='type-id-583'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFileInputStream' mangled-name='_ZN17wxFileInputStreamD1Ev' filepath='include/wx/wfstream.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-881' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFileInputStream' mangled-name='_ZN17wxFileInputStreamD4Ev' filepath='include/wx/wfstream.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-881' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='IsOk' mangled-name='_ZNK17wxFileInputStream4IsOkEv' filepath='include/wx/wfstream.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-585' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxFileOutputStream' visibility='default' is-declaration-only='yes' id='type-id-586'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFileOutputStream' mangled-name='_ZN18wxFileOutputStreamD1Ev' filepath='include/wx/wfstream.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-883' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFileOutputStream' mangled-name='_ZN18wxFileOutputStreamD4Ev' filepath='include/wx/wfstream.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-883' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='IsOk' mangled-name='_ZNK18wxFileOutputStream4IsOkEv' filepath='include/wx/wfstream.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-588' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxHashTable' visibility='default' is-declaration-only='yes' id='type-id-890'/>
    <class-decl name='wxHashTable_Node' visibility='default' is-declaration-only='yes' id='type-id-205'/>
    <class-decl name='wxInputStream' visibility='default' is-declaration-only='yes' id='type-id-891'/>
    <class-decl name='wxLog' visibility='default' is-declaration-only='yes' id='type-id-1000'/>
    <class-decl name='wxMBConv' visibility='default' is-declaration-only='yes' id='type-id-605'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMBConv' mangled-name='_ZN8wxMBConvD0Ev' filepath='include/wx/strconv.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-214' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMBConv' mangled-name='_ZN8wxMBConvD2Ev' filepath='include/wx/strconv.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-214' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMBConv' mangled-name='_ZN8wxMBConvD4Ev' filepath='include/wx/strconv.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-214' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='0'>
        <function-decl name='ToWChar' mangled-name='_ZNK8wxMBConv7ToWCharEPwmPKcm' filepath='include/wx/strconv.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-608' is-artificial='yes'/>
          <parameter type-id='type-id-842'/>
          <parameter type-id='type-id-119'/>
          <parameter type-id='type-id-188'/>
          <parameter type-id='type-id-119'/>
          <return type-id='type-id-119'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='1'>
        <function-decl name='FromWChar' mangled-name='_ZNK8wxMBConv9FromWCharEPcmPKwm' filepath='include/wx/strconv.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-608' is-artificial='yes'/>
          <parameter type-id='type-id-251'/>
          <parameter type-id='type-id-119'/>
          <parameter type-id='type-id-218'/>
          <parameter type-id='type-id-119'/>
          <return type-id='type-id-119'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetMaxCharLen' mangled-name='_ZNK8wxMBConv13GetMaxCharLenEv' filepath='include/wx/strconv.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-608' is-artificial='yes'/>
          <return type-id='type-id-119'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='GetMBNulLen' mangled-name='_ZNK8wxMBConv11GetMBNulLenEv' filepath='include/wx/strconv.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-608' is-artificial='yes'/>
          <return type-id='type-id-119'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='IsUTF8' mangled-name='_ZNK8wxMBConv6IsUTF8Ev' filepath='include/wx/strconv.h' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-608' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='MB2WC' mangled-name='_ZNK8wxMBConv5MB2WCEPwPKcm' filepath='include/wx/strconv.h' line='165' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-608' is-artificial='yes'/>
          <parameter type-id='type-id-842'/>
          <parameter type-id='type-id-188'/>
          <parameter type-id='type-id-119'/>
          <return type-id='type-id-119'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='6'>
        <function-decl name='WC2MB' mangled-name='_ZNK8wxMBConv5WC2MBEPcPKwm' filepath='include/wx/strconv.h' line='166' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-608' is-artificial='yes'/>
          <parameter type-id='type-id-251'/>
          <parameter type-id='type-id-218'/>
          <parameter type-id='type-id-119'/>
          <return type-id='type-id-119'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxMBConvStrictUTF8' visibility='default' is-declaration-only='yes' id='type-id-609'>
      <member-function access='public' const='yes' vtable-offset='0'>
        <function-decl name='ToWChar' mangled-name='_ZNK18wxMBConvStrictUTF87ToWCharEPwmPKcm' filepath='include/wx/strconv.h' line='347' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-611' is-artificial='yes'/>
          <parameter type-id='type-id-842'/>
          <parameter type-id='type-id-119'/>
          <parameter type-id='type-id-188'/>
          <parameter type-id='type-id-119'/>
          <return type-id='type-id-119'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='1'>
        <function-decl name='FromWChar' mangled-name='_ZNK18wxMBConvStrictUTF89FromWCharEPcmPKwm' filepath='include/wx/strconv.h' line='349' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-611' is-artificial='yes'/>
          <parameter type-id='type-id-251'/>
          <parameter type-id='type-id-119'/>
          <parameter type-id='type-id-218'/>
          <parameter type-id='type-id-119'/>
          <return type-id='type-id-119'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetMaxCharLen' mangled-name='_ZNK18wxMBConvStrictUTF813GetMaxCharLenEv' filepath='include/wx/strconv.h' line='352' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-611' is-artificial='yes'/>
          <return type-id='type-id-119'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='IsUTF8' mangled-name='_ZNK18wxMBConvStrictUTF86IsUTF8Ev' filepath='include/wx/strconv.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-611' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='7'>
        <function-decl name='Clone' mangled-name='_ZNK18wxMBConvStrictUTF85CloneEv' filepath='include/wx/strconv.h' line='354' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-611' is-artificial='yes'/>
          <return type-id='type-id-214'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxMBConvUTF8' visibility='default' is-declaration-only='yes' id='type-id-612'>
      <member-type access='public'>
        <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='include/wx/strconv.h' line='365' column='1' id='type-id-1001'>
          <underlying-type type-id='type-id-28'/>
          <enumerator name='MAP_INVALID_UTF8_NOT' value='0'/>
          <enumerator name='MAP_INVALID_UTF8_TO_PUA' value='1'/>
          <enumerator name='MAP_INVALID_UTF8_TO_OCTAL' value='2'/>
        </enum-decl>
      </member-type>
      <member-function access='public' const='yes' vtable-offset='0'>
        <function-decl name='ToWChar' mangled-name='_ZNK12wxMBConvUTF87ToWCharEPwmPKcm' filepath='include/wx/strconv.h' line='373' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-614' is-artificial='yes'/>
          <parameter type-id='type-id-842'/>
          <parameter type-id='type-id-119'/>
          <parameter type-id='type-id-188'/>
          <parameter type-id='type-id-119'/>
          <return type-id='type-id-119'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='1'>
        <function-decl name='FromWChar' mangled-name='_ZNK12wxMBConvUTF89FromWCharEPcmPKwm' filepath='include/wx/strconv.h' line='375' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-614' is-artificial='yes'/>
          <parameter type-id='type-id-251'/>
          <parameter type-id='type-id-119'/>
          <parameter type-id='type-id-218'/>
          <parameter type-id='type-id-119'/>
          <return type-id='type-id-119'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetMaxCharLen' mangled-name='_ZNK12wxMBConvUTF813GetMaxCharLenEv' filepath='include/wx/strconv.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-614' is-artificial='yes'/>
          <return type-id='type-id-119'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='IsUTF8' mangled-name='_ZNK12wxMBConvUTF86IsUTF8Ev' filepath='include/wx/strconv.h' line='384' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-614' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='7'>
        <function-decl name='Clone' mangled-name='_ZNK12wxMBConvUTF85CloneEv' filepath='include/wx/strconv.h' line='380' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-614' is-artificial='yes'/>
          <return type-id='type-id-214'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxMutexInternal' visibility='default' is-declaration-only='yes' id='type-id-906'/>
    <class-decl name='wxObject' visibility='default' is-declaration-only='yes' id='type-id-316'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-907' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-907' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD4Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-907' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK8wxObject12GetClassInfoEv' filepath='include/wx/object.h' line='446' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-619' is-artificial='yes'/>
          <return type-id='type-id-212'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='3'>
        <function-decl name='CreateRefData' mangled-name='_ZNK8wxObject13CreateRefDataEv' filepath='include/wx/object.h' line='464' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-619' is-artificial='yes'/>
          <return type-id='type-id-909'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='4'>
        <function-decl name='CloneRefData' mangled-name='_ZNK8wxObject12CloneRefDataEPK12wxRefCounter' filepath='include/wx/object.h' line='467' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-619' is-artificial='yes'/>
          <parameter type-id='type-id-622'/>
          <return type-id='type-id-909'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxOutputStream' visibility='default' is-declaration-only='yes' id='type-id-910'/>
    <class-decl name='wxThread' visibility='default' is-declaration-only='yes' id='type-id-287'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-291' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD4Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-291' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='0'>
        <function-decl name='TestDestroy' mangled-name='_ZN8wxThread11TestDestroyEv' filepath='include/wx/thread.h' line='593' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-291' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='4'>
        <function-decl name='OnDelete' mangled-name='_ZN8wxThread8OnDeleteEv' filepath='include/wx/thread.h' line='622' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-291' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='5'>
        <function-decl name='OnKill' mangled-name='_ZN8wxThread6OnKillEv' filepath='include/wx/thread.h' line='626' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-291' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='6'>
        <function-decl name='OnExit' mangled-name='_ZN8wxThread6OnExitEv' filepath='include/wx/thread.h' line='631' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-291' is-artificial='yes'/>
          <return type-id='type-id-32'/>
        </function-decl>
      </member-function>
    </class-decl>
    <namespace-decl name='wxPrivate'>
      <class-decl name='UntypedBufferData' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='30' column='1' id='type-id-41'>
        <member-type access='public'>
          <enum-decl name='Kind' filepath='include/wx/buffer.h' line='32' column='1' id='type-id-1002'>
            <underlying-type type-id='type-id-28'/>
            <enumerator name='Owned' value='0'/>
            <enumerator name='NonOwned' value='1'/>
          </enum-decl>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='m_str' type-id='type-id-16' visibility='default' filepath='include/wx/buffer.h' line='47' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='m_length' type-id='type-id-119' visibility='default' filepath='include/wx/buffer.h' line='48' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='m_ref' type-id='type-id-30' visibility='default' filepath='include/wx/buffer.h' line='51' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='144'>
          <var-decl name='m_owned' type-id='type-id-3' visibility='default' filepath='include/wx/buffer.h' line='53' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <function-decl name='XML_ParserCreate' filepath='/usr/include/expat.h' line='231' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-427'/>
      <return type-id='type-id-327'/>
    </function-decl>
    <function-decl name='XML_SetElementHandler' filepath='/usr/include/expat.h' line='548' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-327'/>
      <parameter type-id='type-id-333'/>
      <parameter type-id='type-id-335'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='XML_SetCharacterDataHandler' filepath='/usr/include/expat.h' line='558' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-327'/>
      <parameter type-id='type-id-337'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='XML_SetProcessingInstructionHandler' filepath='/usr/include/expat.h' line='562' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-327'/>
      <parameter type-id='type-id-339'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='XML_SetCommentHandler' filepath='/usr/include/expat.h' line='565' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-327'/>
      <parameter type-id='type-id-340'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='XML_SetCdataSectionHandler' filepath='/usr/include/expat.h' line='568' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-327'/>
      <parameter type-id='type-id-342'/>
      <parameter type-id='type-id-343'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='XML_SetDefaultHandler' filepath='/usr/include/expat.h' line='585' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-327'/>
      <parameter type-id='type-id-344'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='XML_SetDoctypeDeclHandler' filepath='/usr/include/expat.h' line='595' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-327'/>
      <parameter type-id='type-id-346'/>
      <parameter type-id='type-id-347'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='XML_SetUnknownEncodingHandler' filepath='/usr/include/expat.h' line='645' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-327'/>
      <parameter type-id='type-id-352'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='XML_SetUserData' filepath='/usr/include/expat.h' line='675' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-327'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='XML_Parse' filepath='/usr/include/expat.h' line='783' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-327'/>
      <parameter type-id='type-id-188'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-330'/>
    </function-decl>
    <function-decl name='XML_GetErrorCode' filepath='/usr/include/expat.h' line='922' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-327'/>
      <return type-id='type-id-331'/>
    </function-decl>
    <function-decl name='XML_GetCurrentLineNumber' filepath='/usr/include/expat.h' line='944' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-327'/>
      <return type-id='type-id-355'/>
    </function-decl>
    <function-decl name='XML_ParserFree' filepath='/usr/include/expat.h' line='991' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-327'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='XML_ErrorString' filepath='/usr/include/expat.h' line='995' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-331'/>
      <return type-id='type-id-430'/>
    </function-decl>
    <function-decl name='setlocale' filepath='/usr/include/locale.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-188'/>
      <return type-id='type-id-251'/>
    </function-decl>
    <function-decl name='localeconv' filepath='/usr/include/locale.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-777'/>
    </function-decl>
    <function-decl name='remove' filepath='/usr/include/stdio.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-188'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='rename' filepath='/usr/include/stdio.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-188'/>
      <parameter type-id='type-id-188'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-386'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='tmpnam' filepath='/usr/include/stdio.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <return type-id='type-id-251'/>
    </function-decl>
    <function-decl name='fflush' filepath='/usr/include/stdio.h' line='230' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-386'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='setbuf' filepath='/usr/include/stdio.h' line='328' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-386'/>
      <parameter type-id='type-id-251'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='setvbuf' filepath='/usr/include/stdio.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-386'/>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='fgetc' filepath='/usr/include/stdio.h' line='513' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-386'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='getc' filepath='/usr/include/stdio.h' line='514' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-386'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='getchar' filepath='/usr/include/stdio.h' line='520' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='fgets' filepath='/usr/include/stdio.h' line='592' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-386'/>
      <return type-id='type-id-251'/>
    </function-decl>
    <function-decl name='ungetc' filepath='/usr/include/stdio.h' line='668' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-386'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='fread' filepath='/usr/include/stdio.h' line='675' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-386'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='fseek' filepath='/usr/include/stdio.h' line='713' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-386'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='ftell' filepath='/usr/include/stdio.h' line='718' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-386'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rewind' filepath='/usr/include/stdio.h' line='723' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-386'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='clearerr' filepath='/usr/include/stdio.h' line='786' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-386'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='feof' filepath='/usr/include/stdio.h' line='788' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-386'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='ferror' filepath='/usr/include/stdio.h' line='790' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-386'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='perror' filepath='/usr/include/stdio.h' line='804' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-188'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='atof' filepath='/usr/include/stdlib.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-188'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atoi' filepath='/usr/include/stdlib.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-188'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='atol' filepath='/usr/include/stdlib.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-188'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='atoll' filepath='/usr/include/stdlib.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-188'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='strtod' filepath='/usr/include/stdlib.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-188'/>
      <parameter type-id='type-id-425'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='strtof' filepath='/usr/include/stdlib.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-188'/>
      <parameter type-id='type-id-425'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='strtold' filepath='/usr/include/stdlib.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-188'/>
      <parameter type-id='type-id-425'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='strtol' filepath='/usr/include/stdlib.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-188'/>
      <parameter type-id='type-id-425'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='strtoul' filepath='/usr/include/stdlib.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-188'/>
      <parameter type-id='type-id-425'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='strtoll' filepath='/usr/include/stdlib.h' line='201' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-188'/>
      <parameter type-id='type-id-425'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='strtoull' filepath='/usr/include/stdlib.h' line='206' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-188'/>
      <parameter type-id='type-id-425'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='rand' filepath='/usr/include/stdlib.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='srand' filepath='/usr/include/stdlib.h' line='456' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='555' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='atexit' filepath='/usr/include/stdlib.h' line='602' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-832'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='quick_exit' filepath='/usr/include/stdlib.h' line='630' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='641' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-188'/>
      <return type-id='type-id-251'/>
    </function-decl>
    <function-decl name='system' filepath='/usr/include/stdlib.h' line='791' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-188'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='bsearch' filepath='/usr/include/stdlib.h' line='828' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-366'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='qsort' filepath='/usr/include/stdlib.h' line='838' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-366'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='div' filepath='/usr/include/stdlib.h' line='860' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-359'/>
    </function-decl>
    <function-decl name='ldiv' filepath='/usr/include/stdlib.h' line='862' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-361'/>
    </function-decl>
    <function-decl name='lldiv' filepath='/usr/include/stdlib.h' line='866' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-363'/>
    </function-decl>
    <function-decl name='mblen' filepath='/usr/include/stdlib.h' line='930' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-188'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='mbtowc' filepath='/usr/include/stdlib.h' line='933' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-842'/>
      <parameter type-id='type-id-188'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='wctomb' filepath='/usr/include/stdlib.h' line='937' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='mbstowcs' filepath='/usr/include/stdlib.h' line='941' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-842'/>
      <parameter type-id='type-id-188'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='wcstombs' filepath='/usr/include/stdlib.h' line='945' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='memcmp' filepath='/usr/include/string.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='strcmp' filepath='/usr/include/string.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-188'/>
      <parameter type-id='type-id-188'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-188'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='wcscpy' filepath='/usr/include/wchar.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-842'/>
      <parameter type-id='type-id-218'/>
      <return type-id='type-id-842'/>
    </function-decl>
    <function-decl name='wcsncpy' filepath='/usr/include/wchar.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-842'/>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-842'/>
    </function-decl>
    <function-decl name='wcscat' filepath='/usr/include/wchar.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-842'/>
      <parameter type-id='type-id-218'/>
      <return type-id='type-id-842'/>
    </function-decl>
    <function-decl name='wcsncat' filepath='/usr/include/wchar.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-842'/>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-842'/>
    </function-decl>
    <function-decl name='wcscmp' filepath='/usr/include/wchar.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-218'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='wcsncmp' filepath='/usr/include/wchar.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='wcscoll' filepath='/usr/include/wchar.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-218'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='wcsxfrm' filepath='/usr/include/wchar.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-842'/>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='wcscspn' filepath='/usr/include/wchar.h' line='188' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-218'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='wcsspn' filepath='/usr/include/wchar.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-218'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='wcstok' filepath='/usr/include/wchar.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-842'/>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-845'/>
      <return type-id='type-id-842'/>
    </function-decl>
    <function-decl name='wcslen' filepath='/usr/include/wchar.h' line='223' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-218'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='wmemcmp' filepath='/usr/include/wchar.h' line='259' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='wmemcpy' filepath='/usr/include/wchar.h' line='263' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-842'/>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-842'/>
    </function-decl>
    <function-decl name='wmemmove' filepath='/usr/include/wchar.h' line='268' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-842'/>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-842'/>
    </function-decl>
    <function-decl name='wmemset' filepath='/usr/include/wchar.h' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-842'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-842'/>
    </function-decl>
    <function-decl name='btowc' filepath='/usr/include/wchar.h' line='285' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-385'/>
    </function-decl>
    <function-decl name='wctob' filepath='/usr/include/wchar.h' line='289' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-385'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='mbsinit' filepath='/usr/include/wchar.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-468'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='mbrtowc' filepath='/usr/include/wchar.h' line='297' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-842'/>
      <parameter type-id='type-id-188'/>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-782'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='wcrtomb' filepath='/usr/include/wchar.h' line='302' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-782'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='mbrlen' filepath='/usr/include/wchar.h' line='308' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-188'/>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-782'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='mbsrtowcs' filepath='/usr/include/wchar.h' line='338' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-842'/>
      <parameter type-id='type-id-463'/>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-782'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='wcsrtombs' filepath='/usr/include/wchar.h' line='344' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-548'/>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-782'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='wcstod' filepath='/usr/include/wchar.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-845'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='wcstof' filepath='/usr/include/wchar.h' line='383' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-845'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='wcstold' filepath='/usr/include/wchar.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-845'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='wcstol' filepath='/usr/include/wchar.h' line='429' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-845'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='wcstoul' filepath='/usr/include/wchar.h' line='434' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-845'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='wcstoll' filepath='/usr/include/wchar.h' line='442' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-845'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='wcstoull' filepath='/usr/include/wchar.h' line='449' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-845'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='fwide' filepath='/usr/include/wchar.h' line='588' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-392'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='fwprintf' filepath='/usr/include/wchar.h' line='595' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-392'/>
      <parameter type-id='type-id-218'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='wprintf' filepath='/usr/include/wchar.h' line='602' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-218'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='swprintf' filepath='/usr/include/wchar.h' line='605' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-842'/>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-218'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='vfwprintf' filepath='/usr/include/wchar.h' line='613' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-392'/>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-827'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='vwprintf' filepath='/usr/include/wchar.h' line='621' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-827'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='vswprintf' filepath='/usr/include/wchar.h' line='626' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-842'/>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-827'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='fgetwc' filepath='/usr/include/wchar.h' line='744' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-392'/>
      <return type-id='type-id-385'/>
    </function-decl>
    <function-decl name='getwc' filepath='/usr/include/wchar.h' line='745' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-392'/>
      <return type-id='type-id-385'/>
    </function-decl>
    <function-decl name='getwchar' filepath='/usr/include/wchar.h' line='751' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-385'/>
    </function-decl>
    <function-decl name='fputwc' filepath='/usr/include/wchar.h' line='758' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-392'/>
      <return type-id='type-id-385'/>
    </function-decl>
    <function-decl name='putwc' filepath='/usr/include/wchar.h' line='759' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-392'/>
      <return type-id='type-id-385'/>
    </function-decl>
    <function-decl name='putwchar' filepath='/usr/include/wchar.h' line='765' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-385'/>
    </function-decl>
    <function-decl name='fgetws' filepath='/usr/include/wchar.h' line='773' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-842'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-392'/>
      <return type-id='type-id-842'/>
    </function-decl>
    <function-decl name='fputws' filepath='/usr/include/wchar.h' line='780' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-392'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='ungetwc' filepath='/usr/include/wchar.h' line='788' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-385'/>
      <parameter type-id='type-id-392'/>
      <return type-id='type-id-385'/>
    </function-decl>
    <function-decl name='wcsftime' filepath='/usr/include/wchar.h' line='852' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-842'/>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-218'/>
      <parameter type-id='type-id-541'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <namespace-decl name='std'>
      <class-decl name='allocator_traits&lt;std::allocator&lt;char&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='411' column='1' id='type-id-1003'>
        <member-type access='public'>
          <typedef-decl name='allocator_type' type-id='type-id-492' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='414' column='1' id='type-id-498'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-4' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='417' column='1' id='type-id-1004'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-251' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='420' column='1' id='type-id-1005'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_pointer' type-id='type-id-188' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='423' column='1' id='type-id-1006'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-16' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='429' column='1' id='type-id-1007'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1009' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='435' column='1' id='type-id-1008'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-492' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='450' column='1' id='type-id-1010'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;wchar_t&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='411' column='1' id='type-id-1011'>
        <member-type access='public'>
          <typedef-decl name='allocator_type' type-id='type-id-495' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='414' column='1' id='type-id-501'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-33' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='417' column='1' id='type-id-1012'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-842' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='420' column='1' id='type-id-1013'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_pointer' type-id='type-id-218' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='423' column='1' id='type-id-1014'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-16' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='429' column='1' id='type-id-1015'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1009' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='435' column='1' id='type-id-1016'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-495' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='450' column='1' id='type-id-1017'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator&lt;char&gt;' size-in-bits='8' visibility='default' filepath='/usr/include/c++/11/bits/allocator.h' line='124' column='1' id='type-id-492'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-414'/>
      </class-decl>
      <class-decl name='allocator&lt;wchar_t&gt;' size-in-bits='8' visibility='default' filepath='/usr/include/c++/11/bits/allocator.h' line='124' column='1' id='type-id-495'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-416'/>
      </class-decl>
      <class-decl name='char_traits&lt;wchar_t&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/char_traits.h' line='479' column='1' id='type-id-1018'>
        <member-type access='public'>
          <typedef-decl name='char_type' type-id='type-id-33' filepath='/usr/include/c++/11/bits/char_traits.h' line='481' column='1' id='type-id-520'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='int_type' type-id='type-id-385' filepath='/usr/include/c++/11/bits/char_traits.h' line='482' column='1' id='type-id-524'/>
        </member-type>
      </class-decl>
      <class-decl name='__false_type' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/cpp_type_traits.h' line='74' column='1' id='type-id-1019'/>
      <class-decl name='input_iterator_tag' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='93' column='1' id='type-id-1020'/>
      <class-decl name='forward_iterator_tag' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='99' column='1' id='type-id-1021'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1020'/>
      </class-decl>
      <class-decl name='bidirectional_iterator_tag' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='103' column='1' id='type-id-1022'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1021'/>
      </class-decl>
      <class-decl name='random_access_iterator_tag' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='107' column='1' id='type-id-1023'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1022'/>
      </class-decl>
      <class-decl name='iterator_traits&lt;char*&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='210' column='1' id='type-id-1024'>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-1026' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='214' column='1' id='type-id-1025'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-251' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='215' column='1' id='type-id-1027'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-422' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='216' column='1' id='type-id-1028'/>
        </member-type>
      </class-decl>
      <class-decl name='iterator_traits&lt;wchar_t*&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='210' column='1' id='type-id-1029'>
        <member-type access='public'>
          <typedef-decl name='iterator_category' type-id='type-id-1023' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='212' column='1' id='type-id-1030'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-1026' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='214' column='1' id='type-id-1031'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-842' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='215' column='1' id='type-id-1032'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-841' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='216' column='1' id='type-id-1033'/>
        </member-type>
      </class-decl>
      <class-decl name='iterator_traits&lt;char const*&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='221' column='1' id='type-id-1034'>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-1026' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='225' column='1' id='type-id-1035'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-188' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='226' column='1' id='type-id-1036'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-460' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='227' column='1' id='type-id-1037'/>
        </member-type>
      </class-decl>
      <class-decl name='iterator_traits&lt;wchar_t const*&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='221' column='1' id='type-id-1038'>
        <member-type access='public'>
          <typedef-decl name='iterator_category' type-id='type-id-1023' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='223' column='1' id='type-id-1039'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-1026' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='225' column='1' id='type-id-1040'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-218' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='226' column='1' id='type-id-1041'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-545' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='227' column='1' id='type-id-1042'/>
        </member-type>
      </class-decl>
      <typedef-decl name='string' type-id='type-id-469' filepath='/usr/include/c++/11/bits/stringfwd.h' line='79' column='1' id='type-id-533'/>
      <typedef-decl name='wstring' type-id='type-id-476' filepath='/usr/include/c++/11/bits/stringfwd.h' line='83' column='1' id='type-id-254'/>
      <class-decl name='initializer_list&lt;char&gt;' size-in-bits='128' visibility='default' filepath='/usr/include/c++/11/initializer_list' line='47' column='1' id='type-id-527'>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1009' filepath='/usr/include/c++/11/initializer_list' line='53' column='1' id='type-id-1043'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='type-id-188' filepath='/usr/include/c++/11/initializer_list' line='54' column='1' id='type-id-1044'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-188' filepath='/usr/include/c++/11/initializer_list' line='55' column='1' id='type-id-1045'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_array' type-id='type-id-1044' visibility='default' filepath='/usr/include/c++/11/initializer_list' line='58' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_len' type-id='type-id-1043' visibility='default' filepath='/usr/include/c++/11/initializer_list' line='59' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='initializer_list&lt;wchar_t&gt;' size-in-bits='128' visibility='default' filepath='/usr/include/c++/11/initializer_list' line='47' column='1' id='type-id-530'>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1009' filepath='/usr/include/c++/11/initializer_list' line='53' column='1' id='type-id-1046'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='type-id-218' filepath='/usr/include/c++/11/initializer_list' line='54' column='1' id='type-id-1047'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-218' filepath='/usr/include/c++/11/initializer_list' line='55' column='1' id='type-id-1048'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_array' type-id='type-id-1047' visibility='default' filepath='/usr/include/c++/11/initializer_list' line='58' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_len' type-id='type-id-1046' visibility='default' filepath='/usr/include/c++/11/initializer_list' line='59' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='basic_string_view&lt;char, std::char_traits&lt;char&gt; &gt;' size-in-bits='128' visibility='default' filepath='/usr/include/c++/11/string_view' line='98' column='1' id='type-id-504'>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-4' filepath='/usr/include/c++/11/string_view' line='108' column='1' id='type-id-508'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_pointer' type-id='type-id-511' filepath='/usr/include/c++/11/string_view' line='110' column='1' id='type-id-1049'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-510' filepath='/usr/include/c++/11/string_view' line='112' column='1' id='type-id-1050'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-511' filepath='/usr/include/c++/11/string_view' line='113' column='1' id='type-id-1051'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1053' filepath='/usr/include/c++/11/string_view' line='115' column='1' id='type-id-1052'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1009' filepath='/usr/include/c++/11/string_view' line='117' column='1' id='type-id-1054'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_len' type-id='type-id-1009' visibility='default' filepath='/usr/include/c++/11/string_view' line='511' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_str' type-id='type-id-188' visibility='default' filepath='/usr/include/c++/11/string_view' line='512' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='basic_string_view&lt;wchar_t, std::char_traits&lt;wchar_t&gt; &gt;' size-in-bits='128' visibility='default' filepath='/usr/include/c++/11/string_view' line='98' column='1' id='type-id-512'>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-33' filepath='/usr/include/c++/11/string_view' line='108' column='1' id='type-id-516'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_pointer' type-id='type-id-519' filepath='/usr/include/c++/11/string_view' line='110' column='1' id='type-id-1055'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-518' filepath='/usr/include/c++/11/string_view' line='112' column='1' id='type-id-1056'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-519' filepath='/usr/include/c++/11/string_view' line='113' column='1' id='type-id-1057'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-1059' filepath='/usr/include/c++/11/string_view' line='115' column='1' id='type-id-1058'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1009' filepath='/usr/include/c++/11/string_view' line='117' column='1' id='type-id-1060'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_len' type-id='type-id-1009' visibility='default' filepath='/usr/include/c++/11/string_view' line='511' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_str' type-id='type-id-218' visibility='default' filepath='/usr/include/c++/11/string_view' line='512' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='remove_reference&lt;std::allocator&lt;wchar_t&gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/type_traits' line='1607' column='1' id='type-id-1061'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-495' filepath='/usr/include/c++/11/type_traits' line='1608' column='1' id='type-id-825'/>
        </member-type>
      </class-decl>
      <typedef-decl name='size_t' type-id='type-id-6' filepath='/usr/include/x86_64-linux-gnu/c++/11/bits/c++config.h' line='280' column='1' id='type-id-1009'/>
      <typedef-decl name='ptrdiff_t' type-id='type-id-23' filepath='/usr/include/x86_64-linux-gnu/c++/11/bits/c++config.h' line='281' column='1' id='type-id-1026'/>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;char const*, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-1062'/>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;char*, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-1063'/>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;wchar_t const*, std::__cxx11::basic_string&lt;wchar_t, std::char_traits&lt;wchar_t&gt;, std::allocator&lt;wchar_t&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-1064'/>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;wchar_t*, std::__cxx11::basic_string&lt;wchar_t, std::char_traits&lt;wchar_t&gt;, std::allocator&lt;wchar_t&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-1065'/>
      <class-decl name='reverse_iterator&lt;char const*&gt;' visibility='default' is-declaration-only='yes' id='type-id-1053'/>
      <class-decl name='reverse_iterator&lt;wchar_t const*&gt;' visibility='default' is-declaration-only='yes' id='type-id-1059'/>
      <class-decl name='type_info' visibility='default' is-declaration-only='yes' id='type-id-536'/>
      <namespace-decl name='__exception_ptr'>
        <class-decl name='exception_ptr' size-in-bits='64' visibility='default' filepath='/usr/include/c++/11/bits/exception_ptr.h' line='86' column='1' id='type-id-488'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='_M_exception_object' type-id='type-id-16' visibility='default' filepath='/usr/include/c++/11/bits/exception_ptr.h' line='88' column='1'/>
          </data-member>
        </class-decl>
      </namespace-decl>
      <namespace-decl name='__cxx11'>
        <class-decl name='basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;' size-in-bits='256' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='85' column='1' id='type-id-469'>
          <member-type access='private'>
            <typedef-decl name='_Char_alloc_type' type-id='type-id-1067' filepath='/usr/include/c++/11/bits/basic_string.h' line='88' column='1' id='type-id-1066'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='allocator_type' type-id='type-id-1066' filepath='/usr/include/c++/11/bits/basic_string.h' line='95' column='1' id='type-id-473'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='size_type' type-id='type-id-1068' filepath='/usr/include/c++/11/bits/basic_string.h' line='96' column='1' id='type-id-792'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-1070' filepath='/usr/include/c++/11/bits/basic_string.h' line='98' column='1' id='type-id-1069'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_reference' type-id='type-id-1072' filepath='/usr/include/c++/11/bits/basic_string.h' line='99' column='1' id='type-id-1071'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='pointer' type-id='type-id-1074' filepath='/usr/include/c++/11/bits/basic_string.h' line='100' column='1' id='type-id-1073'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_pointer' type-id='type-id-1076' filepath='/usr/include/c++/11/bits/basic_string.h' line='101' column='1' id='type-id-1075'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='iterator' type-id='type-id-400' filepath='/usr/include/c++/11/bits/basic_string.h' line='102' column='1' id='type-id-1077'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_iterator' type-id='type-id-397' filepath='/usr/include/c++/11/bits/basic_string.h' line='104' column='1' id='type-id-1078'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_reverse_iterator' type-id='type-id-1062' filepath='/usr/include/c++/11/bits/basic_string.h' line='105' column='1' id='type-id-1079'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reverse_iterator' type-id='type-id-1063' filepath='/usr/include/c++/11/bits/basic_string.h' line='106' column='1' id='type-id-1080'/>
          </member-type>
          <member-type access='protected'>
            <typedef-decl name='__const_iterator' type-id='type-id-1078' filepath='/usr/include/c++/11/bits/basic_string.h' line='116' column='1' id='type-id-1081'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='__sv_type' type-id='type-id-504' filepath='/usr/include/c++/11/bits/basic_string.h' line='122' column='1' id='type-id-1082'/>
          </member-type>
          <member-type access='private'>
            <class-decl name='__sv_wrapper' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='140' column='1' id='type-id-789'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='_M_sv' type-id='type-id-1082' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='143' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <member-type access='private'>
            <class-decl name='_Alloc_hider' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='158' column='1' id='type-id-787'>
              <base-class access='public' layout-offset-in-bits='0' type-id='type-id-492'/>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='_M_p' type-id='type-id-1073' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='171' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <member-type access='private'>
            <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='180' column='1' id='type-id-1083'>
              <data-member access='public'>
                <var-decl name='_M_local_buf' type-id='type-id-5' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='181' column='1'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='_M_allocated_capacity' type-id='type-id-792' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='182' column='1'/>
              </data-member>
            </union-decl>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='_M_dataplus' type-id='type-id-787' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='174' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='_M_string_length' type-id='type-id-792' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='175' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='128'>
            <var-decl name='' type-id='type-id-1083' visibility='default'/>
          </data-member>
        </class-decl>
        <class-decl name='basic_string&lt;wchar_t, std::char_traits&lt;wchar_t&gt;, std::allocator&lt;wchar_t&gt; &gt;' size-in-bits='256' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='85' column='1' id='type-id-476'>
          <member-type access='private'>
            <typedef-decl name='_Char_alloc_type' type-id='type-id-1085' filepath='/usr/include/c++/11/bits/basic_string.h' line='88' column='1' id='type-id-1084'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='allocator_type' type-id='type-id-1084' filepath='/usr/include/c++/11/bits/basic_string.h' line='95' column='1' id='type-id-481'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='size_type' type-id='type-id-1086' filepath='/usr/include/c++/11/bits/basic_string.h' line='96' column='1' id='type-id-486'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-1088' filepath='/usr/include/c++/11/bits/basic_string.h' line='98' column='1' id='type-id-1087'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_reference' type-id='type-id-1090' filepath='/usr/include/c++/11/bits/basic_string.h' line='99' column='1' id='type-id-1089'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='pointer' type-id='type-id-1092' filepath='/usr/include/c++/11/bits/basic_string.h' line='100' column='1' id='type-id-1091'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_pointer' type-id='type-id-1094' filepath='/usr/include/c++/11/bits/basic_string.h' line='101' column='1' id='type-id-1093'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='iterator' type-id='type-id-407' filepath='/usr/include/c++/11/bits/basic_string.h' line='102' column='1' id='type-id-231'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_iterator' type-id='type-id-403' filepath='/usr/include/c++/11/bits/basic_string.h' line='104' column='1' id='type-id-237'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_reverse_iterator' type-id='type-id-1064' filepath='/usr/include/c++/11/bits/basic_string.h' line='105' column='1' id='type-id-1095'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reverse_iterator' type-id='type-id-1065' filepath='/usr/include/c++/11/bits/basic_string.h' line='106' column='1' id='type-id-1096'/>
          </member-type>
          <member-type access='protected'>
            <typedef-decl name='__const_iterator' type-id='type-id-237' filepath='/usr/include/c++/11/bits/basic_string.h' line='116' column='1' id='type-id-1097'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='__sv_type' type-id='type-id-512' filepath='/usr/include/c++/11/bits/basic_string.h' line='122' column='1' id='type-id-1098'/>
          </member-type>
          <member-type access='private'>
            <class-decl name='__sv_wrapper' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='140' column='1' id='type-id-801'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='_M_sv' type-id='type-id-1098' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='143' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <member-type access='private'>
            <class-decl name='_Alloc_hider' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='158' column='1' id='type-id-798'>
              <base-class access='public' layout-offset-in-bits='0' type-id='type-id-495'/>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='_M_p' type-id='type-id-1091' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='171' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <member-type access='private'>
            <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='/usr/include/c++/11/bits/basic_string.h' line='177' column='1' id='type-id-1099'>
              <underlying-type type-id='type-id-28'/>
              <enumerator name='_S_local_capacity' value='3'/>
            </enum-decl>
          </member-type>
          <member-type access='private'>
            <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='180' column='1' id='type-id-1100'>
              <data-member access='public'>
                <var-decl name='_M_local_buf' type-id='type-id-34' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='181' column='1'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='_M_allocated_capacity' type-id='type-id-486' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='182' column='1'/>
              </data-member>
            </union-decl>
          </member-type>
          <data-member access='public' static='yes'>
            <var-decl name='npos' type-id='type-id-487' mangled-name='_ZNSt7__cxx1112basic_stringIwSt11char_traitsIwESaIwEE4nposE' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='109' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='_M_dataplus' type-id='type-id-798' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='174' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='_M_string_length' type-id='type-id-486' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='175' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='128'>
            <var-decl name='' type-id='type-id-1100' visibility='default'/>
          </data-member>
          <member-function access='private'>
            <function-decl name='_M_construct&lt;wchar_t const*&gt;' mangled-name='_ZNSt7__cxx1112basic_stringIwSt11char_traitsIwESaIwEE12_M_constructIPKwEEvT_S8_St20forward_iterator_tag' filepath='/usr/include/c++/11/bits/basic_string.tcc' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt7__cxx1112basic_stringIwSt11char_traitsIwESaIwEE12_M_constructIPKwEEvT_S8_St20forward_iterator_tag@@WXU_3.2'>
              <parameter type-id='type-id-797' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-218' name='__beg' filepath='/usr/include/c++/11/bits/basic_string.tcc' line='207' column='1'/>
              <parameter type-id='type-id-218' name='__end' filepath='/usr/include/c++/11/bits/basic_string.tcc' line='207' column='1'/>
              <parameter type-id='type-id-1021'/>
              <return type-id='type-id-32'/>
            </function-decl>
          </member-function>
        </class-decl>
      </namespace-decl>
    </namespace-decl>
    <namespace-decl name='__gnu_cxx'>
      <class-decl name='_Char_types&lt;wchar_t&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/char_traits.h' line='65' column='1' id='type-id-1101'>
        <member-type access='public'>
          <typedef-decl name='int_type' type-id='type-id-6' filepath='/usr/include/c++/11/bits/char_traits.h' line='67' column='1' id='type-id-1102'/>
        </member-type>
      </class-decl>
      <class-decl name='char_traits&lt;wchar_t&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/char_traits.h' line='90' column='1' id='type-id-1103'>
        <member-type access='public'>
          <typedef-decl name='char_type' type-id='type-id-33' filepath='/usr/include/c++/11/bits/char_traits.h' line='92' column='1' id='type-id-411'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='int_type' type-id='type-id-1102' filepath='/usr/include/c++/11/bits/char_traits.h' line='93' column='1' id='type-id-450'/>
        </member-type>
      </class-decl>
      <class-decl name='__normal_iterator&lt;char const*, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;' size-in-bits='64' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='987' column='1' id='type-id-397'>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-1035' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='998' column='1' id='type-id-1104'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-1037' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='999' column='1' id='type-id-1105'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1036' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='1000' column='1' id='type-id-1106'/>
        </member-type>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='_M_current' type-id='type-id-188' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='990' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__normal_iterator&lt;char*, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;' size-in-bits='64' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='987' column='1' id='type-id-400'>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-1025' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='998' column='1' id='type-id-1107'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-1028' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='999' column='1' id='type-id-1108'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1027' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='1000' column='1' id='type-id-1109'/>
        </member-type>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='_M_current' type-id='type-id-251' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='990' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__normal_iterator&lt;wchar_t const*, std::__cxx11::basic_string&lt;wchar_t, std::char_traits&lt;wchar_t&gt;, std::allocator&lt;wchar_t&gt; &gt; &gt;' size-in-bits='64' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='987' column='1' id='type-id-403'>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-1040' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='998' column='1' id='type-id-1110'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-1042' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='999' column='1' id='type-id-1111'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1041' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='1000' column='1' id='type-id-1112'/>
        </member-type>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='_M_current' type-id='type-id-218' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='990' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__normal_iterator&lt;wchar_t*, std::__cxx11::basic_string&lt;wchar_t, std::char_traits&lt;wchar_t&gt;, std::allocator&lt;wchar_t&gt; &gt; &gt;' size-in-bits='64' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='987' column='1' id='type-id-407'>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-1031' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='998' column='1' id='type-id-1113'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-1033' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='999' column='1' id='type-id-1114'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1032' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='1000' column='1' id='type-id-1115'/>
        </member-type>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='_M_current' type-id='type-id-842' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='990' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__alloc_traits&lt;std::allocator&lt;char&gt;, char&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/ext/alloc_traits.h' line='48' column='1' id='type-id-1116'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1003'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1004' filepath='/usr/include/c++/11/ext/alloc_traits.h' line='56' column='1' id='type-id-393'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1005' filepath='/usr/include/c++/11/ext/alloc_traits.h' line='57' column='1' id='type-id-1074'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_pointer' type-id='type-id-1006' filepath='/usr/include/c++/11/ext/alloc_traits.h' line='58' column='1' id='type-id-1076'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1008' filepath='/usr/include/c++/11/ext/alloc_traits.h' line='59' column='1' id='type-id-1068'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-394' filepath='/usr/include/c++/11/ext/alloc_traits.h' line='62' column='1' id='type-id-1070'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-432' filepath='/usr/include/c++/11/ext/alloc_traits.h' line='63' column='1' id='type-id-1072'/>
        </member-type>
        <member-type access='public'>
          <class-decl name='rebind&lt;char&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/ext/alloc_traits.h' line='119' column='1' id='type-id-1117'>
            <member-type access='public'>
              <typedef-decl name='other' type-id='type-id-1010' filepath='/usr/include/c++/11/ext/alloc_traits.h' line='120' column='1' id='type-id-1067'/>
            </member-type>
          </class-decl>
        </member-type>
      </class-decl>
      <class-decl name='__alloc_traits&lt;std::allocator&lt;wchar_t&gt;, wchar_t&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/ext/alloc_traits.h' line='48' column='1' id='type-id-1118'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-1011'/>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-1012' filepath='/usr/include/c++/11/ext/alloc_traits.h' line='56' column='1' id='type-id-395'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-1013' filepath='/usr/include/c++/11/ext/alloc_traits.h' line='57' column='1' id='type-id-1092'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_pointer' type-id='type-id-1014' filepath='/usr/include/c++/11/ext/alloc_traits.h' line='58' column='1' id='type-id-1094'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-1016' filepath='/usr/include/c++/11/ext/alloc_traits.h' line='59' column='1' id='type-id-1086'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-396' filepath='/usr/include/c++/11/ext/alloc_traits.h' line='62' column='1' id='type-id-1088'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-434' filepath='/usr/include/c++/11/ext/alloc_traits.h' line='63' column='1' id='type-id-1090'/>
        </member-type>
        <member-type access='public'>
