<abi-corpus version='2.0' architecture='elf-amd-x86_64' soname='libwx_gtk3u_qa-3.2.so.0'>
  <elf-needed>
    <dependency name='libwx_gtk3u_core-3.2.so.0'/>
    <dependency name='libwx_baseu-3.2.so.0'/>
    <dependency name='libwx_baseu_xml-3.2.so.0'/>
    <dependency name='libm.so.6'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_ZN13wxDebugReport10AddContextENS_7ContextE' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN13wxDebugReport10RemoveFileERK8wxString' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN13wxDebugReport15DoAddSystemInfoEP9wxXmlNode' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN13wxDebugReport18DoAddExceptionInfoEP9wxXmlNode' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN13wxDebugReport18DoAddLoadedModulesEP9wxXmlNode' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_ZTI15wxSizerItemList' size='24' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTI17wxStackWalkerBase' size='16' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTI19wxDebugReportUpload' size='24' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTI20wxDebugReportPreview' size='16' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTI21wxDebugReportCompress' size='24' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTI23wxDebugReportPreviewStd' size='24' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTIN10wxFileType17MessageParametersE' size='16' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS13wxDebugReport' size='16' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS15wxAnyButtonBase' size='18' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS15wxSizerItemList' size='18' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS17wxStackWalkerBase' size='20' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS19wxDebugReportUpload' size='22' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS20wxDebugReportPreview' size='23' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS21wxDebugReportCompress' size='24' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS23wxDebugReportPreviewStd' size='26' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTSN10wxFileType17MessageParametersE' size='34' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV13wxDebugReport' size='104' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV15wxAnyButtonBase' size='1776' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV15wxSizerItemList' size='48' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV17wxStackWalkerBase' size='56' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV19wxDebugReportUpload' size='112' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV20wxDebugReportPreview' size='40' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV21wxDebugReportCompress' size='104' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV23wxDebugReportPreviewStd' size='40' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTVN10wxFileType17MessageParametersE' size='40' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/common/debugrpt.cpp' language='LANG_C_plus_plus_14'>
    <type-decl name='__float128' size-in-bits='128' id='type-id-1'/>
    <type-decl name='__int128' size-in-bits='128' id='type-id-2'/>
    <type-decl name='bool' size-in-bits='8' id='type-id-3'/>
    <type-decl name='char' size-in-bits='8' id='type-id-4'/>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='128' id='type-id-5'>
      <subrange length='16' type-id='type-id-6' id='type-id-7'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='8' id='type-id-8'>
      <subrange length='1' type-id='type-id-6' id='type-id-9'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='160' id='type-id-10'>
      <subrange length='20' type-id='type-id-6' id='type-id-11'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='32' id='type-id-12'>
      <subrange length='4' type-id='type-id-6' id='type-id-13'/>
    </array-type-def>
    <class-decl name='typedef __va_list_tag __va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-16' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='type-id-17'/>
    <type-decl name='float' size-in-bits='32' id='type-id-18'/>
    <type-decl name='int' size-in-bits='32' id='type-id-19'/>
    <type-decl name='long double' size-in-bits='128' id='type-id-20'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-21'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-22'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-23'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-24'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-25'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-26'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-27'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-15'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-6'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-28'/>
    <type-decl name='variadic parameter type' id='type-id-29'/>
    <type-decl name='void' id='type-id-30'/>
    <type-decl name='wchar_t' size-in-bits='32' id='type-id-31'/>
    <array-type-def dimensions='1' type-id='type-id-31' size-in-bits='128' id='type-id-32'>
      <subrange length='4' type-id='type-id-6' id='type-id-13'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-33' size-in-bits='64' id='type-id-34'>
      <subrange length='2' type-id='type-id-6' id='type-id-35'/>
    </array-type-def>
    <class-decl name='wxAnyStrPtr' size-in-bits='128' visibility='default' filepath='include/wx/anystr.h' line='29' column='1' id='type-id-36'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_str' type-id='type-id-37' visibility='default' filepath='include/wx/anystr.h' line='134' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_iter' type-id='type-id-38' visibility='default' filepath='include/wx/anystr.h' line='135' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArrayString' size-in-bits='320' visibility='default' filepath='include/wx/arrstr.h' line='157' column='1' id='type-id-39'>
      <member-type access='public'>
        <typedef-decl name='CompareFunction' type-id='type-id-41' filepath='include/wx/arrstr.h' line='161' column='1' id='type-id-40'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CompareFunction2' type-id='type-id-43' filepath='include/wx/arrstr.h' line='165' column='1' id='type-id-42'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-45' filepath='include/wx/arrstr.h' line='267' column='1' id='type-id-44'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-47' filepath='include/wx/arrstr.h' line='270' column='1' id='type-id-46'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-49' filepath='include/wx/arrstr.h' line='271' column='1' id='type-id-48'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-51' filepath='include/wx/arrstr.h' line='272' column='1' id='type-id-50'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-53' filepath='include/wx/arrstr.h' line='273' column='1' id='type-id-52'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-55' filepath='include/wx/arrstr.h' line='275' column='1' id='type-id-54'/>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator' size-in-bits='64' visibility='default' filepath='include/wx/arrstr.h' line='278' column='1' id='type-id-56'>
          <member-type access='private'>
            <typedef-decl name='value_type' type-id='type-id-45' filepath='include/wx/arrstr.h' line='280' column='1' id='type-id-57'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='type-id-59' filepath='include/wx/arrstr.h' line='281' column='1' id='type-id-58'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reference' type-id='type-id-61' filepath='include/wx/arrstr.h' line='282' column='1' id='type-id-60'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='itor' type-id='type-id-56' filepath='include/wx/arrstr.h' line='283' column='1' id='type-id-62'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_ptr' type-id='type-id-58' visibility='default' filepath='include/wx/arrstr.h' line='289' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_reverse_iterator' size-in-bits='64' visibility='default' filepath='include/wx/arrstr.h' line='304' column='1' id='type-id-63'>
          <member-type access='private'>
            <typedef-decl name='value_type' type-id='type-id-45' filepath='include/wx/arrstr.h' line='306' column='1' id='type-id-64'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='type-id-66' filepath='include/wx/arrstr.h' line='307' column='1' id='type-id-65'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reference' type-id='type-id-68' filepath='include/wx/arrstr.h' line='308' column='1' id='type-id-67'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='itor' type-id='type-id-63' filepath='include/wx/arrstr.h' line='309' column='1' id='type-id-69'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_ptr' type-id='type-id-65' visibility='default' filepath='include/wx/arrstr.h' line='315' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_compareFunction' type-id='type-id-40' visibility='default' filepath='include/wx/arrstr.h' line='393' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_nSize' type-id='type-id-55' visibility='default' filepath='include/wx/arrstr.h' line='406' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_nCount' type-id='type-id-55' visibility='default' filepath='include/wx/arrstr.h' line='407' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_pItems' type-id='type-id-70' visibility='default' filepath='include/wx/arrstr.h' line='409' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_autoSort' type-id='type-id-3' visibility='default' filepath='include/wx/arrstr.h' line='411' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxScopedCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='66' column='1' id='type-id-71'>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-4' filepath='include/wx/buffer.h' line='69' column='1' id='type-id-72'/>
      </member-type>
      <member-type access='protected'>
        <class-decl name='Data' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='164' column='1' id='type-id-73'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-74'/>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-75' visibility='default' filepath='include/wx/buffer.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxScopedCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='66' column='1' id='type-id-76'>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-31' filepath='include/wx/buffer.h' line='69' column='1' id='type-id-77'/>
      </member-type>
      <member-type access='protected'>
        <class-decl name='Data' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='164' column='1' id='type-id-78'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-74'/>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-79' visibility='default' filepath='include/wx/buffer.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxScopedCharBuffer' type-id='type-id-71' filepath='include/wx/buffer.h' line='241' column='1' id='type-id-80'/>
    <typedef-decl name='wxScopedWCharBuffer' type-id='type-id-76' filepath='include/wx/buffer.h' line='242' column='1' id='type-id-81'/>
    <class-decl name='wxCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='247' column='1' id='type-id-82'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-71'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-4' filepath='include/wx/buffer.h' line='253' column='1' id='type-id-83'/>
      </member-type>
    </class-decl>
    <class-decl name='wxCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='247' column='1' id='type-id-84'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-76'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-31' filepath='include/wx/buffer.h' line='253' column='1' id='type-id-85'/>
      </member-type>
    </class-decl>
    <class-decl name='wxCharBuffer' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='357' column='1' id='type-id-86'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-82'/>
      <member-type access='public'>
        <typedef-decl name='wxCharTypeBufferBase' type-id='type-id-82' filepath='include/wx/buffer.h' line='360' column='1' id='type-id-87'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='wxScopedCharTypeBufferBase' type-id='type-id-71' filepath='include/wx/buffer.h' line='361' column='1' id='type-id-88'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWCharBuffer' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='374' column='1' id='type-id-89'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-84'/>
      <member-type access='public'>
        <typedef-decl name='wxCharTypeBufferBase' type-id='type-id-84' filepath='include/wx/buffer.h' line='377' column='1' id='type-id-90'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='wxScopedCharTypeBufferBase' type-id='type-id-76' filepath='include/wx/buffer.h' line='378' column='1' id='type-id-91'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWritableCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='393' column='1' id='type-id-92'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-82'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-72' filepath='include/wx/buffer.h' line='396' column='1' id='type-id-93'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWritableCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='393' column='1' id='type-id-94'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-84'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-77' filepath='include/wx/buffer.h' line='396' column='1' id='type-id-95'/>
      </member-type>
    </class-decl>
    <typedef-decl name='wxWritableCharBuffer' type-id='type-id-92' filepath='include/wx/buffer.h' line='410' column='1' id='type-id-96'/>
    <typedef-decl name='wxWritableWCharBuffer' type-id='type-id-94' filepath='include/wx/buffer.h' line='411' column='1' id='type-id-97'/>
    <typedef-decl name='wxChar' type-id='type-id-31' filepath='include/wx/chartype.h' line='123' column='1' id='type-id-33'/>
    <typedef-decl name='wxStringCharType' type-id='type-id-31' filepath='include/wx/chartype.h' line='170' column='1' id='type-id-98'/>
    <class-decl name='wxDateTime' size-in-bits='64' visibility='default' filepath='include/wx/datetime.h' line='128' column='1' id='type-id-99'>
      <member-type access='public'>
        <typedef-decl name='wxDateTime_t' type-id='type-id-28' filepath='include/wx/datetime.h' line='139' column='1' id='type-id-100'/>
      </member-type>
      <member-type access='public'>
        <enum-decl name='TZ' filepath='include/wx/datetime.h' line='145' column='1' id='type-id-101'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Local' value='0'/>
          <enumerator name='GMT_12' value='1'/>
          <enumerator name='GMT_11' value='2'/>
          <enumerator name='GMT_10' value='3'/>
          <enumerator name='GMT_9' value='4'/>
          <enumerator name='GMT_8' value='5'/>
          <enumerator name='GMT_7' value='6'/>
          <enumerator name='GMT_6' value='7'/>
          <enumerator name='GMT_5' value='8'/>
          <enumerator name='GMT_4' value='9'/>
          <enumerator name='GMT_3' value='10'/>
          <enumerator name='GMT_2' value='11'/>
          <enumerator name='GMT_1' value='12'/>
          <enumerator name='GMT0' value='13'/>
          <enumerator name='GMT1' value='14'/>
          <enumerator name='GMT2' value='15'/>
          <enumerator name='GMT3' value='16'/>
          <enumerator name='GMT4' value='17'/>
          <enumerator name='GMT5' value='18'/>
          <enumerator name='GMT6' value='19'/>
          <enumerator name='GMT7' value='20'/>
          <enumerator name='GMT8' value='21'/>
          <enumerator name='GMT9' value='22'/>
          <enumerator name='GMT10' value='23'/>
          <enumerator name='GMT11' value='24'/>
          <enumerator name='GMT12' value='25'/>
          <enumerator name='GMT13' value='26'/>
          <enumerator name='WET' value='13'/>
          <enumerator name='WEST' value='14'/>
          <enumerator name='CET' value='14'/>
          <enumerator name='CEST' value='15'/>
          <enumerator name='EET' value='15'/>
          <enumerator name='EEST' value='16'/>
          <enumerator name='MSK' value='16'/>
          <enumerator name='MSD' value='17'/>
          <enumerator name='AST' value='9'/>
          <enumerator name='ADT' value='10'/>
          <enumerator name='EST' value='8'/>
          <enumerator name='EDT' value='9'/>
          <enumerator name='CST' value='7'/>
          <enumerator name='CDT' value='8'/>
          <enumerator name='MST' value='6'/>
          <enumerator name='MDT' value='7'/>
          <enumerator name='PST' value='5'/>
          <enumerator name='PDT' value='6'/>
          <enumerator name='HST' value='3'/>
          <enumerator name='AKST' value='4'/>
          <enumerator name='AKDT' value='5'/>
          <enumerator name='A_WST' value='21'/>
          <enumerator name='A_CST' value='27'/>
          <enumerator name='A_EST' value='23'/>
          <enumerator name='A_ESST' value='24'/>
          <enumerator name='NZST' value='25'/>
          <enumerator name='NZDT' value='26'/>
          <enumerator name='UTC' value='13'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='Calendar' filepath='include/wx/datetime.h' line='212' column='1' id='type-id-102'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Gregorian' value='0'/>
          <enumerator name='Julian' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='Country' filepath='include/wx/datetime.h' line='226' column='1' id='type-id-103'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Country_Unknown' value='0'/>
          <enumerator name='Country_Default' value='1'/>
          <enumerator name='Country_WesternEurope_Start' value='2'/>
          <enumerator name='Country_EEC' value='2'/>
          <enumerator name='France' value='3'/>
          <enumerator name='Germany' value='4'/>
          <enumerator name='UK' value='5'/>
          <enumerator name='Country_WesternEurope_End' value='5'/>
          <enumerator name='Russia' value='6'/>
          <enumerator name='USA' value='7'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='Month' filepath='include/wx/datetime.h' line='248' column='1' id='type-id-104'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Jan' value='0'/>
          <enumerator name='Feb' value='1'/>
          <enumerator name='Mar' value='2'/>
          <enumerator name='Apr' value='3'/>
          <enumerator name='May' value='4'/>
          <enumerator name='Jun' value='5'/>
          <enumerator name='Jul' value='6'/>
          <enumerator name='Aug' value='7'/>
          <enumerator name='Sep' value='8'/>
          <enumerator name='Oct' value='9'/>
          <enumerator name='Nov' value='10'/>
          <enumerator name='Dec' value='11'/>
          <enumerator name='Inv_Month' value='12'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='WeekDay' filepath='include/wx/datetime.h' line='254' column='1' id='type-id-105'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Sun' value='0'/>
          <enumerator name='Mon' value='1'/>
          <enumerator name='Tue' value='2'/>
          <enumerator name='Wed' value='3'/>
          <enumerator name='Thu' value='4'/>
          <enumerator name='Fri' value='5'/>
          <enumerator name='Sat' value='6'/>
          <enumerator name='Inv_WeekDay' value='7'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='NameFlags' filepath='include/wx/datetime.h' line='266' column='1' id='type-id-106'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Name_Full' value='1'/>
          <enumerator name='Name_Abbr' value='2'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='WeekFlags' filepath='include/wx/datetime.h' line='273' column='1' id='type-id-107'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Default_First' value='0'/>
          <enumerator name='Monday_First' value='1'/>
          <enumerator name='Sunday_First' value='2'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='TimeZone' size-in-bits='64' visibility='default' filepath='include/wx/datetime.h' line='294' column='1' id='type-id-108'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_offset' type-id='type-id-21' visibility='default' filepath='include/wx/datetime.h' line='315' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='Tm' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/wx/datetime.h' line='325' column='1' id='type-id-109'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='msec' type-id='type-id-100' visibility='default' filepath='include/wx/datetime.h' line='327' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='16'>
            <var-decl name='sec' type-id='type-id-100' visibility='default' filepath='include/wx/datetime.h' line='327' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <var-decl name='min' type-id='type-id-100' visibility='default' filepath='include/wx/datetime.h' line='327' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='48'>
            <var-decl name='hour' type-id='type-id-100' visibility='default' filepath='include/wx/datetime.h' line='327' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='mday' type-id='type-id-100' visibility='default' filepath='include/wx/datetime.h' line='328' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='80'>
            <var-decl name='yday' type-id='type-id-100' visibility='default' filepath='include/wx/datetime.h' line='329' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='96'>
            <var-decl name='mon' type-id='type-id-104' visibility='default' filepath='include/wx/datetime.h' line='330' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='year' type-id='type-id-19' visibility='default' filepath='include/wx/datetime.h' line='331' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='192'>
            <var-decl name='m_tz' type-id='type-id-108' visibility='default' filepath='include/wx/datetime.h' line='362' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='256'>
            <var-decl name='wday' type-id='type-id-100' visibility='default' filepath='include/wx/datetime.h' line='367' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_time' type-id='type-id-110' visibility='default' filepath='include/wx/datetime.h' line='1160' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxTimeSpan' size-in-bits='64' visibility='default' filepath='include/wx/datetime.h' line='1169' column='1' id='type-id-111'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_diff' type-id='type-id-110' visibility='default' filepath='include/wx/datetime.h' line='1357' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxDateSpan' size-in-bits='128' visibility='default' filepath='include/wx/datetime.h' line='1395' column='1' id='type-id-112'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_years' type-id='type-id-19' visibility='default' filepath='include/wx/datetime.h' line='1518' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='m_months' type-id='type-id-19' visibility='default' filepath='include/wx/datetime.h' line='1519' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_weeks' type-id='type-id-19' visibility='default' filepath='include/wx/datetime.h' line='1520' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='m_days' type-id='type-id-19' visibility='default' filepath='include/wx/datetime.h' line='1521' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxDebugReportCompress' size-in-bits='2240' visibility='default' filepath='include/wx/debugrpt.h' line='137' column='1' id='type-id-113'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-114'/>
      <data-member access='private' layout-offset-in-bits='1088'>
        <var-decl name='m_zipDir' type-id='type-id-45' visibility='default' filepath='include/wx/debugrpt.h' line='162' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1472'>
        <var-decl name='m_zipName' type-id='type-id-45' visibility='default' filepath='include/wx/debugrpt.h' line='163' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1856'>
        <var-decl name='m_zipfile' type-id='type-id-45' visibility='default' filepath='include/wx/debugrpt.h' line='166' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='SetCompressedFileBaseName' mangled-name='_ZN21wxDebugReportCompress25SetCompressedFileBaseNameERK8wxString' filepath='src/common/debugrpt.cpp' line='622' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN21wxDebugReportCompress25SetCompressedFileBaseNameERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-115' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-116' name='name' filepath='src/common/debugrpt.cpp' line='622' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetCompressedFileDirectory' mangled-name='_ZN21wxDebugReportCompress26SetCompressedFileDirectoryERK8wxString' filepath='src/common/debugrpt.cpp' line='615' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN21wxDebugReportCompress26SetCompressedFileDirectoryERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-115' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-116' name='name' filepath='src/common/debugrpt.cpp' line='622' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='9'>
        <function-decl name='DoProcess' mangled-name='_ZN21wxDebugReportCompress9DoProcessEv' filepath='src/common/debugrpt.cpp' line='642' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN21wxDebugReportCompress9DoProcessEv@@WXU_3.2'>
          <parameter type-id='type-id-117' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='10'>
        <function-decl name='GetSaveLocation' mangled-name='_ZNK21wxDebugReportCompress15GetSaveLocationEv' filepath='src/common/debugrpt.cpp' line='629' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK21wxDebugReportCompress15GetSaveLocationEv@@WXU_3.2'>
          <parameter type-id='type-id-118' is-artificial='yes'/>
          <return type-id='type-id-119'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxDebugReportUpload' size-in-bits='3392' visibility='default' filepath='include/wx/debugrpt.h' line='173' column='1' id='type-id-120'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-113'/>
      <data-member access='private' layout-offset-in-bits='2240'>
        <var-decl name='m_uploadURL' type-id='type-id-45' visibility='default' filepath='include/wx/debugrpt.h' line='202' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2624'>
        <var-decl name='m_inputField' type-id='type-id-45' visibility='default' filepath='include/wx/debugrpt.h' line='206' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='3008'>
        <var-decl name='m_curlCmd' type-id='type-id-45' visibility='default' filepath='include/wx/debugrpt.h' line='210' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxDebugReportUpload' mangled-name='_ZN19wxDebugReportUploadC2ERK8wxStringS2_S2_S2_' filepath='src/common/debugrpt.cpp' line='698' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxDebugReportUploadC2ERK8wxStringS2_S2_S2_@@WXU_3.2'>
          <parameter type-id='type-id-121' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-116' name='url' filepath='src/common/debugrpt.cpp' line='698' column='1'/>
          <parameter type-id='type-id-116' name='input' filepath='src/common/debugrpt.cpp' line='699' column='1'/>
          <parameter type-id='type-id-116' name='action' filepath='src/common/debugrpt.cpp' line='700' column='1'/>
          <parameter type-id='type-id-116' name='curl' filepath='src/common/debugrpt.cpp' line='701' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='9'>
        <function-decl name='DoProcess' mangled-name='_ZN19wxDebugReportUpload9DoProcessEv' filepath='src/common/debugrpt.cpp' line='711' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxDebugReportUpload9DoProcessEv@@WXU_3.2'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='11'>
        <function-decl name='OnServerReply' mangled-name='_ZN19wxDebugReportUpload13OnServerReplyERK13wxArrayString' filepath='include/wx/debugrpt.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-122' is-artificial='yes'/>
          <parameter type-id='type-id-123'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxDir' size-in-bits='64' visibility='default' filepath='include/wx/dir.h' line='91' column='1' id='type-id-124'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-125' visibility='default' filepath='include/wx/dir.h' line='185' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArray_SortFunction&lt;wxDynamicLibraryDetails*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-126'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-128' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-127'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-127' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;wxDynamicLibraryDetails*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-129'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-131' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-130'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-130' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxBaseArray&lt;wxDynamicLibraryDetails*, wxSortedArray_SortFunction&lt;wxDynamicLibraryDetails*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-132'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-133'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-130' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-134'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-127' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-135'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-137' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-136'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseObjectArray&lt;wxDynamicLibraryDetails, wxObjectArrayTraitsForwxDynamicLibraryDetailsArray&gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='276' column='1' id='type-id-138'>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-132'/>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-128' filepath='include/wx/dynarray.h' line='283' column='1' id='type-id-139'/>
      </member-type>
    </class-decl>
    <class-decl name='wxDynamicLibraryDetails' size-in-bits='1280' visibility='default' filepath='include/wx/dynlib.h' line='160' column='1' id='type-id-140'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_name' type-id='type-id-45' visibility='default' filepath='include/wx/dynlib.h' line='195' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_path' type-id='type-id-45' visibility='default' filepath='include/wx/dynlib.h' line='196' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='m_version' type-id='type-id-45' visibility='default' filepath='include/wx/dynlib.h' line='197' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1152'>
        <var-decl name='m_address' type-id='type-id-16' visibility='default' filepath='include/wx/dynlib.h' line='199' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1216'>
        <var-decl name='m_length' type-id='type-id-55' visibility='default' filepath='include/wx/dynlib.h' line='200' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxDynamicLibraryDetailsArray' size-in-bits='192' visibility='default' filepath='include/wx/dynlib.h' line='205' column='1' id='type-id-141'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-138'/>
    </class-decl>
    <class-decl name='wxObjectEventFunctor' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='258' column='1' id='type-id-142'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-143'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-144' visibility='default' filepath='include/wx/event.h' line='288' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxObjectEventFunctorclEP12wxEvtHandlerR7wxEvent' filepath='include/wx/event.h' line='4105' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-145' is-artificial='yes'/>
          <parameter type-id='type-id-144'/>
          <parameter type-id='type-id-146'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxObjectEventFunctor10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-147' is-artificial='yes'/>
          <parameter type-id='type-id-148'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxObjectEventFunctor13GetEvtHandlerEv' filepath='include/wx/event.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-147' is-artificial='yes'/>
          <return type-id='type-id-144'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxObjectEventFunctor12GetEvtMethodEv' filepath='include/wx/event.h' line='284' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-147' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxFFile' size-in-bits='448' visibility='default' filepath='include/wx/ffile.h' line='31' column='1' id='type-id-149'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_fp' type-id='type-id-150' visibility='default' filepath='include/wx/ffile.h' line='101' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_name' type-id='type-id-45' visibility='default' filepath='include/wx/ffile.h' line='103' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxFile' size-in-bits='64' visibility='default' filepath='include/wx/file.h' line='30' column='1' id='type-id-151'>
      <member-type access='public'>
        <enum-decl name='OpenMode' filepath='include/wx/file.h' line='39' column='1' id='type-id-152'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='read' value='0'/>
          <enumerator name='write' value='1'/>
          <enumerator name='read_write' value='2'/>
          <enumerator name='write_append' value='3'/>
          <enumerator name='write_excl' value='4'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_fd' type-id='type-id-19' visibility='default' filepath='include/wx/file.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='m_lasterror' type-id='type-id-19' visibility='default' filepath='include/wx/file.h' line='132' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxSeekMode' filepath='include/wx/filefn.h' line='55' column='1' id='type-id-153'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxFromStart' value='0'/>
      <enumerator name='wxFromCurrent' value='1'/>
      <enumerator name='wxFromEnd' value='2'/>
    </enum-decl>
    <enum-decl name='wxFileKind' filepath='include/wx/filefn.h' line='62' column='1' id='type-id-154'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxFILE_KIND_UNKNOWN' value='0'/>
      <enumerator name='wxFILE_KIND_DISK' value='1'/>
      <enumerator name='wxFILE_KIND_TERMINAL' value='2'/>
      <enumerator name='wxFILE_KIND_PIPE' value='3'/>
    </enum-decl>
    <typedef-decl name='wxFileOffset' type-id='type-id-155' filepath='include/wx/filefn.h' line='343' column='1' id='type-id-156'/>
    <enum-decl name='wxPathFormat' filepath='include/wx/filename.h' line='42' column='1' id='type-id-157'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxPATH_NATIVE' value='0'/>
      <enumerator name='wxPATH_UNIX' value='1'/>
      <enumerator name='wxPATH_BEOS' value='1'/>
      <enumerator name='wxPATH_MAC' value='2'/>
      <enumerator name='wxPATH_DOS' value='3'/>
      <enumerator name='wxPATH_WIN' value='3'/>
      <enumerator name='wxPATH_OS2' value='3'/>
      <enumerator name='wxPATH_VMS' value='4'/>
      <enumerator name='wxPATH_MAX' value='5'/>
    </enum-decl>
    <enum-decl name='wxSizeConvention' filepath='include/wx/filename.h' line='57' column='1' id='type-id-158'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxSIZE_CONV_TRADITIONAL' value='0'/>
      <enumerator name='wxSIZE_CONV_IEC' value='1'/>
      <enumerator name='wxSIZE_CONV_SI' value='2'/>
    </enum-decl>
    <class-decl name='wxFileName' size-in-bits='1536' visibility='default' filepath='include/wx/filename.h' line='136' column='1' id='type-id-119'>
      <member-type access='private'>
        <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='include/wx/filename.h' line='631' column='1' id='type-id-159'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='SetPath_PathOnly' value='0'/>
          <enumerator name='SetPath_MayHaveVolume' value='1'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_volume' type-id='type-id-45' visibility='default' filepath='include/wx/filename.h' line='644' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_dirs' type-id='type-id-39' visibility='default' filepath='include/wx/filename.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='704'>
        <var-decl name='m_name' type-id='type-id-45' visibility='default' filepath='include/wx/filename.h' line='650' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1088'>
        <var-decl name='m_ext' type-id='type-id-45' visibility='default' filepath='include/wx/filename.h' line='651' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1472'>
        <var-decl name='m_relative' type-id='type-id-3' visibility='default' filepath='include/wx/filename.h' line='661' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1480'>
        <var-decl name='m_hasExt' type-id='type-id-3' visibility='default' filepath='include/wx/filename.h' line='668' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1488'>
        <var-decl name='m_dontFollowLinks' type-id='type-id-3' visibility='default' filepath='include/wx/filename.h' line='673' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxFontEncoding' filepath='include/wx/fontenc.h' line='15' column='1' id='type-id-160'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxFONTENCODING_SYSTEM' value='-1'/>
      <enumerator name='wxFONTENCODING_DEFAULT' value='0'/>
      <enumerator name='wxFONTENCODING_ISO8859_1' value='1'/>
      <enumerator name='wxFONTENCODING_ISO8859_2' value='2'/>
      <enumerator name='wxFONTENCODING_ISO8859_3' value='3'/>
      <enumerator name='wxFONTENCODING_ISO8859_4' value='4'/>
      <enumerator name='wxFONTENCODING_ISO8859_5' value='5'/>
      <enumerator name='wxFONTENCODING_ISO8859_6' value='6'/>
      <enumerator name='wxFONTENCODING_ISO8859_7' value='7'/>
      <enumerator name='wxFONTENCODING_ISO8859_8' value='8'/>
      <enumerator name='wxFONTENCODING_ISO8859_9' value='9'/>
      <enumerator name='wxFONTENCODING_ISO8859_10' value='10'/>
      <enumerator name='wxFONTENCODING_ISO8859_11' value='11'/>
      <enumerator name='wxFONTENCODING_ISO8859_12' value='12'/>
      <enumerator name='wxFONTENCODING_ISO8859_13' value='13'/>
      <enumerator name='wxFONTENCODING_ISO8859_14' value='14'/>
      <enumerator name='wxFONTENCODING_ISO8859_15' value='15'/>
      <enumerator name='wxFONTENCODING_ISO8859_MAX' value='16'/>
      <enumerator name='wxFONTENCODING_KOI8' value='17'/>
      <enumerator name='wxFONTENCODING_KOI8_U' value='18'/>
      <enumerator name='wxFONTENCODING_ALTERNATIVE' value='19'/>
      <enumerator name='wxFONTENCODING_BULGARIAN' value='20'/>
      <enumerator name='wxFONTENCODING_CP437' value='21'/>
      <enumerator name='wxFONTENCODING_CP850' value='22'/>
      <enumerator name='wxFONTENCODING_CP852' value='23'/>
      <enumerator name='wxFONTENCODING_CP855' value='24'/>
      <enumerator name='wxFONTENCODING_CP866' value='25'/>
      <enumerator name='wxFONTENCODING_CP874' value='26'/>
      <enumerator name='wxFONTENCODING_CP932' value='27'/>
      <enumerator name='wxFONTENCODING_CP936' value='28'/>
      <enumerator name='wxFONTENCODING_CP949' value='29'/>
      <enumerator name='wxFONTENCODING_CP950' value='30'/>
      <enumerator name='wxFONTENCODING_CP1250' value='31'/>
      <enumerator name='wxFONTENCODING_CP1251' value='32'/>
      <enumerator name='wxFONTENCODING_CP1252' value='33'/>
      <enumerator name='wxFONTENCODING_CP1253' value='34'/>
      <enumerator name='wxFONTENCODING_CP1254' value='35'/>
      <enumerator name='wxFONTENCODING_CP1255' value='36'/>
      <enumerator name='wxFONTENCODING_CP1256' value='37'/>
      <enumerator name='wxFONTENCODING_CP1257' value='38'/>
      <enumerator name='wxFONTENCODING_CP1258' value='39'/>
      <enumerator name='wxFONTENCODING_CP1361' value='40'/>
      <enumerator name='wxFONTENCODING_CP12_MAX' value='41'/>
      <enumerator name='wxFONTENCODING_UTF7' value='42'/>
      <enumerator name='wxFONTENCODING_UTF8' value='43'/>
      <enumerator name='wxFONTENCODING_EUC_JP' value='44'/>
      <enumerator name='wxFONTENCODING_UTF16BE' value='45'/>
      <enumerator name='wxFONTENCODING_UTF16LE' value='46'/>
      <enumerator name='wxFONTENCODING_UTF32BE' value='47'/>
      <enumerator name='wxFONTENCODING_UTF32LE' value='48'/>
      <enumerator name='wxFONTENCODING_MACROMAN' value='49'/>
      <enumerator name='wxFONTENCODING_MACJAPANESE' value='50'/>
      <enumerator name='wxFONTENCODING_MACCHINESETRAD' value='51'/>
      <enumerator name='wxFONTENCODING_MACKOREAN' value='52'/>
      <enumerator name='wxFONTENCODING_MACARABIC' value='53'/>
      <enumerator name='wxFONTENCODING_MACHEBREW' value='54'/>
      <enumerator name='wxFONTENCODING_MACGREEK' value='55'/>
      <enumerator name='wxFONTENCODING_MACCYRILLIC' value='56'/>
      <enumerator name='wxFONTENCODING_MACDEVANAGARI' value='57'/>
      <enumerator name='wxFONTENCODING_MACGURMUKHI' value='58'/>
      <enumerator name='wxFONTENCODING_MACGUJARATI' value='59'/>
      <enumerator name='wxFONTENCODING_MACORIYA' value='60'/>
      <enumerator name='wxFONTENCODING_MACBENGALI' value='61'/>
      <enumerator name='wxFONTENCODING_MACTAMIL' value='62'/>
      <enumerator name='wxFONTENCODING_MACTELUGU' value='63'/>
      <enumerator name='wxFONTENCODING_MACKANNADA' value='64'/>
      <enumerator name='wxFONTENCODING_MACMALAJALAM' value='65'/>
      <enumerator name='wxFONTENCODING_MACSINHALESE' value='66'/>
      <enumerator name='wxFONTENCODING_MACBURMESE' value='67'/>
      <enumerator name='wxFONTENCODING_MACKHMER' value='68'/>
      <enumerator name='wxFONTENCODING_MACTHAI' value='69'/>
      <enumerator name='wxFONTENCODING_MACLAOTIAN' value='70'/>
      <enumerator name='wxFONTENCODING_MACGEORGIAN' value='71'/>
      <enumerator name='wxFONTENCODING_MACARMENIAN' value='72'/>
      <enumerator name='wxFONTENCODING_MACCHINESESIMP' value='73'/>
      <enumerator name='wxFONTENCODING_MACTIBETAN' value='74'/>
      <enumerator name='wxFONTENCODING_MACMONGOLIAN' value='75'/>
      <enumerator name='wxFONTENCODING_MACETHIOPIC' value='76'/>
      <enumerator name='wxFONTENCODING_MACCENTRALEUR' value='77'/>
      <enumerator name='wxFONTENCODING_MACVIATNAMESE' value='78'/>
      <enumerator name='wxFONTENCODING_MACARABICEXT' value='79'/>
      <enumerator name='wxFONTENCODING_MACSYMBOL' value='80'/>
      <enumerator name='wxFONTENCODING_MACDINGBATS' value='81'/>
      <enumerator name='wxFONTENCODING_MACTURKISH' value='82'/>
      <enumerator name='wxFONTENCODING_MACCROATIAN' value='83'/>
      <enumerator name='wxFONTENCODING_MACICELANDIC' value='84'/>
      <enumerator name='wxFONTENCODING_MACROMANIAN' value='85'/>
      <enumerator name='wxFONTENCODING_MACCELTIC' value='86'/>
      <enumerator name='wxFONTENCODING_MACGAELIC' value='87'/>
      <enumerator name='wxFONTENCODING_MACKEYBOARD' value='88'/>
      <enumerator name='wxFONTENCODING_ISO2022_JP' value='89'/>
      <enumerator name='wxFONTENCODING_MAX' value='90'/>
      <enumerator name='wxFONTENCODING_MACMIN' value='49'/>
      <enumerator name='wxFONTENCODING_MACMAX' value='88'/>
      <enumerator name='wxFONTENCODING_UTF16' value='46'/>
      <enumerator name='wxFONTENCODING_UTF32' value='48'/>
      <enumerator name='wxFONTENCODING_UNICODE' value='48'/>
      <enumerator name='wxFONTENCODING_GB2312' value='28'/>
      <enumerator name='wxFONTENCODING_BIG5' value='30'/>
      <enumerator name='wxFONTENCODING_SHIFT_JIS' value='27'/>
      <enumerator name='wxFONTENCODING_EUC_KR' value='29'/>
      <enumerator name='wxFONTENCODING_JOHAB' value='40'/>
      <enumerator name='wxFONTENCODING_VIETNAMESE' value='39'/>
    </enum-decl>
    <class-decl name='_wxHashTable_NodeBase' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='68' column='1' id='type-id-161'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_next' type-id='type-id-162' visibility='default' filepath='include/wx/hashmap.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_wxHashTableBase2' size-in-bits='8' visibility='default' filepath='include/wx/hashmap.h' line='80' column='1' id='type-id-163'>
      <member-type access='public'>
        <typedef-decl name='NodeDtor' type-id='type-id-165' filepath='include/wx/hashmap.h' line='83' column='1' id='type-id-164'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='BucketFromNode' type-id='type-id-167' filepath='include/wx/hashmap.h' line='84' column='1' id='type-id-166'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='ProcessNode' type-id='type-id-169' filepath='include/wx/hashmap.h' line='85' column='1' id='type-id-168'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringHash' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='566' column='1' id='type-id-170'/>
    <class-decl name='wxStringEqual' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='589' column='1' id='type-id-171'/>
    <class-decl name='wxStringToStringHashMap' size-in-bits='256' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-172'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-173'/>
      <member-type access='public'>
        <class-decl name='Insert_Result' size-in-bits='192' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-174'>
          <member-type access='public'>
            <typedef-decl name='const_t1' type-id='type-id-176' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-175'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_t2' type-id='type-id-178' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-177'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t1' type-id='type-id-180' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-179'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t2' type-id='type-id-3' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-181'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='first' type-id='type-id-179' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='second' type-id='type-id-181' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='mapped_type' type-id='type-id-45' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-182'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringToStringHashMap_wxImplementation_HashTable' size-in-bits='256' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-173'>
      <base-class access='protected' layout-offset-in-bits='0' type-id='type-id-163'/>
      <member-type access='public'>
        <class-decl name='Iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-183'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-184' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_ht' type-id='type-id-185' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='Node' size-in-bits='832' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-186'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-161'/>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_value' type-id='type-id-187' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-188'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-183'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-180'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-183'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='Self' type-id='type-id-173' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-189'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_key_type' type-id='type-id-191' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-190'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_pointer' type-id='type-id-193' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-192'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-195' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-194'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='hasher' type-id='type-id-170' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-196'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_equal' type-id='type-id-171' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-197'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_extractor' type-id='type-id-199' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-198'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_type' type-id='type-id-45' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-200'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='pointer' type-id='type-id-202' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-201'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-204' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-203'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-55' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-205'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-206' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-187'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_table' type-id='type-id-207' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_tableBuckets' type-id='type-id-55' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_items' type-id='type-id-55' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_hasher' type-id='type-id-196' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='200'>
        <var-decl name='m_equals' type-id='type-id-197' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='208'>
        <var-decl name='m_getKey' type-id='type-id-198' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxStringToStringHashMap_wxImplementation_KeyEx' size-in-bits='8' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-199'>
      <member-type access='private'>
        <typedef-decl name='const_key_reference' type-id='type-id-209' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-208'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_key_type' type-id='type-id-211' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-210'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_reference' type-id='type-id-213' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-212'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_type' type-id='type-id-215' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-214'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='key_type' type-id='type-id-45' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-216'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='pair_type' type-id='type-id-206' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-217'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringToStringHashMap_wxImplementation_Pair' size-in-bits='768' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-206'>
      <member-type access='public'>
        <typedef-decl name='const_t1' type-id='type-id-191' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-218'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_t2' type-id='type-id-191' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-219'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t1' type-id='type-id-45' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-220'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t2' type-id='type-id-45' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-221'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='first' type-id='type-id-220' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='second' type-id='type-id-221' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxStringToNumHashMap' size-in-bits='256' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-222'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-223'/>
      <member-type access='public'>
        <class-decl name='Insert_Result' size-in-bits='192' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-224'>
          <member-type access='public'>
            <typedef-decl name='const_t1' type-id='type-id-226' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-225'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_t2' type-id='type-id-178' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-227'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t1' type-id='type-id-229' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-228'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t2' type-id='type-id-3' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-230'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='first' type-id='type-id-228' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='second' type-id='type-id-230' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='mapped_type' type-id='type-id-232' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-231'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringToNumHashMap_wxImplementation_HashTable' size-in-bits='256' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-223'>
      <base-class access='protected' layout-offset-in-bits='0' type-id='type-id-163'/>
      <member-type access='public'>
        <class-decl name='Iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-233'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-234' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_ht' type-id='type-id-235' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='Node' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-236'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-161'/>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_value' type-id='type-id-237' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-238'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-233'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-229'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-233'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='Self' type-id='type-id-223' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-239'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_key_type' type-id='type-id-191' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-240'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_pointer' type-id='type-id-242' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-241'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-244' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-243'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='hasher' type-id='type-id-170' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-245'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_equal' type-id='type-id-171' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-246'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_extractor' type-id='type-id-248' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-247'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_type' type-id='type-id-45' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-249'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='pointer' type-id='type-id-251' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-250'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-253' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-252'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-55' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-254'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-255' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-237'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_table' type-id='type-id-207' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_tableBuckets' type-id='type-id-55' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_items' type-id='type-id-55' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_hasher' type-id='type-id-245' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='200'>
        <var-decl name='m_equals' type-id='type-id-246' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='208'>
        <var-decl name='m_getKey' type-id='type-id-247' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxStringToNumHashMap_wxImplementation_KeyEx' size-in-bits='8' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-248'>
      <member-type access='private'>
        <typedef-decl name='const_key_reference' type-id='type-id-257' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-256'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_key_type' type-id='type-id-259' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-258'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_reference' type-id='type-id-261' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-260'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_type' type-id='type-id-263' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-262'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='key_type' type-id='type-id-45' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-264'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='pair_type' type-id='type-id-255' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-265'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringToNumHashMap_wxImplementation_Pair' size-in-bits='448' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-255'>
      <member-type access='public'>
        <typedef-decl name='const_t1' type-id='type-id-191' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-266'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_t2' type-id='type-id-268' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-267'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t1' type-id='type-id-45' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-269'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t2' type-id='type-id-232' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-270'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='first' type-id='type-id-269' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='second' type-id='type-id-270' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxLogLevel' type-id='type-id-6' filepath='include/wx/log.h' line='22' column='1' id='type-id-271'/>
    <class-decl name='wxLogRecordInfo' size-in-bits='512' visibility='default' filepath='include/wx/log.h' line='141' column='1' id='type-id-272'>
      <member-type access='private'>
        <class-decl name='ExtraData' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/wx/log.h' line='289' column='1' id='type-id-273'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='numValues' type-id='type-id-222' visibility='default' filepath='include/wx/log.h' line='291' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='strValues' type-id='type-id-172' visibility='default' filepath='include/wx/log.h' line='292' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='filename' type-id='type-id-274' visibility='default' filepath='include/wx/log.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='line' type-id='type-id-19' visibility='default' filepath='include/wx/log.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='func' type-id='type-id-274' visibility='default' filepath='include/wx/log.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='component' type-id='type-id-274' visibility='default' filepath='include/wx/log.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='timestampMS' type-id='type-id-22' visibility='default' filepath='include/wx/log.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='timestamp' type-id='type-id-275' visibility='default' filepath='include/wx/log.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='threadId' type-id='type-id-276' visibility='default' filepath='include/wx/log.h' line='224' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='m_data' type-id='type-id-277' visibility='default' filepath='include/wx/log.h' line='296' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxLogger' size-in-bits='960' visibility='default' filepath='include/wx/log.h' line='897' column='1' id='type-id-278'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_level' type-id='type-id-279' visibility='default' filepath='include/wx/log.h' line='1198' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_info' type-id='type-id-272' visibility='default' filepath='include/wx/log.h' line='1199' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='m_optKey' type-id='type-id-45' visibility='default' filepath='include/wx/log.h' line='1201' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxLongLong' type-id='type-id-280' filepath='include/wx/longlong.h' line='90' column='1' id='type-id-110'/>
    <typedef-decl name='wxULongLong' type-id='type-id-281' filepath='include/wx/longlong.h' line='91' column='1' id='type-id-282'/>
    <class-decl name='wxLongLongNative' size-in-bits='64' visibility='default' filepath='include/wx/longlong.h' line='106' column='1' id='type-id-280'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_ll' type-id='type-id-22' visibility='default' filepath='include/wx/longlong.h' line='343' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxULongLongNative' size-in-bits='64' visibility='default' filepath='include/wx/longlong.h' line='347' column='1' id='type-id-281'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_ll' type-id='type-id-23' visibility='default' filepath='include/wx/longlong.h' line='562' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRefCounter' size-in-bits='128' visibility='default' filepath='include/wx/object.h' line='228' column='1' id='type-id-283'>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_count' type-id='type-id-19' visibility='default' filepath='include/wx/object.h' line='245' column='1'/>
      </data-member>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRefCounter' mangled-name='_ZN12wxRefCounterD4Ev' filepath='include/wx/object.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-284' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='wxObjectRefData' type-id='type-id-283' filepath='include/wx/object.h' line='258' column='1' id='type-id-285'/>
    <typedef-decl name='wxObjectConstructorFn' type-id='type-id-286' filepath='include/wx/rtti.h' line='39' column='1' id='type-id-287'/>
    <class-decl name='wxClassInfo' size-in-bits='384' visibility='default' filepath='include/wx/rtti.h' line='41' column='1' id='type-id-288'>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-289'>
          <member-type access='private'>
            <typedef-decl name='Node' type-id='type-id-291' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-290'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-289' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-292'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-294' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-293'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-295' visibility='default' filepath='include/wx/rtti.h' line='106' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_table' type-id='type-id-296' visibility='default' filepath='include/wx/rtti.h' line='106' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_className' type-id='type-id-297' visibility='default' filepath='include/wx/rtti.h' line='109' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_objectSize' type-id='type-id-19' visibility='default' filepath='include/wx/rtti.h' line='110' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_objectConstructor' type-id='type-id-287' visibility='default' filepath='include/wx/rtti.h' line='111' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_baseInfo1' type-id='type-id-294' visibility='default' filepath='include/wx/rtti.h' line='115' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_baseInfo2' type-id='type-id-294' visibility='default' filepath='include/wx/rtti.h' line='116' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='m_next' type-id='type-id-298' visibility='default' filepath='include/wx/rtti.h' line='122' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxStackFrameBase' size-in-bits='1472' visibility='default' filepath='include/wx/stackwalk.h' line='28' column='1' id='type-id-299'>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_level' type-id='type-id-55' visibility='default' filepath='include/wx/stackwalk.h' line='107' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_name' type-id='type-id-45' visibility='default' filepath='include/wx/stackwalk.h' line='109' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='512'>
        <var-decl name='m_module' type-id='type-id-45' visibility='default' filepath='include/wx/stackwalk.h' line='110' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='896'>
        <var-decl name='m_filename' type-id='type-id-45' visibility='default' filepath='include/wx/stackwalk.h' line='111' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='1280'>
        <var-decl name='m_line' type-id='type-id-55' visibility='default' filepath='include/wx/stackwalk.h' line='113' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='1344'>
        <var-decl name='m_address' type-id='type-id-16' visibility='default' filepath='include/wx/stackwalk.h' line='115' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='1408'>
        <var-decl name='m_offset' type-id='type-id-55' visibility='default' filepath='include/wx/stackwalk.h' line='116' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxStackFrameBase' mangled-name='_ZN16wxStackFrameBaseD4Ev' filepath='include/wx/stackwalk.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-300' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='0'>
        <function-decl name='GetParamCount' mangled-name='_ZNK16wxStackFrameBase13GetParamCountEv' filepath='include/wx/stackwalk.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-301' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='1'>
        <function-decl name='GetParam' mangled-name='_ZNK16wxStackFrameBase8GetParamEmP8wxStringS1_S1_' filepath='include/wx/stackwalk.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-301' is-artificial='yes'/>
          <parameter type-id='type-id-55'/>
          <parameter type-id='type-id-70'/>
          <parameter type-id='type-id-70'/>
          <parameter type-id='type-id-70'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='4'>
        <function-decl name='OnGetName' mangled-name='_ZN16wxStackFrameBase9OnGetNameEv' filepath='include/wx/stackwalk.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-300' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='5'>
        <function-decl name='OnGetLocation' mangled-name='_ZN16wxStackFrameBase13OnGetLocationEv' filepath='include/wx/stackwalk.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-300' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxStackWalkerBase' size-in-bits='64' visibility='default' filepath='include/wx/stackwalk.h' line='123' column='1' id='type-id-302'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxStackWalkerBase' mangled-name='_ZN17wxStackWalkerBaseD0Ev' filepath='include/wx/stackwalk.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-303' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxStackWalkerBase' mangled-name='_ZN17wxStackWalkerBaseD2Ev' filepath='include/wx/stackwalk.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-303' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxStackWalkerBase' mangled-name='_ZN17wxStackWalkerBaseD4Ev' filepath='include/wx/stackwalk.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-303' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='Walk' mangled-name='_ZN17wxStackWalkerBase4WalkEmm' filepath='include/wx/stackwalk.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-303' is-artificial='yes'/>
          <parameter type-id='type-id-55'/>
          <parameter type-id='type-id-55'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <function-decl name='WalkFromException' mangled-name='_ZN17wxStackWalkerBase17WalkFromExceptionEm' filepath='include/wx/stackwalk.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-303' is-artificial='yes'/>
          <parameter type-id='type-id-55'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='4'>
        <function-decl name='OnStackFrame' mangled-name='_ZN17wxStackWalkerBase12OnStackFrameERK12wxStackFrame' filepath='include/wx/stackwalk.h' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-303' is-artificial='yes'/>
          <parameter type-id='type-id-304'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxCStrData' size-in-bits='192' visibility='default' filepath='include/wx/string.h' line='152' column='1' id='type-id-305'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_str' type-id='type-id-306' visibility='default' filepath='include/wx/string.h' line='245' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_offset' type-id='type-id-55' visibility='default' filepath='include/wx/string.h' line='252' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_owned' type-id='type-id-3' visibility='default' filepath='include/wx/string.h' line='254' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxString' size-in-bits='384' visibility='default' filepath='include/wx/string.h' line='301' column='1' id='type-id-45'>
      <member-type access='private'>
        <class-decl name='SubstrBufFromType&lt;wchar_t const*&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='337' column='1' id='type-id-307'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='data' type-id='type-id-308' visibility='default' filepath='include/wx/string.h' line='339' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='len' type-id='type-id-55' visibility='default' filepath='include/wx/string.h' line='340' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='SubstrBufFromType&lt;wxScopedCharTypeBuffer&lt;wchar_t&gt; &gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='337' column='1' id='type-id-309'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='data' type-id='type-id-76' visibility='default' filepath='include/wx/string.h' line='339' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='len' type-id='type-id-55' visibility='default' filepath='include/wx/string.h' line='340' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='SubstrBufFromWC' type-id='type-id-307' filepath='include/wx/string.h' line='354' column='1' id='type-id-310'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='SubstrBufFromMB' type-id='type-id-309' filepath='include/wx/string.h' line='355' column='1' id='type-id-311'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-55' filepath='include/wx/string.h' line='752' column='1' id='type-id-312'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-314' filepath='include/wx/string.h' line='753' column='1' id='type-id-313'/>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='963' column='1' id='type-id-315'>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-317' filepath='include/wx/string.h' line='965' column='1' id='type-id-316'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-319' filepath='include/wx/string.h' line='965' column='1' id='type-id-318'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='underlying_iterator' type-id='type-id-321' filepath='include/wx/string.h' line='965' column='1' id='type-id-320'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-320' visibility='default' filepath='include/wx/string.h' line='965' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='994' column='1' id='type-id-322'>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-317' filepath='include/wx/string.h' line='998' column='1' id='type-id-323'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-325' filepath='include/wx/string.h' line='998' column='1' id='type-id-324'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='underlying_iterator' type-id='type-id-327' filepath='include/wx/string.h' line='998' column='1' id='type-id-326'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-326' visibility='default' filepath='include/wx/string.h' line='998' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator_impl&lt;wxString::const_iterator&gt;' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='1060' column='1' id='type-id-328'>
          <member-type access='public'>
            <typedef-decl name='iterator_type' type-id='type-id-322' filepath='include/wx/string.h' line='1063' column='1' id='type-id-329'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-323' filepath='include/wx/string.h' line='1067' column='1' id='type-id-330'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-324' filepath='include/wx/string.h' line='1068' column='1' id='type-id-331'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-329' visibility='default' filepath='include/wx/string.h' line='1115' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator_impl&lt;wxString::iterator&gt;' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='1060' column='1' id='type-id-332'>
          <member-type access='public'>
            <typedef-decl name='iterator_type' type-id='type-id-315' filepath='include/wx/string.h' line='1063' column='1' id='type-id-333'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-316' filepath='include/wx/string.h' line='1067' column='1' id='type-id-334'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-318' filepath='include/wx/string.h' line='1068' column='1' id='type-id-335'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-333' visibility='default' filepath='include/wx/string.h' line='1115' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reverse_iterator' type-id='type-id-332' filepath='include/wx/string.h' line='1118' column='1' id='type-id-336'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reverse_iterator' type-id='type-id-328' filepath='include/wx/string.h' line='1119' column='1' id='type-id-337'/>
      </member-type>
      <member-type access='public'>
        <enum-decl name='caseCompare' filepath='include/wx/string.h' line='2386' column='1' id='type-id-338'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='exact' value='0'/>
          <enumerator name='ignoreCase' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='stripType' filepath='include/wx/string.h' line='2388' column='1' id='type-id-339'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='leading' value='1'/>
          <enumerator name='trailing' value='2'/>
          <enumerator name='both' value='3'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='ConvertedBuffer&lt;char&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='3599' column='1' id='type-id-340'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_str' type-id='type-id-341' visibility='default' filepath='include/wx/string.h' line='3625' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_len' type-id='type-id-55' visibility='default' filepath='include/wx/string.h' line='3626' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' static='yes'>
        <var-decl name='npos' type-id='type-id-342' mangled-name='_ZN8wxString4nposE' visibility='default' filepath='include/wx/string.h' line='308' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_impl' type-id='type-id-343' visibility='default' filepath='include/wx/string.h' line='3589' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_convertedToChar' type-id='type-id-340' visibility='default' filepath='include/wx/string.h' line='3677' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxStdWideString' type-id='type-id-344' filepath='include/wx/stringimpl.h' line='70' column='1' id='type-id-345'/>
    <typedef-decl name='wxStdString' type-id='type-id-345' filepath='include/wx/stringimpl.h' line='76' column='1' id='type-id-346'/>
    <typedef-decl name='wxStringImpl' type-id='type-id-346' filepath='include/wx/stringimpl.h' line='90' column='1' id='type-id-343'/>
    <class-decl name='wxStringOperationsWchar' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/stringops.h' line='27' column='1' id='type-id-347'>
      <member-type access='public'>
        <class-decl name='SingleCharBuffer' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/stringops.h' line='64' column='1' id='type-id-348'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='data' type-id='type-id-34' visibility='default' filepath='include/wx/stringops.h' line='66' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
    </class-decl>
    <class-decl name='wxFormatString' size-in-bits='320' visibility='default' filepath='include/wx/strvararg.h' line='137' column='1' id='type-id-349'>
      <member-type access='public'>
        <enum-decl name='ArgumentType' filepath='include/wx/strvararg.h' line='161' column='1' id='type-id-350'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Arg_Unused' value='0'/>
          <enumerator name='Arg_Char' value='1'/>
          <enumerator name='Arg_Pointer' value='2'/>
          <enumerator name='Arg_String' value='6'/>
          <enumerator name='Arg_Int' value='9'/>
          <enumerator name='Arg_LongInt' value='16'/>
          <enumerator name='Arg_LongLongInt' value='16'/>
          <enumerator name='Arg_Double' value='64'/>
          <enumerator name='Arg_LongDouble' value='128'/>
          <enumerator name='Arg_Size_t' value='16'/>
          <enumerator name='Arg_IntPtr' value='512'/>
          <enumerator name='Arg_ShortIntPtr' value='1024'/>
          <enumerator name='Arg_LongIntPtr' value='2048'/>
          <enumerator name='Arg_Unknown' value='32768'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_convertedWChar' type-id='type-id-81' visibility='default' filepath='include/wx/strvararg.h' line='232' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_char' type-id='type-id-80' visibility='default' filepath='include/wx/strvararg.h' line='236' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_wchar' type-id='type-id-81' visibility='default' filepath='include/wx/strvararg.h' line='237' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_str' type-id='type-id-37' visibility='default' filepath='include/wx/strvararg.h' line='242' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_cstr' type-id='type-id-351' visibility='default' filepath='include/wx/strvararg.h' line='243' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxFormatStringArgument' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='250' column='1' id='type-id-352'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_str' type-id='type-id-353' visibility='default' filepath='include/wx/strvararg.h' line='253' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxFormatStringArgumentFinder&lt;const wxFormatString&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='277' column='1' id='type-id-354'/>
    <class-decl name='wxArgNormalizer&lt;int&gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='474' column='1' id='type-id-355'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_value' type-id='type-id-19' visibility='default' filepath='include/wx/strvararg.h' line='492' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArgNormalizer&lt;long unsigned int&gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='474' column='1' id='type-id-356'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_value' type-id='type-id-6' visibility='default' filepath='include/wx/strvararg.h' line='492' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArgNormalizer&lt;wchar_t&gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='474' column='1' id='type-id-357'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_value' type-id='type-id-31' visibility='default' filepath='include/wx/strvararg.h' line='492' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArgNormalizerWchar&lt;int&gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='500' column='1' id='type-id-358'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-355'/>
    </class-decl>
    <class-decl name='wxArgNormalizerWchar&lt;long unsigned int&gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='500' column='1' id='type-id-359'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-356'/>
    </class-decl>
    <class-decl name='wxArgNormalizerWchar&lt;wchar_t&gt;' size-in-bits='32' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='500' column='1' id='type-id-360'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-357'/>
    </class-decl>
    <class-decl name='wxArgNormalizerWchar&lt;const wxString&amp;&gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='553' column='1' id='type-id-361'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_value' type-id='type-id-116' visibility='default' filepath='include/wx/strvararg.h' line='565' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArgNormalizerWchar&lt;wxString&gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='755' column='1' id='type-id-362'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-361'/>
    </class-decl>
    <enum-decl name='wxMutexError' filepath='include/wx/thread.h' line='28' column='1' id='type-id-363'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxMUTEX_NO_ERROR' value='0'/>
      <enumerator name='wxMUTEX_INVALID' value='1'/>
      <enumerator name='wxMUTEX_DEAD_LOCK' value='2'/>
      <enumerator name='wxMUTEX_BUSY' value='3'/>
      <enumerator name='wxMUTEX_UNLOCKED' value='4'/>
      <enumerator name='wxMUTEX_TIMEOUT' value='5'/>
      <enumerator name='wxMUTEX_MISC_ERROR' value='6'/>
    </enum-decl>
    <enum-decl name='wxThreadError' filepath='include/wx/thread.h' line='57' column='1' id='type-id-364'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxTHREAD_NO_ERROR' value='0'/>
      <enumerator name='wxTHREAD_NO_RESOURCE' value='1'/>
      <enumerator name='wxTHREAD_RUNNING' value='2'/>
      <enumerator name='wxTHREAD_NOT_RUNNING' value='3'/>
      <enumerator name='wxTHREAD_KILLED' value='4'/>
      <enumerator name='wxTHREAD_MISC_ERROR' value='5'/>
    </enum-decl>
    <enum-decl name='wxThreadKind' filepath='include/wx/thread.h' line='67' column='1' id='type-id-365'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxTHREAD_DETACHED' value='0'/>
      <enumerator name='wxTHREAD_JOINABLE' value='1'/>
    </enum-decl>
    <enum-decl name='wxMutexType' filepath='include/wx/thread.h' line='112' column='1' id='type-id-366'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxMUTEX_DEFAULT' value='0'/>
      <enumerator name='wxMUTEX_RECURSIVE' value='1'/>
    </enum-decl>
    <class-decl name='wxMutex' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='137' column='1' id='type-id-367'>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_internal' type-id='type-id-368' visibility='default' filepath='include/wx/thread.h' line='174' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxCriticalSectionType' filepath='include/wx/thread.h' line='231' column='1' id='type-id-369'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxCRITSEC_DEFAULT' value='0'/>
      <enumerator name='wxCRITSEC_NON_RECURSIVE' value='1'/>
    </enum-decl>
    <class-decl name='wxCriticalSection' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='242' column='1' id='type-id-370'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_mutex' type-id='type-id-367' visibility='default' filepath='include/wx/thread.h' line='259' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='Leave' mangled-name='_ZN17wxCriticalSection5LeaveEv' filepath='include/wx/thread.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxCriticalSection5LeaveEv@@WXU_3.2'>
          <parameter type-id='type-id-371' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Enter' mangled-name='_ZN17wxCriticalSection5EnterEv' filepath='include/wx/thread.h' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxCriticalSection5EnterEv@@WXU_3.2'>
          <parameter type-id='type-id-371' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxCriticalSectionLocker' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='301' column='1' id='type-id-372'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_critsect' type-id='type-id-373' visibility='default' filepath='include/wx/thread.h' line='316' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxThreadIdType' type-id='type-id-6' filepath='include/wx/thread.h' line='448' column='1' id='type-id-276'/>
    <class-decl name='wxThreadHelperThread' size-in-bits='320' visibility='default' filepath='include/wx/thread.h' line='658' column='1' id='type-id-374'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-375'/>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_owner' type-id='type-id-376' visibility='default' filepath='include/wx/thread.h' line='673' column='1'/>
      </data-member>
      <member-function access='protected' vtable-offset='3'>
        <function-decl name='Entry' mangled-name='_ZN20wxThreadHelperThread5EntryEv' filepath='include/wx/thread.h' line='761' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-377' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxThreadHelper' size-in-bits='256' visibility='default' filepath='include/wx/thread.h' line='686' column='1' id='type-id-378'>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_thread' type-id='type-id-379' visibility='default' filepath='include/wx/thread.h' line='748' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_kind' type-id='type-id-365' visibility='default' filepath='include/wx/thread.h' line='749' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_critSection' type-id='type-id-370' visibility='default' filepath='include/wx/thread.h' line='750' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThreadHelper' mangled-name='_ZN14wxThreadHelperD4Ev' filepath='include/wx/thread.h' line='714' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-380' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='Entry' mangled-name='_ZN14wxThreadHelper5EntryEv' filepath='include/wx/thread.h' line='735' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-380' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxTypeIdentifier' size-in-bits='64' visibility='default' filepath='include/wx/typeinfo.h' line='63' column='1' id='type-id-381'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_className' type-id='type-id-274' visibility='default' filepath='include/wx/typeinfo.h' line='81' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxUint16' type-id='type-id-28' filepath='include/wx/types.h' line='57' column='1' id='type-id-382'/>
    <typedef-decl name='wxInt32' type-id='type-id-19' filepath='include/wx/types.h' line='145' column='1' id='type-id-383'/>
    <typedef-decl name='wxUint32' type-id='type-id-15' filepath='include/wx/types.h' line='146' column='1' id='type-id-384'/>
    <typedef-decl name='wxUIntPtr' type-id='type-id-6' filepath='include/wx/types.h' line='365' column='1' id='type-id-232'/>
    <class-decl name='wxUniChar' size-in-bits='32' visibility='default' filepath='include/wx/unichar.h' line='29' column='1' id='type-id-325'>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-384' filepath='include/wx/unichar.h' line='35' column='1' id='type-id-385'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_value' type-id='type-id-385' visibility='default' filepath='include/wx/unichar.h' line='212' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxUniCharRef' size-in-bits='64' visibility='default' filepath='include/wx/unichar.h' line='220' column='1' id='type-id-319'>
      <member-type access='private'>
        <typedef-decl name='iterator' type-id='type-id-321' filepath='include/wx/unichar.h' line='223' column='1' id='type-id-386'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_pos' type-id='type-id-386' visibility='default' filepath='include/wx/unichar.h' line='325' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxEnvVariableHashMap' type-id='type-id-172' filepath='include/wx/utils.h' line='385' column='1' id='type-id-387'/>
    <class-decl name='wxExecuteEnv' size-in-bits='640' is-struct='yes' visibility='default' filepath='include/wx/utils.h' line='389' column='1' id='type-id-388'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cwd' type-id='type-id-45' visibility='default' filepath='include/wx/utils.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='env' type-id='type-id-387' visibility='default' filepath='include/wx/utils.h' line='392' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVector&lt;wxDynamicLibraryDetails*&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-133'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-55' filepath='include/wx/vector.h' line='179' column='1' id='type-id-389'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-391' filepath='include/wx/vector.h' line='181' column='1' id='type-id-390'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-393' filepath='include/wx/vector.h' line='184' column='1' id='type-id-392'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-395' filepath='include/wx/vector.h' line='185' column='1' id='type-id-394'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-396' filepath='include/wx/vector.h' line='187' column='1' id='type-id-137'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-397'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-398'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-389' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-389' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-393' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxXmlNodeType' filepath='include/wx/xml/xml.h' line='40' column='1' id='type-id-399'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxXML_ELEMENT_NODE' value='1'/>
      <enumerator name='wxXML_ATTRIBUTE_NODE' value='2'/>
      <enumerator name='wxXML_TEXT_NODE' value='3'/>
      <enumerator name='wxXML_CDATA_SECTION_NODE' value='4'/>
      <enumerator name='wxXML_ENTITY_REF_NODE' value='5'/>
      <enumerator name='wxXML_ENTITY_NODE' value='6'/>
      <enumerator name='wxXML_PI_NODE' value='7'/>
      <enumerator name='wxXML_COMMENT_NODE' value='8'/>
      <enumerator name='wxXML_DOCUMENT_NODE' value='9'/>
      <enumerator name='wxXML_DOCUMENT_TYPE_NODE' value='10'/>
      <enumerator name='wxXML_DOCUMENT_FRAG_NODE' value='11'/>
      <enumerator name='wxXML_NOTATION_NODE' value='12'/>
      <enumerator name='wxXML_HTML_DOCUMENT_NODE' value='13'/>
    </enum-decl>
    <class-decl name='wxXmlDoctype' size-in-bits='1152' visibility='default' filepath='include/wx/xml/xml.h' line='240' column='1' id='type-id-400'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_rootName' type-id='type-id-45' visibility='default' filepath='include/wx/xml/xml.h' line='264' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_systemId' type-id='type-id-45' visibility='default' filepath='include/wx/xml/xml.h' line='265' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='m_publicId' type-id='type-id-45' visibility='default' filepath='include/wx/xml/xml.h' line='266' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxBuildOptionsChecker' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/common/debugrpt.cpp' line='29' column='1' id='type-id-401'/>
    <class-decl name='XmlStackWalker' size-in-bits='192' visibility='default' filepath='src/common/debugrpt.cpp' line='65' column='1' id='type-id-402'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-403'/>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_nodeStack' type-id='type-id-404' visibility='default' filepath='src/common/debugrpt.cpp' line='79' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_isOk' type-id='type-id-3' visibility='default' filepath='src/common/debugrpt.cpp' line='80' column='1'/>
      </data-member>
      <member-function access='protected' vtable-offset='4'>
        <function-decl name='OnStackFrame' mangled-name='_ZN14XmlStackWalker12OnStackFrameERK12wxStackFrame' filepath='src/common/debugrpt.cpp' line='121' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-405' is-artificial='yes'/>
          <parameter type-id='type-id-304'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='lconv' size-in-bits='768' is-struct='yes' visibility='default' filepath='/usr/include/locale.h' line='51' column='1' id='type-id-406'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='decimal_point' type-id='type-id-341' visibility='default' filepath='/usr/include/locale.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thousands_sep' type-id='type-id-341' visibility='default' filepath='/usr/include/locale.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='grouping' type-id='type-id-341' visibility='default' filepath='/usr/include/locale.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='int_curr_symbol' type-id='type-id-341' visibility='default' filepath='/usr/include/locale.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='currency_symbol' type-id='type-id-341' visibility='default' filepath='/usr/include/locale.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mon_decimal_point' type-id='type-id-341' visibility='default' filepath='/usr/include/locale.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mon_thousands_sep' type-id='type-id-341' visibility='default' filepath='/usr/include/locale.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mon_grouping' type-id='type-id-341' visibility='default' filepath='/usr/include/locale.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='positive_sign' type-id='type-id-341' visibility='default' filepath='/usr/include/locale.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='negative_sign' type-id='type-id-341' visibility='default' filepath='/usr/include/locale.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='int_frac_digits' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <var-decl name='frac_digits' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='p_cs_precedes' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='664'>
        <var-decl name='p_sep_by_space' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='n_cs_precedes' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='680'>
        <var-decl name='n_sep_by_space' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='688'>
        <var-decl name='p_sign_posn' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='696'>
        <var-decl name='n_sign_posn' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='int_p_cs_precedes' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='712'>
        <var-decl name='int_p_sep_by_space' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='720'>
        <var-decl name='int_n_cs_precedes' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='728'>
        <var-decl name='int_n_sep_by_space' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='int_p_sign_posn' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='744'>
        <var-decl name='int_n_sign_posn' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='fpos_t' type-id='type-id-407' filepath='/usr/include/stdio.h' line='86' column='1' id='type-id-408'/>
    <class-decl name='div_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-409' visibility='default' filepath='/usr/include/stdlib.h' line='60' column='1' id='type-id-410'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-19' visibility='default' filepath='/usr/include/stdlib.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rem' type-id='type-id-19' visibility='default' filepath='/usr/include/stdlib.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='div_t' type-id='type-id-410' filepath='/usr/include/stdlib.h' line='63' column='1' id='type-id-409'/>
    <class-decl name='ldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-411' visibility='default' filepath='/usr/include/stdlib.h' line='68' column='1' id='type-id-412'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-21' visibility='default' filepath='/usr/include/stdlib.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-21' visibility='default' filepath='/usr/include/stdlib.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ldiv_t' type-id='type-id-412' filepath='/usr/include/stdlib.h' line='71' column='1' id='type-id-411'/>
    <class-decl name='lldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-413' visibility='default' filepath='/usr/include/stdlib.h' line='78' column='1' id='type-id-414'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-22' visibility='default' filepath='/usr/include/stdlib.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-22' visibility='default' filepath='/usr/include/stdlib.h' line='80' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='lldiv_t' type-id='type-id-414' filepath='/usr/include/stdlib.h' line='81' column='1' id='type-id-413'/>
    <typedef-decl name='__compar_fn_t' type-id='type-id-415' filepath='/usr/include/stdlib.h' line='816' column='1' id='type-id-416'/>
    <typedef-decl name='__off_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-417'/>
    <typedef-decl name='__off64_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1' id='type-id-418'/>
    <typedef-decl name='__time_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='160' column='1' id='type-id-419'/>
    <typedef-decl name='__ssize_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='194' column='1' id='type-id-420'/>
    <typedef-decl name='FILE' type-id='type-id-421' filepath='/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-422'/>
    <typedef-decl name='__FILE' type-id='type-id-421' filepath='/usr/include/x86_64-linux-gnu/bits/types/__FILE.h' line='5' column='1' id='type-id-423'/>
    <class-decl name='_G_fpos64_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='10' column='1' id='type-id-424'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__pos' type-id='type-id-418' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__state' type-id='type-id-425' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='13' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__fpos64_t' type-id='type-id-424' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='14' column='1' id='type-id-407'/>
    <class-decl name='__mbstate_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-425' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='14' column='1' id='type-id-426'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='17' column='1' id='type-id-427'>
          <data-member access='public'>
            <var-decl name='__wch' type-id='type-id-15' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='18' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='__wchb' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='19' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='type-id-427' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='20' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__mbstate_t' type-id='type-id-426' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='21' column='1' id='type-id-425'/>
    <typedef-decl name='mbstate_t' type-id='type-id-425' filepath='/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h' line='6' column='1' id='type-id-428'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-30' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='43' column='1' id='type-id-429'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='49' column='1' id='type-id-421'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-341' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-341' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-341' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-341' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-341' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-341' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-341' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-341' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-341' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-341' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-341' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-430' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-431' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-417' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-28' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-25' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-8' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-432' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-418' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-433' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-434' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-431' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-16' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-55' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-10' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='7' column='1' id='type-id-435'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-274' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='time_t' type-id='type-id-419' filepath='/usr/include/x86_64-linux-gnu/bits/types/time_t.h' line='10' column='1' id='type-id-275'/>
    <typedef-decl name='wint_t' type-id='type-id-15' filepath='/usr/include/x86_64-linux-gnu/bits/types/wint_t.h' line='20' column='1' id='type-id-436'/>
    <typedef-decl name='off_t' type-id='type-id-418' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='87' column='1' id='type-id-155'/>
    <typedef-decl name='ssize_t' type-id='type-id-420' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='108' column='1' id='type-id-437'/>
    <typedef-decl name='ptrdiff_t' type-id='type-id-21' filepath='/usr/lib/gcc/x86_64-linux-gnu/11/include/stddef.h' line='143' column='1' id='type-id-317'/>
    <typedef-decl name='size_t' type-id='type-id-6' filepath='/usr/lib/gcc/x86_64-linux-gnu/11/include/stddef.h' line='209' column='1' id='type-id-55'/>
    <pointer-type-def type-id='type-id-422' size-in-bits='64' id='type-id-150'/>
    <pointer-type-def type-id='type-id-402' size-in-bits='64' id='type-id-405'/>
    <qualified-type-def type-id='type-id-405' const='yes' id='type-id-438'/>
    <pointer-type-def type-id='type-id-421' size-in-bits='64' id='type-id-431'/>
    <pointer-type-def type-id='type-id-439' size-in-bits='64' id='type-id-433'/>
    <pointer-type-def type-id='type-id-429' size-in-bits='64' id='type-id-432'/>
    <pointer-type-def type-id='type-id-440' size-in-bits='64' id='type-id-430'/>
    <pointer-type-def type-id='type-id-441' size-in-bits='64' id='type-id-434'/>
    <pointer-type-def type-id='type-id-423' size-in-bits='64' id='type-id-442'/>
    <reference-type-def kind='lvalue' type-id='type-id-443' size-in-bits='64' id='type-id-444'/>
    <reference-type-def kind='lvalue' type-id='type-id-445' size-in-bits='64' id='type-id-446'/>
    <reference-type-def kind='lvalue' type-id='type-id-447' size-in-bits='64' id='type-id-448'/>
    <pointer-type-def type-id='type-id-447' size-in-bits='64' id='type-id-449'/>
    <reference-type-def kind='lvalue' type-id='type-id-450' size-in-bits='64' id='type-id-451'/>
    <pointer-type-def type-id='type-id-450' size-in-bits='64' id='type-id-452'/>
    <reference-type-def kind='lvalue' type-id='type-id-453' size-in-bits='64' id='type-id-454'/>
    <pointer-type-def type-id='type-id-453' size-in-bits='64' id='type-id-455'/>
    <reference-type-def kind='lvalue' type-id='type-id-456' size-in-bits='64' id='type-id-457'/>
    <pointer-type-def type-id='type-id-456' size-in-bits='64' id='type-id-458'/>
    <qualified-type-def type-id='type-id-458' const='yes' id='type-id-459'/>
    <reference-type-def kind='lvalue' type-id='type-id-460' size-in-bits='64' id='type-id-461'/>
    <pointer-type-def type-id='type-id-460' size-in-bits='64' id='type-id-462'/>
    <pointer-type-def type-id='type-id-463' size-in-bits='64' id='type-id-464'/>
    <pointer-type-def type-id='type-id-465' size-in-bits='64' id='type-id-466'/>
    <qualified-type-def type-id='type-id-466' const='yes' id='type-id-467'/>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-468'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-162'/>
    <pointer-type-def type-id='type-id-469' size-in-bits='64' id='type-id-169'/>
    <qualified-type-def type-id='type-id-162' const='yes' id='type-id-470'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-207'/>
    <reference-type-def kind='lvalue' type-id='type-id-3' size-in-bits='64' id='type-id-471'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-472'/>
    <reference-type-def kind='lvalue' type-id='type-id-4' size-in-bits='64' id='type-id-473'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-341'/>
    <qualified-type-def type-id='type-id-341' const='yes' id='type-id-474'/>
    <reference-type-def kind='lvalue' type-id='type-id-474' size-in-bits='64' id='type-id-475'/>
    <pointer-type-def type-id='type-id-341' size-in-bits='64' id='type-id-476'/>
    <qualified-type-def type-id='type-id-402' const='yes' id='type-id-477'/>
    <pointer-type-def type-id='type-id-477' size-in-bits='64' id='type-id-478'/>
    <qualified-type-def type-id='type-id-478' const='yes' id='type-id-479'/>
    <qualified-type-def type-id='type-id-443' const='yes' id='type-id-480'/>
    <reference-type-def kind='lvalue' type-id='type-id-480' size-in-bits='64' id='type-id-481'/>
    <qualified-type-def type-id='type-id-445' const='yes' id='type-id-482'/>
    <reference-type-def kind='lvalue' type-id='type-id-482' size-in-bits='64' id='type-id-483'/>
    <qualified-type-def type-id='type-id-447' const='yes' id='type-id-484'/>
    <pointer-type-def type-id='type-id-484' size-in-bits='64' id='type-id-485'/>
    <qualified-type-def type-id='type-id-450' const='yes' id='type-id-486'/>
    <pointer-type-def type-id='type-id-486' size-in-bits='64' id='type-id-487'/>
    <qualified-type-def type-id='type-id-453' const='yes' id='type-id-488'/>
    <pointer-type-def type-id='type-id-488' size-in-bits='64' id='type-id-489'/>
    <qualified-type-def type-id='type-id-456' const='yes' id='type-id-490'/>
    <reference-type-def kind='lvalue' type-id='type-id-490' size-in-bits='64' id='type-id-491'/>
    <pointer-type-def type-id='type-id-490' size-in-bits='64' id='type-id-492'/>
    <qualified-type-def type-id='type-id-492' const='yes' id='type-id-493'/>
    <qualified-type-def type-id='type-id-460' const='yes' id='type-id-494'/>
    <reference-type-def kind='lvalue' type-id='type-id-494' size-in-bits='64' id='type-id-495'/>
    <pointer-type-def type-id='type-id-494' size-in-bits='64' id='type-id-496'/>
    <qualified-type-def type-id='type-id-497' const='yes' id='type-id-498'/>
    <reference-type-def kind='lvalue' type-id='type-id-498' size-in-bits='64' id='type-id-499'/>
    <qualified-type-def type-id='type-id-463' const='yes' id='type-id-500'/>
    <reference-type-def kind='lvalue' type-id='type-id-500' size-in-bits='64' id='type-id-501'/>
    <pointer-type-def type-id='type-id-500' size-in-bits='64' id='type-id-502'/>
    <qualified-type-def type-id='type-id-465' const='yes' id='type-id-503'/>
    <reference-type-def kind='lvalue' type-id='type-id-503' size-in-bits='64' id='type-id-504'/>
    <pointer-type-def type-id='type-id-503' size-in-bits='64' id='type-id-505'/>
    <qualified-type-def type-id='type-id-3' const='yes' id='type-id-178'/>
    <qualified-type-def type-id='type-id-4' const='yes' id='type-id-506'/>
    <reference-type-def kind='lvalue' type-id='type-id-506' size-in-bits='64' id='type-id-507'/>
    <pointer-type-def type-id='type-id-506' size-in-bits='64' id='type-id-274'/>
    <qualified-type-def type-id='type-id-274' const='yes' id='type-id-508'/>
    <reference-type-def kind='lvalue' type-id='type-id-508' size-in-bits='64' id='type-id-509'/>
    <pointer-type-def type-id='type-id-274' size-in-bits='64' id='type-id-510'/>
    <qualified-type-def type-id='type-id-408' const='yes' id='type-id-511'/>
    <pointer-type-def type-id='type-id-511' size-in-bits='64' id='type-id-512'/>
    <qualified-type-def type-id='type-id-19' const='yes' id='type-id-513'/>
    <qualified-type-def type-id='type-id-428' const='yes' id='type-id-514'/>
    <pointer-type-def type-id='type-id-514' size-in-bits='64' id='type-id-515'/>
    <qualified-type-def type-id='type-id-55' const='yes' id='type-id-342'/>
    <qualified-type-def type-id='type-id-516' const='yes' id='type-id-517'/>
    <reference-type-def kind='lvalue' type-id='type-id-517' size-in-bits='64' id='type-id-518'/>
    <pointer-type-def type-id='type-id-517' size-in-bits='64' id='type-id-519'/>
    <qualified-type-def type-id='type-id-520' const='yes' id='type-id-521'/>
    <reference-type-def kind='lvalue' type-id='type-id-521' size-in-bits='64' id='type-id-522'/>
    <qualified-type-def type-id='type-id-523' const='yes' id='type-id-524'/>
    <reference-type-def kind='lvalue' type-id='type-id-524' size-in-bits='64' id='type-id-525'/>
    <pointer-type-def type-id='type-id-524' size-in-bits='64' id='type-id-526'/>
    <qualified-type-def type-id='type-id-526' const='yes' id='type-id-527'/>
    <qualified-type-def type-id='type-id-528' const='yes' id='type-id-529'/>
    <reference-type-def kind='lvalue' type-id='type-id-529' size-in-bits='64' id='type-id-530'/>
    <qualified-type-def type-id='type-id-327' const='yes' id='type-id-531'/>
    <reference-type-def kind='lvalue' type-id='type-id-531' size-in-bits='64' id='type-id-532'/>
    <qualified-type-def type-id='type-id-533' const='yes' id='type-id-534'/>
    <qualified-type-def type-id='type-id-535' const='yes' id='type-id-536'/>
    <reference-type-def kind='lvalue' type-id='type-id-536' size-in-bits='64' id='type-id-537'/>
    <pointer-type-def type-id='type-id-536' size-in-bits='64' id='type-id-538'/>
    <qualified-type-def type-id='type-id-539' const='yes' id='type-id-540'/>
    <reference-type-def kind='lvalue' type-id='type-id-540' size-in-bits='64' id='type-id-541'/>
    <qualified-type-def type-id='type-id-542' const='yes' id='type-id-543'/>
    <reference-type-def kind='lvalue' type-id='type-id-543' size-in-bits='64' id='type-id-544'/>
    <qualified-type-def type-id='type-id-545' const='yes' id='type-id-546'/>
    <reference-type-def kind='lvalue' type-id='type-id-546' size-in-bits='64' id='type-id-547'/>
    <qualified-type-def type-id='type-id-548' const='yes' id='type-id-549'/>
    <reference-type-def kind='lvalue' type-id='type-id-549' size-in-bits='64' id='type-id-550'/>
    <qualified-type-def type-id='type-id-551' const='yes' id='type-id-552'/>
    <reference-type-def kind='lvalue' type-id='type-id-552' size-in-bits='64' id='type-id-553'/>
    <pointer-type-def type-id='type-id-552' size-in-bits='64' id='type-id-554'/>
    <qualified-type-def type-id='type-id-555' const='yes' id='type-id-556'/>
    <reference-type-def kind='lvalue' type-id='type-id-556' size-in-bits='64' id='type-id-557'/>
    <pointer-type-def type-id='type-id-556' size-in-bits='64' id='type-id-558'/>
    <qualified-type-def type-id='type-id-559' const='yes' id='type-id-560'/>
    <reference-type-def kind='lvalue' type-id='type-id-560' size-in-bits='64' id='type-id-561'/>
    <pointer-type-def type-id='type-id-560' size-in-bits='64' id='type-id-562'/>
    <qualified-type-def type-id='type-id-563' const='yes' id='type-id-564'/>
    <reference-type-def kind='lvalue' type-id='type-id-564' size-in-bits='64' id='type-id-565'/>
    <pointer-type-def type-id='type-id-564' size-in-bits='64' id='type-id-566'/>
    <qualified-type-def type-id='type-id-567' const='yes' id='type-id-568'/>
    <reference-type-def kind='lvalue' type-id='type-id-568' size-in-bits='64' id='type-id-569'/>
    <pointer-type-def type-id='type-id-568' size-in-bits='64' id='type-id-570'/>
    <qualified-type-def type-id='type-id-571' const='yes' id='type-id-572'/>
    <reference-type-def kind='lvalue' type-id='type-id-572' size-in-bits='64' id='type-id-573'/>
    <qualified-type-def type-id='type-id-574' const='yes' id='type-id-575'/>
    <pointer-type-def type-id='type-id-575' size-in-bits='64' id='type-id-576'/>
    <qualified-type-def type-id='type-id-577' const='yes' id='type-id-578'/>
    <pointer-type-def type-id='type-id-578' size-in-bits='64' id='type-id-579'/>
    <qualified-type-def type-id='type-id-580' const='yes' id='type-id-581'/>
    <reference-type-def kind='lvalue' type-id='type-id-581' size-in-bits='64' id='type-id-582'/>
    <qualified-type-def type-id='type-id-583' const='yes' id='type-id-584'/>
    <pointer-type-def type-id='type-id-584' size-in-bits='64' id='type-id-585'/>
    <qualified-type-def type-id='type-id-585' const='yes' id='type-id-586'/>
    <qualified-type-def type-id='type-id-435' const='yes' id='type-id-587'/>
    <reference-type-def kind='lvalue' type-id='type-id-587' size-in-bits='64' id='type-id-588'/>
    <pointer-type-def type-id='type-id-587' size-in-bits='64' id='type-id-589'/>
    <qualified-type-def type-id='type-id-27' const='yes' id='type-id-590'/>
    <pointer-type-def type-id='type-id-590' size-in-bits='64' id='type-id-591'/>
    <qualified-type-def type-id='type-id-31' const='yes' id='type-id-592'/>
    <reference-type-def kind='lvalue' type-id='type-id-592' size-in-bits='64' id='type-id-593'/>
    <pointer-type-def type-id='type-id-592' size-in-bits='64' id='type-id-308'/>
    <qualified-type-def type-id='type-id-308' const='yes' id='type-id-594'/>
    <reference-type-def kind='lvalue' type-id='type-id-594' size-in-bits='64' id='type-id-595'/>
    <pointer-type-def type-id='type-id-308' size-in-bits='64' id='type-id-596'/>
    <qualified-type-def type-id='type-id-36' const='yes' id='type-id-597'/>
    <reference-type-def kind='lvalue' type-id='type-id-597' size-in-bits='64' id='type-id-598'/>
    <pointer-type-def type-id='type-id-597' size-in-bits='64' id='type-id-599'/>
    <qualified-type-def type-id='type-id-600' const='yes' id='type-id-601'/>
    <pointer-type-def type-id='type-id-601' size-in-bits='64' id='type-id-602'/>
    <qualified-type-def type-id='type-id-355' const='yes' id='type-id-603'/>
    <pointer-type-def type-id='type-id-603' size-in-bits='64' id='type-id-604'/>
    <qualified-type-def type-id='type-id-604' const='yes' id='type-id-605'/>
    <qualified-type-def type-id='type-id-356' const='yes' id='type-id-606'/>
    <pointer-type-def type-id='type-id-606' size-in-bits='64' id='type-id-607'/>
    <qualified-type-def type-id='type-id-607' const='yes' id='type-id-608'/>
    <qualified-type-def type-id='type-id-357' const='yes' id='type-id-609'/>
    <pointer-type-def type-id='type-id-609' size-in-bits='64' id='type-id-610'/>
    <qualified-type-def type-id='type-id-610' const='yes' id='type-id-611'/>
    <qualified-type-def type-id='type-id-361' const='yes' id='type-id-612'/>
    <pointer-type-def type-id='type-id-612' size-in-bits='64' id='type-id-613'/>
    <qualified-type-def type-id='type-id-39' const='yes' id='type-id-614'/>
    <reference-type-def kind='lvalue' type-id='type-id-614' size-in-bits='64' id='type-id-123'/>
    <pointer-type-def type-id='type-id-614' size-in-bits='64' id='type-id-615'/>
    <qualified-type-def type-id='type-id-615' const='yes' id='type-id-616'/>
    <qualified-type-def type-id='type-id-63' const='yes' id='type-id-617'/>
    <pointer-type-def type-id='type-id-617' size-in-bits='64' id='type-id-618'/>
    <qualified-type-def type-id='type-id-69' const='yes' id='type-id-619'/>
    <reference-type-def kind='lvalue' type-id='type-id-619' size-in-bits='64' id='type-id-620'/>
    <qualified-type-def type-id='type-id-64' const='yes' id='type-id-621'/>
    <reference-type-def kind='lvalue' type-id='type-id-621' size-in-bits='64' id='type-id-68'/>
    <pointer-type-def type-id='type-id-621' size-in-bits='64' id='type-id-66'/>
    <qualified-type-def type-id='type-id-56' const='yes' id='type-id-622'/>
    <reference-type-def kind='lvalue' type-id='type-id-622' size-in-bits='64' id='type-id-623'/>
    <pointer-type-def type-id='type-id-622' size-in-bits='64' id='type-id-624'/>
    <qualified-type-def type-id='type-id-62' const='yes' id='type-id-625'/>
    <reference-type-def kind='lvalue' type-id='type-id-625' size-in-bits='64' id='type-id-626'/>
    <qualified-type-def type-id='type-id-44' const='yes' id='type-id-627'/>
    <reference-type-def kind='lvalue' type-id='type-id-627' size-in-bits='64' id='type-id-53'/>
    <pointer-type-def type-id='type-id-627' size-in-bits='64' id='type-id-49'/>
    <qualified-type-def type-id='type-id-132' const='yes' id='type-id-628'/>
    <pointer-type-def type-id='type-id-628' size-in-bits='64' id='type-id-629'/>
    <qualified-type-def type-id='type-id-138' const='yes' id='type-id-630'/>
    <reference-type-def kind='lvalue' type-id='type-id-630' size-in-bits='64' id='type-id-631'/>
    <pointer-type-def type-id='type-id-630' size-in-bits='64' id='type-id-632'/>
    <qualified-type-def type-id='type-id-632' const='yes' id='type-id-633'/>
    <qualified-type-def type-id='type-id-305' const='yes' id='type-id-634'/>
    <reference-type-def kind='lvalue' type-id='type-id-634' size-in-bits='64' id='type-id-635'/>
    <pointer-type-def type-id='type-id-634' size-in-bits='64' id='type-id-636'/>
    <qualified-type-def type-id='type-id-636' const='yes' id='type-id-351'/>
    <qualified-type-def type-id='type-id-33' const='yes' id='type-id-637'/>
    <pointer-type-def type-id='type-id-637' size-in-bits='64' id='type-id-297'/>
    <qualified-type-def type-id='type-id-86' const='yes' id='type-id-638'/>
    <qualified-type-def type-id='type-id-87' const='yes' id='type-id-639'/>
    <reference-type-def kind='lvalue' type-id='type-id-639' size-in-bits='64' id='type-id-640'/>
    <qualified-type-def type-id='type-id-88' const='yes' id='type-id-641'/>
    <reference-type-def kind='lvalue' type-id='type-id-641' size-in-bits='64' id='type-id-642'/>
    <qualified-type-def type-id='type-id-82' const='yes' id='type-id-643'/>
    <reference-type-def kind='lvalue' type-id='type-id-643' size-in-bits='64' id='type-id-644'/>
    <qualified-type-def type-id='type-id-83' const='yes' id='type-id-645'/>
    <pointer-type-def type-id='type-id-645' size-in-bits='64' id='type-id-646'/>
    <qualified-type-def type-id='type-id-84' const='yes' id='type-id-647'/>
    <reference-type-def kind='lvalue' type-id='type-id-647' size-in-bits='64' id='type-id-648'/>
    <qualified-type-def type-id='type-id-85' const='yes' id='type-id-649'/>
    <pointer-type-def type-id='type-id-649' size-in-bits='64' id='type-id-650'/>
    <qualified-type-def type-id='type-id-288' const='yes' id='type-id-651'/>
    <reference-type-def kind='lvalue' type-id='type-id-651' size-in-bits='64' id='type-id-652'/>
    <pointer-type-def type-id='type-id-651' size-in-bits='64' id='type-id-294'/>
    <qualified-type-def type-id='type-id-289' const='yes' id='type-id-653'/>
    <pointer-type-def type-id='type-id-653' size-in-bits='64' id='type-id-654'/>
    <qualified-type-def type-id='type-id-292' const='yes' id='type-id-655'/>
    <reference-type-def kind='lvalue' type-id='type-id-655' size-in-bits='64' id='type-id-656'/>
    <qualified-type-def type-id='type-id-657' const='yes' id='type-id-658'/>
    <pointer-type-def type-id='type-id-658' size-in-bits='64' id='type-id-659'/>
    <qualified-type-def type-id='type-id-370' const='yes' id='type-id-660'/>
    <reference-type-def kind='lvalue' type-id='type-id-660' size-in-bits='64' id='type-id-661'/>
    <qualified-type-def type-id='type-id-372' const='yes' id='type-id-662'/>
    <reference-type-def kind='lvalue' type-id='type-id-662' size-in-bits='64' id='type-id-663'/>
    <qualified-type-def type-id='type-id-112' const='yes' id='type-id-664'/>
    <reference-type-def kind='lvalue' type-id='type-id-664' size-in-bits='64' id='type-id-665'/>
    <pointer-type-def type-id='type-id-664' size-in-bits='64' id='type-id-666'/>
    <qualified-type-def type-id='type-id-99' const='yes' id='type-id-667'/>
    <reference-type-def kind='lvalue' type-id='type-id-667' size-in-bits='64' id='type-id-668'/>
    <pointer-type-def type-id='type-id-667' size-in-bits='64' id='type-id-669'/>
    <qualified-type-def type-id='type-id-108' const='yes' id='type-id-670'/>
    <reference-type-def kind='lvalue' type-id='type-id-670' size-in-bits='64' id='type-id-671'/>
    <pointer-type-def type-id='type-id-670' size-in-bits='64' id='type-id-672'/>
    <qualified-type-def type-id='type-id-109' const='yes' id='type-id-673'/>
    <reference-type-def kind='lvalue' type-id='type-id-673' size-in-bits='64' id='type-id-674'/>
    <pointer-type-def type-id='type-id-673' size-in-bits='64' id='type-id-675'/>
    <qualified-type-def type-id='type-id-114' const='yes' id='type-id-676'/>
    <pointer-type-def type-id='type-id-676' size-in-bits='64' id='type-id-677'/>
    <qualified-type-def type-id='type-id-677' const='yes' id='type-id-678'/>
    <qualified-type-def type-id='type-id-113' const='yes' id='type-id-679'/>
    <pointer-type-def type-id='type-id-679' size-in-bits='64' id='type-id-118'/>
    <qualified-type-def type-id='type-id-118' const='yes' id='type-id-680'/>
    <qualified-type-def type-id='type-id-124' const='yes' id='type-id-681'/>
    <reference-type-def kind='lvalue' type-id='type-id-681' size-in-bits='64' id='type-id-682'/>
    <pointer-type-def type-id='type-id-681' size-in-bits='64' id='type-id-683'/>
    <qualified-type-def type-id='type-id-140' const='yes' id='type-id-684'/>
    <reference-type-def kind='lvalue' type-id='type-id-684' size-in-bits='64' id='type-id-685'/>
    <pointer-type-def type-id='type-id-684' size-in-bits='64' id='type-id-686'/>
    <qualified-type-def type-id='type-id-686' const='yes' id='type-id-687'/>
    <qualified-type-def type-id='type-id-143' const='yes' id='type-id-688'/>
    <reference-type-def kind='lvalue' type-id='type-id-688' size-in-bits='64' id='type-id-148'/>
    <qualified-type-def type-id='type-id-388' const='yes' id='type-id-689'/>
    <pointer-type-def type-id='type-id-689' size-in-bits='64' id='type-id-690'/>
    <qualified-type-def type-id='type-id-149' const='yes' id='type-id-691'/>
    <reference-type-def kind='lvalue' type-id='type-id-691' size-in-bits='64' id='type-id-692'/>
    <pointer-type-def type-id='type-id-691' size-in-bits='64' id='type-id-693'/>
    <qualified-type-def type-id='type-id-693' const='yes' id='type-id-694'/>
    <qualified-type-def type-id='type-id-695' const='yes' id='type-id-696'/>
    <pointer-type-def type-id='type-id-696' size-in-bits='64' id='type-id-697'/>
    <qualified-type-def type-id='type-id-698' const='yes' id='type-id-699'/>
    <pointer-type-def type-id='type-id-699' size-in-bits='64' id='type-id-700'/>
    <qualified-type-def type-id='type-id-151' const='yes' id='type-id-701'/>
    <reference-type-def kind='lvalue' type-id='type-id-701' size-in-bits='64' id='type-id-702'/>
    <pointer-type-def type-id='type-id-701' size-in-bits='64' id='type-id-703'/>
    <qualified-type-def type-id='type-id-119' const='yes' id='type-id-704'/>
    <reference-type-def kind='lvalue' type-id='type-id-704' size-in-bits='64' id='type-id-705'/>
    <pointer-type-def type-id='type-id-704' size-in-bits='64' id='type-id-706'/>
    <qualified-type-def type-id='type-id-349' const='yes' id='type-id-707'/>
    <reference-type-def kind='lvalue' type-id='type-id-707' size-in-bits='64' id='type-id-708'/>
    <pointer-type-def type-id='type-id-707' size-in-bits='64' id='type-id-353'/>
    <qualified-type-def type-id='type-id-353' const='yes' id='type-id-709'/>
    <qualified-type-def type-id='type-id-352' const='yes' id='type-id-710'/>
    <reference-type-def kind='lvalue' type-id='type-id-710' size-in-bits='64' id='type-id-711'/>
    <pointer-type-def type-id='type-id-710' size-in-bits='64' id='type-id-712'/>
    <qualified-type-def type-id='type-id-712' const='yes' id='type-id-713'/>
    <qualified-type-def type-id='type-id-271' const='yes' id='type-id-279'/>
    <qualified-type-def type-id='type-id-272' const='yes' id='type-id-714'/>
    <reference-type-def kind='lvalue' type-id='type-id-714' size-in-bits='64' id='type-id-715'/>
    <pointer-type-def type-id='type-id-714' size-in-bits='64' id='type-id-716'/>
    <qualified-type-def type-id='type-id-278' const='yes' id='type-id-717'/>
    <reference-type-def kind='lvalue' type-id='type-id-717' size-in-bits='64' id='type-id-718'/>
    <qualified-type-def type-id='type-id-110' const='yes' id='type-id-719'/>
    <reference-type-def kind='lvalue' type-id='type-id-719' size-in-bits='64' id='type-id-720'/>
    <qualified-type-def type-id='type-id-280' const='yes' id='type-id-721'/>
    <reference-type-def kind='lvalue' type-id='type-id-721' size-in-bits='64' id='type-id-722'/>
    <pointer-type-def type-id='type-id-721' size-in-bits='64' id='type-id-723'/>
    <qualified-type-def type-id='type-id-723' const='yes' id='type-id-724'/>
    <qualified-type-def type-id='type-id-725' const='yes' id='type-id-726'/>
    <reference-type-def kind='lvalue' type-id='type-id-726' size-in-bits='64' id='type-id-727'/>
    <pointer-type-def type-id='type-id-726' size-in-bits='64' id='type-id-728'/>
    <qualified-type-def type-id='type-id-367' const='yes' id='type-id-729'/>
    <reference-type-def kind='lvalue' type-id='type-id-729' size-in-bits='64' id='type-id-730'/>
    <pointer-type-def type-id='type-id-729' size-in-bits='64' id='type-id-731'/>
    <qualified-type-def type-id='type-id-732' const='yes' id='type-id-733'/>
    <pointer-type-def type-id='type-id-733' size-in-bits='64' id='type-id-734'/>
    <qualified-type-def type-id='type-id-142' const='yes' id='type-id-735'/>
    <pointer-type-def type-id='type-id-735' size-in-bits='64' id='type-id-147'/>
    <qualified-type-def type-id='type-id-285' const='yes' id='type-id-736'/>
    <pointer-type-def type-id='type-id-736' size-in-bits='64' id='type-id-737'/>
    <qualified-type-def type-id='type-id-283' const='yes' id='type-id-738'/>
    <reference-type-def kind='lvalue' type-id='type-id-738' size-in-bits='64' id='type-id-739'/>
    <pointer-type-def type-id='type-id-738' size-in-bits='64' id='type-id-740'/>
    <qualified-type-def type-id='type-id-80' const='yes' id='type-id-741'/>
    <reference-type-def kind='lvalue' type-id='type-id-741' size-in-bits='64' id='type-id-742'/>
    <qualified-type-def type-id='type-id-71' const='yes' id='type-id-743'/>
    <reference-type-def kind='lvalue' type-id='type-id-743' size-in-bits='64' id='type-id-744'/>
    <pointer-type-def type-id='type-id-743' size-in-bits='64' id='type-id-745'/>
    <qualified-type-def type-id='type-id-745' const='yes' id='type-id-746'/>
    <qualified-type-def type-id='type-id-72' const='yes' id='type-id-747'/>
    <pointer-type-def type-id='type-id-747' size-in-bits='64' id='type-id-748'/>
    <qualified-type-def type-id='type-id-73' const='yes' id='type-id-749'/>
    <pointer-type-def type-id='type-id-749' size-in-bits='64' id='type-id-750'/>
    <qualified-type-def type-id='type-id-750' const='yes' id='type-id-751'/>
    <qualified-type-def type-id='type-id-76' const='yes' id='type-id-752'/>
    <reference-type-def kind='lvalue' type-id='type-id-752' size-in-bits='64' id='type-id-753'/>
    <pointer-type-def type-id='type-id-752' size-in-bits='64' id='type-id-754'/>
    <qualified-type-def type-id='type-id-754' const='yes' id='type-id-755'/>
    <qualified-type-def type-id='type-id-77' const='yes' id='type-id-756'/>
    <pointer-type-def type-id='type-id-756' size-in-bits='64' id='type-id-757'/>
    <qualified-type-def type-id='type-id-78' const='yes' id='type-id-758'/>
    <pointer-type-def type-id='type-id-758' size-in-bits='64' id='type-id-759'/>
    <qualified-type-def type-id='type-id-759' const='yes' id='type-id-760'/>
    <qualified-type-def type-id='type-id-81' const='yes' id='type-id-761'/>
    <reference-type-def kind='lvalue' type-id='type-id-761' size-in-bits='64' id='type-id-762'/>
    <qualified-type-def type-id='type-id-763' const='yes' id='type-id-764'/>
    <reference-type-def kind='lvalue' type-id='type-id-764' size-in-bits='64' id='type-id-304'/>
    <qualified-type-def type-id='type-id-299' const='yes' id='type-id-765'/>
    <pointer-type-def type-id='type-id-765' size-in-bits='64' id='type-id-301'/>
    <qualified-type-def type-id='type-id-301' const='yes' id='type-id-766'/>
    <qualified-type-def type-id='type-id-345' const='yes' id='type-id-767'/>
    <reference-type-def kind='lvalue' type-id='type-id-767' size-in-bits='64' id='type-id-768'/>
    <qualified-type-def type-id='type-id-45' const='yes' id='type-id-191'/>
    <reference-type-def kind='lvalue' type-id='type-id-191' size-in-bits='64' id='type-id-116'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-306'/>
    <qualified-type-def type-id='type-id-306' const='yes' id='type-id-37'/>
    <qualified-type-def type-id='type-id-340' const='yes' id='type-id-769'/>
    <pointer-type-def type-id='type-id-769' size-in-bits='64' id='type-id-770'/>
    <qualified-type-def type-id='type-id-770' const='yes' id='type-id-771'/>
    <qualified-type-def type-id='type-id-310' const='yes' id='type-id-772'/>
    <qualified-type-def type-id='type-id-322' const='yes' id='type-id-38'/>
    <reference-type-def kind='lvalue' type-id='type-id-38' size-in-bits='64' id='type-id-773'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-774'/>
    <qualified-type-def type-id='type-id-315' const='yes' id='type-id-775'/>
    <reference-type-def kind='lvalue' type-id='type-id-775' size-in-bits='64' id='type-id-776'/>
    <pointer-type-def type-id='type-id-775' size-in-bits='64' id='type-id-777'/>
    <qualified-type-def type-id='type-id-777' const='yes' id='type-id-778'/>
    <qualified-type-def type-id='type-id-328' const='yes' id='type-id-779'/>
    <reference-type-def kind='lvalue' type-id='type-id-779' size-in-bits='64' id='type-id-780'/>
    <pointer-type-def type-id='type-id-779' size-in-bits='64' id='type-id-781'/>
    <qualified-type-def type-id='type-id-332' const='yes' id='type-id-782'/>
    <reference-type-def kind='lvalue' type-id='type-id-782' size-in-bits='64' id='type-id-783'/>
    <pointer-type-def type-id='type-id-782' size-in-bits='64' id='type-id-784'/>
    <qualified-type-def type-id='type-id-784' const='yes' id='type-id-785'/>
    <qualified-type-def type-id='type-id-98' const='yes' id='type-id-786'/>
    <pointer-type-def type-id='type-id-786' size-in-bits='64' id='type-id-787'/>
    <qualified-type-def type-id='type-id-171' const='yes' id='type-id-788'/>
    <pointer-type-def type-id='type-id-788' size-in-bits='64' id='type-id-789'/>
    <qualified-type-def type-id='type-id-789' const='yes' id='type-id-790'/>
    <qualified-type-def type-id='type-id-170' const='yes' id='type-id-791'/>
    <pointer-type-def type-id='type-id-791' size-in-bits='64' id='type-id-792'/>
    <qualified-type-def type-id='type-id-792' const='yes' id='type-id-793'/>
    <qualified-type-def type-id='type-id-343' const='yes' id='type-id-794'/>
    <reference-type-def kind='lvalue' type-id='type-id-794' size-in-bits='64' id='type-id-795'/>
    <qualified-type-def type-id='type-id-348' const='yes' id='type-id-796'/>
    <pointer-type-def type-id='type-id-796' size-in-bits='64' id='type-id-797'/>
    <qualified-type-def type-id='type-id-797' const='yes' id='type-id-798'/>
    <qualified-type-def type-id='type-id-222' const='yes' id='type-id-799'/>
    <pointer-type-def type-id='type-id-799' size-in-bits='64' id='type-id-800'/>
    <qualified-type-def type-id='type-id-223' const='yes' id='type-id-801'/>
    <pointer-type-def type-id='type-id-801' size-in-bits='64' id='type-id-802'/>
    <qualified-type-def type-id='type-id-233' const='yes' id='type-id-803'/>
    <reference-type-def kind='lvalue' type-id='type-id-803' size-in-bits='64' id='type-id-804'/>
    <pointer-type-def type-id='type-id-803' size-in-bits='64' id='type-id-805'/>
    <qualified-type-def type-id='type-id-239' const='yes' id='type-id-806'/>
    <reference-type-def kind='lvalue' type-id='type-id-806' size-in-bits='64' id='type-id-807'/>
    <pointer-type-def type-id='type-id-806' size-in-bits='64' id='type-id-808'/>
    <qualified-type-def type-id='type-id-238' const='yes' id='type-id-809'/>
    <pointer-type-def type-id='type-id-809' size-in-bits='64' id='type-id-810'/>
    <qualified-type-def type-id='type-id-245' const='yes' id='type-id-811'/>
    <reference-type-def kind='lvalue' type-id='type-id-811' size-in-bits='64' id='type-id-812'/>
    <qualified-type-def type-id='type-id-229' const='yes' id='type-id-226'/>
    <reference-type-def kind='lvalue' type-id='type-id-226' size-in-bits='64' id='type-id-813'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-814'/>
    <qualified-type-def type-id='type-id-246' const='yes' id='type-id-815'/>
    <reference-type-def kind='lvalue' type-id='type-id-815' size-in-bits='64' id='type-id-816'/>
    <qualified-type-def type-id='type-id-247' const='yes' id='type-id-817'/>
    <reference-type-def kind='lvalue' type-id='type-id-817' size-in-bits='64' id='type-id-818'/>
    <qualified-type-def type-id='type-id-249' const='yes' id='type-id-819'/>
    <reference-type-def kind='lvalue' type-id='type-id-819' size-in-bits='64' id='type-id-820'/>
    <qualified-type-def type-id='type-id-237' const='yes' id='type-id-821'/>
    <reference-type-def kind='lvalue' type-id='type-id-821' size-in-bits='64' id='type-id-244'/>
    <pointer-type-def type-id='type-id-821' size-in-bits='64' id='type-id-242'/>
    <qualified-type-def type-id='type-id-248' const='yes' id='type-id-822'/>
    <pointer-type-def type-id='type-id-822' size-in-bits='64' id='type-id-823'/>
    <qualified-type-def type-id='type-id-823' const='yes' id='type-id-824'/>
    <qualified-type-def type-id='type-id-264' const='yes' id='type-id-259'/>
    <qualified-type-def type-id='type-id-265' const='yes' id='type-id-263'/>
    <qualified-type-def type-id='type-id-172' const='yes' id='type-id-825'/>
    <pointer-type-def type-id='type-id-825' size-in-bits='64' id='type-id-826'/>
    <qualified-type-def type-id='type-id-173' const='yes' id='type-id-827'/>
    <pointer-type-def type-id='type-id-827' size-in-bits='64' id='type-id-828'/>
    <qualified-type-def type-id='type-id-183' const='yes' id='type-id-829'/>
    <reference-type-def kind='lvalue' type-id='type-id-829' size-in-bits='64' id='type-id-830'/>
    <pointer-type-def type-id='type-id-829' size-in-bits='64' id='type-id-831'/>
    <qualified-type-def type-id='type-id-189' const='yes' id='type-id-832'/>
    <reference-type-def kind='lvalue' type-id='type-id-832' size-in-bits='64' id='type-id-833'/>
    <pointer-type-def type-id='type-id-832' size-in-bits='64' id='type-id-834'/>
    <qualified-type-def type-id='type-id-188' const='yes' id='type-id-835'/>
    <pointer-type-def type-id='type-id-835' size-in-bits='64' id='type-id-836'/>
    <qualified-type-def type-id='type-id-196' const='yes' id='type-id-837'/>
    <reference-type-def kind='lvalue' type-id='type-id-837' size-in-bits='64' id='type-id-838'/>
    <qualified-type-def type-id='type-id-180' const='yes' id='type-id-176'/>
    <reference-type-def kind='lvalue' type-id='type-id-176' size-in-bits='64' id='type-id-839'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-840'/>
    <qualified-type-def type-id='type-id-197' const='yes' id='type-id-841'/>
    <reference-type-def kind='lvalue' type-id='type-id-841' size-in-bits='64' id='type-id-842'/>
    <qualified-type-def type-id='type-id-198' const='yes' id='type-id-843'/>
    <reference-type-def kind='lvalue' type-id='type-id-843' size-in-bits='64' id='type-id-844'/>
    <qualified-type-def type-id='type-id-200' const='yes' id='type-id-845'/>
    <reference-type-def kind='lvalue' type-id='type-id-845' size-in-bits='64' id='type-id-846'/>
    <qualified-type-def type-id='type-id-187' const='yes' id='type-id-847'/>
    <reference-type-def kind='lvalue' type-id='type-id-847' size-in-bits='64' id='type-id-195'/>
    <pointer-type-def type-id='type-id-847' size-in-bits='64' id='type-id-193'/>
    <qualified-type-def type-id='type-id-199' const='yes' id='type-id-848'/>
    <pointer-type-def type-id='type-id-848' size-in-bits='64' id='type-id-849'/>
    <qualified-type-def type-id='type-id-216' const='yes' id='type-id-211'/>
    <qualified-type-def type-id='type-id-217' const='yes' id='type-id-215'/>
    <qualified-type-def type-id='type-id-378' const='yes' id='type-id-850'/>
    <pointer-type-def type-id='type-id-850' size-in-bits='64' id='type-id-851'/>
    <qualified-type-def type-id='type-id-374' const='yes' id='type-id-852'/>
    <reference-type-def kind='lvalue' type-id='type-id-852' size-in-bits='64' id='type-id-853'/>
    <qualified-type-def type-id='type-id-111' const='yes' id='type-id-854'/>
    <reference-type-def kind='lvalue' type-id='type-id-854' size-in-bits='64' id='type-id-855'/>
    <pointer-type-def type-id='type-id-854' size-in-bits='64' id='type-id-856'/>
    <qualified-type-def type-id='type-id-381' const='yes' id='type-id-857'/>
    <reference-type-def kind='lvalue' type-id='type-id-857' size-in-bits='64' id='type-id-858'/>
    <pointer-type-def type-id='type-id-857' size-in-bits='64' id='type-id-859'/>
    <qualified-type-def type-id='type-id-859' const='yes' id='type-id-860'/>
    <qualified-type-def type-id='type-id-232' const='yes' id='type-id-268'/>
    <qualified-type-def type-id='type-id-282' const='yes' id='type-id-861'/>
    <reference-type-def kind='lvalue' type-id='type-id-861' size-in-bits='64' id='type-id-862'/>
    <qualified-type-def type-id='type-id-281' const='yes' id='type-id-863'/>
    <reference-type-def kind='lvalue' type-id='type-id-863' size-in-bits='64' id='type-id-864'/>
    <pointer-type-def type-id='type-id-863' size-in-bits='64' id='type-id-865'/>
    <qualified-type-def type-id='type-id-325' const='yes' id='type-id-314'/>
    <reference-type-def kind='lvalue' type-id='type-id-314' size-in-bits='64' id='type-id-866'/>
    <pointer-type-def type-id='type-id-314' size-in-bits='64' id='type-id-867'/>
    <qualified-type-def type-id='type-id-867' const='yes' id='type-id-868'/>
    <qualified-type-def type-id='type-id-319' const='yes' id='type-id-869'/>
    <reference-type-def kind='lvalue' type-id='type-id-869' size-in-bits='64' id='type-id-870'/>
    <pointer-type-def type-id='type-id-869' size-in-bits='64' id='type-id-871'/>
    <qualified-type-def type-id='type-id-871' const='yes' id='type-id-872'/>
    <qualified-type-def type-id='type-id-133' const='yes' id='type-id-873'/>
    <reference-type-def kind='lvalue' type-id='type-id-873' size-in-bits='64' id='type-id-874'/>
    <pointer-type-def type-id='type-id-873' size-in-bits='64' id='type-id-875'/>
    <qualified-type-def type-id='type-id-875' const='yes' id='type-id-876'/>
    <qualified-type-def type-id='type-id-390' const='yes' id='type-id-877'/>
    <reference-type-def kind='lvalue' type-id='type-id-877' size-in-bits='64' id='type-id-396'/>
    <pointer-type-def type-id='type-id-877' size-in-bits='64' id='type-id-395'/>
    <qualified-type-def type-id='type-id-90' const='yes' id='type-id-878'/>
    <reference-type-def kind='lvalue' type-id='type-id-878' size-in-bits='64' id='type-id-879'/>
    <qualified-type-def type-id='type-id-91' const='yes' id='type-id-880'/>
    <reference-type-def kind='lvalue' type-id='type-id-880' size-in-bits='64' id='type-id-881'/>
    <qualified-type-def type-id='type-id-93' const='yes' id='type-id-882'/>
    <pointer-type-def type-id='type-id-882' size-in-bits='64' id='type-id-883'/>
    <qualified-type-def type-id='type-id-95' const='yes' id='type-id-884'/>
    <pointer-type-def type-id='type-id-884' size-in-bits='64' id='type-id-885'/>
    <qualified-type-def type-id='type-id-400' const='yes' id='type-id-886'/>
    <pointer-type-def type-id='type-id-886' size-in-bits='64' id='type-id-887'/>
    <qualified-type-def type-id='type-id-888' const='yes' id='type-id-889'/>
    <pointer-type-def type-id='type-id-889' size-in-bits='64' id='type-id-890'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-891'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-892'/>
    <pointer-type-def type-id='type-id-408' size-in-bits='64' id='type-id-893'/>
    <pointer-type-def type-id='type-id-894' size-in-bits='64' id='type-id-41'/>
    <pointer-type-def type-id='type-id-895' size-in-bits='64' id='type-id-415'/>
    <pointer-type-def type-id='type-id-896' size-in-bits='64' id='type-id-128'/>
    <pointer-type-def type-id='type-id-897' size-in-bits='64' id='type-id-131'/>
    <pointer-type-def type-id='type-id-898' size-in-bits='64' id='type-id-43'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-899'/>
    <pointer-type-def type-id='type-id-406' size-in-bits='64' id='type-id-900'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-901'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-902'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-903'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-904'/>
    <pointer-type-def type-id='type-id-428' size-in-bits='64' id='type-id-905'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-906'/>
    <reference-type-def kind='lvalue' type-id='type-id-516' size-in-bits='64' id='type-id-907'/>
    <reference-type-def kind='rvalue' type-id='type-id-516' size-in-bits='64' id='type-id-908'/>
    <pointer-type-def type-id='type-id-516' size-in-bits='64' id='type-id-909'/>
    <pointer-type-def type-id='type-id-910' size-in-bits='64' id='type-id-911'/>
    <pointer-type-def type-id='type-id-912' size-in-bits='64' id='type-id-913'/>
    <reference-type-def kind='lvalue' type-id='type-id-520' size-in-bits='64' id='type-id-914'/>
    <reference-type-def kind='lvalue' type-id='type-id-915' size-in-bits='64' id='type-id-916'/>
    <reference-type-def kind='lvalue' type-id='type-id-523' size-in-bits='64' id='type-id-917'/>
    <reference-type-def kind='rvalue' type-id='type-id-523' size-in-bits='64' id='type-id-918'/>
    <pointer-type-def type-id='type-id-523' size-in-bits='64' id='type-id-919'/>
    <qualified-type-def type-id='type-id-919' const='yes' id='type-id-920'/>
    <pointer-type-def type-id='type-id-921' size-in-bits='64' id='type-id-922'/>
    <qualified-type-def type-id='type-id-922' const='yes' id='type-id-923'/>
    <pointer-type-def type-id='type-id-924' size-in-bits='64' id='type-id-925'/>
    <reference-type-def kind='lvalue' type-id='type-id-528' size-in-bits='64' id='type-id-926'/>
    <reference-type-def kind='lvalue' type-id='type-id-533' size-in-bits='64' id='type-id-927'/>
    <reference-type-def kind='lvalue' type-id='type-id-535' size-in-bits='64' id='type-id-928'/>
    <reference-type-def kind='rvalue' type-id='type-id-535' size-in-bits='64' id='type-id-929'/>
    <pointer-type-def type-id='type-id-535' size-in-bits='64' id='type-id-930'/>
    <reference-type-def kind='lvalue' type-id='type-id-539' size-in-bits='64' id='type-id-931'/>
    <reference-type-def kind='rvalue' type-id='type-id-539' size-in-bits='64' id='type-id-932'/>
    <pointer-type-def type-id='type-id-539' size-in-bits='64' id='type-id-933'/>
    <reference-type-def kind='lvalue' type-id='type-id-542' size-in-bits='64' id='type-id-934'/>
    <reference-type-def kind='rvalue' type-id='type-id-542' size-in-bits='64' id='type-id-935'/>
    <pointer-type-def type-id='type-id-542' size-in-bits='64' id='type-id-936'/>
    <qualified-type-def type-id='type-id-936' const='yes' id='type-id-937'/>
    <reference-type-def kind='lvalue' type-id='type-id-545' size-in-bits='64' id='type-id-938'/>
    <reference-type-def kind='lvalue' type-id='type-id-548' size-in-bits='64' id='type-id-939'/>
    <reference-type-def kind='lvalue' type-id='type-id-551' size-in-bits='64' id='type-id-940'/>
    <pointer-type-def type-id='type-id-551' size-in-bits='64' id='type-id-941'/>
    <reference-type-def kind='lvalue' type-id='type-id-559' size-in-bits='64' id='type-id-942'/>
    <pointer-type-def type-id='type-id-559' size-in-bits='64' id='type-id-943'/>
    <reference-type-def kind='lvalue' type-id='type-id-567' size-in-bits='64' id='type-id-944'/>
    <pointer-type-def type-id='type-id-567' size-in-bits='64' id='type-id-945'/>
    <pointer-type-def type-id='type-id-574' size-in-bits='64' id='type-id-946'/>
    <pointer-type-def type-id='type-id-577' size-in-bits='64' id='type-id-947'/>
    <reference-type-def kind='rvalue' type-id='type-id-948' size-in-bits='64' id='type-id-949'/>
    <pointer-type-def type-id='type-id-435' size-in-bits='64' id='type-id-950'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-951'/>
    <pointer-type-def type-id='type-id-952' size-in-bits='64' id='type-id-167'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-953'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-954'/>
    <pointer-type-def type-id='type-id-955' size-in-bits='64' id='type-id-956'/>
    <pointer-type-def type-id='type-id-957' size-in-bits='64' id='type-id-165'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-16'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-958'/>
    <reference-type-def kind='lvalue' type-id='type-id-31' size-in-bits='64' id='type-id-959'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-960'/>
    <qualified-type-def type-id='type-id-960' const='yes' id='type-id-961'/>
    <reference-type-def kind='lvalue' type-id='type-id-961' size-in-bits='64' id='type-id-962'/>
    <pointer-type-def type-id='type-id-960' size-in-bits='64' id='type-id-963'/>
    <reference-type-def kind='lvalue' type-id='type-id-36' size-in-bits='64' id='type-id-964'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-965'/>
    <pointer-type-def type-id='type-id-966' size-in-bits='64' id='type-id-967'/>
    <pointer-type-def type-id='type-id-355' size-in-bits='64' id='type-id-968'/>
    <qualified-type-def type-id='type-id-968' const='yes' id='type-id-969'/>
    <pointer-type-def type-id='type-id-356' size-in-bits='64' id='type-id-970'/>
    <qualified-type-def type-id='type-id-970' const='yes' id='type-id-971'/>
    <pointer-type-def type-id='type-id-357' size-in-bits='64' id='type-id-972'/>
    <qualified-type-def type-id='type-id-972' const='yes' id='type-id-973'/>
    <pointer-type-def type-id='type-id-361' size-in-bits='64' id='type-id-974'/>
    <qualified-type-def type-id='type-id-974' const='yes' id='type-id-975'/>
    <pointer-type-def type-id='type-id-358' size-in-bits='64' id='type-id-976'/>
    <qualified-type-def type-id='type-id-976' const='yes' id='type-id-977'/>
    <pointer-type-def type-id='type-id-359' size-in-bits='64' id='type-id-978'/>
    <qualified-type-def type-id='type-id-978' const='yes' id='type-id-979'/>
    <pointer-type-def type-id='type-id-360' size-in-bits='64' id='type-id-980'/>
    <qualified-type-def type-id='type-id-980' const='yes' id='type-id-981'/>
    <pointer-type-def type-id='type-id-362' size-in-bits='64' id='type-id-982'/>
    <qualified-type-def type-id='type-id-982' const='yes' id='type-id-983'/>
    <reference-type-def kind='lvalue' type-id='type-id-39' size-in-bits='64' id='type-id-984'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-985'/>
    <qualified-type-def type-id='type-id-985' const='yes' id='type-id-986'/>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' id='type-id-987'/>
    <reference-type-def kind='lvalue' type-id='type-id-69' size-in-bits='64' id='type-id-988'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-989'/>
    <reference-type-def kind='lvalue' type-id='type-id-62' size-in-bits='64' id='type-id-990'/>
    <reference-type-def kind='lvalue' type-id='type-id-57' size-in-bits='64' id='type-id-61'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-59'/>
    <reference-type-def kind='lvalue' type-id='type-id-44' size-in-bits='64' id='type-id-51'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-47'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-991'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-992'/>
    <reference-type-def kind='lvalue' type-id='type-id-138' size-in-bits='64' id='type-id-993'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-994'/>
    <qualified-type-def type-id='type-id-994' const='yes' id='type-id-995'/>
    <pointer-type-def type-id='type-id-401' size-in-bits='64' id='type-id-996'/>
    <qualified-type-def type-id='type-id-996' const='yes' id='type-id-997'/>
    <pointer-type-def type-id='type-id-305' size-in-bits='64' id='type-id-998'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-999'/>
    <reference-type-def kind='lvalue' type-id='type-id-82' size-in-bits='64' id='type-id-1000'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-1001'/>
    <reference-type-def kind='lvalue' type-id='type-id-84' size-in-bits='64' id='type-id-1002'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-1003'/>
    <reference-type-def kind='lvalue' type-id='type-id-288' size-in-bits='64' id='type-id-1004'/>
    <pointer-type-def type-id='type-id-288' size-in-bits='64' id='type-id-298'/>
    <pointer-type-def type-id='type-id-289' size-in-bits='64' id='type-id-1005'/>
    <pointer-type-def type-id='type-id-290' size-in-bits='64' id='type-id-295'/>
    <reference-type-def kind='lvalue' type-id='type-id-292' size-in-bits='64' id='type-id-1006'/>
    <pointer-type-def type-id='type-id-657' size-in-bits='64' id='type-id-1007'/>
    <qualified-type-def type-id='type-id-1007' const='yes' id='type-id-1008'/>
    <reference-type-def kind='lvalue' type-id='type-id-370' size-in-bits='64' id='type-id-373'/>
    <pointer-type-def type-id='type-id-370' size-in-bits='64' id='type-id-1009'/>
    <qualified-type-def type-id='type-id-1009' const='yes' id='type-id-371'/>
    <reference-type-def kind='lvalue' type-id='type-id-372' size-in-bits='64' id='type-id-1010'/>
    <pointer-type-def type-id='type-id-372' size-in-bits='64' id='type-id-1011'/>
    <qualified-type-def type-id='type-id-1011' const='yes' id='type-id-1012'/>
    <reference-type-def kind='lvalue' type-id='type-id-112' size-in-bits='64' id='type-id-1013'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-1014'/>
    <reference-type-def kind='lvalue' type-id='type-id-99' size-in-bits='64' id='type-id-1015'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-1016'/>
    <qualified-type-def type-id='type-id-1016' const='yes' id='type-id-1017'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-1018'/>
    <qualified-type-def type-id='type-id-1018' const='yes' id='type-id-1019'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-1020'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-1021'/>
    <reference-type-def kind='lvalue' type-id='type-id-107' size-in-bits='64' id='type-id-1022'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-1023'/>
    <qualified-type-def type-id='type-id-1023' const='yes' id='type-id-1024'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-117'/>
    <qualified-type-def type-id='type-id-117' const='yes' id='type-id-115'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-122'/>
    <qualified-type-def type-id='type-id-122' const='yes' id='type-id-121'/>
    <reference-type-def kind='lvalue' type-id='type-id-124' size-in-bits='64' id='type-id-1025'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-1026'/>
    <qualified-type-def type-id='type-id-1026' const='yes' id='type-id-1027'/>
    <pointer-type-def type-id='type-id-1028' size-in-bits='64' id='type-id-125'/>
    <reference-type-def kind='lvalue' type-id='type-id-1029' size-in-bits='64' id='type-id-1030'/>
    <reference-type-def kind='lvalue' type-id='type-id-140' size-in-bits='64' id='type-id-1031'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-391'/>
    <qualified-type-def type-id='type-id-391' const='yes' id='type-id-1032'/>
    <reference-type-def kind='lvalue' type-id='type-id-1032' size-in-bits='64' id='type-id-1033'/>
    <reference-type-def kind='lvalue' type-id='type-id-391' size-in-bits='64' id='type-id-1034'/>
    <pointer-type-def type-id='type-id-391' size-in-bits='64' id='type-id-1035'/>
    <reference-type-def kind='lvalue' type-id='type-id-1036' size-in-bits='64' id='type-id-146'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-1037'/>
    <pointer-type-def type-id='type-id-1038' size-in-bits='64' id='type-id-144'/>
    <reference-type-def kind='lvalue' type-id='type-id-149' size-in-bits='64' id='type-id-1039'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-1040'/>
    <qualified-type-def type-id='type-id-1040' const='yes' id='type-id-1041'/>
    <pointer-type-def type-id='type-id-695' size-in-bits='64' id='type-id-1042'/>
    <qualified-type-def type-id='type-id-1042' const='yes' id='type-id-1043'/>
    <pointer-type-def type-id='type-id-698' size-in-bits='64' id='type-id-1044'/>
    <qualified-type-def type-id='type-id-1044' const='yes' id='type-id-1045'/>
    <reference-type-def kind='lvalue' type-id='type-id-151' size-in-bits='64' id='type-id-1046'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-1047'/>
    <reference-type-def kind='lvalue' type-id='type-id-119' size-in-bits='64' id='type-id-1048'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-1049'/>
    <qualified-type-def type-id='type-id-1049' const='yes' id='type-id-1050'/>
    <reference-type-def kind='lvalue' type-id='type-id-349' size-in-bits='64' id='type-id-1051'/>
    <pointer-type-def type-id='type-id-349' size-in-bits='64' id='type-id-1052'/>
    <qualified-type-def type-id='type-id-1052' const='yes' id='type-id-1053'/>
    <pointer-type-def type-id='type-id-352' size-in-bits='64' id='type-id-1054'/>
    <qualified-type-def type-id='type-id-1054' const='yes' id='type-id-1055'/>
    <pointer-type-def type-id='type-id-1056' size-in-bits='64' id='type-id-296'/>
    <reference-type-def kind='lvalue' type-id='type-id-1057' size-in-bits='64' id='type-id-1058'/>
    <reference-type-def kind='lvalue' type-id='type-id-272' size-in-bits='64' id='type-id-1059'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-1060'/>
    <qualified-type-def type-id='type-id-1060' const='yes' id='type-id-1061'/>
    <pointer-type-def type-id='type-id-273' size-in-bits='64' id='type-id-277'/>
    <reference-type-def kind='lvalue' type-id='type-id-278' size-in-bits='64' id='type-id-1062'/>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-1063'/>
    <qualified-type-def type-id='type-id-1063' const='yes' id='type-id-1064'/>
    <reference-type-def kind='lvalue' type-id='type-id-280' size-in-bits='64' id='type-id-1065'/>
    <pointer-type-def type-id='type-id-280' size-in-bits='64' id='type-id-1066'/>
    <qualified-type-def type-id='type-id-1066' const='yes' id='type-id-1067'/>
    <reference-type-def kind='lvalue' type-id='type-id-725' size-in-bits='64' id='type-id-1068'/>
    <pointer-type-def type-id='type-id-725' size-in-bits='64' id='type-id-1069'/>
    <pointer-type-def type-id='type-id-1070' size-in-bits='64' id='type-id-1071'/>
    <reference-type-def kind='lvalue' type-id='type-id-367' size-in-bits='64' id='type-id-1072'/>
    <pointer-type-def type-id='type-id-367' size-in-bits='64' id='type-id-1073'/>
    <pointer-type-def type-id='type-id-1074' size-in-bits='64' id='type-id-368'/>
    <pointer-type-def type-id='type-id-732' size-in-bits='64' id='type-id-1075'/>
    <pointer-type-def type-id='type-id-1076' size-in-bits='64' id='type-id-286'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-145'/>
    <pointer-type-def type-id='type-id-285' size-in-bits='64' id='type-id-1077'/>
    <reference-type-def kind='lvalue' type-id='type-id-1078' size-in-bits='64' id='type-id-1079'/>
    <pointer-type-def type-id='type-id-1078' size-in-bits='64' id='type-id-1080'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-1081'/>
    <qualified-type-def type-id='type-id-1081' const='yes' id='type-id-1082'/>
    <reference-type-def kind='lvalue' type-id='type-id-283' size-in-bits='64' id='type-id-1083'/>
    <pointer-type-def type-id='type-id-283' size-in-bits='64' id='type-id-284'/>
    <reference-type-def kind='lvalue' type-id='type-id-71' size-in-bits='64' id='type-id-1084'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-1085'/>
    <qualified-type-def type-id='type-id-1085' const='yes' id='type-id-1086'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-1087'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-75'/>
    <qualified-type-def type-id='type-id-75' const='yes' id='type-id-1088'/>
    <reference-type-def kind='lvalue' type-id='type-id-76' size-in-bits='64' id='type-id-1089'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-1090'/>
    <qualified-type-def type-id='type-id-1090' const='yes' id='type-id-1091'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-1092'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-79'/>
    <qualified-type-def type-id='type-id-79' const='yes' id='type-id-1093'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-1094'/>
    <pointer-type-def type-id='type-id-299' size-in-bits='64' id='type-id-300'/>
    <pointer-type-def type-id='type-id-403' size-in-bits='64' id='type-id-1095'/>
    <qualified-type-def type-id='type-id-1095' const='yes' id='type-id-1096'/>
    <pointer-type-def type-id='type-id-302' size-in-bits='64' id='type-id-303'/>
    <reference-type-def kind='lvalue' type-id='type-id-45' size-in-bits='64' id='type-id-1097'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-70'/>
    <qualified-type-def type-id='type-id-70' const='yes' id='type-id-1098'/>
    <pointer-type-def type-id='type-id-340' size-in-bits='64' id='type-id-1099'/>
    <qualified-type-def type-id='type-id-1099' const='yes' id='type-id-1100'/>
    <pointer-type-def type-id='type-id-307' size-in-bits='64' id='type-id-1101'/>
    <pointer-type-def type-id='type-id-309' size-in-bits='64' id='type-id-1102'/>
    <reference-type-def kind='lvalue' type-id='type-id-322' size-in-bits='64' id='type-id-1103'/>
    <pointer-type-def type-id='type-id-322' size-in-bits='64' id='type-id-1104'/>
    <reference-type-def kind='lvalue' type-id='type-id-315' size-in-bits='64' id='type-id-1105'/>
    <pointer-type-def type-id='type-id-315' size-in-bits='64' id='type-id-1106'/>
    <qualified-type-def type-id='type-id-1106' const='yes' id='type-id-1107'/>
    <reference-type-def kind='lvalue' type-id='type-id-328' size-in-bits='64' id='type-id-1108'/>
    <pointer-type-def type-id='type-id-328' size-in-bits='64' id='type-id-1109'/>
    <reference-type-def kind='lvalue' type-id='type-id-332' size-in-bits='64' id='type-id-1110'/>
    <pointer-type-def type-id='type-id-332' size-in-bits='64' id='type-id-1111'/>
    <qualified-type-def type-id='type-id-1111' const='yes' id='type-id-1112'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-1113'/>
    <qualified-type-def type-id='type-id-1113' const='yes' id='type-id-1114'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-1115'/>
    <qualified-type-def type-id='type-id-1115' const='yes' id='type-id-1116'/>
    <pointer-type-def type-id='type-id-222' size-in-bits='64' id='type-id-1117'/>
    <qualified-type-def type-id='type-id-1117' const='yes' id='type-id-1118'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-1119'/>
    <reference-type-def kind='lvalue' type-id='type-id-225' size-in-bits='64' id='type-id-1120'/>
    <reference-type-def kind='lvalue' type-id='type-id-227' size-in-bits='64' id='type-id-1121'/>
    <reference-type-def kind='lvalue' type-id='type-id-231' size-in-bits='64' id='type-id-1122'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-1123'/>
    <qualified-type-def type-id='type-id-1123' const='yes' id='type-id-1124'/>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' id='type-id-1125'/>
    <pointer-type-def type-id='type-id-236' size-in-bits='64' id='type-id-234'/>
    <qualified-type-def type-id='type-id-234' const='yes' id='type-id-1126'/>
    <pointer-type-def type-id='type-id-239' size-in-bits='64' id='type-id-235'/>
    <reference-type-def kind='lvalue' type-id='type-id-238' size-in-bits='64' id='type-id-1127'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-1128'/>
    <reference-type-def kind='lvalue' type-id='type-id-240' size-in-bits='64' id='type-id-1129'/>
    <reference-type-def kind='lvalue' type-id='type-id-229' size-in-bits='64' id='type-id-1130'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-1131'/>
    <reference-type-def kind='lvalue' type-id='type-id-237' size-in-bits='64' id='type-id-253'/>
    <pointer-type-def type-id='type-id-237' size-in-bits='64' id='type-id-251'/>
    <pointer-type-def type-id='type-id-248' size-in-bits='64' id='type-id-1132'/>
    <qualified-type-def type-id='type-id-1132' const='yes' id='type-id-1133'/>
    <reference-type-def kind='lvalue' type-id='type-id-258' size-in-bits='64' id='type-id-257'/>
    <reference-type-def kind='lvalue' type-id='type-id-262' size-in-bits='64' id='type-id-261'/>
    <pointer-type-def type-id='type-id-255' size-in-bits='64' id='type-id-1134'/>
    <qualified-type-def type-id='type-id-1134' const='yes' id='type-id-1135'/>
    <reference-type-def kind='lvalue' type-id='type-id-266' size-in-bits='64' id='type-id-1136'/>
    <reference-type-def kind='lvalue' type-id='type-id-267' size-in-bits='64' id='type-id-1137'/>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-1138'/>
    <qualified-type-def type-id='type-id-1138' const='yes' id='type-id-1139'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-1140'/>
    <reference-type-def kind='lvalue' type-id='type-id-175' size-in-bits='64' id='type-id-1141'/>
    <reference-type-def kind='lvalue' type-id='type-id-177' size-in-bits='64' id='type-id-1142'/>
    <reference-type-def kind='lvalue' type-id='type-id-182' size-in-bits='64' id='type-id-1143'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-1144'/>
    <qualified-type-def type-id='type-id-1144' const='yes' id='type-id-1145'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' id='type-id-1146'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-184'/>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' id='type-id-185'/>
    <reference-type-def kind='lvalue' type-id='type-id-188' size-in-bits='64' id='type-id-1147'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-1148'/>
    <reference-type-def kind='lvalue' type-id='type-id-190' size-in-bits='64' id='type-id-1149'/>
    <reference-type-def kind='lvalue' type-id='type-id-180' size-in-bits='64' id='type-id-1150'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-1151'/>
    <reference-type-def kind='lvalue' type-id='type-id-187' size-in-bits='64' id='type-id-204'/>
    <pointer-type-def type-id='type-id-187' size-in-bits='64' id='type-id-202'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-1152'/>
    <qualified-type-def type-id='type-id-1152' const='yes' id='type-id-1153'/>
    <reference-type-def kind='lvalue' type-id='type-id-210' size-in-bits='64' id='type-id-209'/>
    <reference-type-def kind='lvalue' type-id='type-id-214' size-in-bits='64' id='type-id-213'/>
    <pointer-type-def type-id='type-id-206' size-in-bits='64' id='type-id-1154'/>
    <reference-type-def kind='lvalue' type-id='type-id-218' size-in-bits='64' id='type-id-1155'/>
    <reference-type-def kind='lvalue' type-id='type-id-219' size-in-bits='64' id='type-id-1156'/>
    <pointer-type-def type-id='type-id-375' size-in-bits='64' id='type-id-379'/>
    <reference-type-def kind='lvalue' type-id='type-id-378' size-in-bits='64' id='type-id-376'/>
    <pointer-type-def type-id='type-id-378' size-in-bits='64' id='type-id-380'/>
    <reference-type-def kind='lvalue' type-id='type-id-374' size-in-bits='64' id='type-id-1157'/>
    <pointer-type-def type-id='type-id-374' size-in-bits='64' id='type-id-377'/>
    <reference-type-def kind='lvalue' type-id='type-id-111' size-in-bits='64' id='type-id-1158'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-1159'/>
    <pointer-type-def type-id='type-id-381' size-in-bits='64' id='type-id-1160'/>
    <qualified-type-def type-id='type-id-1160' const='yes' id='type-id-1161'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' id='type-id-1162'/>
    <reference-type-def kind='lvalue' type-id='type-id-281' size-in-bits='64' id='type-id-1163'/>
    <pointer-type-def type-id='type-id-281' size-in-bits='64' id='type-id-1164'/>
    <reference-type-def kind='lvalue' type-id='type-id-325' size-in-bits='64' id='type-id-1165'/>
    <pointer-type-def type-id='type-id-325' size-in-bits='64' id='type-id-1166'/>
    <qualified-type-def type-id='type-id-1166' const='yes' id='type-id-1167'/>
    <reference-type-def kind='lvalue' type-id='type-id-319' size-in-bits='64' id='type-id-1168'/>
    <pointer-type-def type-id='type-id-319' size-in-bits='64' id='type-id-1169'/>
    <qualified-type-def type-id='type-id-1169' const='yes' id='type-id-1170'/>
    <reference-type-def kind='lvalue' type-id='type-id-133' size-in-bits='64' id='type-id-1171'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-1172'/>
    <qualified-type-def type-id='type-id-1172' const='yes' id='type-id-1173'/>
    <reference-type-def kind='lvalue' type-id='type-id-390' size-in-bits='64' id='type-id-1174'/>
    <pointer-type-def type-id='type-id-390' size-in-bits='64' id='type-id-393'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-1175'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-1176'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-1177'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-1178'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-1179'/>
    <pointer-type-def type-id='type-id-400' size-in-bits='64' id='type-id-1180'/>
    <pointer-type-def type-id='type-id-888' size-in-bits='64' id='type-id-1181'/>
    <qualified-type-def type-id='type-id-1181' const='yes' id='type-id-1182'/>
    <pointer-type-def type-id='type-id-1183' size-in-bits='64' id='type-id-404'/>
    <qualified-type-def type-id='type-id-404' const='yes' id='type-id-1184'/>
    <pointer-type-def type-id='type-id-1185' size-in-bits='64' id='type-id-1186'/>
    <qualified-type-def type-id='type-id-1186' const='yes' id='type-id-1187'/>
    <pointer-type-def type-id='type-id-1188' size-in-bits='64' id='type-id-1189'/>
    <qualified-type-def type-id='type-id-1189' const='yes' id='type-id-1190'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-439'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-440'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-441'/>
    <class-decl name='wxAppConsole' visibility='default' is-declaration-only='yes' id='type-id-966'/>
    <class-decl name='wxAppConsoleBase' visibility='default' is-declaration-only='yes' id='type-id-600'/>
    <class-decl name='wxConvAuto' visibility='default' is-declaration-only='yes' id='type-id-657'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxConvAuto' mangled-name='_ZN10wxConvAutoD0Ev' filepath='include/wx/convauto.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1007' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxConvAuto' mangled-name='_ZN10wxConvAutoD0Ev' filepath='include/wx/convauto.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1007' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxConvAuto' mangled-name='_ZN10wxConvAutoD2Ev' filepath='include/wx/convauto.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1007' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxConvAuto' mangled-name='_ZN10wxConvAutoD2Ev' filepath='include/wx/convauto.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1007' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxConvAuto' mangled-name='_ZN10wxConvAutoD4Ev' filepath='include/wx/convauto.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1007' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='0'>
        <function-decl name='ToWChar' mangled-name='_ZNK10wxConvAuto7ToWCharEPwmPKcm' filepath='include/wx/convauto.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <parameter type-id='type-id-960'/>
          <parameter type-id='type-id-55'/>
          <parameter type-id='type-id-274'/>
          <parameter type-id='type-id-55'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='1'>
        <function-decl name='FromWChar' mangled-name='_ZNK10wxConvAuto9FromWCharEPcmPKwm' filepath='include/wx/convauto.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <parameter type-id='type-id-341'/>
          <parameter type-id='type-id-55'/>
          <parameter type-id='type-id-308'/>
          <parameter type-id='type-id-55'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='GetMBNulLen' mangled-name='_ZNK10wxConvAuto11GetMBNulLenEv' filepath='include/wx/convauto.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='IsUTF8' mangled-name='_ZNK10wxConvAuto6IsUTF8Ev' filepath='include/wx/convauto.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='7'>
        <function-decl name='Clone' mangled-name='_ZNK10wxConvAuto5CloneEv' filepath='include/wx/convauto.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-1069'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxDirData' visibility='default' is-declaration-only='yes' id='type-id-1028'/>
    <class-decl name='wxDirTraverser' visibility='default' is-declaration-only='yes' id='type-id-1029'/>
    <class-decl name='wxEvent' visibility='default' is-declaration-only='yes' id='type-id-1036'/>
    <class-decl name='wxEventFunctor' visibility='default' is-declaration-only='yes' id='type-id-143'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1037' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1037' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD4Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1037' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK14wxEventFunctor13GetEvtHandlerEv' filepath='include/wx/event.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1191' is-artificial='yes'/>
          <return type-id='type-id-144'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK14wxEventFunctor12GetEvtMethodEv' filepath='include/wx/event.h' line='250' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1191' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEvtHandler' visibility='default' is-declaration-only='yes' id='type-id-1038'>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='SetNextHandler' mangled-name='_ZN12wxEvtHandler14SetNextHandlerEPS_' filepath='include/wx/event.h' line='3647' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-144' is-artificial='yes'/>
          <parameter type-id='type-id-144'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='SetPreviousHandler' mangled-name='_ZN12wxEvtHandler18SetPreviousHandlerEPS_' filepath='include/wx/event.h' line='3648' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-144' is-artificial='yes'/>
          <parameter type-id='type-id-144'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='ProcessEvent' mangled-name='_ZN12wxEvtHandler12ProcessEventER7wxEvent' filepath='include/wx/event.h' line='3677' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-144' is-artificial='yes'/>
          <parameter type-id='type-id-146'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='QueueEvent' mangled-name='_ZN12wxEvtHandler10QueueEventEP7wxEvent' filepath='include/wx/event.h' line='3705' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-144' is-artificial='yes'/>
          <parameter type-id='type-id-1192'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='AddPendingEvent' mangled-name='_ZN12wxEvtHandler15AddPendingEventERK7wxEvent' filepath='include/wx/event.h' line='3709' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-144' is-artificial='yes'/>
          <parameter type-id='type-id-1193'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='SearchEventTable' mangled-name='_ZN12wxEvtHandler16SearchEventTableER12wxEventTableR7wxEvent' filepath='include/wx/event.h' line='3964' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-144' is-artificial='yes'/>
          <parameter type-id='type-id-1194'/>
          <parameter type-id='type-id-146'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='11'>
        <function-decl name='TryBefore' mangled-name='_ZN12wxEvtHandler9TryBeforeER7wxEvent' filepath='include/wx/event.h' line='3994' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-144' is-artificial='yes'/>
          <parameter type-id='type-id-146'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='12'>
        <function-decl name='TryAfter' mangled-name='_ZN12wxEvtHandler8TryAfterER7wxEvent' filepath='include/wx/event.h' line='4014' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-144' is-artificial='yes'/>
          <parameter type-id='type-id-146'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='13'>
        <function-decl name='OnDynamicBind' mangled-name='_ZN12wxEvtHandler13OnDynamicBindER24wxDynamicEventTableEntry' filepath='include/wx/event.h' line='4029' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-144' is-artificial='yes'/>
          <parameter type-id='type-id-1195'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='16'>
        <function-decl name='DoSetClientObject' mangled-name='_ZN12wxEvtHandler17DoSetClientObjectEP12wxClientData' filepath='include/wx/event.h' line='4073' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-144' is-artificial='yes'/>
          <parameter type-id='type-id-1196'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='17'>
        <function-decl name='DoGetClientObject' mangled-name='_ZNK12wxEvtHandler17DoGetClientObjectEv' filepath='include/wx/event.h' line='4074' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1197' is-artificial='yes'/>
          <return type-id='type-id-1196'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='18'>
        <function-decl name='DoSetClientData' mangled-name='_ZN12wxEvtHandler15DoSetClientDataEPv' filepath='include/wx/event.h' line='4076' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-144' is-artificial='yes'/>
          <parameter type-id='type-id-16'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='19'>
        <function-decl name='DoGetClientData' mangled-name='_ZNK12wxEvtHandler15DoGetClientDataEv' filepath='include/wx/event.h' line='4077' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1197' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='20'>
        <function-decl name='WXReservedEvtHandler1' mangled-name='_ZN12wxEvtHandler21WXReservedEvtHandler1EPv' filepath='include/wx/event.h' line='4083' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-144' is-artificial='yes'/>
          <parameter type-id='type-id-16'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='21'>
        <function-decl name='WXReservedEvtHandler2' mangled-name='_ZN12wxEvtHandler21WXReservedEvtHandler2EPv' filepath='include/wx/event.h' line='4084' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-144' is-artificial='yes'/>
          <parameter type-id='type-id-16'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxFFileInputStream' visibility='default' is-declaration-only='yes' id='type-id-695'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFFileInputStream' mangled-name='_ZN18wxFFileInputStreamD1Ev' filepath='include/wx/wfstream.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1042' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFFileInputStream' mangled-name='_ZN18wxFFileInputStreamD4Ev' filepath='include/wx/wfstream.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1042' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='IsOk' mangled-name='_ZNK18wxFFileInputStream4IsOkEv' filepath='include/wx/wfstream.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-697' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxFFileOutputStream' visibility='default' is-declaration-only='yes' id='type-id-698'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFFileOutputStream' mangled-name='_ZN19wxFFileOutputStreamD1Ev' filepath='include/wx/wfstream.h' line='222' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1044' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFFileOutputStream' mangled-name='_ZN19wxFFileOutputStreamD4Ev' filepath='include/wx/wfstream.h' line='222' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1044' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='IsOk' mangled-name='_ZNK19wxFFileOutputStream4IsOkEv' filepath='include/wx/wfstream.h' line='229' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-700' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxHashTable' visibility='default' is-declaration-only='yes' id='type-id-1056'/>
    <class-decl name='wxHashTable_Node' visibility='default' is-declaration-only='yes' id='type-id-291'/>
    <class-decl name='wxInputStream' visibility='default' is-declaration-only='yes' id='type-id-1057'/>
    <class-decl name='wxLog' visibility='default' is-declaration-only='yes' id='type-id-1198'/>
    <class-decl name='wxMBConv' visibility='default' is-declaration-only='yes' id='type-id-725'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMBConv' mangled-name='_ZN8wxMBConvD0Ev' filepath='include/wx/strconv.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1069' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMBConv' mangled-name='_ZN8wxMBConvD0Ev' filepath='include/wx/strconv.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1069' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMBConv' mangled-name='_ZN8wxMBConvD2Ev' filepath='include/wx/strconv.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1069' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMBConv' mangled-name='_ZN8wxMBConvD2Ev' filepath='include/wx/strconv.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1069' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMBConv' mangled-name='_ZN8wxMBConvD4Ev' filepath='include/wx/strconv.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1069' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='0'>
        <function-decl name='ToWChar' mangled-name='_ZNK8wxMBConv7ToWCharEPwmPKcm' filepath='include/wx/strconv.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-728' is-artificial='yes'/>
          <parameter type-id='type-id-960'/>
          <parameter type-id='type-id-55'/>
          <parameter type-id='type-id-274'/>
          <parameter type-id='type-id-55'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='1'>
        <function-decl name='FromWChar' mangled-name='_ZNK8wxMBConv9FromWCharEPcmPKwm' filepath='include/wx/strconv.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-728' is-artificial='yes'/>
          <parameter type-id='type-id-341'/>
          <parameter type-id='type-id-55'/>
          <parameter type-id='type-id-308'/>
          <parameter type-id='type-id-55'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetMaxCharLen' mangled-name='_ZNK8wxMBConv13GetMaxCharLenEv' filepath='include/wx/strconv.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-728' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='GetMBNulLen' mangled-name='_ZNK8wxMBConv11GetMBNulLenEv' filepath='include/wx/strconv.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-728' is-artificial='yes'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='IsUTF8' mangled-name='_ZNK8wxMBConv6IsUTF8Ev' filepath='include/wx/strconv.h' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-728' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='MB2WC' mangled-name='_ZNK8wxMBConv5MB2WCEPwPKcm' filepath='include/wx/strconv.h' line='165' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-728' is-artificial='yes'/>
          <parameter type-id='type-id-960'/>
          <parameter type-id='type-id-274'/>
          <parameter type-id='type-id-55'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='6'>
        <function-decl name='WC2MB' mangled-name='_ZNK8wxMBConv5WC2MBEPcPKwm' filepath='include/wx/strconv.h' line='166' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-728' is-artificial='yes'/>
          <parameter type-id='type-id-341'/>
          <parameter type-id='type-id-308'/>
          <parameter type-id='type-id-55'/>
          <return type-id='type-id-55'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxMBConvStrictUTF8' visibility='default' is-declaration-only='yes' id='type-id-1070'/>
    <class-decl name='wxMutexInternal' visibility='default' is-declaration-only='yes' id='type-id-1074'/>
    <class-decl name='wxObject' visibility='default' is-declaration-only='yes' id='type-id-732'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1075' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1075' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1075' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1075' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD4Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1075' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK8wxObject12GetClassInfoEv' filepath='include/wx/object.h' line='446' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-734' is-artificial='yes'/>
          <return type-id='type-id-298'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='3'>
        <function-decl name='CreateRefData' mangled-name='_ZNK8wxObject13CreateRefDataEv' filepath='include/wx/object.h' line='464' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-734' is-artificial='yes'/>
          <return type-id='type-id-1077'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='4'>
        <function-decl name='CloneRefData' mangled-name='_ZNK8wxObject12CloneRefDataEPK12wxRefCounter' filepath='include/wx/object.h' line='467' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-734' is-artificial='yes'/>
          <parameter type-id='type-id-737'/>
          <return type-id='type-id-1077'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxOutputStream' visibility='default' is-declaration-only='yes' id='type-id-1078'/>
    <class-decl name='wxStackFrame' visibility='default' is-declaration-only='yes' id='type-id-763'/>
    <class-decl name='wxStackWalker' visibility='default' is-declaration-only='yes' id='type-id-403'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxStackWalker' mangled-name='_ZN13wxStackWalkerD0Ev' filepath='include/wx/unix/stackwalk.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1095' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxStackWalker' mangled-name='_ZN13wxStackWalkerD2Ev' filepath='include/wx/unix/stackwalk.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1095' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxStackWalker' mangled-name='_ZN13wxStackWalkerD4Ev' filepath='include/wx/unix/stackwalk.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1095' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='Walk' mangled-name='_ZN13wxStackWalker4WalkEmm' filepath='include/wx/unix/stackwalk.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1095' is-artificial='yes'/>
          <parameter type-id='type-id-55'/>
          <parameter type-id='type-id-55'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <function-decl name='WalkFromException' mangled-name='_ZN13wxStackWalker17WalkFromExceptionEm' filepath='include/wx/unix/stackwalk.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1095' is-artificial='yes'/>
          <parameter type-id='type-id-55'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxThread' visibility='default' is-declaration-only='yes' id='type-id-375'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-379' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-379' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD4Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-379' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='0'>
        <function-decl name='TestDestroy' mangled-name='_ZN8wxThread11TestDestroyEv' filepath='include/wx/thread.h' line='593' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-379' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='4'>
        <function-decl name='OnDelete' mangled-name='_ZN8wxThread8OnDeleteEv' filepath='include/wx/thread.h' line='622' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-379' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='5'>
        <function-decl name='OnKill' mangled-name='_ZN8wxThread6OnKillEv' filepath='include/wx/thread.h' line='626' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-379' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='6'>
        <function-decl name='OnExit' mangled-name='_ZN8wxThread6OnExitEv' filepath='include/wx/thread.h' line='631' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-379' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxXmlDocument' visibility='default' is-declaration-only='yes' id='type-id-888'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxXmlDocument' mangled-name='_ZN13wxXmlDocumentD0Ev' filepath='include/wx/xml/xml.h' line='292' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1181' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxXmlDocument' mangled-name='_ZN13wxXmlDocumentD2Ev' filepath='include/wx/xml/xml.h' line='292' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1181' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxXmlDocument' mangled-name='_ZN13wxXmlDocumentD4Ev' filepath='include/wx/xml/xml.h' line='292' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1181' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK13wxXmlDocument12GetClassInfoEv' filepath='include/wx/xml/xml.h' line='361' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-890' is-artificial='yes'/>
          <return type-id='type-id-298'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='Load' mangled-name='_ZN13wxXmlDocument4LoadERK8wxStringS2_i' filepath='include/wx/xml/xml.h' line='299' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1181' is-artificial='yes'/>
          <parameter type-id='type-id-116'/>
          <parameter type-id='type-id-116'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='Load' mangled-name='_ZN13wxXmlDocument4LoadER13wxInputStreamRK8wxStringi' filepath='include/wx/xml/xml.h' line='301' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1181' is-artificial='yes'/>
          <parameter type-id='type-id-1058'/>
          <parameter type-id='type-id-116'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='7'>
        <function-decl name='Save' mangled-name='_ZNK13wxXmlDocument4SaveERK8wxStringi' filepath='include/wx/xml/xml.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-890' is-artificial='yes'/>
          <parameter type-id='type-id-116'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='8'>
        <function-decl name='Save' mangled-name='_ZNK13wxXmlDocument4SaveER14wxOutputStreami' filepath='include/wx/xml/xml.h' line='306' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-890' is-artificial='yes'/>
          <parameter type-id='type-id-1079'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxXmlNode' visibility='default' is-declaration-only='yes' id='type-id-1183'/>
    <class-decl name='wxZipEntry' visibility='default' is-declaration-only='yes' id='type-id-1185'/>
    <class-decl name='wxZipOutputStream' visibility='default' is-declaration-only='yes' id='type-id-1188'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxZipOutputStream' mangled-name='_ZN17wxZipOutputStreamD1Ev' filepath='include/wx/zipstrm.h' line='301' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1189' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxZipOutputStream' mangled-name='_ZN17wxZipOutputStreamD4Ev' filepath='include/wx/zipstrm.h' line='301' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1189' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <function-decl name='Close' mangled-name='_ZN17wxZipOutputStream5CloseEv' filepath='include/wx/zipstrm.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1189' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <namespace-decl name='wxPrivate'>
      <class-decl name='UntypedBufferData' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='30' column='1' id='type-id-74'>
        <member-type access='public'>
          <enum-decl name='Kind' filepath='include/wx/buffer.h' line='32' column='1' id='type-id-1199'>
            <underlying-type type-id='type-id-26'/>
            <enumerator name='Owned' value='0'/>
            <enumerator name='NonOwned' value='1'/>
          </enum-decl>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='m_str' type-id='type-id-16' visibility='default' filepath='include/wx/buffer.h' line='47' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='m_length' type-id='type-id-55' visibility='default' filepath='include/wx/buffer.h' line='48' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='m_ref' type-id='type-id-28' visibility='default' filepath='include/wx/buffer.h' line='51' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='144'>
          <var-decl name='m_owned' type-id='type-id-3' visibility='default' filepath='include/wx/buffer.h' line='53' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='wxVectorMemOpsMovable&lt;wxDynamicLibraryDetails*&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/vector.h' line='75' column='1' id='type-id-1200'/>
    </namespace-decl>
    <class-decl name='wxDebugReport' visibility='default' filepath='include/wx/debugrpt.h' line='27' column='1' is-declaration-only='yes' id='type-id-114'>
      <member-type access='public'>
        <enum-decl name='Context' filepath='include/wx/debugrpt.h' line='34' column='1' id='type-id-1201'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Context_Current' value='0'/>
          <enumerator name='Context_Exception' value='1'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_dir' type-id='type-id-45' visibility='default' filepath='include/wx/debugrpt.h' line='124' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='m_files' type-id='type-id-39' visibility='default' filepath='include/wx/debugrpt.h' line='127' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='m_descriptions' type-id='type-id-39' visibility='default' filepath='include/wx/debugrpt.h' line='128' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='Process' mangled-name='_ZN13wxDebugReport7ProcessEv' filepath='src/common/debugrpt.cpp' line='550' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxDebugReport7ProcessEv@@WXU_3.2'>
          <parameter type-id='type-id-1024' name='this' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='AddAll' mangled-name='_ZN13wxDebugReport6AddAllENS_7ContextE' filepath='src/common/debugrpt.cpp' line='335' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxDebugReport6AddAllENS_7ContextE@@WXU_3.2'>
          <parameter type-id='type-id-1024' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-1201' name='context' filepath='src/common/debugrpt.cpp' line='335' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetFile' mangled-name='_ZNK13wxDebugReport7GetFileEmP8wxStringS1_' filepath='src/common/debugrpt.cpp' line='322' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxDebugReport7GetFileEmP8wxStringS1_@@WXU_3.2'>
          <parameter type-id='type-id-678' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-55' name='n' filepath='src/common/debugrpt.cpp' line='322' column='1'/>
          <parameter type-id='type-id-70' name='name' filepath='src/common/debugrpt.cpp' line='322' column='1'/>
          <parameter type-id='type-id-70' name='desc' filepath='src/common/debugrpt.cpp' line='322' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='RemoveFile' mangled-name='_ZN13wxDebugReport10RemoveFileERK8wxString' filepath='src/common/debugrpt.cpp' line='311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxDebugReport10RemoveFileERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-1024' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-116' name='name' filepath='src/common/debugrpt.cpp' line='311' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='AddText' mangled-name='_ZN13wxDebugReport7AddTextERK8wxStringS2_S2_' filepath='src/common/debugrpt.cpp' line='286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxDebugReport7AddTextERK8wxStringS2_S2_@@WXU_3.2'>
          <parameter type-id='type-id-1024' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-116' name='filename' filepath='src/common/debugrpt.cpp' line='286' column='1'/>
          <parameter type-id='type-id-116' name='text' filepath='src/common/debugrpt.cpp' line='287' column='1'/>
          <parameter type-id='type-id-116' name='description' filepath='src/common/debugrpt.cpp' line='288' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxDebugReport' mangled-name='_ZN13wxDebugReportC2Ev' filepath='src/common/debugrpt.cpp' line='186' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxDebugReportC2Ev@@WXU_3.2'>
          <parameter type-id='type-id-1023' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxDebugReport' mangled-name='_ZN13wxDebugReportD4Ev' filepath='src/common/debugrpt.cpp' line='217' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1023' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxDebugReport' mangled-name='_ZN13wxDebugReportD0Ev' filepath='src/common/debugrpt.cpp' line='217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxDebugReportD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-1023' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxDebugReport' mangled-name='_ZN13wxDebugReportD2Ev' filepath='src/common/debugrpt.cpp' line='217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxDebugReportD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-1023' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='AddFile' mangled-name='_ZN13wxDebugReport7AddFileERK8wxStringS2_' filepath='src/common/debugrpt.cpp' line='259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxDebugReport7AddFileERK8wxStringS2_@@WXU_3.2'>
          <parameter type-id='type-id-1023' is-artificial='yes'/>
          <parameter type-id='type-id-116'/>
          <parameter type-id='type-id-116'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <function-decl name='AddContext' mangled-name='_ZN13wxDebugReport10AddContextENS_7ContextE' filepath='src/common/debugrpt.cpp' line='447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxDebugReport10AddContextENS_7ContextE@@WXU_3.2'>
          <parameter type-id='type-id-1023' is-artificial='yes'/>
          <parameter type-id='type-id-1201'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetReportName' mangled-name='_ZNK13wxDebugReport13GetReportNameEv' filepath='src/common/debugrpt.cpp' line='250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxDebugReport13GetReportNameEv@@WXU_3.2'>
          <parameter type-id='type-id-677' is-artificial='yes'/>
          <return type-id='type-id-45'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='5'>
        <function-decl name='DoAddSystemInfo' mangled-name='_ZN13wxDebugReport15DoAddSystemInfoEP9wxXmlNode' filepath='src/common/debugrpt.cpp' line='356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxDebugReport15DoAddSystemInfoEP9wxXmlNode@@WXU_3.2'>
          <parameter type-id='type-id-1023' is-artificial='yes'/>
          <parameter type-id='type-id-404'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='6'>
        <function-decl name='DoAddLoadedModules' mangled-name='_ZN13wxDebugReport18DoAddLoadedModulesEP9wxXmlNode' filepath='src/common/debugrpt.cpp' line='363' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxDebugReport18DoAddLoadedModulesEP9wxXmlNode@@WXU_3.2'>
          <parameter type-id='type-id-1023' is-artificial='yes'/>
          <parameter type-id='type-id-404'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='7'>
        <function-decl name='DoAddExceptionInfo' mangled-name='_ZN13wxDebugReport18DoAddExceptionInfoEP9wxXmlNode' filepath='src/common/debugrpt.cpp' line='401' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxDebugReport18DoAddExceptionInfoEP9wxXmlNode@@WXU_3.2'>
          <parameter type-id='type-id-1023' is-artificial='yes'/>
          <parameter type-id='type-id-404'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='8'>
        <function-decl name='DoAddCustomContext' mangled-name='_ZN13wxDebugReport18DoAddCustomContextEP9wxXmlNode' filepath='include/wx/debugrpt.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1023' is-artificial='yes'/>
          <parameter type-id='type-id-404'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='9'>
        <function-decl name='DoProcess' mangled-name='_ZN13wxDebugReport9DoProcessEv' filepath='src/common/debugrpt.cpp' line='572' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxDebugReport9DoProcessEv@@WXU_3.2'>
          <parameter type-id='type-id-1023' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='10'>
        <function-decl name='GetSaveLocation' mangled-name='_ZNK13wxDebugReport15GetSaveLocationEv' filepath='src/common/debugrpt.cpp' line='598' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxDebugReport15GetSaveLocationEv@@WXU_3.2'>
          <parameter type-id='type-id-677' is-artificial='yes'/>
          <return type-id='type-id-119'/>
        </function-decl>
      </member-function>
    </class-decl>
    <function-decl name='setlocale' filepath='/usr/include/locale.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-274'/>
      <return type-id='type-id-341'/>
    </function-decl>
    <function-decl name='localeconv' filepath='/usr/include/locale.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-900'/>
    </function-decl>
    <function-decl name='remove' filepath='/usr/include/stdio.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='rename' filepath='/usr/include/stdio.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <parameter type-id='type-id-274'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='tmpnam' filepath='/usr/include/stdio.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-341'/>
      <return type-id='type-id-341'/>
    </function-decl>
    <function-decl name='fflush' filepath='/usr/include/stdio.h' line='230' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='setbuf' filepath='/usr/include/stdio.h' line='328' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-341'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='setvbuf' filepath='/usr/include/stdio.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-341'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='fgetc' filepath='/usr/include/stdio.h' line='513' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='getc' filepath='/usr/include/stdio.h' line='514' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='getchar' filepath='/usr/include/stdio.h' line='520' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='fgets' filepath='/usr/include/stdio.h' line='592' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-341'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-150'/>
      <return type-id='type-id-341'/>
    </function-decl>
    <function-decl name='ungetc' filepath='/usr/include/stdio.h' line='668' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-150'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='fread' filepath='/usr/include/stdio.h' line='675' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-150'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='fseek' filepath='/usr/include/stdio.h' line='713' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='ftell' filepath='/usr/include/stdio.h' line='718' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='rewind' filepath='/usr/include/stdio.h' line='723' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='clearerr' filepath='/usr/include/stdio.h' line='786' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='feof' filepath='/usr/include/stdio.h' line='788' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='ferror' filepath='/usr/include/stdio.h' line='790' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-150'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='perror' filepath='/usr/include/stdio.h' line='804' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='atof' filepath='/usr/include/stdlib.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atoi' filepath='/usr/include/stdlib.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='atol' filepath='/usr/include/stdlib.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='atoll' filepath='/usr/include/stdlib.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='strtod' filepath='/usr/include/stdlib.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <parameter type-id='type-id-476'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='strtof' filepath='/usr/include/stdlib.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <parameter type-id='type-id-476'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='strtold' filepath='/usr/include/stdlib.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <parameter type-id='type-id-476'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='strtol' filepath='/usr/include/stdlib.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <parameter type-id='type-id-476'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='strtoul' filepath='/usr/include/stdlib.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <parameter type-id='type-id-476'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='strtoll' filepath='/usr/include/stdlib.h' line='201' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <parameter type-id='type-id-476'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='strtoull' filepath='/usr/include/stdlib.h' line='206' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <parameter type-id='type-id-476'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rand' filepath='/usr/include/stdlib.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='srand' filepath='/usr/include/stdlib.h' line='456' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='543' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='555' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='atexit' filepath='/usr/include/stdlib.h' line='602' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-956'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='quick_exit' filepath='/usr/include/stdlib.h' line='630' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='641' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <return type-id='type-id-341'/>
    </function-decl>
    <function-decl name='system' filepath='/usr/include/stdlib.h' line='791' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='bsearch' filepath='/usr/include/stdlib.h' line='828' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-416'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='qsort' filepath='/usr/include/stdlib.h' line='838' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-416'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='div' filepath='/usr/include/stdlib.h' line='860' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-409'/>
    </function-decl>
    <function-decl name='ldiv' filepath='/usr/include/stdlib.h' line='862' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-411'/>
    </function-decl>
    <function-decl name='lldiv' filepath='/usr/include/stdlib.h' line='866' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-413'/>
    </function-decl>
    <function-decl name='mblen' filepath='/usr/include/stdlib.h' line='930' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='mbtowc' filepath='/usr/include/stdlib.h' line='933' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-960'/>
      <parameter type-id='type-id-274'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='wctomb' filepath='/usr/include/stdlib.h' line='937' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-341'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='mbstowcs' filepath='/usr/include/stdlib.h' line='941' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-960'/>
      <parameter type-id='type-id-274'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='wcstombs' filepath='/usr/include/stdlib.h' line='945' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-341'/>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='strcmp' filepath='/usr/include/string.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <parameter type-id='type-id-274'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='rmdir' filepath='/usr/include/unistd.h' line='867' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='wcscpy' filepath='/usr/include/wchar.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-960'/>
      <parameter type-id='type-id-308'/>
      <return type-id='type-id-960'/>
    </function-decl>
    <function-decl name='wcsncpy' filepath='/usr/include/wchar.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-960'/>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-960'/>
    </function-decl>
    <function-decl name='wcscat' filepath='/usr/include/wchar.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-960'/>
      <parameter type-id='type-id-308'/>
      <return type-id='type-id-960'/>
    </function-decl>
    <function-decl name='wcsncat' filepath='/usr/include/wchar.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-960'/>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-960'/>
    </function-decl>
    <function-decl name='wcscmp' filepath='/usr/include/wchar.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-308'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='wcsncmp' filepath='/usr/include/wchar.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='wcscoll' filepath='/usr/include/wchar.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-308'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='wcsxfrm' filepath='/usr/include/wchar.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-960'/>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='wcscspn' filepath='/usr/include/wchar.h' line='188' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-308'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='wcsspn' filepath='/usr/include/wchar.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-308'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='wcstok' filepath='/usr/include/wchar.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-960'/>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-963'/>
      <return type-id='type-id-960'/>
    </function-decl>
    <function-decl name='wcslen' filepath='/usr/include/wchar.h' line='223' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='wmemcmp' filepath='/usr/include/wchar.h' line='259' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='wmemcpy' filepath='/usr/include/wchar.h' line='263' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-960'/>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-960'/>
    </function-decl>
    <function-decl name='wmemmove' filepath='/usr/include/wchar.h' line='268' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-960'/>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-960'/>
    </function-decl>
    <function-decl name='wmemset' filepath='/usr/include/wchar.h' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-960'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-960'/>
    </function-decl>
    <function-decl name='btowc' filepath='/usr/include/wchar.h' line='285' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-436'/>
    </function-decl>
    <function-decl name='wctob' filepath='/usr/include/wchar.h' line='289' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-436'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='mbsinit' filepath='/usr/include/wchar.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-515'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='mbrtowc' filepath='/usr/include/wchar.h' line='297' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-960'/>
      <parameter type-id='type-id-274'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-905'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='wcrtomb' filepath='/usr/include/wchar.h' line='302' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-341'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-905'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='mbrlen' filepath='/usr/include/wchar.h' line='308' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-274'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-905'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='mbsrtowcs' filepath='/usr/include/wchar.h' line='338' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-960'/>
      <parameter type-id='type-id-510'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-905'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='wcsrtombs' filepath='/usr/include/wchar.h' line='344' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-341'/>
      <parameter type-id='type-id-596'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-905'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='wcstod' filepath='/usr/include/wchar.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-963'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='wcstof' filepath='/usr/include/wchar.h' line='383' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-963'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='wcstold' filepath='/usr/include/wchar.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-963'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='wcstol' filepath='/usr/include/wchar.h' line='429' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-963'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='wcstoul' filepath='/usr/include/wchar.h' line='434' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-963'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='wcstoll' filepath='/usr/include/wchar.h' line='442' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-963'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='wcstoull' filepath='/usr/include/wchar.h' line='449' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-963'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='fwide' filepath='/usr/include/wchar.h' line='588' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-442'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='fwprintf' filepath='/usr/include/wchar.h' line='595' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-442'/>
      <parameter type-id='type-id-308'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='wprintf' filepath='/usr/include/wchar.h' line='602' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='swprintf' filepath='/usr/include/wchar.h' line='605' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-960'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-308'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='vfwprintf' filepath='/usr/include/wchar.h' line='613' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-442'/>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-951'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='vwprintf' filepath='/usr/include/wchar.h' line='621' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-951'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='vswprintf' filepath='/usr/include/wchar.h' line='626' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-960'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-951'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='fgetwc' filepath='/usr/include/wchar.h' line='744' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-442'/>
      <return type-id='type-id-436'/>
    </function-decl>
    <function-decl name='getwc' filepath='/usr/include/wchar.h' line='745' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-442'/>
      <return type-id='type-id-436'/>
    </function-decl>
    <function-decl name='getwchar' filepath='/usr/include/wchar.h' line='751' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-436'/>
    </function-decl>
    <function-decl name='fputwc' filepath='/usr/include/wchar.h' line='758' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-442'/>
      <return type-id='type-id-436'/>
    </function-decl>
    <function-decl name='putwc' filepath='/usr/include/wchar.h' line='759' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-442'/>
      <return type-id='type-id-436'/>
    </function-decl>
    <function-decl name='putwchar' filepath='/usr/include/wchar.h' line='765' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-436'/>
    </function-decl>
    <function-decl name='fgetws' filepath='/usr/include/wchar.h' line='773' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-960'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-442'/>
      <return type-id='type-id-960'/>
    </function-decl>
    <function-decl name='fputws' filepath='/usr/include/wchar.h' line='780' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-442'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='ungetwc' filepath='/usr/include/wchar.h' line='788' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-436'/>
      <parameter type-id='type-id-442'/>
      <return type-id='type-id-436'/>
    </function-decl>
    <function-decl name='wcsftime' filepath='/usr/include/wchar.h' line='852' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-960'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-589'/>
      <return type-id='type-id-55'/>
