<abi-corpus version='2.0' architecture='elf-amd-x86_64' soname='libwx_gtk3u_richtext-3.2.so.0'>
  <elf-needed>
    <dependency name='libwx_gtk3u_html-3.2.so.0'/>
    <dependency name='libwx_baseu_xml-3.2.so.0'/>
    <dependency name='libwx_gtk3u_core-3.2.so.0'/>
    <dependency name='libwx_baseu-3.2.so.0'/>
    <dependency name='libm.so.6'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_Z12wxTextAttrEqRK14wxRichTextAttrS1_' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Z16wxRichTextTabsEqRK10wxArrayIntS1_' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Z20wxRichTextApplyStyleR14wxRichTextAttrRKS_PS_' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Z20wxRichTextModuleInitv' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Z21wxRichTextRemoveStyleR14wxRichTextAttrRKS_' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_ZTV34wxRichTextCharacterStyleDefinition' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV34wxRichTextParagraphStyleDefinition' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV6wxList' size='48' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV9wxPenBase' size='216' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RICHTEXT_BUFFER_RESET' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RICHTEXT_CHARACTER' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RICHTEXT_CONSUMING_CHARACTER' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RICHTEXT_CONTENT_DELETED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RICHTEXT_CONTENT_INSERTED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RICHTEXT_DELETE' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RICHTEXT_FOCUS_OBJECT_CHANGED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RICHTEXT_LEFT_CLICK' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RICHTEXT_LEFT_DCLICK' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RICHTEXT_MIDDLE_CLICK' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RICHTEXT_PROPERTIES_CHANGED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RICHTEXT_RETURN' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RICHTEXT_RIGHT_CLICK' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RICHTEXT_SELECTION_CHANGED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RICHTEXT_STYLESHEET_CHANGED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RICHTEXT_STYLESHEET_CHANGING' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RICHTEXT_STYLESHEET_REPLACED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RICHTEXT_STYLESHEET_REPLACING' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_RICHTEXT_STYLE_CHANGED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxRichTextLineBreakChar' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/richtext/richtextbuffer.cpp' language='LANG_C_plus_plus_14'>
    <type-decl name='__float128' size-in-bits='128' id='type-id-1'/>
    <type-decl name='__int128' size-in-bits='128' id='type-id-2'/>
    <type-decl name='bool' size-in-bits='8' id='type-id-3'/>
    <type-decl name='char' size-in-bits='8' id='type-id-4'/>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='128' id='type-id-5'>
      <subrange length='16' type-id='type-id-6' id='type-id-7'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='8' id='type-id-8'>
      <subrange length='1' type-id='type-id-6' id='type-id-9'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='160' id='type-id-10'>
      <subrange length='20' type-id='type-id-6' id='type-id-11'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='32' id='type-id-12'>
      <subrange length='4' type-id='type-id-6' id='type-id-13'/>
    </array-type-def>
    <class-decl name='typedef __va_list_tag __va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-16' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='type-id-17'/>
    <type-decl name='float' size-in-bits='32' id='type-id-18'/>
    <type-decl name='int' size-in-bits='32' id='type-id-19'/>
    <type-decl name='long double' size-in-bits='128' id='type-id-20'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-21'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-22'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-23'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-24'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-25'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-26'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-27'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-15'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-6'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-28'/>
    <type-decl name='variadic parameter type' id='type-id-29'/>
    <type-decl name='void' id='type-id-30'/>
    <type-decl name='wchar_t' size-in-bits='32' id='type-id-31'/>
    <array-type-def dimensions='1' type-id='type-id-31' size-in-bits='128' id='type-id-32'>
      <subrange length='4' type-id='type-id-6' id='type-id-13'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-33' size-in-bits='64' id='type-id-34'>
      <subrange length='2' type-id='type-id-6' id='type-id-35'/>
    </array-type-def>
    <class-decl name='wxArrayString' size-in-bits='320' visibility='default' filepath='include/wx/arrstr.h' line='157' column='1' id='type-id-36'>
      <member-type access='public'>
        <typedef-decl name='CompareFunction' type-id='type-id-38' filepath='include/wx/arrstr.h' line='161' column='1' id='type-id-37'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CompareFunction2' type-id='type-id-40' filepath='include/wx/arrstr.h' line='165' column='1' id='type-id-39'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-42' filepath='include/wx/arrstr.h' line='267' column='1' id='type-id-41'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-44' filepath='include/wx/arrstr.h' line='270' column='1' id='type-id-43'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-46' filepath='include/wx/arrstr.h' line='271' column='1' id='type-id-45'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-48' filepath='include/wx/arrstr.h' line='272' column='1' id='type-id-47'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-50' filepath='include/wx/arrstr.h' line='273' column='1' id='type-id-49'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-52' filepath='include/wx/arrstr.h' line='275' column='1' id='type-id-51'/>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator' size-in-bits='64' visibility='default' filepath='include/wx/arrstr.h' line='278' column='1' id='type-id-53'>
          <member-type access='private'>
            <typedef-decl name='value_type' type-id='type-id-42' filepath='include/wx/arrstr.h' line='280' column='1' id='type-id-54'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='type-id-56' filepath='include/wx/arrstr.h' line='281' column='1' id='type-id-55'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reference' type-id='type-id-58' filepath='include/wx/arrstr.h' line='282' column='1' id='type-id-57'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='itor' type-id='type-id-53' filepath='include/wx/arrstr.h' line='283' column='1' id='type-id-59'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_ptr' type-id='type-id-55' visibility='default' filepath='include/wx/arrstr.h' line='289' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_reverse_iterator' size-in-bits='64' visibility='default' filepath='include/wx/arrstr.h' line='304' column='1' id='type-id-60'>
          <member-type access='private'>
            <typedef-decl name='value_type' type-id='type-id-42' filepath='include/wx/arrstr.h' line='306' column='1' id='type-id-61'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='type-id-63' filepath='include/wx/arrstr.h' line='307' column='1' id='type-id-62'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reference' type-id='type-id-65' filepath='include/wx/arrstr.h' line='308' column='1' id='type-id-64'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='itor' type-id='type-id-60' filepath='include/wx/arrstr.h' line='309' column='1' id='type-id-66'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_ptr' type-id='type-id-62' visibility='default' filepath='include/wx/arrstr.h' line='315' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_compareFunction' type-id='type-id-37' visibility='default' filepath='include/wx/arrstr.h' line='393' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_nSize' type-id='type-id-52' visibility='default' filepath='include/wx/arrstr.h' line='406' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_nCount' type-id='type-id-52' visibility='default' filepath='include/wx/arrstr.h' line='407' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_pItems' type-id='type-id-67' visibility='default' filepath='include/wx/arrstr.h' line='409' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_autoSort' type-id='type-id-3' visibility='default' filepath='include/wx/arrstr.h' line='411' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxBrushStyle' filepath='include/wx/brush.h' line='20' column='1' id='type-id-68'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxBRUSHSTYLE_INVALID' value='-1'/>
      <enumerator name='wxBRUSHSTYLE_SOLID' value='100'/>
      <enumerator name='wxBRUSHSTYLE_TRANSPARENT' value='106'/>
      <enumerator name='wxBRUSHSTYLE_STIPPLE_MASK_OPAQUE' value='107'/>
      <enumerator name='wxBRUSHSTYLE_STIPPLE_MASK' value='108'/>
      <enumerator name='wxBRUSHSTYLE_STIPPLE' value='110'/>
      <enumerator name='wxBRUSHSTYLE_BDIAGONAL_HATCH' value='111'/>
      <enumerator name='wxBRUSHSTYLE_CROSSDIAG_HATCH' value='112'/>
      <enumerator name='wxBRUSHSTYLE_FDIAGONAL_HATCH' value='113'/>
      <enumerator name='wxBRUSHSTYLE_CROSS_HATCH' value='114'/>
      <enumerator name='wxBRUSHSTYLE_HORIZONTAL_HATCH' value='115'/>
      <enumerator name='wxBRUSHSTYLE_VERTICAL_HATCH' value='116'/>
      <enumerator name='wxBRUSHSTYLE_FIRST_HATCH' value='111'/>
      <enumerator name='wxBRUSHSTYLE_LAST_HATCH' value='116'/>
    </enum-decl>
    <class-decl name='wxBrushBase' size-in-bits='128' visibility='default' filepath='include/wx/brush.h' line='41' column='1' id='type-id-69'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-70'/>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBrushBase' mangled-name='_ZN11wxBrushBaseD4Ev' filepath='include/wx/brush.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-71' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='SetColour' mangled-name='_ZN11wxBrushBase9SetColourERK8wxColour' filepath='include/wx/brush.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-71' is-artificial='yes'/>
          <parameter type-id='type-id-72'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='SetColour' mangled-name='_ZN11wxBrushBase9SetColourEhhh' filepath='include/wx/brush.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-71' is-artificial='yes'/>
          <parameter type-id='type-id-27'/>
          <parameter type-id='type-id-27'/>
          <parameter type-id='type-id-27'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='SetStyle' mangled-name='_ZN11wxBrushBase8SetStyleE12wxBrushStyle' filepath='include/wx/brush.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-71' is-artificial='yes'/>
          <parameter type-id='type-id-68'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <function-decl name='SetStipple' mangled-name='_ZN11wxBrushBase10SetStippleERK8wxBitmap' filepath='include/wx/brush.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-71' is-artificial='yes'/>
          <parameter type-id='type-id-73'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='12'>
        <function-decl name='GetColour' mangled-name='_ZNK11wxBrushBase9GetColourEv' filepath='include/wx/brush.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-74' is-artificial='yes'/>
          <return type-id='type-id-75'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='13'>
        <function-decl name='GetStyle' mangled-name='_ZNK11wxBrushBase8GetStyleEv' filepath='include/wx/brush.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-74' is-artificial='yes'/>
          <return type-id='type-id-68'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='14'>
        <function-decl name='GetStipple' mangled-name='_ZNK11wxBrushBase10GetStippleEv' filepath='include/wx/brush.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-74' is-artificial='yes'/>
          <return type-id='type-id-76'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='15'>
        <function-decl name='IsHatch' mangled-name='_ZNK11wxBrushBase7IsHatchEv' filepath='include/wx/brush.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-74' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxScopedCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='66' column='1' id='type-id-77'>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-4' filepath='include/wx/buffer.h' line='69' column='1' id='type-id-78'/>
      </member-type>
      <member-type access='protected'>
        <class-decl name='Data' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='164' column='1' id='type-id-79'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-80'/>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-81' visibility='default' filepath='include/wx/buffer.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxScopedCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='66' column='1' id='type-id-82'>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-31' filepath='include/wx/buffer.h' line='69' column='1' id='type-id-83'/>
      </member-type>
      <member-type access='protected'>
        <class-decl name='Data' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='164' column='1' id='type-id-84'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-80'/>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-85' visibility='default' filepath='include/wx/buffer.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxScopedCharBuffer' type-id='type-id-77' filepath='include/wx/buffer.h' line='241' column='1' id='type-id-86'/>
    <typedef-decl name='wxScopedWCharBuffer' type-id='type-id-82' filepath='include/wx/buffer.h' line='242' column='1' id='type-id-87'/>
    <class-decl name='wxCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='247' column='1' id='type-id-88'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-77'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-4' filepath='include/wx/buffer.h' line='253' column='1' id='type-id-89'/>
      </member-type>
    </class-decl>
    <class-decl name='wxCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='247' column='1' id='type-id-90'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-82'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-31' filepath='include/wx/buffer.h' line='253' column='1' id='type-id-91'/>
      </member-type>
    </class-decl>
    <class-decl name='wxCharBuffer' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='357' column='1' id='type-id-92'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-88'/>
      <member-type access='public'>
        <typedef-decl name='wxCharTypeBufferBase' type-id='type-id-88' filepath='include/wx/buffer.h' line='360' column='1' id='type-id-93'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='wxScopedCharTypeBufferBase' type-id='type-id-77' filepath='include/wx/buffer.h' line='361' column='1' id='type-id-94'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWCharBuffer' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='374' column='1' id='type-id-95'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-90'/>
      <member-type access='public'>
        <typedef-decl name='wxCharTypeBufferBase' type-id='type-id-90' filepath='include/wx/buffer.h' line='377' column='1' id='type-id-96'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='wxScopedCharTypeBufferBase' type-id='type-id-82' filepath='include/wx/buffer.h' line='378' column='1' id='type-id-97'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWritableCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='393' column='1' id='type-id-98'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-88'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-78' filepath='include/wx/buffer.h' line='396' column='1' id='type-id-99'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWritableCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='393' column='1' id='type-id-100'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-90'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-83' filepath='include/wx/buffer.h' line='396' column='1' id='type-id-101'/>
      </member-type>
    </class-decl>
    <typedef-decl name='wxWritableCharBuffer' type-id='type-id-98' filepath='include/wx/buffer.h' line='410' column='1' id='type-id-102'/>
    <typedef-decl name='wxWritableWCharBuffer' type-id='type-id-100' filepath='include/wx/buffer.h' line='411' column='1' id='type-id-103'/>
    <class-decl name='wxMemoryBufferData' size-in-bits='256' visibility='default' filepath='include/wx/buffer.h' line='440' column='1' id='type-id-104'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-16' visibility='default' filepath='include/wx/buffer.h' line='501' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_size' type-id='type-id-52' visibility='default' filepath='include/wx/buffer.h' line='504' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_len' type-id='type-id-52' visibility='default' filepath='include/wx/buffer.h' line='507' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_ref' type-id='type-id-52' visibility='default' filepath='include/wx/buffer.h' line='510' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxMemoryBuffer' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='516' column='1' id='type-id-105'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_bufdata' type-id='type-id-106' visibility='default' filepath='include/wx/buffer.h' line='613' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxChar' type-id='type-id-31' filepath='include/wx/chartype.h' line='123' column='1' id='type-id-33'/>
    <typedef-decl name='wxStringCharType' type-id='type-id-31' filepath='include/wx/chartype.h' line='170' column='1' id='type-id-107'/>
    <class-decl name='wxDataObjectSimple' size-in-bits='192' visibility='default' filepath='include/wx/dataobj.h' line='194' column='1' id='type-id-108'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-109'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_format' type-id='type-id-110' visibility='default' filepath='include/wx/dataobj.h' line='244' column='1'/>
      </data-member>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetPreferredFormat' mangled-name='_ZNK18wxDataObjectSimple18GetPreferredFormatEN16wxDataObjectBase9DirectionE' filepath='include/wx/dataobj.h' line='226' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <parameter type-id='type-id-112'/>
          <return type-id='type-id-110'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='GetFormatCount' mangled-name='_ZNK18wxDataObjectSimple14GetFormatCountEN16wxDataObjectBase9DirectionE' filepath='include/wx/dataobj.h' line='228' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <parameter type-id='type-id-112'/>
          <return type-id='type-id-52'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetAllFormats' mangled-name='_ZNK18wxDataObjectSimple13GetAllFormatsEP12wxDataFormatN16wxDataObjectBase9DirectionE' filepath='include/wx/dataobj.h' line='230' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <parameter type-id='type-id-113'/>
          <parameter type-id='type-id-112'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetDataSize' mangled-name='_ZNK18wxDataObjectSimple11GetDataSizeERK12wxDataFormat' filepath='include/wx/dataobj.h' line='233' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <parameter type-id='type-id-114'/>
          <return type-id='type-id-52'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='6'>
        <function-decl name='GetDataHere' mangled-name='_ZNK18wxDataObjectSimple11GetDataHereERK12wxDataFormatPv' filepath='include/wx/dataobj.h' line='235' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <parameter type-id='type-id-114'/>
          <parameter type-id='type-id-16'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='SetData' mangled-name='_ZN18wxDataObjectSimple7SetDataERK12wxDataFormatmPKv' filepath='include/wx/dataobj.h' line='238' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-115' is-artificial='yes'/>
          <parameter type-id='type-id-114'/>
          <parameter type-id='type-id-52'/>
          <parameter type-id='type-id-16'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='9'>
        <function-decl name='GetDataSize' mangled-name='_ZNK18wxDataObjectSimple11GetDataSizeEv' filepath='include/wx/dataobj.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <return type-id='type-id-52'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='10'>
        <function-decl name='GetDataHere' mangled-name='_ZNK18wxDataObjectSimple11GetDataHereEPv' filepath='include/wx/dataobj.h' line='217' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <parameter type-id='type-id-16'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <function-decl name='SetData' mangled-name='_ZN18wxDataObjectSimple7SetDataEmPKv' filepath='include/wx/dataobj.h' line='221' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-115' is-artificial='yes'/>
          <parameter type-id='type-id-52'/>
          <parameter type-id='type-id-16'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxBitmapDataObjectBase' size-in-bits='320' visibility='default' filepath='include/wx/dataobj.h' line='446' column='1' id='type-id-116'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-108'/>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_bitmap' type-id='type-id-117' visibility='default' filepath='include/wx/dataobj.h' line='462' column='1'/>
      </data-member>
      <member-function access='public' const='yes' vtable-offset='12'>
        <function-decl name='GetBitmap' mangled-name='_ZNK22wxBitmapDataObjectBase9GetBitmapEv' filepath='include/wx/dataobj.h' line='458' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-118' is-artificial='yes'/>
          <return type-id='type-id-117'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <function-decl name='SetBitmap' mangled-name='_ZN22wxBitmapDataObjectBase9SetBitmapERK8wxBitmap' filepath='include/wx/dataobj.h' line='459' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-119' is-artificial='yes'/>
          <parameter type-id='type-id-73'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='wxRasterOperationMode' filepath='include/wx/dc.h' line='50' column='1' id='type-id-120'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxCLEAR' value='0'/>
      <enumerator name='wxXOR' value='1'/>
      <enumerator name='wxINVERT' value='2'/>
      <enumerator name='wxOR_REVERSE' value='3'/>
      <enumerator name='wxAND_REVERSE' value='4'/>
      <enumerator name='wxCOPY' value='5'/>
      <enumerator name='wxAND' value='6'/>
      <enumerator name='wxAND_INVERT' value='7'/>
      <enumerator name='wxNO_OP' value='8'/>
      <enumerator name='wxNOR' value='9'/>
      <enumerator name='wxEQUIV' value='10'/>
      <enumerator name='wxSRC_INVERT' value='11'/>
      <enumerator name='wxOR_INVERT' value='12'/>
      <enumerator name='wxNAND' value='13'/>
      <enumerator name='wxOR' value='14'/>
      <enumerator name='wxSET' value='15'/>
    </enum-decl>
    <enum-decl name='wxKeyType' filepath='include/wx/defs.h' line='1857' column='1' id='type-id-121'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxKEY_NONE' value='0'/>
      <enumerator name='wxKEY_INTEGER' value='1'/>
      <enumerator name='wxKEY_STRING' value='2'/>
    </enum-decl>
    <typedef-decl name='wxWindowID' type-id='type-id-19' filepath='include/wx/defs.h' line='2069' column='1' id='type-id-122'/>
    <enum-decl name='wxDataFormatId' filepath='include/wx/defs.h' line='2239' column='1' id='type-id-123'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxDF_INVALID' value='0'/>
      <enumerator name='wxDF_TEXT' value='1'/>
      <enumerator name='wxDF_BITMAP' value='2'/>
      <enumerator name='wxDF_METAFILE' value='3'/>
      <enumerator name='wxDF_SYLK' value='4'/>
      <enumerator name='wxDF_DIF' value='5'/>
      <enumerator name='wxDF_TIFF' value='6'/>
      <enumerator name='wxDF_OEMTEXT' value='7'/>
      <enumerator name='wxDF_DIB' value='8'/>
      <enumerator name='wxDF_PALETTE' value='9'/>
      <enumerator name='wxDF_PENDATA' value='10'/>
      <enumerator name='wxDF_RIFF' value='11'/>
      <enumerator name='wxDF_WAVE' value='12'/>
      <enumerator name='wxDF_UNICODETEXT' value='13'/>
      <enumerator name='wxDF_ENHMETAFILE' value='14'/>
      <enumerator name='wxDF_FILENAME' value='15'/>
      <enumerator name='wxDF_LOCALE' value='16'/>
      <enumerator name='wxDF_PRIVATE' value='20'/>
      <enumerator name='wxDF_HTML' value='30'/>
      <enumerator name='wxDF_PNG' value='31'/>
      <enumerator name='wxDF_MAX' value='32'/>
    </enum-decl>
    <typedef-decl name='wxSortCompareFunction' type-id='type-id-124' filepath='include/wx/defs.h' line='2687' column='1' id='type-id-125'/>
    <typedef-decl name='GdkAtom' type-id='type-id-126' filepath='include/wx/defs.h' line='3078' column='1' id='type-id-127'/>
    <class-decl name='wxArray_SortFunction&lt;int&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-128'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-130' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-129'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-129' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArray_SortFunction&lt;wxRect*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-131'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-133' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-132'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-132' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArray_SortFunction&lt;wxRichTextAttr*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-134'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-136' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-135'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-135' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArray_SortFunction&lt;wxRichTextFloatRectMap*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-137'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-139' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-138'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-138' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArray_SortFunction&lt;wxRichTextObject*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-140'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-142' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-141'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-141' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArray_SortFunction&lt;wxRichTextObjectPtrArray*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-143'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-145' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-144'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-144' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArray_SortFunction&lt;wxRichTextRange*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-146'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-148' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-147'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-147' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArray_SortFunction&lt;wxVariant*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-149'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-151' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-150'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-150' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;int&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-152'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-154' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-153'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-153' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;wxRect*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-155'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-157' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-156'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-156' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;wxRichTextAttr*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-158'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-160' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-159'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-159' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;wxRichTextFloatRectMap*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-161'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-163' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-162'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-162' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;wxRichTextObject*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-164'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-166' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-165'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-165' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;wxRichTextObjectPtrArray*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-167'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-169' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-168'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-168' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;wxRichTextRange*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-170'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-172' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-171'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-171' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;wxVariant*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-173'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-175' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-174'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-174' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxBaseArray&lt;int, wxSortedArray_SortFunction&lt;int&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-176'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-177'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-153' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-178'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-129' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-179'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-181' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-180'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-183' filepath='include/wx/dynarray.h' line='91' column='1' id='type-id-182'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reverse_iterator' type-id='type-id-185' filepath='include/wx/dynarray.h' line='92' column='1' id='type-id-184'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseArray&lt;wxRect*, wxSortedArray_SortFunction&lt;wxRect*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-186'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-187'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-156' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-188'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-132' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-189'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-191' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-190'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseArray&lt;wxRichTextAttr*, wxSortedArray_SortFunction&lt;wxRichTextAttr*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-192'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-193'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-159' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-194'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-135' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-195'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-197' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-196'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseArray&lt;wxRichTextFloatRectMap*, wxSortedArray_SortFunction&lt;wxRichTextFloatRectMap*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-198'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-199'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-162' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-200'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-138' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-201'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-203' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-202'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-205' filepath='include/wx/dynarray.h' line='91' column='1' id='type-id-204'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reverse_iterator' type-id='type-id-207' filepath='include/wx/dynarray.h' line='92' column='1' id='type-id-206'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseArray&lt;wxRichTextObject*, wxSortedArray_SortFunction&lt;wxRichTextObject*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-208'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-209'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-165' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-210'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-141' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-211'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-213' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-212'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseArray&lt;wxRichTextObjectPtrArray*, wxSortedArray_SortFunction&lt;wxRichTextObjectPtrArray*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-214'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-215'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-168' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-216'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-144' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-217'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-219' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-218'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseArray&lt;wxRichTextRange*, wxSortedArray_SortFunction&lt;wxRichTextRange*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-220'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-221'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-171' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-222'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-147' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-223'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-225' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-224'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseArray&lt;wxVariant*, wxSortedArray_SortFunction&lt;wxVariant*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-226'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-227'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-174' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-228'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-150' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-229'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-231' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-230'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseSortedArray&lt;wxRichTextFloatRectMap*, wxSortedArray_SortFunction&lt;wxRichTextFloatRectMap*&gt; &gt;' size-in-bits='256' visibility='default' filepath='include/wx/dynarray.h' line='231' column='1' id='type-id-232'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-198'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-162' filepath='include/wx/dynarray.h' line='234' column='1' id='type-id-233'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_fnCompare' type-id='type-id-233' visibility='default' filepath='include/wx/dynarray.h' line='262' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxBaseObjectArray&lt;wxRect, wxObjectArrayTraitsForwxRichTextRectArray&gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='276' column='1' id='type-id-234'>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-186'/>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-236' filepath='include/wx/dynarray.h' line='281' column='1' id='type-id-235'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-133' filepath='include/wx/dynarray.h' line='283' column='1' id='type-id-237'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseObjectArray&lt;wxRichTextAttr, wxObjectArrayTraitsForwxRichTextAttrArray&gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='276' column='1' id='type-id-238'>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-192'/>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-240' filepath='include/wx/dynarray.h' line='281' column='1' id='type-id-239'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-136' filepath='include/wx/dynarray.h' line='283' column='1' id='type-id-241'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseObjectArray&lt;wxRichTextObjectPtrArray, wxObjectArrayTraitsForwxRichTextObjectPtrArrayArray&gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='276' column='1' id='type-id-242'>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-214'/>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-244' filepath='include/wx/dynarray.h' line='281' column='1' id='type-id-243'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-145' filepath='include/wx/dynarray.h' line='283' column='1' id='type-id-245'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseObjectArray&lt;wxRichTextRange, wxObjectArrayTraitsForwxRichTextRangeArray&gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='276' column='1' id='type-id-246'>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-220'/>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-248' filepath='include/wx/dynarray.h' line='281' column='1' id='type-id-247'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-148' filepath='include/wx/dynarray.h' line='283' column='1' id='type-id-249'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseObjectArray&lt;wxVariant, wxObjectArrayTraitsForwxRichTextVariantArray&gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='276' column='1' id='type-id-250'>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-226'/>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-252' filepath='include/wx/dynarray.h' line='281' column='1' id='type-id-251'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-151' filepath='include/wx/dynarray.h' line='283' column='1' id='type-id-253'/>
      </member-type>
    </class-decl>
    <class-decl name='wxArrayInt' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='858' column='1' id='type-id-254'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-176'/>
    </class-decl>
    <typedef-decl name='wxEventType' type-id='type-id-19' filepath='include/wx/event.h' line='77' column='1' id='type-id-255'/>
    <class-decl name='wxEventTypeTag&lt;wxRichTextEvent&gt;' size-in-bits='32' visibility='default' filepath='include/wx/event.h' line='202' column='1' id='type-id-256'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_type' type-id='type-id-255' visibility='default' filepath='include/wx/event.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxObjectEventFunctor' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='258' column='1' id='type-id-257'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-258'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-259' visibility='default' filepath='include/wx/event.h' line='288' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxObjectEventFunctorclEP12wxEvtHandlerR7wxEvent' filepath='include/wx/event.h' line='4105' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-260' is-artificial='yes'/>
          <parameter type-id='type-id-259'/>
          <parameter type-id='type-id-261'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxObjectEventFunctor10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <parameter type-id='type-id-263'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxObjectEventFunctor13GetEvtHandlerEv' filepath='include/wx/event.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <return type-id='type-id-259'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxObjectEventFunctor12GetEvtMethodEv' filepath='include/wx/event.h' line='284' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-262' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='wxEventCategory' filepath='include/wx/event.h' line='911' column='1' id='type-id-264'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxEVT_CATEGORY_UI' value='1'/>
      <enumerator name='wxEVT_CATEGORY_USER_INPUT' value='2'/>
      <enumerator name='wxEVT_CATEGORY_SOCKET' value='4'/>
      <enumerator name='wxEVT_CATEGORY_TIMER' value='8'/>
      <enumerator name='wxEVT_CATEGORY_THREAD' value='16'/>
      <enumerator name='wxEVT_CATEGORY_UNKNOWN' value='32'/>
      <enumerator name='wxEVT_CATEGORY_CLIPBOARD' value='64'/>
      <enumerator name='wxEVT_CATEGORY_NATIVE_EVENTS' value='3'/>
      <enumerator name='wxEVT_CATEGORY_ALL' value='127'/>
    </enum-decl>
    <class-decl name='wxEventBasicPayloadMixin' size-in-bits='512' visibility='default' filepath='include/wx/event.h' line='1254' column='1' id='type-id-265'>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_cmdString' type-id='type-id-42' visibility='default' filepath='include/wx/event.h' line='1275' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='384'>
        <var-decl name='m_commandInt' type-id='type-id-19' visibility='default' filepath='include/wx/event.h' line='1276' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='448'>
        <var-decl name='m_extraLong' type-id='type-id-21' visibility='default' filepath='include/wx/event.h' line='1277' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxFile' size-in-bits='64' visibility='default' filepath='include/wx/file.h' line='30' column='1' id='type-id-266'>
      <member-type access='public'>
        <enum-decl name='OpenMode' filepath='include/wx/file.h' line='39' column='1' id='type-id-267'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='read' value='0'/>
          <enumerator name='write' value='1'/>
          <enumerator name='read_write' value='2'/>
          <enumerator name='write_append' value='3'/>
          <enumerator name='write_excl' value='4'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_fd' type-id='type-id-19' visibility='default' filepath='include/wx/file.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='m_lasterror' type-id='type-id-19' visibility='default' filepath='include/wx/file.h' line='132' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxSeekMode' filepath='include/wx/filefn.h' line='55' column='1' id='type-id-268'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxFromStart' value='0'/>
      <enumerator name='wxFromCurrent' value='1'/>
      <enumerator name='wxFromEnd' value='2'/>
    </enum-decl>
    <enum-decl name='wxFileKind' filepath='include/wx/filefn.h' line='62' column='1' id='type-id-269'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxFILE_KIND_UNKNOWN' value='0'/>
      <enumerator name='wxFILE_KIND_DISK' value='1'/>
      <enumerator name='wxFILE_KIND_TERMINAL' value='2'/>
      <enumerator name='wxFILE_KIND_PIPE' value='3'/>
    </enum-decl>
    <typedef-decl name='wxFileOffset' type-id='type-id-270' filepath='include/wx/filefn.h' line='343' column='1' id='type-id-271'/>
    <enum-decl name='wxFontFamily' filepath='include/wx/font.h' line='38' column='1' id='type-id-272'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxFONTFAMILY_DEFAULT' value='70'/>
      <enumerator name='wxFONTFAMILY_DECORATIVE' value='71'/>
      <enumerator name='wxFONTFAMILY_ROMAN' value='72'/>
      <enumerator name='wxFONTFAMILY_SCRIPT' value='73'/>
      <enumerator name='wxFONTFAMILY_SWISS' value='74'/>
      <enumerator name='wxFONTFAMILY_MODERN' value='75'/>
      <enumerator name='wxFONTFAMILY_TELETYPE' value='76'/>
      <enumerator name='wxFONTFAMILY_MAX' value='77'/>
      <enumerator name='wxFONTFAMILY_UNKNOWN' value='77'/>
    </enum-decl>
    <enum-decl name='wxFontStyle' filepath='include/wx/font.h' line='52' column='1' id='type-id-273'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxFONTSTYLE_NORMAL' value='90'/>
      <enumerator name='wxFONTSTYLE_ITALIC' value='93'/>
      <enumerator name='wxFONTSTYLE_SLANT' value='94'/>
      <enumerator name='wxFONTSTYLE_MAX' value='95'/>
    </enum-decl>
    <enum-decl name='wxFontWeight' filepath='include/wx/font.h' line='61' column='1' id='type-id-274'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxFONTWEIGHT_INVALID' value='0'/>
      <enumerator name='wxFONTWEIGHT_THIN' value='100'/>
      <enumerator name='wxFONTWEIGHT_EXTRALIGHT' value='200'/>
      <enumerator name='wxFONTWEIGHT_LIGHT' value='300'/>
      <enumerator name='wxFONTWEIGHT_NORMAL' value='400'/>
      <enumerator name='wxFONTWEIGHT_MEDIUM' value='500'/>
      <enumerator name='wxFONTWEIGHT_SEMIBOLD' value='600'/>
      <enumerator name='wxFONTWEIGHT_BOLD' value='700'/>
      <enumerator name='wxFONTWEIGHT_EXTRABOLD' value='800'/>
      <enumerator name='wxFONTWEIGHT_HEAVY' value='900'/>
      <enumerator name='wxFONTWEIGHT_EXTRAHEAVY' value='1000'/>
      <enumerator name='wxFONTWEIGHT_MAX' value='1000'/>
    </enum-decl>
    <enum-decl name='wxFontEncoding' filepath='include/wx/fontenc.h' line='15' column='1' id='type-id-275'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxFONTENCODING_SYSTEM' value='-1'/>
      <enumerator name='wxFONTENCODING_DEFAULT' value='0'/>
      <enumerator name='wxFONTENCODING_ISO8859_1' value='1'/>
      <enumerator name='wxFONTENCODING_ISO8859_2' value='2'/>
      <enumerator name='wxFONTENCODING_ISO8859_3' value='3'/>
      <enumerator name='wxFONTENCODING_ISO8859_4' value='4'/>
      <enumerator name='wxFONTENCODING_ISO8859_5' value='5'/>
      <enumerator name='wxFONTENCODING_ISO8859_6' value='6'/>
      <enumerator name='wxFONTENCODING_ISO8859_7' value='7'/>
      <enumerator name='wxFONTENCODING_ISO8859_8' value='8'/>
      <enumerator name='wxFONTENCODING_ISO8859_9' value='9'/>
      <enumerator name='wxFONTENCODING_ISO8859_10' value='10'/>
      <enumerator name='wxFONTENCODING_ISO8859_11' value='11'/>
      <enumerator name='wxFONTENCODING_ISO8859_12' value='12'/>
      <enumerator name='wxFONTENCODING_ISO8859_13' value='13'/>
      <enumerator name='wxFONTENCODING_ISO8859_14' value='14'/>
      <enumerator name='wxFONTENCODING_ISO8859_15' value='15'/>
      <enumerator name='wxFONTENCODING_ISO8859_MAX' value='16'/>
      <enumerator name='wxFONTENCODING_KOI8' value='17'/>
      <enumerator name='wxFONTENCODING_KOI8_U' value='18'/>
      <enumerator name='wxFONTENCODING_ALTERNATIVE' value='19'/>
      <enumerator name='wxFONTENCODING_BULGARIAN' value='20'/>
      <enumerator name='wxFONTENCODING_CP437' value='21'/>
      <enumerator name='wxFONTENCODING_CP850' value='22'/>
      <enumerator name='wxFONTENCODING_CP852' value='23'/>
      <enumerator name='wxFONTENCODING_CP855' value='24'/>
      <enumerator name='wxFONTENCODING_CP866' value='25'/>
      <enumerator name='wxFONTENCODING_CP874' value='26'/>
      <enumerator name='wxFONTENCODING_CP932' value='27'/>
      <enumerator name='wxFONTENCODING_CP936' value='28'/>
      <enumerator name='wxFONTENCODING_CP949' value='29'/>
      <enumerator name='wxFONTENCODING_CP950' value='30'/>
      <enumerator name='wxFONTENCODING_CP1250' value='31'/>
      <enumerator name='wxFONTENCODING_CP1251' value='32'/>
      <enumerator name='wxFONTENCODING_CP1252' value='33'/>
      <enumerator name='wxFONTENCODING_CP1253' value='34'/>
      <enumerator name='wxFONTENCODING_CP1254' value='35'/>
      <enumerator name='wxFONTENCODING_CP1255' value='36'/>
      <enumerator name='wxFONTENCODING_CP1256' value='37'/>
      <enumerator name='wxFONTENCODING_CP1257' value='38'/>
      <enumerator name='wxFONTENCODING_CP1258' value='39'/>
      <enumerator name='wxFONTENCODING_CP1361' value='40'/>
      <enumerator name='wxFONTENCODING_CP12_MAX' value='41'/>
      <enumerator name='wxFONTENCODING_UTF7' value='42'/>
      <enumerator name='wxFONTENCODING_UTF8' value='43'/>
      <enumerator name='wxFONTENCODING_EUC_JP' value='44'/>
      <enumerator name='wxFONTENCODING_UTF16BE' value='45'/>
      <enumerator name='wxFONTENCODING_UTF16LE' value='46'/>
      <enumerator name='wxFONTENCODING_UTF32BE' value='47'/>
      <enumerator name='wxFONTENCODING_UTF32LE' value='48'/>
      <enumerator name='wxFONTENCODING_MACROMAN' value='49'/>
      <enumerator name='wxFONTENCODING_MACJAPANESE' value='50'/>
      <enumerator name='wxFONTENCODING_MACCHINESETRAD' value='51'/>
      <enumerator name='wxFONTENCODING_MACKOREAN' value='52'/>
      <enumerator name='wxFONTENCODING_MACARABIC' value='53'/>
      <enumerator name='wxFONTENCODING_MACHEBREW' value='54'/>
      <enumerator name='wxFONTENCODING_MACGREEK' value='55'/>
      <enumerator name='wxFONTENCODING_MACCYRILLIC' value='56'/>
      <enumerator name='wxFONTENCODING_MACDEVANAGARI' value='57'/>
      <enumerator name='wxFONTENCODING_MACGURMUKHI' value='58'/>
      <enumerator name='wxFONTENCODING_MACGUJARATI' value='59'/>
      <enumerator name='wxFONTENCODING_MACORIYA' value='60'/>
      <enumerator name='wxFONTENCODING_MACBENGALI' value='61'/>
      <enumerator name='wxFONTENCODING_MACTAMIL' value='62'/>
      <enumerator name='wxFONTENCODING_MACTELUGU' value='63'/>
      <enumerator name='wxFONTENCODING_MACKANNADA' value='64'/>
      <enumerator name='wxFONTENCODING_MACMALAJALAM' value='65'/>
      <enumerator name='wxFONTENCODING_MACSINHALESE' value='66'/>
      <enumerator name='wxFONTENCODING_MACBURMESE' value='67'/>
      <enumerator name='wxFONTENCODING_MACKHMER' value='68'/>
      <enumerator name='wxFONTENCODING_MACTHAI' value='69'/>
      <enumerator name='wxFONTENCODING_MACLAOTIAN' value='70'/>
      <enumerator name='wxFONTENCODING_MACGEORGIAN' value='71'/>
      <enumerator name='wxFONTENCODING_MACARMENIAN' value='72'/>
      <enumerator name='wxFONTENCODING_MACCHINESESIMP' value='73'/>
      <enumerator name='wxFONTENCODING_MACTIBETAN' value='74'/>
      <enumerator name='wxFONTENCODING_MACMONGOLIAN' value='75'/>
      <enumerator name='wxFONTENCODING_MACETHIOPIC' value='76'/>
      <enumerator name='wxFONTENCODING_MACCENTRALEUR' value='77'/>
      <enumerator name='wxFONTENCODING_MACVIATNAMESE' value='78'/>
      <enumerator name='wxFONTENCODING_MACARABICEXT' value='79'/>
      <enumerator name='wxFONTENCODING_MACSYMBOL' value='80'/>
      <enumerator name='wxFONTENCODING_MACDINGBATS' value='81'/>
      <enumerator name='wxFONTENCODING_MACTURKISH' value='82'/>
      <enumerator name='wxFONTENCODING_MACCROATIAN' value='83'/>
      <enumerator name='wxFONTENCODING_MACICELANDIC' value='84'/>
      <enumerator name='wxFONTENCODING_MACROMANIAN' value='85'/>
      <enumerator name='wxFONTENCODING_MACCELTIC' value='86'/>
      <enumerator name='wxFONTENCODING_MACGAELIC' value='87'/>
      <enumerator name='wxFONTENCODING_MACKEYBOARD' value='88'/>
      <enumerator name='wxFONTENCODING_ISO2022_JP' value='89'/>
      <enumerator name='wxFONTENCODING_MAX' value='90'/>
      <enumerator name='wxFONTENCODING_MACMIN' value='49'/>
      <enumerator name='wxFONTENCODING_MACMAX' value='88'/>
      <enumerator name='wxFONTENCODING_UTF16' value='46'/>
      <enumerator name='wxFONTENCODING_UTF32' value='48'/>
      <enumerator name='wxFONTENCODING_UNICODE' value='48'/>
      <enumerator name='wxFONTENCODING_GB2312' value='28'/>
      <enumerator name='wxFONTENCODING_BIG5' value='30'/>
      <enumerator name='wxFONTENCODING_SHIFT_JIS' value='27'/>
      <enumerator name='wxFONTENCODING_EUC_KR' value='29'/>
      <enumerator name='wxFONTENCODING_JOHAB' value='40'/>
      <enumerator name='wxFONTENCODING_VIETNAMESE' value='39'/>
    </enum-decl>
    <enum-decl name='wxBitmapType' filepath='include/wx/gdicmn.h' line='47' column='1' id='type-id-276'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxBITMAP_TYPE_INVALID' value='0'/>
      <enumerator name='wxBITMAP_TYPE_BMP' value='1'/>
      <enumerator name='wxBITMAP_TYPE_BMP_RESOURCE' value='2'/>
      <enumerator name='wxBITMAP_TYPE_RESOURCE' value='2'/>
      <enumerator name='wxBITMAP_TYPE_ICO' value='3'/>
      <enumerator name='wxBITMAP_TYPE_ICO_RESOURCE' value='4'/>
      <enumerator name='wxBITMAP_TYPE_CUR' value='5'/>
      <enumerator name='wxBITMAP_TYPE_CUR_RESOURCE' value='6'/>
      <enumerator name='wxBITMAP_TYPE_XBM' value='7'/>
      <enumerator name='wxBITMAP_TYPE_XBM_DATA' value='8'/>
      <enumerator name='wxBITMAP_TYPE_XPM' value='9'/>
      <enumerator name='wxBITMAP_TYPE_XPM_DATA' value='10'/>
      <enumerator name='wxBITMAP_TYPE_TIFF' value='11'/>
      <enumerator name='wxBITMAP_TYPE_TIF' value='11'/>
      <enumerator name='wxBITMAP_TYPE_TIFF_RESOURCE' value='12'/>
      <enumerator name='wxBITMAP_TYPE_TIF_RESOURCE' value='12'/>
      <enumerator name='wxBITMAP_TYPE_GIF' value='13'/>
      <enumerator name='wxBITMAP_TYPE_GIF_RESOURCE' value='14'/>
      <enumerator name='wxBITMAP_TYPE_PNG' value='15'/>
      <enumerator name='wxBITMAP_TYPE_PNG_RESOURCE' value='16'/>
      <enumerator name='wxBITMAP_TYPE_JPEG' value='17'/>
      <enumerator name='wxBITMAP_TYPE_JPEG_RESOURCE' value='18'/>
      <enumerator name='wxBITMAP_TYPE_PNM' value='19'/>
      <enumerator name='wxBITMAP_TYPE_PNM_RESOURCE' value='20'/>
      <enumerator name='wxBITMAP_TYPE_PCX' value='21'/>
      <enumerator name='wxBITMAP_TYPE_PCX_RESOURCE' value='22'/>
      <enumerator name='wxBITMAP_TYPE_PICT' value='23'/>
      <enumerator name='wxBITMAP_TYPE_PICT_RESOURCE' value='24'/>
      <enumerator name='wxBITMAP_TYPE_ICON' value='25'/>
      <enumerator name='wxBITMAP_TYPE_ICON_RESOURCE' value='26'/>
      <enumerator name='wxBITMAP_TYPE_ANI' value='27'/>
      <enumerator name='wxBITMAP_TYPE_IFF' value='28'/>
      <enumerator name='wxBITMAP_TYPE_TGA' value='29'/>
      <enumerator name='wxBITMAP_TYPE_MACCURSOR' value='30'/>
      <enumerator name='wxBITMAP_TYPE_MACCURSOR_RESOURCE' value='31'/>
      <enumerator name='wxBITMAP_TYPE_MAX' value='32'/>
      <enumerator name='wxBITMAP_TYPE_ANY' value='50'/>
    </enum-decl>
    <enum-decl name='wxPolygonFillMode' filepath='include/wx/gdicmn.h' line='90' column='1' id='type-id-277'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxODDEVEN_RULE' value='1'/>
      <enumerator name='wxWINDING_RULE' value='2'/>
    </enum-decl>
    <class-decl name='wxSize' size-in-bits='64' visibility='default' filepath='include/wx/gdicmn.h' line='282' column='1' id='type-id-278'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='286' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRealPoint' size-in-bits='128' visibility='default' filepath='include/wx/gdicmn.h' line='459' column='1' id='type-id-279'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-17' visibility='default' filepath='include/wx/gdicmn.h' line='462' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='y' type-id='type-id-17' visibility='default' filepath='include/wx/gdicmn.h' line='463' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxPoint' size-in-bits='64' visibility='default' filepath='include/wx/gdicmn.h' line='577' column='1' id='type-id-280'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='580' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='580' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRect' size-in-bits='128' visibility='default' filepath='include/wx/gdicmn.h' line='733' column='1' id='type-id-236'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='width' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='height' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxDash' type-id='type-id-281' filepath='include/wx/gdicmn.h' line='903' column='1' id='type-id-282'/>
    <class-decl name='wxGDIRefData' size-in-bits='128' visibility='default' filepath='include/wx/gdiobj.h' line='22' column='1' id='type-id-283'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-284'/>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='IsOk' mangled-name='_ZNK12wxGDIRefData4IsOkEv' filepath='include/wx/gdiobj.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-285' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxDataFormat' size-in-bits='128' visibility='default' filepath='include/wx/gtk/dataform.h' line='14' column='1' id='type-id-110'>
      <member-type access='public'>
        <typedef-decl name='NativeFormat' type-id='type-id-127' filepath='include/wx/gtk/dataform.h' line='18' column='1' id='type-id-286'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_type' type-id='type-id-123' visibility='default' filepath='include/wx/gtk/dataform.h' line='71' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_format' type-id='type-id-286' visibility='default' filepath='include/wx/gtk/dataform.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_wxHashTable_NodeBase' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='68' column='1' id='type-id-287'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_next' type-id='type-id-288' visibility='default' filepath='include/wx/hashmap.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_wxHashTableBase2' size-in-bits='8' visibility='default' filepath='include/wx/hashmap.h' line='80' column='1' id='type-id-289'>
      <member-type access='public'>
        <typedef-decl name='NodeDtor' type-id='type-id-291' filepath='include/wx/hashmap.h' line='83' column='1' id='type-id-290'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='BucketFromNode' type-id='type-id-293' filepath='include/wx/hashmap.h' line='84' column='1' id='type-id-292'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='ProcessNode' type-id='type-id-295' filepath='include/wx/hashmap.h' line='85' column='1' id='type-id-294'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringHash' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='566' column='1' id='type-id-296'/>
    <class-decl name='wxStringEqual' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='589' column='1' id='type-id-297'/>
    <class-decl name='wxStringToStringHashMap' size-in-bits='256' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-298'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-299'/>
      <member-type access='public'>
        <class-decl name='Insert_Result' size-in-bits='192' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-300'>
          <member-type access='public'>
            <typedef-decl name='const_t1' type-id='type-id-302' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-301'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_t2' type-id='type-id-304' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-303'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t1' type-id='type-id-306' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-305'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t2' type-id='type-id-3' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-307'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='first' type-id='type-id-305' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='second' type-id='type-id-307' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='mapped_type' type-id='type-id-42' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-308'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringToStringHashMap_wxImplementation_HashTable' size-in-bits='256' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-299'>
      <base-class access='protected' layout-offset-in-bits='0' type-id='type-id-289'/>
      <member-type access='public'>
        <class-decl name='Iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-309'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-310' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_ht' type-id='type-id-311' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='Node' size-in-bits='832' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-312'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-287'/>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_value' type-id='type-id-313' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-314'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-309'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-306'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-309'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='Self' type-id='type-id-299' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-315'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_key_type' type-id='type-id-317' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-316'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_pointer' type-id='type-id-319' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-318'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-321' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-320'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='hasher' type-id='type-id-296' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-322'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_equal' type-id='type-id-297' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-323'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_extractor' type-id='type-id-325' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-324'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_type' type-id='type-id-42' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-326'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='pointer' type-id='type-id-328' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-327'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-330' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-329'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-52' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-331'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-332' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-313'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_table' type-id='type-id-333' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_tableBuckets' type-id='type-id-52' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_items' type-id='type-id-52' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_hasher' type-id='type-id-322' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='200'>
        <var-decl name='m_equals' type-id='type-id-323' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='208'>
        <var-decl name='m_getKey' type-id='type-id-324' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxStringToStringHashMap_wxImplementation_KeyEx' size-in-bits='8' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-325'>
      <member-type access='private'>
        <typedef-decl name='const_key_reference' type-id='type-id-335' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-334'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_key_type' type-id='type-id-337' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-336'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_reference' type-id='type-id-339' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-338'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_type' type-id='type-id-341' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-340'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='key_type' type-id='type-id-42' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-342'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='pair_type' type-id='type-id-332' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-343'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringToStringHashMap_wxImplementation_Pair' size-in-bits='768' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-332'>
      <member-type access='public'>
        <typedef-decl name='const_t1' type-id='type-id-317' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-344'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_t2' type-id='type-id-317' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-345'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t1' type-id='type-id-42' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-346'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t2' type-id='type-id-42' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-347'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='first' type-id='type-id-346' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='second' type-id='type-id-347' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxStringToNumHashMap' size-in-bits='256' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-348'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-349'/>
      <member-type access='public'>
        <class-decl name='Insert_Result' size-in-bits='192' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-350'>
          <member-type access='public'>
            <typedef-decl name='const_t1' type-id='type-id-352' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-351'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_t2' type-id='type-id-304' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-353'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t1' type-id='type-id-355' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-354'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t2' type-id='type-id-3' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-356'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='first' type-id='type-id-354' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='second' type-id='type-id-356' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='mapped_type' type-id='type-id-358' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-357'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringToNumHashMap_wxImplementation_HashTable' size-in-bits='256' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-349'>
      <base-class access='protected' layout-offset-in-bits='0' type-id='type-id-289'/>
      <member-type access='public'>
        <class-decl name='Iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-359'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-360' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_ht' type-id='type-id-361' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='Node' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-362'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-287'/>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_value' type-id='type-id-363' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-364'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-359'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-355'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-359'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='Self' type-id='type-id-349' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-365'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_key_type' type-id='type-id-317' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-366'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_pointer' type-id='type-id-368' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-367'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-370' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-369'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='hasher' type-id='type-id-296' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-371'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_equal' type-id='type-id-297' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-372'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_extractor' type-id='type-id-374' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-373'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_type' type-id='type-id-42' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-375'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='pointer' type-id='type-id-377' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-376'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-379' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-378'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-52' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-380'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-381' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-363'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_table' type-id='type-id-333' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_tableBuckets' type-id='type-id-52' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_items' type-id='type-id-52' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_hasher' type-id='type-id-371' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='200'>
        <var-decl name='m_equals' type-id='type-id-372' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='208'>
        <var-decl name='m_getKey' type-id='type-id-373' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxStringToNumHashMap_wxImplementation_KeyEx' size-in-bits='8' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-374'>
      <member-type access='private'>
        <typedef-decl name='const_key_reference' type-id='type-id-383' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-382'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_key_type' type-id='type-id-385' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-384'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_reference' type-id='type-id-387' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-386'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_type' type-id='type-id-389' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-388'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='key_type' type-id='type-id-42' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-390'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='pair_type' type-id='type-id-381' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-391'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringToNumHashMap_wxImplementation_Pair' size-in-bits='448' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-381'>
      <member-type access='public'>
        <typedef-decl name='const_t1' type-id='type-id-317' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-392'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_t2' type-id='type-id-394' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-393'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t1' type-id='type-id-42' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-395'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t2' type-id='type-id-358' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-396'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='first' type-id='type-id-395' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='second' type-id='type-id-396' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxImageResizeQuality' filepath='include/wx/image.h' line='61' column='1' id='type-id-397'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxIMAGE_QUALITY_NEAREST' value='0'/>
      <enumerator name='wxIMAGE_QUALITY_BILINEAR' value='1'/>
      <enumerator name='wxIMAGE_QUALITY_BICUBIC' value='2'/>
      <enumerator name='wxIMAGE_QUALITY_BOX_AVERAGE' value='3'/>
      <enumerator name='wxIMAGE_QUALITY_NORMAL' value='0'/>
      <enumerator name='wxIMAGE_QUALITY_HIGH' value='4'/>
    </enum-decl>
    <union-decl name='wxListKeyValue' size-in-bits='64' visibility='default' filepath='include/wx/list.h' line='320' column='1' id='type-id-398'>
      <data-member access='public'>
        <var-decl name='integer' type-id='type-id-21' visibility='default' filepath='include/wx/list.h' line='322' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='string' type-id='type-id-67' visibility='default' filepath='include/wx/list.h' line='323' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='wxListKey' size-in-bits='128' visibility='default' filepath='include/wx/list.h' line='332' column='1' id='type-id-399'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_keyType' type-id='type-id-121' visibility='default' filepath='include/wx/list.h' line='369' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_key' type-id='type-id-398' visibility='default' filepath='include/wx/list.h' line='370' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxObjectList' size-in-bits='384' visibility='default' filepath='include/wx/list.h' line='1164' column='1' id='type-id-400'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-401'/>
      <member-type access='public'>
        <class-decl name='compatibility_iterator' size-in-bits='64' visibility='default' filepath='include/wx/list.h' line='1164' column='1' id='type-id-402'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_ptr' type-id='type-id-403' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/list.h' line='1164' column='1' id='type-id-404'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-406' filepath='include/wx/list.h' line='1164' column='1' id='type-id-405'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-404' filepath='include/wx/list.h' line='1164' column='1' id='type-id-407'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-409' filepath='include/wx/list.h' line='1164' column='1' id='type-id-408'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-408' filepath='include/wx/list.h' line='1164' column='1' id='type-id-410'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-412' filepath='include/wx/list.h' line='1164' column='1' id='type-id-411'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-413' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-413' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_reverse_iterator' size-in-bits='128' visibility='default' filepath='include/wx/list.h' line='1164' column='1' id='type-id-414'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-406' filepath='include/wx/list.h' line='1164' column='1' id='type-id-415'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-414' filepath='include/wx/list.h' line='1164' column='1' id='type-id-416'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-418' filepath='include/wx/list.h' line='1164' column='1' id='type-id-417'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-417' filepath='include/wx/list.h' line='1164' column='1' id='type-id-419'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-412' filepath='include/wx/list.h' line='1164' column='1' id='type-id-420'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-421' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-421' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='128' visibility='default' filepath='include/wx/list.h' line='1164' column='1' id='type-id-422'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-406' filepath='include/wx/list.h' line='1164' column='1' id='type-id-423'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-422' filepath='include/wx/list.h' line='1164' column='1' id='type-id-424'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='pointer' type-id='type-id-426' filepath='include/wx/list.h' line='1164' column='1' id='type-id-425'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='pointer_type' type-id='type-id-425' filepath='include/wx/list.h' line='1164' column='1' id='type-id-427'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-429' filepath='include/wx/list.h' line='1164' column='1' id='type-id-428'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-428' filepath='include/wx/list.h' line='1164' column='1' id='type-id-430'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-412' filepath='include/wx/list.h' line='1164' column='1' id='type-id-431'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-432' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-432' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator' size-in-bits='128' visibility='default' filepath='include/wx/list.h' line='1164' column='1' id='type-id-433'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-406' filepath='include/wx/list.h' line='1164' column='1' id='type-id-434'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-433' filepath='include/wx/list.h' line='1164' column='1' id='type-id-435'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-437' filepath='include/wx/list.h' line='1164' column='1' id='type-id-436'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-436' filepath='include/wx/list.h' line='1164' column='1' id='type-id-438'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-412' filepath='include/wx/list.h' line='1164' column='1' id='type-id-439'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-440' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-440' visibility='default' filepath='include/wx/list.h' line='1164' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='Node' type-id='type-id-406' filepath='include/wx/list.h' line='1164' column='1' id='type-id-441'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-443' filepath='include/wx/list.h' line='1164' column='1' id='type-id-442'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-445' filepath='include/wx/list.h' line='1164' column='1' id='type-id-444'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-52' filepath='include/wx/list.h' line='1164' column='1' id='type-id-446'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-412' filepath='include/wx/list.h' line='1164' column='1' id='type-id-447'/>
      </member-type>
      <member-function access='protected' vtable-offset='2'>
        <function-decl name='CreateNode' mangled-name='_ZN12wxObjectList10CreateNodeEP10wxNodeBaseS1_PvRK9wxListKey' filepath='include/wx/list.h' line='1164' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-448' is-artificial='yes'/>
          <parameter type-id='type-id-449'/>
          <parameter type-id='type-id-449'/>
          <parameter type-id='type-id-16'/>
          <parameter type-id='type-id-450'/>
          <return type-id='type-id-449'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='Find' mangled-name='_ZNK12wxObjectList4FindERK9wxListKey' filepath='include/wx/list.h' line='1164' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-451' is-artificial='yes'/>
          <parameter type-id='type-id-450'/>
          <return type-id='type-id-452'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='wxSortFuncFor_wxObjectList' type-id='type-id-453' filepath='include/wx/list.h' line='1164' column='1' id='type-id-454'/>
    <class-decl name='wxList' size-in-bits='384' visibility='default' filepath='include/wx/list.h' line='1167' column='1' id='type-id-455'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-400'/>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxList' mangled-name='_ZN6wxListD0Ev' filepath='include/wx/list.h' line='1178' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-456' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxList' mangled-name='_ZN6wxListD0Ev' filepath='include/wx/list.h' line='1178' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-456' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxList' mangled-name='_ZN6wxListD0Ev' filepath='include/wx/list.h' line='1178' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-456' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxList' mangled-name='_ZN6wxListD0Ev' filepath='include/wx/list.h' line='1178' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-456' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxList' mangled-name='_ZN6wxListD0Ev' filepath='include/wx/list.h' line='1178' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-456' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxList' mangled-name='_ZN6wxListD2Ev' filepath='include/wx/list.h' line='1178' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-456' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxList' mangled-name='_ZN6wxListD2Ev' filepath='include/wx/list.h' line='1178' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-456' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxList' mangled-name='_ZN6wxListD2Ev' filepath='include/wx/list.h' line='1178' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-456' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxList' mangled-name='_ZN6wxListD2Ev' filepath='include/wx/list.h' line='1178' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-456' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxList' mangled-name='_ZN6wxListD2Ev' filepath='include/wx/list.h' line='1178' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-456' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxList' mangled-name='_ZN6wxListD4Ev' filepath='include/wx/list.h' line='1178' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-456' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='wxLogLevel' type-id='type-id-6' filepath='include/wx/log.h' line='22' column='1' id='type-id-457'/>
    <class-decl name='wxLogRecordInfo' size-in-bits='512' visibility='default' filepath='include/wx/log.h' line='141' column='1' id='type-id-458'>
      <member-type access='private'>
        <class-decl name='ExtraData' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/wx/log.h' line='289' column='1' id='type-id-459'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='numValues' type-id='type-id-348' visibility='default' filepath='include/wx/log.h' line='291' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='strValues' type-id='type-id-298' visibility='default' filepath='include/wx/log.h' line='292' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='filename' type-id='type-id-460' visibility='default' filepath='include/wx/log.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='line' type-id='type-id-19' visibility='default' filepath='include/wx/log.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='func' type-id='type-id-460' visibility='default' filepath='include/wx/log.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='component' type-id='type-id-460' visibility='default' filepath='include/wx/log.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='timestampMS' type-id='type-id-22' visibility='default' filepath='include/wx/log.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='timestamp' type-id='type-id-461' visibility='default' filepath='include/wx/log.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='threadId' type-id='type-id-462' visibility='default' filepath='include/wx/log.h' line='224' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='m_data' type-id='type-id-463' visibility='default' filepath='include/wx/log.h' line='296' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxLogger' size-in-bits='960' visibility='default' filepath='include/wx/log.h' line='897' column='1' id='type-id-464'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_level' type-id='type-id-465' visibility='default' filepath='include/wx/log.h' line='1198' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_info' type-id='type-id-458' visibility='default' filepath='include/wx/log.h' line='1199' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='m_optKey' type-id='type-id-42' visibility='default' filepath='include/wx/log.h' line='1201' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxLongLong' type-id='type-id-466' filepath='include/wx/longlong.h' line='90' column='1' id='type-id-467'/>
    <class-decl name='wxLongLongNative' size-in-bits='64' visibility='default' filepath='include/wx/longlong.h' line='106' column='1' id='type-id-466'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_ll' type-id='type-id-22' visibility='default' filepath='include/wx/longlong.h' line='343' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxULongLongNative' size-in-bits='64' visibility='default' filepath='include/wx/longlong.h' line='347' column='1' id='type-id-468'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_ll' type-id='type-id-23' visibility='default' filepath='include/wx/longlong.h' line='562' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRefCounter' size-in-bits='128' visibility='default' filepath='include/wx/object.h' line='228' column='1' id='type-id-284'>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_count' type-id='type-id-19' visibility='default' filepath='include/wx/object.h' line='245' column='1'/>
      </data-member>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRefCounter' mangled-name='_ZN12wxRefCounterD0Ev' filepath='include/wx/object.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-469' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRefCounter' mangled-name='_ZN12wxRefCounterD2Ev' filepath='include/wx/object.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-469' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRefCounter' mangled-name='_ZN12wxRefCounterD4Ev' filepath='include/wx/object.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-469' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='wxObjectRefData' type-id='type-id-284' filepath='include/wx/object.h' line='258' column='1' id='type-id-470'/>
    <enum-decl name='wxPenQuality' filepath='include/wx/pen.h' line='18' column='1' id='type-id-471'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxPEN_QUALITY_DEFAULT' value='0'/>
      <enumerator name='wxPEN_QUALITY_LOW' value='1'/>
      <enumerator name='wxPEN_QUALITY_HIGH' value='2'/>
    </enum-decl>
    <class-decl name='wxPenBase' size-in-bits='128' visibility='default' filepath='include/wx/pen.h' line='63' column='1' id='type-id-472'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-70'/>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPenBase' mangled-name='_ZN9wxPenBaseD4Ev' filepath='include/wx/pen.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='SetColour' mangled-name='_ZN9wxPenBase9SetColourERK8wxColour' filepath='include/wx/pen.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <parameter type-id='type-id-72'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='SetColour' mangled-name='_ZN9wxPenBase9SetColourEhhh' filepath='include/wx/pen.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <parameter type-id='type-id-27'/>
          <parameter type-id='type-id-27'/>
          <parameter type-id='type-id-27'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='SetWidth' mangled-name='_ZN9wxPenBase8SetWidthEi' filepath='include/wx/pen.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <function-decl name='SetStyle' mangled-name='_ZN9wxPenBase8SetStyleE10wxPenStyle' filepath='include/wx/pen.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <parameter type-id='type-id-474'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <function-decl name='SetStipple' mangled-name='_ZN9wxPenBase10SetStippleERK8wxBitmap' filepath='include/wx/pen.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <parameter type-id='type-id-73'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <function-decl name='SetDashes' mangled-name='_ZN9wxPenBase9SetDashesEiPKa' filepath='include/wx/pen.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-475'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <function-decl name='SetJoin' mangled-name='_ZN9wxPenBase7SetJoinE9wxPenJoin' filepath='include/wx/pen.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <parameter type-id='type-id-476'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <function-decl name='SetCap' mangled-name='_ZN9wxPenBase6SetCapE8wxPenCap' filepath='include/wx/pen.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <parameter type-id='type-id-477'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <function-decl name='SetQuality' mangled-name='_ZN9wxPenBase10SetQualityE12wxPenQuality' filepath='include/wx/pen.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <parameter type-id='type-id-471'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='17'>
        <function-decl name='GetColour' mangled-name='_ZNK9wxPenBase9GetColourEv' filepath='include/wx/pen.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-478' is-artificial='yes'/>
          <return type-id='type-id-75'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='18'>
        <function-decl name='GetStipple' mangled-name='_ZNK9wxPenBase10GetStippleEv' filepath='include/wx/pen.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-478' is-artificial='yes'/>
          <return type-id='type-id-76'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='19'>
        <function-decl name='GetStyle' mangled-name='_ZNK9wxPenBase8GetStyleEv' filepath='include/wx/pen.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-478' is-artificial='yes'/>
          <return type-id='type-id-474'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='20'>
        <function-decl name='GetJoin' mangled-name='_ZNK9wxPenBase7GetJoinEv' filepath='include/wx/pen.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-478' is-artificial='yes'/>
          <return type-id='type-id-476'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='21'>
        <function-decl name='GetCap' mangled-name='_ZNK9wxPenBase6GetCapEv' filepath='include/wx/pen.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-478' is-artificial='yes'/>
          <return type-id='type-id-477'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='22'>
        <function-decl name='GetQuality' mangled-name='_ZNK9wxPenBase10GetQualityEv' filepath='include/wx/pen.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-478' is-artificial='yes'/>
          <return type-id='type-id-471'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='23'>
        <function-decl name='GetWidth' mangled-name='_ZNK9wxPenBase8GetWidthEv' filepath='include/wx/pen.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-478' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='24'>
        <function-decl name='GetDashes' mangled-name='_ZNK9wxPenBase9GetDashesEPPa' filepath='include/wx/pen.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-478' is-artificial='yes'/>
          <parameter type-id='type-id-479'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='wxPenStyle' filepath='include/wx/peninfobase.h' line='17' column='1' id='type-id-474'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxPENSTYLE_INVALID' value='-1'/>
      <enumerator name='wxPENSTYLE_SOLID' value='100'/>
      <enumerator name='wxPENSTYLE_DOT' value='101'/>
      <enumerator name='wxPENSTYLE_LONG_DASH' value='102'/>
      <enumerator name='wxPENSTYLE_SHORT_DASH' value='103'/>
      <enumerator name='wxPENSTYLE_DOT_DASH' value='104'/>
      <enumerator name='wxPENSTYLE_USER_DASH' value='105'/>
      <enumerator name='wxPENSTYLE_TRANSPARENT' value='106'/>
      <enumerator name='wxPENSTYLE_STIPPLE_MASK_OPAQUE' value='107'/>
      <enumerator name='wxPENSTYLE_STIPPLE_MASK' value='108'/>
      <enumerator name='wxPENSTYLE_STIPPLE' value='110'/>
      <enumerator name='wxPENSTYLE_BDIAGONAL_HATCH' value='111'/>
      <enumerator name='wxPENSTYLE_CROSSDIAG_HATCH' value='112'/>
      <enumerator name='wxPENSTYLE_FDIAGONAL_HATCH' value='113'/>
      <enumerator name='wxPENSTYLE_CROSS_HATCH' value='114'/>
      <enumerator name='wxPENSTYLE_HORIZONTAL_HATCH' value='115'/>
      <enumerator name='wxPENSTYLE_VERTICAL_HATCH' value='116'/>
      <enumerator name='wxPENSTYLE_FIRST_HATCH' value='111'/>
      <enumerator name='wxPENSTYLE_LAST_HATCH' value='116'/>
    </enum-decl>
    <enum-decl name='wxPenJoin' filepath='include/wx/peninfobase.h' line='44' column='1' id='type-id-476'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxJOIN_INVALID' value='-1'/>
      <enumerator name='wxJOIN_BEVEL' value='120'/>
      <enumerator name='wxJOIN_MITER' value='121'/>
      <enumerator name='wxJOIN_ROUND' value='122'/>
    </enum-decl>
    <enum-decl name='wxPenCap' filepath='include/wx/peninfobase.h' line='53' column='1' id='type-id-477'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxCAP_INVALID' value='-1'/>
      <enumerator name='wxCAP_ROUND' value='130'/>
      <enumerator name='wxCAP_PROJECTING' value='131'/>
      <enumerator name='wxCAP_BUTT' value='132'/>
    </enum-decl>
    <class-decl name='wxPosition' size-in-bits='64' visibility='default' filepath='include/wx/position.h' line='15' column='1' id='type-id-480'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_row' type-id='type-id-19' visibility='default' filepath='include/wx/position.h' line='54' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='m_column' type-id='type-id-19' visibility='default' filepath='include/wx/position.h' line='55' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxRichTextFileType' filepath='include/wx/richtext/richtextbuffer.h' line='111' column='1' id='type-id-481'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxRICHTEXT_TYPE_ANY' value='0'/>
      <enumerator name='wxRICHTEXT_TYPE_TEXT' value='1'/>
      <enumerator name='wxRICHTEXT_TYPE_XML' value='2'/>
      <enumerator name='wxRICHTEXT_TYPE_HTML' value='3'/>
      <enumerator name='wxRICHTEXT_TYPE_RTF' value='4'/>
      <enumerator name='wxRICHTEXT_TYPE_PDF' value='5'/>
    </enum-decl>
    <typedef-decl name='wxTextAttrDimensionFlags' type-id='type-id-28' filepath='include/wx/richtext/richtextbuffer.h' line='296' column='1' id='type-id-482'/>
    <enum-decl name='wxTextBoxAttrFlags' filepath='include/wx/richtext/richtextbuffer.h' line='301' column='1' id='type-id-483'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxTEXT_BOX_ATTR_FLOAT' value='1'/>
      <enumerator name='wxTEXT_BOX_ATTR_CLEAR' value='2'/>
      <enumerator name='wxTEXT_BOX_ATTR_COLLAPSE_BORDERS' value='4'/>
      <enumerator name='wxTEXT_BOX_ATTR_VERTICAL_ALIGNMENT' value='8'/>
      <enumerator name='wxTEXT_BOX_ATTR_BOX_STYLE_NAME' value='16'/>
      <enumerator name='wxTEXT_BOX_ATTR_WHITESPACE' value='32'/>
      <enumerator name='wxTEXT_BOX_ATTR_CORNER_RADIUS' value='64'/>
    </enum-decl>
    <enum-decl name='wxTextAttrUnits' filepath='include/wx/richtext/richtextbuffer.h' line='324' column='1' id='type-id-484'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxTEXT_ATTR_UNITS_TENTHS_MM' value='1'/>
      <enumerator name='wxTEXT_ATTR_UNITS_PIXELS' value='2'/>
      <enumerator name='wxTEXT_ATTR_UNITS_PERCENTAGE' value='4'/>
      <enumerator name='wxTEXT_ATTR_UNITS_POINTS' value='8'/>
      <enumerator name='wxTEXT_ATTR_UNITS_HUNDREDTHS_POINT' value='256'/>
      <enumerator name='wxTEXT_ATTR_UNITS_MASK' value='271'/>
    </enum-decl>
    <enum-decl name='wxTextBoxAttrPosition' filepath='include/wx/richtext/richtextbuffer.h' line='338' column='1' id='type-id-485'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxTEXT_BOX_ATTR_POSITION_STATIC' value='0'/>
      <enumerator name='wxTEXT_BOX_ATTR_POSITION_RELATIVE' value='16'/>
      <enumerator name='wxTEXT_BOX_ATTR_POSITION_ABSOLUTE' value='32'/>
      <enumerator name='wxTEXT_BOX_ATTR_POSITION_FIXED' value='64'/>
      <enumerator name='wxTEXT_BOX_ATTR_POSITION_MASK' value='240'/>
    </enum-decl>
    <class-decl name='wxTextAttrDimension' size-in-bits='64' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='361' column='1' id='type-id-486'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_value' type-id='type-id-19' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='m_flags' type-id='type-id-482' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='479' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='CollectCommonAttributes' mangled-name='_ZN19wxTextAttrDimension23CollectCommonAttributesERKS_RS_S2_' filepath='src/richtext/richtextbuffer.cpp' line='14334' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxTextAttrDimension23CollectCommonAttributesERKS_RS_S2_@@WXU_3.2'>
          <parameter type-id='type-id-487' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-488' name='attr' filepath='src/richtext/richtextbuffer.cpp' line='14334' column='1'/>
          <parameter type-id='type-id-489' name='clashingAttr' filepath='src/richtext/richtextbuffer.cpp' line='14334' column='1'/>
          <parameter type-id='type-id-489' name='absentAttr' filepath='src/richtext/richtextbuffer.cpp' line='14334' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Apply' mangled-name='_ZN19wxTextAttrDimension5ApplyERKS_PS0_' filepath='src/richtext/richtextbuffer.cpp' line='14321' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxTextAttrDimension5ApplyERKS_PS0_@@WXU_3.2'>
          <parameter type-id='type-id-487' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-488' name='dim' filepath='src/richtext/richtextbuffer.cpp' line='14321' column='1'/>
          <parameter type-id='type-id-490' name='compareWith' filepath='src/richtext/richtextbuffer.cpp' line='14321' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='EqPartial' mangled-name='_ZNK19wxTextAttrDimension9EqPartialERKS_b' filepath='src/richtext/richtextbuffer.cpp' line='14310' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK19wxTextAttrDimension9EqPartialERKS_b@@WXU_3.2'>
          <parameter type-id='type-id-491' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-488' name='dim' filepath='src/richtext/richtextbuffer.cpp' line='14310' column='1'/>
          <parameter type-id='type-id-3' name='weakTest' filepath='src/richtext/richtextbuffer.cpp' line='14310' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxTextAttrDimensions' size-in-bits='256' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='492' column='1' id='type-id-492'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_left' type-id='type-id-486' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='570' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='m_top' type-id='type-id-486' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='571' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='m_right' type-id='type-id-486' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='572' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_bottom' type-id='type-id-486' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='573' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='CollectCommonAttributes' mangled-name='_ZN20wxTextAttrDimensions23CollectCommonAttributesERKS_RS_S2_' filepath='src/richtext/richtextbuffer.cpp' line='14486' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN20wxTextAttrDimensions23CollectCommonAttributesERKS_RS_S2_@@WXU_3.2'>
          <parameter type-id='type-id-493' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-494' name='attr' filepath='src/richtext/richtextbuffer.cpp' line='14486' column='1'/>
          <parameter type-id='type-id-495' name='clashingAttr' filepath='src/richtext/richtextbuffer.cpp' line='14486' column='1'/>
          <parameter type-id='type-id-495' name='absentAttr' filepath='src/richtext/richtextbuffer.cpp' line='14486' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='RemoveStyle' mangled-name='_ZN20wxTextAttrDimensions11RemoveStyleERKS_' filepath='src/richtext/richtextbuffer.cpp' line='14470' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN20wxTextAttrDimensions11RemoveStyleERKS_@@WXU_3.2'>
          <parameter type-id='type-id-493' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-494' name='attr' filepath='src/richtext/richtextbuffer.cpp' line='14470' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Apply' mangled-name='_ZN20wxTextAttrDimensions5ApplyERKS_PS0_' filepath='src/richtext/richtextbuffer.cpp' line='14459' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN20wxTextAttrDimensions5ApplyERKS_PS0_@@WXU_3.2'>
          <parameter type-id='type-id-493' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-494' name='dims' filepath='src/richtext/richtextbuffer.cpp' line='14459' column='1'/>
          <parameter type-id='type-id-496' name='compareWith' filepath='src/richtext/richtextbuffer.cpp' line='14459' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='EqPartial' mangled-name='_ZNK20wxTextAttrDimensions9EqPartialERKS_b' filepath='src/richtext/richtextbuffer.cpp' line='14441' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK20wxTextAttrDimensions9EqPartialERKS_b@@WXU_3.2'>
          <parameter type-id='type-id-497' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-494' name='dims' filepath='src/richtext/richtextbuffer.cpp' line='14441' column='1'/>
          <parameter type-id='type-id-3' name='weakTest' filepath='src/richtext/richtextbuffer.cpp' line='14441' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxTextAttrSize' size-in-bits='128' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='586' column='1' id='type-id-498'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_width' type-id='type-id-486' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='675' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='m_height' type-id='type-id-486' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='676' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='CollectCommonAttributes' mangled-name='_ZN14wxTextAttrSize23CollectCommonAttributesERKS_RS_S2_' filepath='src/richtext/richtextbuffer.cpp' line='14528' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxTextAttrSize23CollectCommonAttributesERKS_RS_S2_@@WXU_3.2'>
          <parameter type-id='type-id-499' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-500' name='attr' filepath='src/richtext/richtextbuffer.cpp' line='14528' column='1'/>
          <parameter type-id='type-id-501' name='clashingAttr' filepath='src/richtext/richtextbuffer.cpp' line='14528' column='1'/>
          <parameter type-id='type-id-501' name='absentAttr' filepath='src/richtext/richtextbuffer.cpp' line='14528' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='RemoveStyle' mangled-name='_ZN14wxTextAttrSize11RemoveStyleERKS_' filepath='src/richtext/richtextbuffer.cpp' line='14516' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxTextAttrSize11RemoveStyleERKS_@@WXU_3.2'>
          <parameter type-id='type-id-499' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-500' name='attr' filepath='src/richtext/richtextbuffer.cpp' line='14516' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Apply' mangled-name='_ZN14wxTextAttrSize5ApplyERKS_PS0_' filepath='src/richtext/richtextbuffer.cpp' line='14507' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxTextAttrSize5ApplyERKS_PS0_@@WXU_3.2'>
          <parameter type-id='type-id-499' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-500' name='size' filepath='src/richtext/richtextbuffer.cpp' line='14507' column='1'/>
          <parameter type-id='type-id-502' name='compareWith' filepath='src/richtext/richtextbuffer.cpp' line='14507' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='EqPartial' mangled-name='_ZNK14wxTextAttrSize9EqPartialERKS_b' filepath='src/richtext/richtextbuffer.cpp' line='14495' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxTextAttrSize9EqPartialERKS_b@@WXU_3.2'>
          <parameter type-id='type-id-503' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-500' name='size' filepath='src/richtext/richtextbuffer.cpp' line='14495' column='1'/>
          <parameter type-id='type-id-3' name='weakTest' filepath='src/richtext/richtextbuffer.cpp' line='14495' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxTextAttrDimensionConverter' size-in-bits='192' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='689' column='1' id='type-id-504'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_ppi' type-id='type-id-19' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='746' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='m_scale' type-id='type-id-17' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='747' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='m_parentSize' type-id='type-id-278' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='748' column='1'/>
      </data-member>
      <member-function access='public' const='yes'>
        <function-decl name='GetTenthsMM' mangled-name='_ZNK28wxTextAttrDimensionConverter11GetTenthsMMERK19wxTextAttrDimension' filepath='src/richtext/richtextbuffer.cpp' line='14423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK28wxTextAttrDimensionConverter11GetTenthsMMERK19wxTextAttrDimension@@WXU_3.2'>
          <parameter type-id='type-id-505' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-488' name='dim' filepath='src/richtext/richtextbuffer.cpp' line='14423' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetPixels' mangled-name='_ZNK28wxTextAttrDimensionConverter9GetPixelsERK19wxTextAttrDimensioni' filepath='src/richtext/richtextbuffer.cpp' line='14382' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK28wxTextAttrDimensionConverter9GetPixelsERK19wxTextAttrDimensioni@@WXU_3.2'>
          <parameter type-id='type-id-505' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-488' name='dim' filepath='src/richtext/richtextbuffer.cpp' line='14382' column='1'/>
          <parameter type-id='type-id-19' name='direction' filepath='src/richtext/richtextbuffer.cpp' line='14382' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='ConvertPixelsToTenthsMM' mangled-name='_ZNK28wxTextAttrDimensionConverter23ConvertPixelsToTenthsMMEi' filepath='src/richtext/richtextbuffer.cpp' line='14377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK28wxTextAttrDimensionConverter23ConvertPixelsToTenthsMMEi@@WXU_3.2'>
          <parameter type-id='type-id-505' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-19' name='pixels' filepath='src/richtext/richtextbuffer.cpp' line='14377' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='ConvertTenthsMMToPixels' mangled-name='_ZNK28wxTextAttrDimensionConverter23ConvertTenthsMMToPixelsEi' filepath='src/richtext/richtextbuffer.cpp' line='14372' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK28wxTextAttrDimensionConverter23ConvertTenthsMMToPixelsEi@@WXU_3.2'>
          <parameter type-id='type-id-505' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-19' name='pixels' filepath='src/richtext/richtextbuffer.cpp' line='14377' column='1'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxTextAttrDimensionConverter' mangled-name='_ZN28wxTextAttrDimensionConverterC2EidRK6wxSize' filepath='src/richtext/richtextbuffer.cpp' line='14366' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN28wxTextAttrDimensionConverterC2EidRK6wxSize@@WXU_3.2'>
          <parameter type-id='type-id-506' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-19' name='ppi' filepath='src/richtext/richtextbuffer.cpp' line='14366' column='1'/>
          <parameter type-id='type-id-17' name='scale' filepath='src/richtext/richtextbuffer.cpp' line='14366' column='1'/>
          <parameter type-id='type-id-507' name='parentSize' filepath='src/richtext/richtextbuffer.cpp' line='14366' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxTextAttrDimensionConverter' mangled-name='_ZN28wxTextAttrDimensionConverterC2ER4wxDCdRK6wxSize' filepath='src/richtext/richtextbuffer.cpp' line='14360' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN28wxTextAttrDimensionConverterC2ER4wxDCdRK6wxSize@@WXU_3.2'>
          <parameter type-id='type-id-506' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-508' name='dc' filepath='src/richtext/richtextbuffer.cpp' line='14360' column='1'/>
          <parameter type-id='type-id-17' name='scale' filepath='src/richtext/richtextbuffer.cpp' line='14360' column='1'/>
          <parameter type-id='type-id-507' name='parentSize' filepath='src/richtext/richtextbuffer.cpp' line='14360' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='wxTextBoxAttrFloatStyle' filepath='include/wx/richtext/richtextbuffer.h' line='789' column='1' id='type-id-509'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxTEXT_BOX_ATTR_FLOAT_NONE' value='0'/>
      <enumerator name='wxTEXT_BOX_ATTR_FLOAT_LEFT' value='1'/>
      <enumerator name='wxTEXT_BOX_ATTR_FLOAT_RIGHT' value='2'/>
    </enum-decl>
    <enum-decl name='wxTextBoxAttrClearStyle' filepath='include/wx/richtext/richtextbuffer.h' line='799' column='1' id='type-id-510'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxTEXT_BOX_ATTR_CLEAR_NONE' value='0'/>
      <enumerator name='wxTEXT_BOX_ATTR_CLEAR_LEFT' value='1'/>
      <enumerator name='wxTEXT_BOX_ATTR_CLEAR_RIGHT' value='2'/>
      <enumerator name='wxTEXT_BOX_ATTR_CLEAR_BOTH' value='3'/>
    </enum-decl>
    <enum-decl name='wxTextBoxAttrCollapseMode' filepath='include/wx/richtext/richtextbuffer.h' line='810' column='1' id='type-id-511'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxTEXT_BOX_ATTR_COLLAPSE_NONE' value='0'/>
      <enumerator name='wxTEXT_BOX_ATTR_COLLAPSE_FULL' value='1'/>
    </enum-decl>
    <enum-decl name='wxTextBoxAttrVerticalAlignment' filepath='include/wx/richtext/richtextbuffer.h' line='819' column='1' id='type-id-512'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxTEXT_BOX_ATTR_VERTICAL_ALIGNMENT_NONE' value='0'/>
      <enumerator name='wxTEXT_BOX_ATTR_VERTICAL_ALIGNMENT_TOP' value='1'/>
      <enumerator name='wxTEXT_BOX_ATTR_VERTICAL_ALIGNMENT_CENTRE' value='2'/>
      <enumerator name='wxTEXT_BOX_ATTR_VERTICAL_ALIGNMENT_BOTTOM' value='3'/>
    </enum-decl>
    <enum-decl name='wxTextBoxAttrWhitespaceMode' filepath='include/wx/richtext/richtextbuffer.h' line='832' column='1' id='type-id-513'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxTEXT_BOX_ATTR_WHITESPACE_NONE' value='0'/>
      <enumerator name='wxTEXT_BOX_ATTR_WHITESPACE_NORMAL' value='1'/>
      <enumerator name='wxTEXT_BOX_ATTR_WHITESPACE_NO_WRAP' value='2'/>
      <enumerator name='wxTEXT_BOX_ATTR_WHITESPACE_PREFORMATTED' value='3'/>
      <enumerator name='wxTEXT_BOX_ATTR_WHITESPACE_PREFORMATTED_LINE' value='4'/>
      <enumerator name='wxTEXT_BOX_ATTR_WHITESPACE_PREFORMATTED_WRAP' value='5'/>
    </enum-decl>
    <class-decl name='wxTextAttrBorder' size-in-bits='256' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='852' column='1' id='type-id-514'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_borderStyle' type-id='type-id-19' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='995' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='m_borderColour' type-id='type-id-6' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='996' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='m_borderWidth' type-id='type-id-486' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='997' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_flags' type-id='type-id-19' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='998' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='CollectCommonAttributes' mangled-name='_ZN16wxTextAttrBorder23CollectCommonAttributesERKS_RS_S2_' filepath='src/richtext/richtextbuffer.cpp' line='14188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxTextAttrBorder23CollectCommonAttributesERKS_RS_S2_@@WXU_3.2'>
          <parameter type-id='type-id-515' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-516' name='attr' filepath='src/richtext/richtextbuffer.cpp' line='14188' column='1'/>
          <parameter type-id='type-id-517' name='clashingAttr' filepath='src/richtext/richtextbuffer.cpp' line='14188' column='1'/>
          <parameter type-id='type-id-517' name='absentAttr' filepath='src/richtext/richtextbuffer.cpp' line='14188' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='RemoveStyle' mangled-name='_ZN16wxTextAttrBorder11RemoveStyleERKS_' filepath='src/richtext/richtextbuffer.cpp' line='14174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxTextAttrBorder11RemoveStyleERKS_@@WXU_3.2'>
          <parameter type-id='type-id-515' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-516' name='attr' filepath='src/richtext/richtextbuffer.cpp' line='14174' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Apply' mangled-name='_ZN16wxTextAttrBorder5ApplyERKS_PS0_' filepath='src/richtext/richtextbuffer.cpp' line='14152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxTextAttrBorder5ApplyERKS_PS0_@@WXU_3.2'>
          <parameter type-id='type-id-515' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-516' name='border' filepath='src/richtext/richtextbuffer.cpp' line='14152' column='1'/>
          <parameter type-id='type-id-518' name='compareWith' filepath='src/richtext/richtextbuffer.cpp' line='14152' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='EqPartial' mangled-name='_ZNK16wxTextAttrBorder9EqPartialERKS_b' filepath='src/richtext/richtextbuffer.cpp' line='14129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16wxTextAttrBorder9EqPartialERKS_b@@WXU_3.2'>
          <parameter type-id='type-id-519' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-516' name='border' filepath='src/richtext/richtextbuffer.cpp' line='14129' column='1'/>
          <parameter type-id='type-id-3' name='weakTest' filepath='src/richtext/richtextbuffer.cpp' line='14129' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxTextAttrBorders' size-in-bits='1024' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1011' column='1' id='type-id-520'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_left' type-id='type-id-514' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='m_right' type-id='type-id-514' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='m_top' type-id='type-id-514' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='m_bottom' type-id='type-id-514' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1116' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='SetWidth' mangled-name='_ZN17wxTextAttrBorders8SetWidthERK19wxTextAttrDimension' filepath='src/richtext/richtextbuffer.cpp' line='14301' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxTextAttrBorders8SetWidthERK19wxTextAttrDimension@@WXU_3.2'>
          <parameter type-id='type-id-521' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-488' name='width' filepath='src/richtext/richtextbuffer.cpp' line='14301' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetColour' mangled-name='_ZN17wxTextAttrBorders9SetColourERK8wxColour' filepath='src/richtext/richtextbuffer.cpp' line='14292' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxTextAttrBorders9SetColourERK8wxColour@@WXU_3.2'>
          <parameter type-id='type-id-521' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-72' name='colour' filepath='src/richtext/richtextbuffer.cpp' line='14292' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetColour' mangled-name='_ZN17wxTextAttrBorders9SetColourEm' filepath='src/richtext/richtextbuffer.cpp' line='14284' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxTextAttrBorders9SetColourEm@@WXU_3.2'>
          <parameter type-id='type-id-521' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-6' name='colour' filepath='src/richtext/richtextbuffer.cpp' line='14284' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetStyle' mangled-name='_ZN17wxTextAttrBorders8SetStyleEi' filepath='src/richtext/richtextbuffer.cpp' line='14275' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxTextAttrBorders8SetStyleEi@@WXU_3.2'>
          <parameter type-id='type-id-521' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-19' name='style' filepath='src/richtext/richtextbuffer.cpp' line='14275' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='CollectCommonAttributes' mangled-name='_ZN17wxTextAttrBorders23CollectCommonAttributesERKS_RS_S2_' filepath='src/richtext/richtextbuffer.cpp' line='14266' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxTextAttrBorders23CollectCommonAttributesERKS_RS_S2_@@WXU_3.2'>
          <parameter type-id='type-id-521' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-522' name='attr' filepath='src/richtext/richtextbuffer.cpp' line='14266' column='1'/>
          <parameter type-id='type-id-523' name='clashingAttr' filepath='src/richtext/richtextbuffer.cpp' line='14266' column='1'/>
          <parameter type-id='type-id-523' name='absentAttr' filepath='src/richtext/richtextbuffer.cpp' line='14266' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='RemoveStyle' mangled-name='_ZN17wxTextAttrBorders11RemoveStyleERKS_' filepath='src/richtext/richtextbuffer.cpp' line='14255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxTextAttrBorders11RemoveStyleERKS_@@WXU_3.2'>
          <parameter type-id='type-id-521' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-522' name='attr' filepath='src/richtext/richtextbuffer.cpp' line='14255' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Apply' mangled-name='_ZN17wxTextAttrBorders5ApplyERKS_PS0_' filepath='src/richtext/richtextbuffer.cpp' line='14245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxTextAttrBorders5ApplyERKS_PS0_@@WXU_3.2'>
          <parameter type-id='type-id-521' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-522' name='borders' filepath='src/richtext/richtextbuffer.cpp' line='14245' column='1'/>
          <parameter type-id='type-id-524' name='compareWith' filepath='src/richtext/richtextbuffer.cpp' line='14245' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='EqPartial' mangled-name='_ZNK17wxTextAttrBorders9EqPartialERKS_b' filepath='src/richtext/richtextbuffer.cpp' line='14238' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK17wxTextAttrBorders9EqPartialERKS_b@@WXU_3.2'>
          <parameter type-id='type-id-525' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-522' name='borders' filepath='src/richtext/richtextbuffer.cpp' line='14238' column='1'/>
          <parameter type-id='type-id-3' name='weakTest' filepath='src/richtext/richtextbuffer.cpp' line='14238' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxTextAttrShadow' size-in-bits='448' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1130' column='1' id='type-id-526'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_flags' type-id='type-id-19' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='m_shadowColour' type-id='type-id-6' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='m_offsetX' type-id='type-id-486' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_offsetY' type-id='type-id-486' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='m_spread' type-id='type-id-486' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='m_blurDistance' type-id='type-id-486' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='m_opacity' type-id='type-id-486' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1298' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='CollectCommonAttributes' mangled-name='_ZN16wxTextAttrShadow23CollectCommonAttributesERKS_RS_S2_' filepath='src/richtext/richtextbuffer.cpp' line='15802' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxTextAttrShadow23CollectCommonAttributesERKS_RS_S2_@@WXU_3.2'>
          <parameter type-id='type-id-527' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-528' name='attr' filepath='src/richtext/richtextbuffer.cpp' line='15802' column='1'/>
          <parameter type-id='type-id-529' name='clashingAttr' filepath='src/richtext/richtextbuffer.cpp' line='15802' column='1'/>
          <parameter type-id='type-id-529' name='absentAttr' filepath='src/richtext/richtextbuffer.cpp' line='15802' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='RemoveStyle' mangled-name='_ZN16wxTextAttrShadow11RemoveStyleERKS_' filepath='src/richtext/richtextbuffer.cpp' line='15784' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxTextAttrShadow11RemoveStyleERKS_@@WXU_3.2'>
          <parameter type-id='type-id-527' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-528' name='attr' filepath='src/richtext/richtextbuffer.cpp' line='15784' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Apply' mangled-name='_ZN16wxTextAttrShadow5ApplyERKS_PS0_' filepath='src/richtext/richtextbuffer.cpp' line='15767' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxTextAttrShadow5ApplyERKS_PS0_@@WXU_3.2'>
          <parameter type-id='type-id-527' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-528' name='shadow' filepath='src/richtext/richtextbuffer.cpp' line='15767' column='1'/>
          <parameter type-id='type-id-530' name='compareWith' filepath='src/richtext/richtextbuffer.cpp' line='15767' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='EqPartial' mangled-name='_ZNK16wxTextAttrShadow9EqPartialERKS_b' filepath='src/richtext/richtextbuffer.cpp' line='15732' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16wxTextAttrShadow9EqPartialERKS_b@@WXU_3.2'>
          <parameter type-id='type-id-531' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-528' name='shadow' filepath='src/richtext/richtextbuffer.cpp' line='15732' column='1'/>
          <parameter type-id='type-id-3' name='weakTest' filepath='src/richtext/richtextbuffer.cpp' line='15732' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Reset' mangled-name='_ZN16wxTextAttrShadow5ResetEv' filepath='src/richtext/richtextbuffer.cpp' line='15721' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxTextAttrShadow5ResetEv@@WXU_3.2'>
          <parameter type-id='type-id-527' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='operator==' mangled-name='_ZNK16wxTextAttrShadoweqERKS_' filepath='src/richtext/richtextbuffer.cpp' line='15710' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16wxTextAttrShadoweqERKS_@@WXU_3.2'>
          <parameter type-id='type-id-531' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-528' name='shadow' filepath='src/richtext/richtextbuffer.cpp' line='15710' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxTextBoxAttr' size-in-bits='4352' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1311' column='1' id='type-id-532'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_flags' type-id='type-id-19' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1718' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='m_margins' type-id='type-id-492' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1720' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='m_padding' type-id='type-id-492' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1721' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='m_position' type-id='type-id-492' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1722' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='m_size' type-id='type-id-498' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1724' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='m_minSize' type-id='type-id-498' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1725' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='m_maxSize' type-id='type-id-498' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1726' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='m_border' type-id='type-id-520' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1728' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='m_outline' type-id='type-id-520' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1729' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='m_floatMode' type-id='type-id-509' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1731' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3296'>
        <var-decl name='m_clearMode' type-id='type-id-510' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1732' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='m_collapseMode' type-id='type-id-511' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1733' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3360'>
        <var-decl name='m_verticalAlignment' type-id='type-id-512' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1734' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='m_whitespaceMode' type-id='type-id-513' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1735' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3424'>
        <var-decl name='m_cornerRadius' type-id='type-id-486' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='m_boxStyleName' type-id='type-id-42' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1737' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='m_shadow' type-id='type-id-526' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1738' column='1'/>
      </data-member>
      <member-function access='public' const='yes'>
        <function-decl name='IsDefault' mangled-name='_ZNK13wxTextBoxAttr9IsDefaultEv' filepath='src/richtext/richtextbuffer.cpp' line='14063' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxTextBoxAttr9IsDefaultEv@@WXU_3.2'>
          <parameter type-id='type-id-533' name='this' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='CollectCommonAttributes' mangled-name='_ZN13wxTextBoxAttr23CollectCommonAttributesERKS_RS_S2_' filepath='src/richtext/richtextbuffer.cpp' line='13892' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxTextBoxAttr23CollectCommonAttributesERKS_RS_S2_@@WXU_3.2'>
          <parameter type-id='type-id-534' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-535' name='attr' filepath='src/richtext/richtextbuffer.cpp' line='13892' column='1'/>
          <parameter type-id='type-id-536' name='clashingAttr' filepath='src/richtext/richtextbuffer.cpp' line='13892' column='1'/>
          <parameter type-id='type-id-536' name='absentAttr' filepath='src/richtext/richtextbuffer.cpp' line='13892' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='RemoveStyle' mangled-name='_ZN13wxTextBoxAttr11RemoveStyleERKS_' filepath='src/richtext/richtextbuffer.cpp' line='13848' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxTextBoxAttr11RemoveStyleERKS_@@WXU_3.2'>
          <parameter type-id='type-id-534' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-535' name='attr' filepath='src/richtext/richtextbuffer.cpp' line='13848' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Apply' mangled-name='_ZN13wxTextBoxAttr5ApplyERKS_PS0_' filepath='src/richtext/richtextbuffer.cpp' line='13788' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxTextBoxAttr5ApplyERKS_PS0_@@WXU_3.2'>
          <parameter type-id='type-id-534' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-535' name='attr' filepath='src/richtext/richtextbuffer.cpp' line='13788' column='1'/>
          <parameter type-id='type-id-537' name='compareWith' filepath='src/richtext/richtextbuffer.cpp' line='13788' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='EqPartial' mangled-name='_ZNK13wxTextBoxAttr9EqPartialERKS_b' filepath='src/richtext/richtextbuffer.cpp' line='13708' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxTextBoxAttr9EqPartialERKS_b@@WXU_3.2'>
          <parameter type-id='type-id-533' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-535' name='attr' filepath='src/richtext/richtextbuffer.cpp' line='13708' column='1'/>
          <parameter type-id='type-id-3' name='weakTest' filepath='src/richtext/richtextbuffer.cpp' line='13708' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='operator==' mangled-name='_ZNK13wxTextBoxAttreqERKS_' filepath='src/richtext/richtextbuffer.cpp' line='13680' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK13wxTextBoxAttreqERKS_@@WXU_3.2'>
          <parameter type-id='type-id-533' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-535' name='attr' filepath='src/richtext/richtextbuffer.cpp' line='13680' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Reset' mangled-name='_ZN13wxTextBoxAttr5ResetEv' filepath='src/richtext/richtextbuffer.cpp' line='13655' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN13wxTextBoxAttr5ResetEv@@WXU_3.2'>
          <parameter type-id='type-id-534' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxRichTextAttr' size-in-bits='8768' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1752' column='1' id='type-id-240'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-538'/>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='m_textBoxAttr' type-id='type-id-532' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1832' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='CollectCommonAttributes' mangled-name='_ZN14wxRichTextAttr23CollectCommonAttributesERKS_RS_S2_' filepath='src/richtext/richtextbuffer.cpp' line='14121' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxRichTextAttr23CollectCommonAttributesERKS_RS_S2_@@WXU_3.2'>
          <parameter type-id='type-id-539' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-540' name='attr' filepath='src/richtext/richtextbuffer.cpp' line='14121' column='1'/>
          <parameter type-id='type-id-541' name='clashingAttr' filepath='src/richtext/richtextbuffer.cpp' line='14121' column='1'/>
          <parameter type-id='type-id-541' name='absentAttr' filepath='src/richtext/richtextbuffer.cpp' line='14121' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='RemoveStyle' mangled-name='_ZN14wxRichTextAttr11RemoveStyleERKS_' filepath='src/richtext/richtextbuffer.cpp' line='14112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxRichTextAttr11RemoveStyleERKS_@@WXU_3.2'>
          <parameter type-id='type-id-539' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-540' name='attr' filepath='src/richtext/richtextbuffer.cpp' line='14112' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Apply' mangled-name='_ZN14wxRichTextAttr5ApplyERKS_PS0_' filepath='src/richtext/richtextbuffer.cpp' line='14104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxRichTextAttr5ApplyERKS_PS0_@@WXU_3.2'>
          <parameter type-id='type-id-539' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-540' name='style' filepath='src/richtext/richtextbuffer.cpp' line='14104' column='1'/>
          <parameter type-id='type-id-542' name='compareWith' filepath='src/richtext/richtextbuffer.cpp' line='14104' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='EqPartial' mangled-name='_ZNK14wxRichTextAttr9EqPartialERKS_b' filepath='src/richtext/richtextbuffer.cpp' line='14093' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxRichTextAttr9EqPartialERKS_b@@WXU_3.2'>
          <parameter type-id='type-id-543' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-540' name='attr' filepath='src/richtext/richtextbuffer.cpp' line='14093' column='1'/>
          <parameter type-id='type-id-3' name='weakTest' filepath='src/richtext/richtextbuffer.cpp' line='14093' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='operator==' mangled-name='_ZNK14wxRichTextAttreqERKS_' filepath='src/richtext/richtextbuffer.cpp' line='14084' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxRichTextAttreqERKS_@@WXU_3.2'>
          <parameter type-id='type-id-543' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-540' name='attr' filepath='src/richtext/richtextbuffer.cpp' line='14084' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Copy' mangled-name='_ZN14wxRichTextAttr4CopyERKS_' filepath='src/richtext/richtextbuffer.cpp' line='14077' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxRichTextAttr4CopyERKS_@@WXU_3.2'>
          <parameter type-id='type-id-539' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-540' name='attr' filepath='src/richtext/richtextbuffer.cpp' line='14077' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxObjectArrayTraitsForwxRichTextAttrArray' size-in-bits='8' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1835' column='1' id='type-id-544'>
      <member-function access='public' static='yes'>
        <function-decl name='Free' mangled-name='_ZN41wxObjectArrayTraitsForwxRichTextAttrArray4FreeEP14wxRichTextAttr' filepath='src/richtext/richtextbuffer.cpp' line='15163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN41wxObjectArrayTraitsForwxRichTextAttrArray4FreeEP14wxRichTextAttr@@WXU_3.2'>
          <parameter type-id='type-id-545' name='p' filepath='src/richtext/richtextbuffer.cpp' line='15163' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='Clone' mangled-name='_ZN41wxObjectArrayTraitsForwxRichTextAttrArray5CloneERK14wxRichTextAttr' filepath='src/richtext/richtextbuffer.cpp' line='15163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN41wxObjectArrayTraitsForwxRichTextAttrArray5CloneERK14wxRichTextAttr@@WXU_3.2'>
          <parameter type-id='type-id-546' name='item' filepath='src/richtext/richtextbuffer.cpp' line='15163' column='1'/>
          <return type-id='type-id-547'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxRichTextAttrArray' size-in-bits='192' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1835' column='1' id='type-id-548'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-238'/>
    </class-decl>
    <class-decl name='wxObjectArrayTraitsForwxRichTextVariantArray' size-in-bits='8' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1837' column='1' id='type-id-549'>
      <member-function access='public' static='yes'>
        <function-decl name='Free' mangled-name='_ZN44wxObjectArrayTraitsForwxRichTextVariantArray4FreeEP9wxVariant' filepath='src/richtext/richtextbuffer.cpp' line='15162' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN44wxObjectArrayTraitsForwxRichTextVariantArray4FreeEP9wxVariant@@WXU_3.2'>
          <parameter type-id='type-id-550' name='p' filepath='src/richtext/richtextbuffer.cpp' line='15162' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='Clone' mangled-name='_ZN44wxObjectArrayTraitsForwxRichTextVariantArray5CloneERK9wxVariant' filepath='src/richtext/richtextbuffer.cpp' line='15162' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN44wxObjectArrayTraitsForwxRichTextVariantArray5CloneERK9wxVariant@@WXU_3.2'>
          <parameter type-id='type-id-551' name='item' filepath='src/richtext/richtextbuffer.cpp' line='15162' column='1'/>
          <return type-id='type-id-552'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxRichTextVariantArray' size-in-bits='192' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1837' column='1' id='type-id-553'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-250'/>
    </class-decl>
    <class-decl name='wxObjectArrayTraitsForwxRichTextRectArray' size-in-bits='8' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1839' column='1' id='type-id-554'>
      <member-function access='public' static='yes'>
        <function-decl name='Free' mangled-name='_ZN41wxObjectArrayTraitsForwxRichTextRectArray4FreeEP6wxRect' filepath='src/richtext/richtextbuffer.cpp' line='15164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN41wxObjectArrayTraitsForwxRichTextRectArray4FreeEP6wxRect@@WXU_3.2'>
          <parameter type-id='type-id-555' name='p' filepath='src/richtext/richtextbuffer.cpp' line='15164' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='Clone' mangled-name='_ZN41wxObjectArrayTraitsForwxRichTextRectArray5CloneERK6wxRect' filepath='src/richtext/richtextbuffer.cpp' line='15164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN41wxObjectArrayTraitsForwxRichTextRectArray5CloneERK6wxRect@@WXU_3.2'>
          <parameter type-id='type-id-556' name='item' filepath='src/richtext/richtextbuffer.cpp' line='15164' column='1'/>
          <return type-id='type-id-557'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxRichTextRectArray' size-in-bits='192' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='1839' column='1' id='type-id-558'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-234'/>
    </class-decl>
    <class-decl name='wxRichTextRange' size-in-bits='128' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='2094' column='1' id='type-id-248'>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_start' type-id='type-id-21' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='2212' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_end' type-id='type-id-21' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='2213' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='LimitTo' mangled-name='_ZN15wxRichTextRange7LimitToERKS_' filepath='src/richtext/richtextbuffer.cpp' line='12474' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxRichTextRange7LimitToERKS_@@WXU_3.2'>
          <parameter type-id='type-id-559' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-560' name='range' filepath='src/richtext/richtextbuffer.cpp' line='12474' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxObjectArrayTraitsForwxRichTextRangeArray' size-in-bits='8' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='2216' column='1' id='type-id-561'>
      <member-function access='public' static='yes'>
        <function-decl name='Free' mangled-name='_ZN42wxObjectArrayTraitsForwxRichTextRangeArray4FreeEP15wxRichTextRange' filepath='src/richtext/richtextbuffer.cpp' line='12471' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN42wxObjectArrayTraitsForwxRichTextRangeArray4FreeEP15wxRichTextRange@@WXU_3.2'>
          <parameter type-id='type-id-562' name='p' filepath='src/richtext/richtextbuffer.cpp' line='12471' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='Clone' mangled-name='_ZN42wxObjectArrayTraitsForwxRichTextRangeArray5CloneERK15wxRichTextRange' filepath='src/richtext/richtextbuffer.cpp' line='12471' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN42wxObjectArrayTraitsForwxRichTextRangeArray5CloneERK15wxRichTextRange@@WXU_3.2'>
          <parameter type-id='type-id-563' name='item' filepath='src/richtext/richtextbuffer.cpp' line='12471' column='1'/>
          <return type-id='type-id-564'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxRichTextRangeArray' size-in-bits='192' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='2216' column='1' id='type-id-565'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-246'/>
    </class-decl>
    <class-decl name='wxRichTextSelection' size-in-bits='256' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='2239' column='1' id='type-id-566'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_ranges' type-id='type-id-565' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='2380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_container' type-id='type-id-567' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='2381' column='1'/>
      </data-member>
      <member-function access='public' static='yes'>
        <function-decl name='WithinSelection' mangled-name='_ZN19wxRichTextSelection15WithinSelectionERK15wxRichTextRangeRK20wxRichTextRangeArray' filepath='src/richtext/richtextbuffer.cpp' line='15464' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxRichTextSelection15WithinSelectionERK15wxRichTextRangeRK20wxRichTextRangeArray@@WXU_3.2'>
          <parameter type-id='type-id-560'/>
          <parameter type-id='type-id-568'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='WithinSelection' mangled-name='_ZN19wxRichTextSelection15WithinSelectionElRK20wxRichTextRangeArray' filepath='src/richtext/richtextbuffer.cpp' line='15451' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxRichTextSelection15WithinSelectionElRK20wxRichTextRangeArray@@WXU_3.2'>
          <parameter type-id='type-id-21'/>
          <parameter type-id='type-id-568'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='WithinSelection' mangled-name='_ZNK19wxRichTextSelection15WithinSelectionElP16wxRichTextObject' filepath='src/richtext/richtextbuffer.cpp' line='15439' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK19wxRichTextSelection15WithinSelectionElP16wxRichTextObject@@WXU_3.2'>
          <parameter type-id='type-id-569' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-21' name='pos' filepath='src/richtext/richtextbuffer.cpp' line='15439' column='1'/>
          <parameter type-id='type-id-570' name='obj' filepath='src/richtext/richtextbuffer.cpp' line='15439' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetSelectionForObject' mangled-name='_ZNK19wxRichTextSelection21GetSelectionForObjectEP16wxRichTextObject' filepath='src/richtext/richtextbuffer.cpp' line='15398' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK19wxRichTextSelection21GetSelectionForObjectEP16wxRichTextObject@@WXU_3.2'>
          <parameter type-id='type-id-569' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-570' name='obj' filepath='src/richtext/richtextbuffer.cpp' line='15398' column='1'/>
          <return type-id='type-id-565'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='operator==' mangled-name='_ZNK19wxRichTextSelectioneqERKS_' filepath='src/richtext/richtextbuffer.cpp' line='15383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK19wxRichTextSelectioneqERKS_@@WXU_3.2'>
          <parameter type-id='type-id-569' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-571' name='sel' filepath='src/richtext/richtextbuffer.cpp' line='15383' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxRichTextObjectList' size-in-bits='384' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-572'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-401'/>
      <member-type access='public'>
        <class-decl name='compatibility_iterator' size-in-bits='64' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-573'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_ptr' type-id='type-id-574' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-575'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-577' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-576'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-575' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-578'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-580' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-579'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-579' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-581'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-570' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-582'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-583' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-583' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_reverse_iterator' size-in-bits='128' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-584'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-577' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-585'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-584' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-586'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-588' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-587'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-587' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-589'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-570' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-590'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-591' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-591' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='128' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-592'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-577' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-593'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-592' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-594'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-596' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-595'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-595' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-597'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-570' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-598'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-599' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-599' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator' size-in-bits='128' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-600'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-577' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-601'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-600' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-602'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-604' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-603'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-603' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-605'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-570' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-606'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-607' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-607' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='Node' type-id='type-id-577' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-608'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-610' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-609'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-612' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-611'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-52' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-613'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-570' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-614'/>
      </member-type>
      <member-function access='protected' vtable-offset='2'>
        <function-decl name='CreateNode' mangled-name='_ZN20wxRichTextObjectList10CreateNodeEP10wxNodeBaseS1_PvRK9wxListKey' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-615' is-artificial='yes'/>
          <parameter type-id='type-id-449'/>
          <parameter type-id='type-id-449'/>
          <parameter type-id='type-id-16'/>
          <parameter type-id='type-id-450'/>
          <return type-id='type-id-449'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='Find' mangled-name='_ZNK20wxRichTextObjectList4FindERK9wxListKey' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-616' is-artificial='yes'/>
          <parameter type-id='type-id-450'/>
          <return type-id='type-id-617'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='wxSortFuncFor_wxRichTextObjectList' type-id='type-id-618' filepath='include/wx/richtext/richtextbuffer.h' line='3099' column='1' id='type-id-619'/>
    <class-decl name='wxRichTextFieldType' size-in-bits='512' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4003' column='1' id='type-id-620'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-621'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-622' mangled-name='_ZN19wxRichTextFieldType12ms_classInfoE' visibility='default' filepath='src/richtext/richtextbuffer.cpp' line='9561' column='1' elf-symbol-id='_ZN19wxRichTextFieldType12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_name' type-id='type-id-42' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4081' column='1'/>
      </data-member>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK19wxRichTextFieldType12GetClassInfoEv' filepath='src/richtext/richtextbuffer.cpp' line='9561' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK19wxRichTextFieldType12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-623' is-artificial='yes'/>
          <return type-id='type-id-624'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='Draw' mangled-name='_ZN19wxRichTextFieldType4DrawEP15wxRichTextFieldR4wxDCR24wxRichTextDrawingContextRK15wxRichTextRangeRK19wxRichTextSelectionRK6wxRectii' filepath='include/wx/richtext/richtextbuffer.h' line='4027' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-625' is-artificial='yes'/>
          <parameter type-id='type-id-626'/>
          <parameter type-id='type-id-508'/>
          <parameter type-id='type-id-627'/>
          <parameter type-id='type-id-560'/>
          <parameter type-id='type-id-571'/>
          <parameter type-id='type-id-628'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='Layout' mangled-name='_ZN19wxRichTextFieldType6LayoutEP15wxRichTextFieldR4wxDCR24wxRichTextDrawingContextRK6wxRectS8_i' filepath='include/wx/richtext/richtextbuffer.h' line='4035' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-625' is-artificial='yes'/>
          <parameter type-id='type-id-626'/>
          <parameter type-id='type-id-508'/>
          <parameter type-id='type-id-627'/>
          <parameter type-id='type-id-628'/>
          <parameter type-id='type-id-628'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='7'>
        <function-decl name='GetRangeSize' mangled-name='_ZNK19wxRichTextFieldType12GetRangeSizeEP15wxRichTextFieldRK15wxRichTextRangeR6wxSizeRiR4wxDCR24wxRichTextDrawingContextiRK7wxPointRKS5_P10wxArrayInt' filepath='include/wx/richtext/richtextbuffer.h' line='4041' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-623' is-artificial='yes'/>
          <parameter type-id='type-id-626'/>
          <parameter type-id='type-id-560'/>
          <parameter type-id='type-id-629'/>
          <parameter type-id='type-id-630'/>
          <parameter type-id='type-id-508'/>
          <parameter type-id='type-id-627'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-631'/>
          <parameter type-id='type-id-507'/>
          <parameter type-id='type-id-632'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='8'>
        <function-decl name='CanEditProperties' mangled-name='_ZNK19wxRichTextFieldType17CanEditPropertiesEP15wxRichTextField' filepath='include/wx/richtext/richtextbuffer.h' line='4046' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-623' is-artificial='yes'/>
          <parameter type-id='type-id-626'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='EditProperties' mangled-name='_ZN19wxRichTextFieldType14EditPropertiesEP15wxRichTextFieldP8wxWindowP16wxRichTextBuffer' filepath='include/wx/richtext/richtextbuffer.h' line='4051' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-625' is-artificial='yes'/>
          <parameter type-id='type-id-626'/>
          <parameter type-id='type-id-633'/>
          <parameter type-id='type-id-634'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='10'>
        <function-decl name='GetPropertiesMenuLabel' mangled-name='_ZNK19wxRichTextFieldType22GetPropertiesMenuLabelEP15wxRichTextField' filepath='include/wx/richtext/richtextbuffer.h' line='4056' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-623' is-artificial='yes'/>
          <parameter type-id='type-id-626'/>
          <return type-id='type-id-42'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <function-decl name='UpdateField' mangled-name='_ZN19wxRichTextFieldType11UpdateFieldEP16wxRichTextBufferP15wxRichTextField' filepath='include/wx/richtext/richtextbuffer.h' line='4062' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-625' is-artificial='yes'/>
          <parameter type-id='type-id-634'/>
          <parameter type-id='type-id-626'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='12'>
        <function-decl name='IsTopLevel' mangled-name='_ZNK19wxRichTextFieldType10IsTopLevelEP15wxRichTextField' filepath='include/wx/richtext/richtextbuffer.h' line='4067' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-623' is-artificial='yes'/>
          <parameter type-id='type-id-626'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxRichTextFieldTypeHashMap' size-in-bits='256' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-635'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-636'/>
      <member-type access='public'>
        <class-decl name='Insert_Result' size-in-bits='192' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-637'>
          <member-type access='public'>
            <typedef-decl name='const_t1' type-id='type-id-639' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-638'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_t2' type-id='type-id-304' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-640'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t1' type-id='type-id-642' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-641'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t2' type-id='type-id-3' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-643'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='first' type-id='type-id-641' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='second' type-id='type-id-643' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='mapped_type' type-id='type-id-625' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-644'/>
      </member-type>
    </class-decl>
    <class-decl name='wxRichTextFieldTypeHashMap_wxImplementation_HashTable' size-in-bits='256' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-636'>
      <base-class access='protected' layout-offset-in-bits='0' type-id='type-id-289'/>
      <member-type access='public'>
        <class-decl name='Iterator' size-in-bits='128' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-645'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-646' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_ht' type-id='type-id-647' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='Node' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-648'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-287'/>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_value' type-id='type-id-649' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-650'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-645'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='128' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-642'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-645'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='Self' type-id='type-id-636' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-651'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_key_type' type-id='type-id-317' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-652'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_pointer' type-id='type-id-654' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-653'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-656' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-655'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='hasher' type-id='type-id-296' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-657'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_equal' type-id='type-id-297' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-658'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_extractor' type-id='type-id-660' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-659'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_type' type-id='type-id-42' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-661'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='pointer' type-id='type-id-663' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-662'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-665' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-664'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-52' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-666'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-667' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-649'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_table' type-id='type-id-333' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_tableBuckets' type-id='type-id-52' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_items' type-id='type-id-52' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_hasher' type-id='type-id-657' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='200'>
        <var-decl name='m_equals' type-id='type-id-658' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='208'>
        <var-decl name='m_getKey' type-id='type-id-659' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRichTextFieldTypeHashMap_wxImplementation_KeyEx' size-in-bits='8' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-660'>
      <member-type access='private'>
        <typedef-decl name='const_key_reference' type-id='type-id-669' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-668'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_key_type' type-id='type-id-671' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-670'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_reference' type-id='type-id-673' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-672'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_type' type-id='type-id-675' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-674'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='key_type' type-id='type-id-42' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-676'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='pair_type' type-id='type-id-667' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-677'/>
      </member-type>
    </class-decl>
    <class-decl name='wxRichTextFieldTypeHashMap_wxImplementation_Pair' size-in-bits='448' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-667'>
      <member-type access='public'>
        <typedef-decl name='const_t1' type-id='type-id-317' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-678'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_t2' type-id='type-id-623' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-679'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t1' type-id='type-id-42' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-680'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t2' type-id='type-id-625' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1' id='type-id-681'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='first' type-id='type-id-680' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='second' type-id='type-id-681' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4084' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRichTextFieldTypeStandard' size-in-bits='1728' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4117' column='1' id='type-id-682'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-620'/>
      <member-type access='public'>
        <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='include/wx/richtext/richtextbuffer.h' line='4123' column='1' id='type-id-683'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='wxRICHTEXT_FIELD_STYLE_COMPOSITE' value='1'/>
          <enumerator name='wxRICHTEXT_FIELD_STYLE_RECTANGLE' value='2'/>
          <enumerator name='wxRICHTEXT_FIELD_STYLE_NO_BORDER' value='4'/>
          <enumerator name='wxRICHTEXT_FIELD_STYLE_START_TAG' value='8'/>
          <enumerator name='wxRICHTEXT_FIELD_STYLE_END_TAG' value='16'/>
        </enum-decl>
      </member-type>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-622' mangled-name='_ZN27wxRichTextFieldTypeStandard12ms_classInfoE' visibility='default' filepath='src/richtext/richtextbuffer.cpp' line='9563' column='1' elf-symbol-id='_ZN27wxRichTextFieldTypeStandard12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='512'>
        <var-decl name='m_label' type-id='type-id-42' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4333' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='896'>
        <var-decl name='m_displayStyle' type-id='type-id-19' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4334' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='960'>
        <var-decl name='m_font' type-id='type-id-684' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4335' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='1088'>
        <var-decl name='m_textColour' type-id='type-id-75' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4336' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='1216'>
        <var-decl name='m_borderColour' type-id='type-id-75' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4337' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='1344'>
        <var-decl name='m_backgroundColour' type-id='type-id-75' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4338' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='1472'>
        <var-decl name='m_verticalPadding' type-id='type-id-19' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4339' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='1504'>
        <var-decl name='m_horizontalPadding' type-id='type-id-19' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4340' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='1536'>
        <var-decl name='m_horizontalMargin' type-id='type-id-19' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4341' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='1568'>
        <var-decl name='m_verticalMargin' type-id='type-id-19' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4342' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='1600'>
        <var-decl name='m_bitmap' type-id='type-id-117' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='4343' column='1'/>
      </data-member>
      <member-function access='public' const='yes'>
        <function-decl name='GetSize' mangled-name='_ZNK27wxRichTextFieldTypeStandard7GetSizeEP15wxRichTextFieldR4wxDCR24wxRichTextDrawingContexti' filepath='src/richtext/richtextbuffer.cpp' line='9753' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK27wxRichTextFieldTypeStandard7GetSizeEP15wxRichTextFieldR4wxDCR24wxRichTextDrawingContexti@@WXU_3.2'>
          <parameter type-id='type-id-685' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-626'/>
          <parameter type-id='type-id-508' name='dc' filepath='src/richtext/richtextbuffer.cpp' line='9753' column='1'/>
          <parameter type-id='type-id-627'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-278'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Copy' mangled-name='_ZN27wxRichTextFieldTypeStandard4CopyERKS_' filepath='src/richtext/richtextbuffer.cpp' line='9596' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN27wxRichTextFieldTypeStandard4CopyERKS_@@WXU_3.2'>
          <parameter type-id='type-id-686' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-687' name='field' filepath='src/richtext/richtextbuffer.cpp' line='9596' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Init' mangled-name='_ZN27wxRichTextFieldTypeStandard4InitEv' filepath='src/richtext/richtextbuffer.cpp' line='9583' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN27wxRichTextFieldTypeStandard4InitEv@@WXU_3.2'>
          <parameter type-id='type-id-686' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxRichTextFieldTypeStandard' mangled-name='_ZN27wxRichTextFieldTypeStandardC2ERK8wxStringRK8wxBitmapi' filepath='src/richtext/richtextbuffer.cpp' line='9574' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN27wxRichTextFieldTypeStandardC2ERK8wxStringRK8wxBitmapi@@WXU_3.2'>
          <parameter type-id='type-id-686' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-688' name='name' filepath='src/richtext/richtextbuffer.cpp' line='9574' column='1'/>
          <parameter type-id='type-id-73' name='bitmap' filepath='src/richtext/richtextbuffer.cpp' line='9574' column='1'/>
          <parameter type-id='type-id-19' name='displayStyle' filepath='src/richtext/richtextbuffer.cpp' line='9574' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxRichTextFieldTypeStandard' mangled-name='_ZN27wxRichTextFieldTypeStandardC2ERK8wxStringS2_i' filepath='src/richtext/richtextbuffer.cpp' line='9565' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN27wxRichTextFieldTypeStandardC2ERK8wxStringS2_i@@WXU_3.2'>
          <parameter type-id='type-id-686' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-688' name='name' filepath='src/richtext/richtextbuffer.cpp' line='9565' column='1'/>
          <parameter type-id='type-id-688' name='label' filepath='src/richtext/richtextbuffer.cpp' line='9565' column='1'/>
          <parameter type-id='type-id-19' name='displayStyle' filepath='src/richtext/richtextbuffer.cpp' line='9565' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK27wxRichTextFieldTypeStandard12GetClassInfoEv' filepath='src/richtext/richtextbuffer.cpp' line='9563' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK27wxRichTextFieldTypeStandard12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-689' is-artificial='yes'/>
          <return type-id='type-id-624'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='Draw' mangled-name='_ZN27wxRichTextFieldTypeStandard4DrawEP15wxRichTextFieldR4wxDCR24wxRichTextDrawingContextRK15wxRichTextRangeRK19wxRichTextSelectionRK6wxRectii' filepath='src/richtext/richtextbuffer.cpp' line='9612' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN27wxRichTextFieldTypeStandard4DrawEP15wxRichTextFieldR4wxDCR24wxRichTextDrawingContextRK15wxRichTextRangeRK19wxRichTextSelectionRK6wxRectii@@WXU_3.2'>
          <parameter type-id='type-id-690' is-artificial='yes'/>
          <parameter type-id='type-id-626'/>
          <parameter type-id='type-id-508'/>
          <parameter type-id='type-id-627'/>
          <parameter type-id='type-id-560'/>
          <parameter type-id='type-id-571'/>
          <parameter type-id='type-id-628'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='Layout' mangled-name='_ZN27wxRichTextFieldTypeStandard6LayoutEP15wxRichTextFieldR4wxDCR24wxRichTextDrawingContextRK6wxRectS8_i' filepath='src/richtext/richtextbuffer.cpp' line='9720' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN27wxRichTextFieldTypeStandard6LayoutEP15wxRichTextFieldR4wxDCR24wxRichTextDrawingContextRK6wxRectS8_i@@WXU_3.2'>
          <parameter type-id='type-id-690' is-artificial='yes'/>
          <parameter type-id='type-id-626'/>
          <parameter type-id='type-id-508'/>
          <parameter type-id='type-id-627'/>
          <parameter type-id='type-id-628'/>
          <parameter type-id='type-id-628'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='7'>
        <function-decl name='GetRangeSize' mangled-name='_ZNK27wxRichTextFieldTypeStandard12GetRangeSizeEP15wxRichTextFieldRK15wxRichTextRangeR6wxSizeRiR4wxDCR24wxRichTextDrawingContextiRK7wxPointRKS5_P10wxArrayInt' filepath='src/richtext/richtextbuffer.cpp' line='9732' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK27wxRichTextFieldTypeStandard12GetRangeSizeEP15wxRichTextFieldRK15wxRichTextRangeR6wxSizeRiR4wxDCR24wxRichTextDrawingContextiRK7wxPointRKS5_P10wxArrayInt@@WXU_3.2'>
          <parameter type-id='type-id-689' is-artificial='yes'/>
          <parameter type-id='type-id-626'/>
          <parameter type-id='type-id-560'/>
          <parameter type-id='type-id-629'/>
          <parameter type-id='type-id-630'/>
          <parameter type-id='type-id-508'/>
          <parameter type-id='type-id-627'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-631'/>
          <parameter type-id='type-id-507'/>
          <parameter type-id='type-id-632'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='12'>
        <function-decl name='IsTopLevel' mangled-name='_ZNK27wxRichTextFieldTypeStandard10IsTopLevelEP15wxRichTextField' filepath='include/wx/richtext/richtextbuffer.h' line='4219' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-689' is-artificial='yes'/>
          <parameter type-id='type-id-626'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='wxRichTextLineVector' type-id='type-id-691' filepath='include/wx/richtext/richtextbuffer.h' line='4480' column='1' id='type-id-692'/>
    <class-decl name='wxRichTextCell' size-in-bits='19392' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='5927' column='1' id='type-id-693'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-694'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-622' mangled-name='_ZN14wxRichTextCell12ms_classInfoE' visibility='default' filepath='src/richtext/richtextbuffer.cpp' line='9792' column='1' elf-symbol-id='_ZN14wxRichTextCell12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <member-function access='public' const='yes'>
        <function-decl name='GetRowSpan' mangled-name='_ZNK14wxRichTextCell10GetRowSpanEv' filepath='src/richtext/richtextbuffer.cpp' line='10079' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxRichTextCell10GetRowSpanEv@@WXU_3.2'>
          <parameter type-id='type-id-695' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetColSpan' mangled-name='_ZNK14wxRichTextCell10GetColSpanEv' filepath='src/richtext/richtextbuffer.cpp' line='10068' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxRichTextCell10GetColSpanEv@@WXU_3.2'>
          <parameter type-id='type-id-695' name='this' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetRowSpan' mangled-name='_ZN14wxRichTextCell10SetRowSpanEi' filepath='src/richtext/richtextbuffer.cpp' line='10060' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxRichTextCell10SetRowSpanEi@@WXU_3.2'>
          <parameter type-id='type-id-696' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-19' name='span' filepath='src/richtext/richtextbuffer.cpp' line='10060' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetColSpan' mangled-name='_ZN14wxRichTextCell10SetColSpanEi' filepath='src/richtext/richtextbuffer.cpp' line='10053' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxRichTextCell10SetColSpanEi@@WXU_3.2'>
          <parameter type-id='type-id-696' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-19' name='span' filepath='src/richtext/richtextbuffer.cpp' line='10060' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Copy' mangled-name='_ZN14wxRichTextCell4CopyERKS_' filepath='src/richtext/richtextbuffer.cpp' line='9966' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxRichTextCell4CopyERKS_@@WXU_3.2'>
          <parameter type-id='type-id-696' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-697' name='obj' filepath='src/richtext/richtextbuffer.cpp' line='9966' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxRichTextCell' mangled-name='_ZN14wxRichTextCellC2EP16wxRichTextObject' filepath='src/richtext/richtextbuffer.cpp' line='9794' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxRichTextCellC2EP16wxRichTextObject@@WXU_3.2'>
          <parameter type-id='type-id-696' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-570' name='parent' filepath='src/richtext/richtextbuffer.cpp' line='9794' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='wxCreateObject' mangled-name='_ZN14wxRichTextCell14wxCreateObjectEv' filepath='src/richtext/richtextbuffer.cpp' line='9792' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxRichTextCell14wxCreateObjectEv@@WXU_3.2'>
          <return type-id='type-id-412'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK14wxRichTextCell12GetClassInfoEv' filepath='src/richtext/richtextbuffer.cpp' line='9792' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxRichTextCell12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-698' is-artificial='yes'/>
          <return type-id='type-id-624'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='Draw' mangled-name='_ZN14wxRichTextCell4DrawER4wxDCR24wxRichTextDrawingContextRK15wxRichTextRangeRK19wxRichTextSelectionRK6wxRectii' filepath='src/richtext/richtextbuffer.cpp' line='9800' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxRichTextCell4DrawER4wxDCR24wxRichTextDrawingContextRK15wxRichTextRangeRK19wxRichTextSelectionRK6wxRectii@@WXU_3.2'>
          <parameter type-id='type-id-699' is-artificial='yes'/>
          <parameter type-id='type-id-508'/>
          <parameter type-id='type-id-627'/>
          <parameter type-id='type-id-560'/>
          <parameter type-id='type-id-571'/>
          <parameter type-id='type-id-628'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='HitTest' mangled-name='_ZN14wxRichTextCell7HitTestER4wxDCR24wxRichTextDrawingContextRK7wxPointRlPP16wxRichTextObjectSA_i' filepath='src/richtext/richtextbuffer.cpp' line='9811' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxRichTextCell7HitTestER4wxDCR24wxRichTextDrawingContextRK7wxPointRlPP16wxRichTextObjectSA_i@@WXU_3.2'>
          <parameter type-id='type-id-699' is-artificial='yes'/>
          <parameter type-id='type-id-508'/>
          <parameter type-id='type-id-627'/>
          <parameter type-id='type-id-631'/>
          <parameter type-id='type-id-700'/>
          <parameter type-id='type-id-701'/>
          <parameter type-id='type-id-701'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='14'>
        <function-decl name='IsEmpty' mangled-name='_ZNK14wxRichTextCell7IsEmptyEv' filepath='include/wx/richtext/richtextbuffer.h' line='5962' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-698' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='24'>
        <function-decl name='CanEditProperties' mangled-name='_ZNK14wxRichTextCell17CanEditPropertiesEv' filepath='include/wx/richtext/richtextbuffer.h' line='5955' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-698' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='25'>
        <function-decl name='EditProperties' mangled-name='_ZN14wxRichTextCell14EditPropertiesEP8wxWindowP16wxRichTextBuffer' filepath='src/richtext/richtextbuffer.cpp' line='9972' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxRichTextCell14EditPropertiesEP8wxWindowP16wxRichTextBuffer@@WXU_3.2'>
          <parameter type-id='type-id-699' is-artificial='yes'/>
          <parameter type-id='type-id-633'/>
          <parameter type-id='type-id-634'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='26'>
        <function-decl name='GetPropertiesMenuLabel' mangled-name='_ZNK14wxRichTextCell22GetPropertiesMenuLabelEv' filepath='include/wx/richtext/richtextbuffer.h' line='5959' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-698' is-artificial='yes'/>
          <return type-id='type-id-42'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='32'>
        <function-decl name='GetXMLNodeName' mangled-name='_ZNK14wxRichTextCell14GetXMLNodeNameEv' filepath='include/wx/richtext/richtextbuffer.h' line='5953' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-698' is-artificial='yes'/>
          <return type-id='type-id-42'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='61'>
        <function-decl name='AdjustAttributes' mangled-name='_ZN14wxRichTextCell16AdjustAttributesER14wxRichTextAttrR24wxRichTextDrawingContext' filepath='src/richtext/richtextbuffer.cpp' line='9828' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxRichTextCell16AdjustAttributesER14wxRichTextAttrR24wxRichTextDrawingContext@@WXU_3.2'>
          <parameter type-id='type-id-699' is-artificial='yes'/>
          <parameter type-id='type-id-541'/>
          <parameter type-id='type-id-627'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='64'>
        <function-decl name='Clone' mangled-name='_ZNK14wxRichTextCell5CloneEv' filepath='include/wx/richtext/richtextbuffer.h' line='5988' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-698' is-artificial='yes'/>
          <return type-id='type-id-570'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxRichTextObjectPtrArray' size-in-bits='192' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='6001' column='1' id='type-id-244'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-208'/>
    </class-decl>
    <class-decl name='wxObjectArrayTraitsForwxRichTextObjectPtrArrayArray' size-in-bits='8' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='6002' column='1' id='type-id-702'>
      <member-function access='public' static='yes'>
        <function-decl name='Free' mangled-name='_ZN51wxObjectArrayTraitsForwxRichTextObjectPtrArrayArray4FreeEP24wxRichTextObjectPtrArray' filepath='src/richtext/richtextbuffer.cpp' line='10090' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN51wxObjectArrayTraitsForwxRichTextObjectPtrArrayArray4FreeEP24wxRichTextObjectPtrArray@@WXU_3.2'>
          <parameter type-id='type-id-703' name='p' filepath='src/richtext/richtextbuffer.cpp' line='10090' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='Clone' mangled-name='_ZN51wxObjectArrayTraitsForwxRichTextObjectPtrArrayArray5CloneERK24wxRichTextObjectPtrArray' filepath='src/richtext/richtextbuffer.cpp' line='10090' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN51wxObjectArrayTraitsForwxRichTextObjectPtrArrayArray5CloneERK24wxRichTextObjectPtrArray@@WXU_3.2'>
          <parameter type-id='type-id-704' name='item' filepath='src/richtext/richtextbuffer.cpp' line='10090' column='1'/>
          <return type-id='type-id-705'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxRichTextObjectPtrArrayArray' size-in-bits='192' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='6002' column='1' id='type-id-706'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-242'/>
    </class-decl>
    <class-decl name='wxRichTextTableBlock' size-in-bits='128' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='6199' column='1' id='type-id-707'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_colStart' type-id='type-id-19' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='6241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='m_colEnd' type-id='type-id-19' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='6241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='m_rowStart' type-id='type-id-19' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='6241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='m_rowEnd' type-id='type-id-19' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='6241' column='1'/>
      </data-member>
      <member-function access='public' static='yes'>
        <function-decl name='GetFocusedCell' mangled-name='_ZN20wxRichTextTableBlock14GetFocusedCellEP14wxRichTextCtrl' filepath='src/richtext/richtextbuffer.cpp' line='11632' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN20wxRichTextTableBlock14GetFocusedCellEP14wxRichTextCtrl@@WXU_3.2'>
          <parameter type-id='type-id-708'/>
          <return type-id='type-id-699'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='IsWholeTable' mangled-name='_ZNK20wxRichTextTableBlock12IsWholeTableEP15wxRichTextTable' filepath='src/richtext/richtextbuffer.cpp' line='11626' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK20wxRichTextTableBlock12IsWholeTableEP15wxRichTextTable@@WXU_3.2'>
          <parameter type-id='type-id-709' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-710' name='table' filepath='src/richtext/richtextbuffer.cpp' line='11626' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='ComputeBlockForSelection' mangled-name='_ZN20wxRichTextTableBlock24ComputeBlockForSelectionEP15wxRichTextTableP14wxRichTextCtrlb' filepath='src/richtext/richtextbuffer.cpp' line='11558' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN20wxRichTextTableBlock24ComputeBlockForSelectionEP15wxRichTextTableP14wxRichTextCtrlb@@WXU_3.2'>
          <parameter type-id='type-id-711' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-710' name='table' filepath='src/richtext/richtextbuffer.cpp' line='11558' column='1'/>
          <parameter type-id='type-id-708' name='ctrl' filepath='src/richtext/richtextbuffer.cpp' line='11558' column='1'/>
          <parameter type-id='type-id-3' name='requireCellSelection' filepath='src/richtext/richtextbuffer.cpp' line='11558' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='wxRichTextCommandId' filepath='include/wx/richtext/richtextbuffer.h' line='6248' column='1' id='type-id-712'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxRICHTEXT_INSERT' value='0'/>
      <enumerator name='wxRICHTEXT_DELETE' value='1'/>
      <enumerator name='wxRICHTEXT_CHANGE_ATTRIBUTES' value='2'/>
      <enumerator name='wxRICHTEXT_CHANGE_STYLE' value='3'/>
      <enumerator name='wxRICHTEXT_CHANGE_PROPERTIES' value='4'/>
      <enumerator name='wxRICHTEXT_CHANGE_OBJECT' value='5'/>
    </enum-decl>
    <class-decl name='wxRichTextObjectAddress' size-in-bits='192' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='6272' column='1' id='type-id-713'>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_address' type-id='type-id-254' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='6325' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='Create' mangled-name='_ZN23wxRichTextObjectAddress6CreateEP28wxRichTextParagraphLayoutBoxP16wxRichTextObject' filepath='src/richtext/richtextbuffer.cpp' line='15354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN23wxRichTextObjectAddress6CreateEP28wxRichTextParagraphLayoutBoxP16wxRichTextObject@@WXU_3.2'>
          <parameter type-id='type-id-714' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-567' name='topLevelContainer' filepath='src/richtext/richtextbuffer.cpp' line='15354' column='1'/>
          <parameter type-id='type-id-570' name='obj' filepath='src/richtext/richtextbuffer.cpp' line='15354' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetObject' mangled-name='_ZNK23wxRichTextObjectAddress9GetObjectEP28wxRichTextParagraphLayoutBox' filepath='src/richtext/richtextbuffer.cpp' line='15330' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK23wxRichTextObjectAddress9GetObjectEP28wxRichTextParagraphLayoutBox@@WXU_3.2'>
          <parameter type-id='type-id-715' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-567' name='topLevelContainer' filepath='src/richtext/richtextbuffer.cpp' line='15330' column='1'/>
          <return type-id='type-id-570'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxRichTextCommand' size-in-bits='1024' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='6342' column='1' id='type-id-716'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-717'/>
      <data-member access='protected' layout-offset-in-bits='576'>
        <var-decl name='m_actions' type-id='type-id-455' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='6391' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='960'>
        <var-decl name='m_freeze' type-id='type-id-3' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='6392' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='ClearActions' mangled-name='_ZN17wxRichTextCommand12ClearActionsEv' filepath='src/richtext/richtextbuffer.cpp' line='11764' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxRichTextCommand12ClearActionsEv@@WXU_3.2'>
          <parameter type-id='type-id-718' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='AddAction' mangled-name='_ZN17wxRichTextCommand9AddActionEP16wxRichTextAction' filepath='src/richtext/richtextbuffer.cpp' line='11721' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxRichTextCommand9AddActionEP16wxRichTextAction@@WXU_3.2'>
          <parameter type-id='type-id-718' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-719' name='action' filepath='src/richtext/richtextbuffer.cpp' line='11721' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxRichTextCommand' mangled-name='_ZN17wxRichTextCommandC2ERK8wxString' filepath='src/richtext/richtextbuffer.cpp' line='11711' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxRichTextCommandC2ERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-718' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-688' name='name' filepath='src/richtext/richtextbuffer.cpp' line='11711' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxRichTextCommand' mangled-name='_ZN17wxRichTextCommandC2ERK8wxString19wxRichTextCommandIdP16wxRichTextBufferP28wxRichTextParagraphLayoutBoxP14wxRichTextCtrlb' filepath='src/richtext/richtextbuffer.cpp' line='11704' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxRichTextCommandC2ERK8wxString19wxRichTextCommandIdP16wxRichTextBufferP28wxRichTextParagraphLayoutBoxP14wxRichTextCtrlb@@WXU_3.2'>
          <parameter type-id='type-id-718' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-688' name='name' filepath='src/richtext/richtextbuffer.cpp' line='11704' column='1'/>
          <parameter type-id='type-id-712' name='id' filepath='src/richtext/richtextbuffer.cpp' line='11704' column='1'/>
          <parameter type-id='type-id-634' name='buffer' filepath='src/richtext/richtextbuffer.cpp' line='11704' column='1'/>
          <parameter type-id='type-id-567' name='container' filepath='src/richtext/richtextbuffer.cpp' line='11705' column='1'/>
          <parameter type-id='type-id-708' name='ctrl' filepath='src/richtext/richtextbuffer.cpp' line='11705' column='1'/>
          <parameter type-id='type-id-3' name='ignoreFirstTime' filepath='src/richtext/richtextbuffer.cpp' line='11705' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRichTextCommand' mangled-name='_ZN17wxRichTextCommandD4Ev' filepath='src/richtext/richtextbuffer.cpp' line='11716' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-720' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRichTextCommand' mangled-name='_ZN17wxRichTextCommandD0Ev' filepath='src/richtext/richtextbuffer.cpp' line='11716' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxRichTextCommandD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-720' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRichTextCommand' mangled-name='_ZN17wxRichTextCommandD2Ev' filepath='src/richtext/richtextbuffer.cpp' line='11716' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxRichTextCommandD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-720' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='Do' mangled-name='_ZN17wxRichTextCommand2DoEv' filepath='src/richtext/richtextbuffer.cpp' line='11730' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxRichTextCommand2DoEv@@WXU_3.2'>
          <parameter type-id='type-id-720' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='Undo' mangled-name='_ZN17wxRichTextCommand4UndoEv' filepath='src/richtext/richtextbuffer.cpp' line='11747' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxRichTextCommand4UndoEv@@WXU_3.2'>
          <parameter type-id='type-id-720' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxRichTextPlainTextHandler' size-in-bits='1408' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='6793' column='1' id='type-id-721'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-722'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-622' mangled-name='_ZN26wxRichTextPlainTextHandler12ms_classInfoE' visibility='default' filepath='src/richtext/richtextbuffer.cpp' line='13072' column='1' elf-symbol-id='_ZN26wxRichTextPlainTextHandler12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK26wxRichTextPlainTextHandler12GetClassInfoEv' filepath='src/richtext/richtextbuffer.cpp' line='13072' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK26wxRichTextPlainTextHandler12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-723' is-artificial='yes'/>
          <return type-id='type-id-624'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='8'>
        <function-decl name='CanSave' mangled-name='_ZNK26wxRichTextPlainTextHandler7CanSaveEv' filepath='include/wx/richtext/richtextbuffer.h' line='6804' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-723' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='9'>
        <function-decl name='CanLoad' mangled-name='_ZNK26wxRichTextPlainTextHandler7CanLoadEv' filepath='include/wx/richtext/richtextbuffer.h' line='6807' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-723' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='12'>
        <function-decl name='DoLoadFile' mangled-name='_ZN26wxRichTextPlainTextHandler10DoLoadFileEP16wxRichTextBufferR13wxInputStream' filepath='src/richtext/richtextbuffer.cpp' line='13075' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN26wxRichTextPlainTextHandler10DoLoadFileEP16wxRichTextBufferR13wxInputStream@@WXU_3.2'>
          <parameter type-id='type-id-724' is-artificial='yes'/>
          <parameter type-id='type-id-634'/>
          <parameter type-id='type-id-725'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='13'>
        <function-decl name='DoSaveFile' mangled-name='_ZN26wxRichTextPlainTextHandler10DoSaveFileEP16wxRichTextBufferR14wxOutputStream' filepath='src/richtext/richtextbuffer.cpp' line='13107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN26wxRichTextPlainTextHandler10DoSaveFileEP16wxRichTextBufferR14wxOutputStream@@WXU_3.2'>
          <parameter type-id='type-id-724' is-artificial='yes'/>
          <parameter type-id='type-id-634'/>
          <parameter type-id='type-id-726'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxRichTextDrawingHandler' size-in-bits='512' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='6830' column='1' id='type-id-727'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-621'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-622' mangled-name='_ZN24wxRichTextDrawingHandler12ms_classInfoE' visibility='default' filepath='src/richtext/richtextbuffer.cpp' line='15476' column='1' elf-symbol-id='_ZN24wxRichTextDrawingHandler12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_name' type-id='type-id-42' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='6888' column='1'/>
      </data-member>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK24wxRichTextDrawingHandler12GetClassInfoEv' filepath='src/richtext/richtextbuffer.cpp' line='15476' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK24wxRichTextDrawingHandler12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-728' is-artificial='yes'/>
          <return type-id='type-id-624'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='HasVirtualAttributes' mangled-name='_ZNK24wxRichTextDrawingHandler20HasVirtualAttributesEP16wxRichTextObject' filepath='include/wx/richtext/richtextbuffer.h' line='6844' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-728' is-artificial='yes'/>
          <parameter type-id='type-id-570'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='6'>
        <function-decl name='GetVirtualAttributes' mangled-name='_ZNK24wxRichTextDrawingHandler20GetVirtualAttributesER14wxRichTextAttrP16wxRichTextObject' filepath='include/wx/richtext/richtextbuffer.h' line='6849' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-728' is-artificial='yes'/>
          <parameter type-id='type-id-541'/>
          <parameter type-id='type-id-570'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='7'>
        <function-decl name='GetVirtualSubobjectAttributesCount' mangled-name='_ZNK24wxRichTextDrawingHandler34GetVirtualSubobjectAttributesCountEP16wxRichTextObject' filepath='include/wx/richtext/richtextbuffer.h' line='6855' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-728' is-artificial='yes'/>
          <parameter type-id='type-id-570'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='8'>
        <function-decl name='GetVirtualSubobjectAttributes' mangled-name='_ZNK24wxRichTextDrawingHandler29GetVirtualSubobjectAttributesEP16wxRichTextObjectR10wxArrayIntR19wxRichTextAttrArray' filepath='include/wx/richtext/richtextbuffer.h' line='6862' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-728' is-artificial='yes'/>
          <parameter type-id='type-id-570'/>
          <parameter type-id='type-id-729'/>
          <parameter type-id='type-id-730'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='9'>
        <function-decl name='HasVirtualText' mangled-name='_ZNK24wxRichTextDrawingHandler14HasVirtualTextEPK19wxRichTextPlainText' filepath='include/wx/richtext/richtextbuffer.h' line='6869' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-728' is-artificial='yes'/>
          <parameter type-id='type-id-731'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='10'>
        <function-decl name='GetVirtualText' mangled-name='_ZNK24wxRichTextDrawingHandler14GetVirtualTextEPK19wxRichTextPlainTextR8wxString' filepath='include/wx/richtext/richtextbuffer.h' line='6874' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-728' is-artificial='yes'/>
          <parameter type-id='type-id-731'/>
          <parameter type-id='type-id-732'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxRichTextRenderer' size-in-bits='128' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='6957' column='1' id='type-id-733'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-621'/>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRichTextRenderer' mangled-name='_ZN18wxRichTextRendererD0Ev' filepath='include/wx/richtext/richtextbuffer.h' line='6964' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-734' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRichTextRenderer' mangled-name='_ZN18wxRichTextRendererD2Ev' filepath='include/wx/richtext/richtextbuffer.h' line='6964' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-734' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRichTextRenderer' mangled-name='_ZN18wxRichTextRendererD4Ev' filepath='include/wx/richtext/richtextbuffer.h' line='6964' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-734' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='DrawStandardBullet' mangled-name='_ZN18wxRichTextRenderer18DrawStandardBulletEP19wxRichTextParagraphR4wxDCRK14wxRichTextAttrRK6wxRect' filepath='include/wx/richtext/richtextbuffer.h' line='6969' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-734' is-artificial='yes'/>
          <parameter type-id='type-id-735'/>
          <parameter type-id='type-id-508'/>
          <parameter type-id='type-id-540'/>
          <parameter type-id='type-id-628'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='DrawTextBullet' mangled-name='_ZN18wxRichTextRenderer14DrawTextBulletEP19wxRichTextParagraphR4wxDCRK14wxRichTextAttrRK6wxRectRK8wxString' filepath='include/wx/richtext/richtextbuffer.h' line='6974' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-734' is-artificial='yes'/>
          <parameter type-id='type-id-735'/>
          <parameter type-id='type-id-508'/>
          <parameter type-id='type-id-540'/>
          <parameter type-id='type-id-628'/>
          <parameter type-id='type-id-688'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='DrawBitmapBullet' mangled-name='_ZN18wxRichTextRenderer16DrawBitmapBulletEP19wxRichTextParagraphR4wxDCRK14wxRichTextAttrRK6wxRect' filepath='include/wx/richtext/richtextbuffer.h' line='6979' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-734' is-artificial='yes'/>
          <parameter type-id='type-id-735'/>
          <parameter type-id='type-id-508'/>
          <parameter type-id='type-id-540'/>
          <parameter type-id='type-id-628'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='EnumerateStandardBulletNames' mangled-name='_ZN18wxRichTextRenderer28EnumerateStandardBulletNamesER13wxArrayString' filepath='include/wx/richtext/richtextbuffer.h' line='6984' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-734' is-artificial='yes'/>
          <parameter type-id='type-id-736'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='MeasureBullet' mangled-name='_ZN18wxRichTextRenderer13MeasureBulletEP19wxRichTextParagraphR4wxDCRK14wxRichTextAttrR6wxSize' filepath='include/wx/richtext/richtextbuffer.h' line='6989' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-734' is-artificial='yes'/>
          <parameter type-id='type-id-735'/>
          <parameter type-id='type-id-508'/>
          <parameter type-id='type-id-540'/>
          <parameter type-id='type-id-629'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxRichTextStdRenderer' size-in-bits='128' visibility='default' filepath='include/wx/richtext/richtextbuffer.h' line='7003' column='1' id='type-id-737'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-733'/>
      <member-function access='public' static='yes'>
        <function-decl name='SetFontForBullet' mangled-name='_ZN21wxRichTextStdRenderer16SetFontForBulletER16wxRichTextBufferR4wxDCRK14wxRichTextAttr' filepath='src/richtext/richtextbuffer.cpp' line='9278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN21wxRichTextStdRenderer16SetFontForBulletER16wxRichTextBufferR4wxDCRK14wxRichTextAttr@@WXU_3.2'>
          <parameter type-id='type-id-738'/>
          <parameter type-id='type-id-508'/>
          <parameter type-id='type-id-540'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='DrawStandardBullet' mangled-name='_ZN21wxRichTextStdRenderer18DrawStandardBulletEP19wxRichTextParagraphR4wxDCRK14wxRichTextAttrRK6wxRect' filepath='src/richtext/richtextbuffer.cpp' line='9166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN21wxRichTextStdRenderer18DrawStandardBulletEP19wxRichTextParagraphR4wxDCRK14wxRichTextAttrRK6wxRect@@WXU_3.2'>
          <parameter type-id='type-id-739' is-artificial='yes'/>
          <parameter type-id='type-id-735'/>
          <parameter type-id='type-id-508'/>
          <parameter type-id='type-id-540'/>
          <parameter type-id='type-id-628'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='DrawTextBullet' mangled-name='_ZN21wxRichTextStdRenderer14DrawTextBulletEP19wxRichTextParagraphR4wxDCRK14wxRichTextAttrRK6wxRectRK8wxString' filepath='src/richtext/richtextbuffer.cpp' line='9238' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN21wxRichTextStdRenderer14DrawTextBulletEP19wxRichTextParagraphR4wxDCRK14wxRichTextAttrRK6wxRectRK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-739' is-artificial='yes'/>
          <parameter type-id='type-id-735'/>
          <parameter type-id='type-id-508'/>
          <parameter type-id='type-id-540'/>
          <parameter type-id='type-id-628'/>
          <parameter type-id='type-id-688'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='DrawBitmapBullet' mangled-name='_ZN21wxRichTextStdRenderer16DrawBitmapBulletEP19wxRichTextParagraphR4wxDCRK14wxRichTextAttrRK6wxRect' filepath='src/richtext/richtextbuffer.cpp' line='9337' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN21wxRichTextStdRenderer16DrawBitmapBulletEP19wxRichTextParagraphR4wxDCRK14wxRichTextAttrRK6wxRect@@WXU_3.2'>
          <parameter type-id='type-id-739' is-artificial='yes'/>
          <parameter type-id='type-id-735'/>
          <parameter type-id='type-id-508'/>
          <parameter type-id='type-id-540'/>
          <parameter type-id='type-id-628'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='EnumerateStandardBulletNames' mangled-name='_ZN21wxRichTextStdRenderer28EnumerateStandardBulletNamesER13wxArrayString' filepath='src/richtext/richtextbuffer.cpp' line='9384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN21wxRichTextStdRenderer28EnumerateStandardBulletNamesER13wxArrayString@@WXU_3.2'>
          <parameter type-id='type-id-739' is-artificial='yes'/>
          <parameter type-id='type-id-736'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='MeasureBullet' mangled-name='_ZN21wxRichTextStdRenderer13MeasureBulletEP19wxRichTextParagraphR4wxDCRK14wxRichTextAttrR6wxSize' filepath='src/richtext/richtextbuffer.cpp' line='9345' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN21wxRichTextStdRenderer13MeasureBulletEP19wxRichTextParagraphR4wxDCRK14wxRichTextAttrR6wxSize@@WXU_3.2'>
          <parameter type-id='type-id-739' is-artificial='yes'/>
          <parameter type-id='type-id-735'/>
          <parameter type-id='type-id-508'/>
          <parameter type-id='type-id-540'/>
          <parameter type-id='type-id-629'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxRichTextEvent' size-in-bits='1920' visibility='default' filepath='include/wx/richtext/richtextctrl.h' line='2533' column='1' id='type-id-740'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-741'/>
      <data-member access='protected' layout-offset-in-bits='1376'>
        <var-decl name='m_flags' type-id='type-id-19' visibility='default' filepath='include/wx/richtext/richtextctrl.h' line='2653' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='1408'>
        <var-decl name='m_position' type-id='type-id-21' visibility='default' filepath='include/wx/richtext/richtextctrl.h' line='2654' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='1472'>
        <var-decl name='m_oldStyleSheet' type-id='type-id-742' visibility='default' filepath='include/wx/richtext/richtextctrl.h' line='2655' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='1536'>
        <var-decl name='m_newStyleSheet' type-id='type-id-742' visibility='default' filepath='include/wx/richtext/richtextctrl.h' line='2656' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='1600'>
        <var-decl name='m_range' type-id='type-id-248' visibility='default' filepath='include/wx/richtext/richtextctrl.h' line='2657' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='1728'>
        <var-decl name='m_char' type-id='type-id-33' visibility='default' filepath='include/wx/richtext/richtextctrl.h' line='2658' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='1792'>
        <var-decl name='m_container' type-id='type-id-567' visibility='default' filepath='include/wx/richtext/richtextctrl.h' line='2659' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='1856'>
        <var-decl name='m_oldContainer' type-id='type-id-567' visibility='default' filepath='include/wx/richtext/richtextctrl.h' line='2660' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-622' mangled-name='_ZN15wxRichTextEvent12ms_classInfoE' visibility='default' filepath='src/richtext/richtextctrl.cpp' line='156' column='1' elf-symbol-id='_ZN15wxRichTextEvent12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <member-function access='public' static='yes'>
        <function-decl name='wxCreateObject' mangled-name='_ZN15wxRichTextEvent14wxCreateObjectEv' filepath='src/richtext/richtextctrl.cpp' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxRichTextEvent14wxCreateObjectEv@@WXU_3.2'>
          <return type-id='type-id-412'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK15wxRichTextEvent12GetClassInfoEv' filepath='include/wx/richtext/richtextctrl.h' line='2663' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxRichTextEvent12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-743' is-artificial='yes'/>
          <return type-id='type-id-624'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='Clone' mangled-name='_ZNK15wxRichTextEvent5CloneEv' filepath='include/wx/richtext/richtextctrl.h' line='2650' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-743' is-artificial='yes'/>
          <return type-id='type-id-744'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxRichTextObjectPropertiesDialog' size-in-bits='18048' visibility='default' filepath='include/wx/richtext/richtextimagedlg.h' line='46' column='1' id='type-id-745'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-746'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-622' mangled-name='_ZN32wxRichTextObjectPropertiesDialog12ms_classInfoE' visibility='default' filepath='src/richtext/richtextimagedlg.cpp' line='38' column='1' elf-symbol-id='_ZN32wxRichTextObjectPropertiesDialog12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='sm_eventTableEntries' type-id='type-id-747' mangled-name='_ZN32wxRichTextObjectPropertiesDialog20sm_eventTableEntriesE' visibility='default' filepath='src/richtext/richtextimagedlg.cpp' line='45' column='1' elf-symbol-id='_ZN32wxRichTextObjectPropertiesDialog20sm_eventTableEntriesE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' static='yes'>
        <var-decl name='sm_eventTable' type-id='type-id-748' mangled-name='_ZN32wxRichTextObjectPropertiesDialog13sm_eventTableE' visibility='default' filepath='src/richtext/richtextimagedlg.cpp' line='45' column='1' elf-symbol-id='_ZN32wxRichTextObjectPropertiesDialog13sm_eventTableE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' static='yes'>
        <var-decl name='sm_eventHashTable' type-id='type-id-749' mangled-name='_ZN32wxRichTextObjectPropertiesDialog17sm_eventHashTableE' visibility='default' filepath='src/richtext/richtextimagedlg.cpp' line='45' column='1' elf-symbol-id='_ZN32wxRichTextObjectPropertiesDialog17sm_eventHashTableE@@WXU_3.2'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='GetIconResource' mangled-name='_ZN32wxRichTextObjectPropertiesDialog15GetIconResourceERK8wxString' filepath='src/richtext/richtextimagedlg.cpp' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN32wxRichTextObjectPropertiesDialog15GetIconResourceERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-750' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-688' name='name' filepath='src/richtext/richtextimagedlg.cpp' line='143' column='1'/>
          <return type-id='type-id-751'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='GetBitmapResource' mangled-name='_ZN32wxRichTextObjectPropertiesDialog17GetBitmapResourceERK8wxString' filepath='src/richtext/richtextimagedlg.cpp' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN32wxRichTextObjectPropertiesDialog17GetBitmapResourceERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-750' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-688' name='name' filepath='src/richtext/richtextimagedlg.cpp' line='130' column='1'/>
          <return type-id='type-id-117'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='ShowToolTips' mangled-name='_ZN32wxRichTextObjectPropertiesDialog12ShowToolTipsEv' filepath='src/richtext/richtextimagedlg.cpp' line='121' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN32wxRichTextObjectPropertiesDialog12ShowToolTipsEv@@WXU_3.2'>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='CreateControls' mangled-name='_ZN32wxRichTextObjectPropertiesDialog14CreateControlsEv' filepath='src/richtext/richtextimagedlg.cpp' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN32wxRichTextObjectPropertiesDialog14CreateControlsEv@@WXU_3.2'>
          <parameter type-id='type-id-752' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Init' mangled-name='_ZN32wxRichTextObjectPropertiesDialog4InitEv' filepath='src/richtext/richtextimagedlg.cpp' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN32wxRichTextObjectPropertiesDialog4InitEv@@WXU_3.2'>
          <parameter type-id='type-id-752' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Create' mangled-name='_ZN32wxRichTextObjectPropertiesDialog6CreateEP16wxRichTextObjectP8wxWindowiRK8wxStringRK7wxPointRK6wxSizel' filepath='src/richtext/richtextimagedlg.cpp' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN32wxRichTextObjectPropertiesDialog6CreateEP16wxRichTextObjectP8wxWindowiRK8wxStringRK7wxPointRK6wxSizel@@WXU_3.2'>
          <parameter type-id='type-id-750' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-570' name='obj' filepath='src/richtext/richtextimagedlg.cpp' line='73' column='1'/>
          <parameter type-id='type-id-633' name='parent' filepath='src/richtext/richtextimagedlg.cpp' line='73' column='1'/>
          <parameter type-id='type-id-122' name='id' filepath='src/richtext/richtextimagedlg.cpp' line='73' column='1'/>
          <parameter type-id='type-id-688' name='caption' filepath='src/richtext/richtextimagedlg.cpp' line='73' column='1'/>
          <parameter type-id='type-id-631' name='pos' filepath='src/richtext/richtextimagedlg.cpp' line='73' column='1'/>
          <parameter type-id='type-id-507' name='size' filepath='src/richtext/richtextimagedlg.cpp' line='73' column='1'/>
          <parameter type-id='type-id-21' name='style' filepath='src/richtext/richtextimagedlg.cpp' line='73' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxRichTextObjectPropertiesDialog' mangled-name='_ZN32wxRichTextObjectPropertiesDialogC2EP16wxRichTextObjectP8wxWindowiRK8wxStringRK7wxPointRK6wxSizel' filepath='src/richtext/richtextimagedlg.cpp' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN32wxRichTextObjectPropertiesDialogC2EP16wxRichTextObjectP8wxWindowiRK8wxStringRK7wxPointRK6wxSizel@@WXU_3.2'>
          <parameter type-id='type-id-750' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-570' name='obj' filepath='include/wx/richtext/richtextimagedlg.h' line='54' column='1'/>
          <parameter type-id='type-id-633' name='parent' filepath='include/wx/richtext/richtextimagedlg.h' line='54' column='1'/>
          <parameter type-id='type-id-122' name='id' filepath='include/wx/richtext/richtextimagedlg.h' line='54' column='1'/>
          <parameter type-id='type-id-688' name='caption' filepath='include/wx/richtext/richtextimagedlg.h' line='54' column='1'/>
          <parameter type-id='type-id-631' name='pos' filepath='include/wx/richtext/richtextimagedlg.h' line='54' column='1'/>
          <parameter type-id='type-id-507' name='size' filepath='include/wx/richtext/richtextimagedlg.h' line='54' column='1'/>
          <parameter type-id='type-id-21' name='style' filepath='include/wx/richtext/richtextimagedlg.h' line='54' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxRichTextObjectPropertiesDialog' mangled-name='_ZN32wxRichTextObjectPropertiesDialogC2Ev' filepath='src/richtext/richtextimagedlg.cpp' line='57' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN32wxRichTextObjectPropertiesDialogC2Ev@@WXU_3.2'>
          <parameter type-id='type-id-752' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='wxCreateObject' mangled-name='_ZN32wxRichTextObjectPropertiesDialog14wxCreateObjectEv' filepath='src/richtext/richtextimagedlg.cpp' line='38' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN32wxRichTextObjectPropertiesDialog14wxCreateObjectEv@@WXU_3.2'>
          <return type-id='type-id-412'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRichTextObjectPropertiesDialog' mangled-name='_ZN32wxRichTextObjectPropertiesDialogD4Ev' filepath='include/wx/richtext/richtextimagedlg.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-752' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRichTextObjectPropertiesDialog' mangled-name='_ZN32wxRichTextObjectPropertiesDialogD0Ev' filepath='include/wx/richtext/richtextimagedlg.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN32wxRichTextObjectPropertiesDialogD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-752' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRichTextObjectPropertiesDialog' mangled-name='_ZN32wxRichTextObjectPropertiesDialogD1Ev' filepath='include/wx/richtext/richtextimagedlg.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN32wxRichTextObjectPropertiesDialogD1Ev@@WXU_3.2'>
          <parameter type-id='type-id-752' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
