<abi-corpus version='2.0' architecture='elf-amd-x86_64' soname='libwx_baseu_net-3.2.so.0'>
  <elf-needed>
    <dependency name='libcurl.so.4'/>
    <dependency name='libwx_baseu-3.2.so.0'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_ZN10wxProtocol10LogRequestERK8wxString' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN10wxProtocol11LogResponseERK8wxString' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN10wxProtocol17SetDefaultTimeoutEj' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN10wxProtocol6SetLogEP13wxProtocolLog' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN10wxProtocol8ReadLineEP12wxSocketBaseR8wxString' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_ZTV13wxIPV6address' size='104' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV13wxProtocolLog' size='56' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV13wxSockAddress' size='80' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV13wxSocketEvent' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV13wxUNIXaddress' size='80' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV14wxSocketClient' size='112' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV14wxSocketServer' size='96' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV14wxSocketStream' size='328' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV15wxTCPConnection' size='176' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV16wxDatagramSocket' size='96' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV17wxStringTokenizer' size='56' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV17wxWebRequestEvent' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV19wxInternetFSHandler' size='88' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV19wxSocketInputStream' size='168' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV20wxSocketOutputStream' size='160' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV5wxFTP' size='184' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV5wxURL' size='56' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV6wxHTTP' size='176' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV6wxList' size='48' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_SOCKET' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_WEBREQUEST_DATA' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_WEBREQUEST_STATE' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxWebSessionBackendCURL' size='5' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxWebSessionBackendURLSession' size='11' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxWebSessionBackendWinHTTP' size='8' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/common/fs_inet.cpp' language='LANG_C_plus_plus_14'>
    <type-decl name='__float128' size-in-bits='128' id='type-id-1'/>
    <type-decl name='__int128' size-in-bits='128' id='type-id-2'/>
    <type-decl name='bool' size-in-bits='8' id='type-id-3'/>
    <type-decl name='char' size-in-bits='8' id='type-id-4'/>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='128' id='type-id-5'>
      <subrange length='16' type-id='type-id-6' id='type-id-7'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='8' id='type-id-8'>
      <subrange length='1' type-id='type-id-6' id='type-id-9'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='160' id='type-id-10'>
      <subrange length='20' type-id='type-id-6' id='type-id-11'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='32' id='type-id-12'>
      <subrange length='4' type-id='type-id-6' id='type-id-13'/>
    </array-type-def>
    <class-decl name='typedef __va_list_tag __va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-16' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='type-id-17'/>
    <type-decl name='float' size-in-bits='32' id='type-id-18'/>
    <type-decl name='int' size-in-bits='32' id='type-id-19'/>
    <type-decl name='long double' size-in-bits='128' id='type-id-20'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-21'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-22'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-23'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-24'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-25'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-26'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-27'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-15'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-6'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-28'/>
    <type-decl name='variadic parameter type' id='type-id-29'/>
    <type-decl name='void' id='type-id-30'/>
    <type-decl name='wchar_t' size-in-bits='32' id='type-id-31'/>
    <array-type-def dimensions='1' type-id='type-id-31' size-in-bits='128' id='type-id-32'>
      <subrange length='4' type-id='type-id-6' id='type-id-13'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-33' size-in-bits='64' id='type-id-34'>
      <subrange length='2' type-id='type-id-6' id='type-id-35'/>
    </array-type-def>
    <class-decl name='wxAnyStrPtr' size-in-bits='128' visibility='default' filepath='include/wx/anystr.h' line='29' column='1' id='type-id-36'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_str' type-id='type-id-37' visibility='default' filepath='include/wx/anystr.h' line='134' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_iter' type-id='type-id-38' visibility='default' filepath='include/wx/anystr.h' line='135' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxScopedCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='66' column='1' id='type-id-39'>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-4' filepath='include/wx/buffer.h' line='69' column='1' id='type-id-40'/>
      </member-type>
      <member-type access='protected'>
        <class-decl name='Data' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='164' column='1' id='type-id-41'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-42'/>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-43' visibility='default' filepath='include/wx/buffer.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxScopedCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='66' column='1' id='type-id-44'>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-31' filepath='include/wx/buffer.h' line='69' column='1' id='type-id-45'/>
      </member-type>
      <member-type access='protected'>
        <class-decl name='Data' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='164' column='1' id='type-id-46'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-42'/>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-47' visibility='default' filepath='include/wx/buffer.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxScopedCharBuffer' type-id='type-id-39' filepath='include/wx/buffer.h' line='241' column='1' id='type-id-48'/>
    <typedef-decl name='wxScopedWCharBuffer' type-id='type-id-44' filepath='include/wx/buffer.h' line='242' column='1' id='type-id-49'/>
    <class-decl name='wxCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='247' column='1' id='type-id-50'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-39'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-4' filepath='include/wx/buffer.h' line='253' column='1' id='type-id-51'/>
      </member-type>
    </class-decl>
    <class-decl name='wxCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='247' column='1' id='type-id-52'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-44'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-31' filepath='include/wx/buffer.h' line='253' column='1' id='type-id-53'/>
      </member-type>
    </class-decl>
    <class-decl name='wxCharBuffer' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='357' column='1' id='type-id-54'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-50'/>
      <member-type access='public'>
        <typedef-decl name='wxCharTypeBufferBase' type-id='type-id-50' filepath='include/wx/buffer.h' line='360' column='1' id='type-id-55'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='wxScopedCharTypeBufferBase' type-id='type-id-39' filepath='include/wx/buffer.h' line='361' column='1' id='type-id-56'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWCharBuffer' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='374' column='1' id='type-id-57'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-52'/>
      <member-type access='public'>
        <typedef-decl name='wxCharTypeBufferBase' type-id='type-id-52' filepath='include/wx/buffer.h' line='377' column='1' id='type-id-58'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='wxScopedCharTypeBufferBase' type-id='type-id-44' filepath='include/wx/buffer.h' line='378' column='1' id='type-id-59'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWritableCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='393' column='1' id='type-id-60'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-50'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-40' filepath='include/wx/buffer.h' line='396' column='1' id='type-id-61'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWritableCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='393' column='1' id='type-id-62'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-52'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-45' filepath='include/wx/buffer.h' line='396' column='1' id='type-id-63'/>
      </member-type>
    </class-decl>
    <typedef-decl name='wxWritableCharBuffer' type-id='type-id-60' filepath='include/wx/buffer.h' line='410' column='1' id='type-id-64'/>
    <typedef-decl name='wxWritableWCharBuffer' type-id='type-id-62' filepath='include/wx/buffer.h' line='411' column='1' id='type-id-65'/>
    <typedef-decl name='wxChar' type-id='type-id-31' filepath='include/wx/chartype.h' line='123' column='1' id='type-id-33'/>
    <typedef-decl name='wxStringCharType' type-id='type-id-31' filepath='include/wx/chartype.h' line='170' column='1' id='type-id-66'/>
    <class-decl name='wxDateTime' size-in-bits='64' visibility='default' filepath='include/wx/datetime.h' line='128' column='1' id='type-id-67'>
      <member-type access='public'>
        <typedef-decl name='wxDateTime_t' type-id='type-id-28' filepath='include/wx/datetime.h' line='139' column='1' id='type-id-68'/>
      </member-type>
      <member-type access='public'>
        <enum-decl name='TZ' filepath='include/wx/datetime.h' line='145' column='1' id='type-id-69'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Local' value='0'/>
          <enumerator name='GMT_12' value='1'/>
          <enumerator name='GMT_11' value='2'/>
          <enumerator name='GMT_10' value='3'/>
          <enumerator name='GMT_9' value='4'/>
          <enumerator name='GMT_8' value='5'/>
          <enumerator name='GMT_7' value='6'/>
          <enumerator name='GMT_6' value='7'/>
          <enumerator name='GMT_5' value='8'/>
          <enumerator name='GMT_4' value='9'/>
          <enumerator name='GMT_3' value='10'/>
          <enumerator name='GMT_2' value='11'/>
          <enumerator name='GMT_1' value='12'/>
          <enumerator name='GMT0' value='13'/>
          <enumerator name='GMT1' value='14'/>
          <enumerator name='GMT2' value='15'/>
          <enumerator name='GMT3' value='16'/>
          <enumerator name='GMT4' value='17'/>
          <enumerator name='GMT5' value='18'/>
          <enumerator name='GMT6' value='19'/>
          <enumerator name='GMT7' value='20'/>
          <enumerator name='GMT8' value='21'/>
          <enumerator name='GMT9' value='22'/>
          <enumerator name='GMT10' value='23'/>
          <enumerator name='GMT11' value='24'/>
          <enumerator name='GMT12' value='25'/>
          <enumerator name='GMT13' value='26'/>
          <enumerator name='WET' value='13'/>
          <enumerator name='WEST' value='14'/>
          <enumerator name='CET' value='14'/>
          <enumerator name='CEST' value='15'/>
          <enumerator name='EET' value='15'/>
          <enumerator name='EEST' value='16'/>
          <enumerator name='MSK' value='16'/>
          <enumerator name='MSD' value='17'/>
          <enumerator name='AST' value='9'/>
          <enumerator name='ADT' value='10'/>
          <enumerator name='EST' value='8'/>
          <enumerator name='EDT' value='9'/>
          <enumerator name='CST' value='7'/>
          <enumerator name='CDT' value='8'/>
          <enumerator name='MST' value='6'/>
          <enumerator name='MDT' value='7'/>
          <enumerator name='PST' value='5'/>
          <enumerator name='PDT' value='6'/>
          <enumerator name='HST' value='3'/>
          <enumerator name='AKST' value='4'/>
          <enumerator name='AKDT' value='5'/>
          <enumerator name='A_WST' value='21'/>
          <enumerator name='A_CST' value='27'/>
          <enumerator name='A_EST' value='23'/>
          <enumerator name='A_ESST' value='24'/>
          <enumerator name='NZST' value='25'/>
          <enumerator name='NZDT' value='26'/>
          <enumerator name='UTC' value='13'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='Calendar' filepath='include/wx/datetime.h' line='212' column='1' id='type-id-70'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Gregorian' value='0'/>
          <enumerator name='Julian' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='Country' filepath='include/wx/datetime.h' line='226' column='1' id='type-id-71'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Country_Unknown' value='0'/>
          <enumerator name='Country_Default' value='1'/>
          <enumerator name='Country_WesternEurope_Start' value='2'/>
          <enumerator name='Country_EEC' value='2'/>
          <enumerator name='France' value='3'/>
          <enumerator name='Germany' value='4'/>
          <enumerator name='UK' value='5'/>
          <enumerator name='Country_WesternEurope_End' value='5'/>
          <enumerator name='Russia' value='6'/>
          <enumerator name='USA' value='7'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='Month' filepath='include/wx/datetime.h' line='248' column='1' id='type-id-72'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Jan' value='0'/>
          <enumerator name='Feb' value='1'/>
          <enumerator name='Mar' value='2'/>
          <enumerator name='Apr' value='3'/>
          <enumerator name='May' value='4'/>
          <enumerator name='Jun' value='5'/>
          <enumerator name='Jul' value='6'/>
          <enumerator name='Aug' value='7'/>
          <enumerator name='Sep' value='8'/>
          <enumerator name='Oct' value='9'/>
          <enumerator name='Nov' value='10'/>
          <enumerator name='Dec' value='11'/>
          <enumerator name='Inv_Month' value='12'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='WeekDay' filepath='include/wx/datetime.h' line='254' column='1' id='type-id-73'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Sun' value='0'/>
          <enumerator name='Mon' value='1'/>
          <enumerator name='Tue' value='2'/>
          <enumerator name='Wed' value='3'/>
          <enumerator name='Thu' value='4'/>
          <enumerator name='Fri' value='5'/>
          <enumerator name='Sat' value='6'/>
          <enumerator name='Inv_WeekDay' value='7'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='NameFlags' filepath='include/wx/datetime.h' line='266' column='1' id='type-id-74'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Name_Full' value='1'/>
          <enumerator name='Name_Abbr' value='2'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='WeekFlags' filepath='include/wx/datetime.h' line='273' column='1' id='type-id-75'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Default_First' value='0'/>
          <enumerator name='Monday_First' value='1'/>
          <enumerator name='Sunday_First' value='2'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='TimeZone' size-in-bits='64' visibility='default' filepath='include/wx/datetime.h' line='294' column='1' id='type-id-76'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_offset' type-id='type-id-21' visibility='default' filepath='include/wx/datetime.h' line='315' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='Tm' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/wx/datetime.h' line='325' column='1' id='type-id-77'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='msec' type-id='type-id-68' visibility='default' filepath='include/wx/datetime.h' line='327' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='16'>
            <var-decl name='sec' type-id='type-id-68' visibility='default' filepath='include/wx/datetime.h' line='327' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <var-decl name='min' type-id='type-id-68' visibility='default' filepath='include/wx/datetime.h' line='327' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='48'>
            <var-decl name='hour' type-id='type-id-68' visibility='default' filepath='include/wx/datetime.h' line='327' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='mday' type-id='type-id-68' visibility='default' filepath='include/wx/datetime.h' line='328' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='80'>
            <var-decl name='yday' type-id='type-id-68' visibility='default' filepath='include/wx/datetime.h' line='329' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='96'>
            <var-decl name='mon' type-id='type-id-72' visibility='default' filepath='include/wx/datetime.h' line='330' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='year' type-id='type-id-19' visibility='default' filepath='include/wx/datetime.h' line='331' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='192'>
            <var-decl name='m_tz' type-id='type-id-76' visibility='default' filepath='include/wx/datetime.h' line='362' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='256'>
            <var-decl name='wday' type-id='type-id-68' visibility='default' filepath='include/wx/datetime.h' line='367' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_time' type-id='type-id-78' visibility='default' filepath='include/wx/datetime.h' line='1160' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxTimeSpan' size-in-bits='64' visibility='default' filepath='include/wx/datetime.h' line='1169' column='1' id='type-id-79'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_diff' type-id='type-id-78' visibility='default' filepath='include/wx/datetime.h' line='1357' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxDateSpan' size-in-bits='128' visibility='default' filepath='include/wx/datetime.h' line='1395' column='1' id='type-id-80'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_years' type-id='type-id-19' visibility='default' filepath='include/wx/datetime.h' line='1518' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='m_months' type-id='type-id-19' visibility='default' filepath='include/wx/datetime.h' line='1519' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_weeks' type-id='type-id-19' visibility='default' filepath='include/wx/datetime.h' line='1520' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='m_days' type-id='type-id-19' visibility='default' filepath='include/wx/datetime.h' line='1521' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxObjectEventFunctor' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='258' column='1' id='type-id-81'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-82'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-83' visibility='default' filepath='include/wx/event.h' line='288' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxObjectEventFunctorclEP12wxEvtHandlerR7wxEvent' filepath='include/wx/event.h' line='4105' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-84' is-artificial='yes'/>
          <parameter type-id='type-id-83'/>
          <parameter type-id='type-id-85'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxObjectEventFunctor10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-86' is-artificial='yes'/>
          <parameter type-id='type-id-87'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxObjectEventFunctor13GetEvtHandlerEv' filepath='include/wx/event.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-86' is-artificial='yes'/>
          <return type-id='type-id-83'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxObjectEventFunctor12GetEvtMethodEv' filepath='include/wx/event.h' line='284' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-86' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxFile' size-in-bits='64' visibility='default' filepath='include/wx/file.h' line='30' column='1' id='type-id-88'>
      <member-type access='public'>
        <enum-decl name='OpenMode' filepath='include/wx/file.h' line='39' column='1' id='type-id-89'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='read' value='0'/>
          <enumerator name='write' value='1'/>
          <enumerator name='read_write' value='2'/>
          <enumerator name='write_append' value='3'/>
          <enumerator name='write_excl' value='4'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_fd' type-id='type-id-19' visibility='default' filepath='include/wx/file.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='m_lasterror' type-id='type-id-19' visibility='default' filepath='include/wx/file.h' line='132' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxSeekMode' filepath='include/wx/filefn.h' line='55' column='1' id='type-id-90'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxFromStart' value='0'/>
      <enumerator name='wxFromCurrent' value='1'/>
      <enumerator name='wxFromEnd' value='2'/>
    </enum-decl>
    <enum-decl name='wxFileKind' filepath='include/wx/filefn.h' line='62' column='1' id='type-id-91'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxFILE_KIND_UNKNOWN' value='0'/>
      <enumerator name='wxFILE_KIND_DISK' value='1'/>
      <enumerator name='wxFILE_KIND_TERMINAL' value='2'/>
      <enumerator name='wxFILE_KIND_PIPE' value='3'/>
    </enum-decl>
    <typedef-decl name='wxFileOffset' type-id='type-id-92' filepath='include/wx/filefn.h' line='343' column='1' id='type-id-93'/>
    <class-decl name='wxInternetFSHandler' size-in-bits='128' visibility='default' filepath='include/wx/fs_inet.h' line='22' column='1' id='type-id-94'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-95'/>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='CanOpen' mangled-name='_ZN19wxInternetFSHandler7CanOpenERK8wxString' filepath='src/common/fs_inet.cpp' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxInternetFSHandler7CanOpenERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-96' is-artificial='yes'/>
          <parameter type-id='type-id-97'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='OpenFile' mangled-name='_ZN19wxInternetFSHandler8OpenFileER12wxFileSystemRK8wxString' filepath='src/common/fs_inet.cpp' line='92' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN19wxInternetFSHandler8OpenFileER12wxFileSystemRK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-96' is-artificial='yes'/>
          <parameter type-id='type-id-98'/>
          <parameter type-id='type-id-97'/>
          <return type-id='type-id-99'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='wxLongLong' type-id='type-id-100' filepath='include/wx/longlong.h' line='90' column='1' id='type-id-78'/>
    <class-decl name='wxLongLongNative' size-in-bits='64' visibility='default' filepath='include/wx/longlong.h' line='106' column='1' id='type-id-100'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_ll' type-id='type-id-22' visibility='default' filepath='include/wx/longlong.h' line='343' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxULongLongNative' size-in-bits='64' visibility='default' filepath='include/wx/longlong.h' line='347' column='1' id='type-id-101'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_ll' type-id='type-id-23' visibility='default' filepath='include/wx/longlong.h' line='562' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRefCounter' size-in-bits='128' visibility='default' filepath='include/wx/object.h' line='228' column='1' id='type-id-102'>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_count' type-id='type-id-19' visibility='default' filepath='include/wx/object.h' line='245' column='1'/>
      </data-member>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRefCounter' mangled-name='_ZN12wxRefCounterD4Ev' filepath='include/wx/object.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='wxObjectRefData' type-id='type-id-102' filepath='include/wx/object.h' line='258' column='1' id='type-id-104'/>
    <typedef-decl name='wxObjectConstructorFn' type-id='type-id-105' filepath='include/wx/rtti.h' line='39' column='1' id='type-id-106'/>
    <class-decl name='wxClassInfo' size-in-bits='384' visibility='default' filepath='include/wx/rtti.h' line='41' column='1' id='type-id-107'>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-108'>
          <member-type access='private'>
            <typedef-decl name='Node' type-id='type-id-110' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-109'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-108' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-111'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-113' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-112'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-114' visibility='default' filepath='include/wx/rtti.h' line='106' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_table' type-id='type-id-115' visibility='default' filepath='include/wx/rtti.h' line='106' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_className' type-id='type-id-116' visibility='default' filepath='include/wx/rtti.h' line='109' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_objectSize' type-id='type-id-19' visibility='default' filepath='include/wx/rtti.h' line='110' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_objectConstructor' type-id='type-id-106' visibility='default' filepath='include/wx/rtti.h' line='111' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_baseInfo1' type-id='type-id-113' visibility='default' filepath='include/wx/rtti.h' line='115' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_baseInfo2' type-id='type-id-113' visibility='default' filepath='include/wx/rtti.h' line='116' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='sm_first' type-id='type-id-117' mangled-name='_ZN11wxClassInfo8sm_firstE' visibility='default' filepath='include/wx/rtti.h' line='121' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='m_next' type-id='type-id-117' visibility='default' filepath='include/wx/rtti.h' line='122' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxCStrData' size-in-bits='192' visibility='default' filepath='include/wx/string.h' line='152' column='1' id='type-id-118'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_str' type-id='type-id-119' visibility='default' filepath='include/wx/string.h' line='245' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_offset' type-id='type-id-120' visibility='default' filepath='include/wx/string.h' line='252' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_owned' type-id='type-id-3' visibility='default' filepath='include/wx/string.h' line='254' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxString' size-in-bits='384' visibility='default' filepath='include/wx/string.h' line='301' column='1' id='type-id-121'>
      <member-type access='private'>
        <class-decl name='SubstrBufFromType&lt;wchar_t const*&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='337' column='1' id='type-id-122'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='data' type-id='type-id-123' visibility='default' filepath='include/wx/string.h' line='339' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='len' type-id='type-id-120' visibility='default' filepath='include/wx/string.h' line='340' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='SubstrBufFromType&lt;wxScopedCharTypeBuffer&lt;wchar_t&gt; &gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='337' column='1' id='type-id-124'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='data' type-id='type-id-44' visibility='default' filepath='include/wx/string.h' line='339' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='len' type-id='type-id-120' visibility='default' filepath='include/wx/string.h' line='340' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='SubstrBufFromWC' type-id='type-id-122' filepath='include/wx/string.h' line='354' column='1' id='type-id-125'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='SubstrBufFromMB' type-id='type-id-124' filepath='include/wx/string.h' line='355' column='1' id='type-id-126'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-120' filepath='include/wx/string.h' line='752' column='1' id='type-id-127'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-129' filepath='include/wx/string.h' line='753' column='1' id='type-id-128'/>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='963' column='1' id='type-id-130'>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-132' filepath='include/wx/string.h' line='965' column='1' id='type-id-131'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-134' filepath='include/wx/string.h' line='965' column='1' id='type-id-133'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='underlying_iterator' type-id='type-id-136' filepath='include/wx/string.h' line='965' column='1' id='type-id-135'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-135' visibility='default' filepath='include/wx/string.h' line='965' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='994' column='1' id='type-id-137'>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-132' filepath='include/wx/string.h' line='998' column='1' id='type-id-138'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-140' filepath='include/wx/string.h' line='998' column='1' id='type-id-139'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='underlying_iterator' type-id='type-id-142' filepath='include/wx/string.h' line='998' column='1' id='type-id-141'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-141' visibility='default' filepath='include/wx/string.h' line='998' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator_impl&lt;wxString::const_iterator&gt;' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='1060' column='1' id='type-id-143'>
          <member-type access='public'>
            <typedef-decl name='iterator_type' type-id='type-id-137' filepath='include/wx/string.h' line='1063' column='1' id='type-id-144'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-138' filepath='include/wx/string.h' line='1067' column='1' id='type-id-145'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-139' filepath='include/wx/string.h' line='1068' column='1' id='type-id-146'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-144' visibility='default' filepath='include/wx/string.h' line='1115' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator_impl&lt;wxString::iterator&gt;' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='1060' column='1' id='type-id-147'>
          <member-type access='public'>
            <typedef-decl name='iterator_type' type-id='type-id-130' filepath='include/wx/string.h' line='1063' column='1' id='type-id-148'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-131' filepath='include/wx/string.h' line='1067' column='1' id='type-id-149'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-133' filepath='include/wx/string.h' line='1068' column='1' id='type-id-150'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-148' visibility='default' filepath='include/wx/string.h' line='1115' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reverse_iterator' type-id='type-id-147' filepath='include/wx/string.h' line='1118' column='1' id='type-id-151'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reverse_iterator' type-id='type-id-143' filepath='include/wx/string.h' line='1119' column='1' id='type-id-152'/>
      </member-type>
      <member-type access='public'>
        <enum-decl name='caseCompare' filepath='include/wx/string.h' line='2386' column='1' id='type-id-153'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='exact' value='0'/>
          <enumerator name='ignoreCase' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='stripType' filepath='include/wx/string.h' line='2388' column='1' id='type-id-154'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='leading' value='1'/>
          <enumerator name='trailing' value='2'/>
          <enumerator name='both' value='3'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='ConvertedBuffer&lt;char&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='3599' column='1' id='type-id-155'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_str' type-id='type-id-156' visibility='default' filepath='include/wx/string.h' line='3625' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_len' type-id='type-id-120' visibility='default' filepath='include/wx/string.h' line='3626' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' static='yes'>
        <var-decl name='npos' type-id='type-id-157' mangled-name='_ZN8wxString4nposE' visibility='default' filepath='include/wx/string.h' line='308' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_impl' type-id='type-id-158' visibility='default' filepath='include/wx/string.h' line='3589' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_convertedToChar' type-id='type-id-155' visibility='default' filepath='include/wx/string.h' line='3677' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxStdWideString' type-id='type-id-159' filepath='include/wx/stringimpl.h' line='70' column='1' id='type-id-160'/>
    <typedef-decl name='wxStdString' type-id='type-id-160' filepath='include/wx/stringimpl.h' line='76' column='1' id='type-id-161'/>
    <typedef-decl name='wxStringImpl' type-id='type-id-161' filepath='include/wx/stringimpl.h' line='90' column='1' id='type-id-158'/>
    <class-decl name='wxStringOperationsWchar' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/stringops.h' line='27' column='1' id='type-id-162'>
      <member-type access='public'>
        <class-decl name='SingleCharBuffer' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/stringops.h' line='64' column='1' id='type-id-163'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='data' type-id='type-id-34' visibility='default' filepath='include/wx/stringops.h' line='66' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
    </class-decl>
    <class-decl name='wxFormatString' size-in-bits='320' visibility='default' filepath='include/wx/strvararg.h' line='137' column='1' id='type-id-164'>
      <member-type access='public'>
        <enum-decl name='ArgumentType' filepath='include/wx/strvararg.h' line='161' column='1' id='type-id-165'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Arg_Unused' value='0'/>
          <enumerator name='Arg_Char' value='1'/>
          <enumerator name='Arg_Pointer' value='2'/>
          <enumerator name='Arg_String' value='6'/>
          <enumerator name='Arg_Int' value='9'/>
          <enumerator name='Arg_LongInt' value='16'/>
          <enumerator name='Arg_LongLongInt' value='16'/>
          <enumerator name='Arg_Double' value='64'/>
          <enumerator name='Arg_LongDouble' value='128'/>
          <enumerator name='Arg_Size_t' value='16'/>
          <enumerator name='Arg_IntPtr' value='512'/>
          <enumerator name='Arg_ShortIntPtr' value='1024'/>
          <enumerator name='Arg_LongIntPtr' value='2048'/>
          <enumerator name='Arg_Unknown' value='32768'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_convertedWChar' type-id='type-id-49' visibility='default' filepath='include/wx/strvararg.h' line='232' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_char' type-id='type-id-48' visibility='default' filepath='include/wx/strvararg.h' line='236' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_wchar' type-id='type-id-49' visibility='default' filepath='include/wx/strvararg.h' line='237' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_str' type-id='type-id-37' visibility='default' filepath='include/wx/strvararg.h' line='242' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_cstr' type-id='type-id-166' visibility='default' filepath='include/wx/strvararg.h' line='243' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxMutexError' filepath='include/wx/thread.h' line='28' column='1' id='type-id-167'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxMUTEX_NO_ERROR' value='0'/>
      <enumerator name='wxMUTEX_INVALID' value='1'/>
      <enumerator name='wxMUTEX_DEAD_LOCK' value='2'/>
      <enumerator name='wxMUTEX_BUSY' value='3'/>
      <enumerator name='wxMUTEX_UNLOCKED' value='4'/>
      <enumerator name='wxMUTEX_TIMEOUT' value='5'/>
      <enumerator name='wxMUTEX_MISC_ERROR' value='6'/>
    </enum-decl>
    <enum-decl name='wxThreadError' filepath='include/wx/thread.h' line='57' column='1' id='type-id-168'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxTHREAD_NO_ERROR' value='0'/>
      <enumerator name='wxTHREAD_NO_RESOURCE' value='1'/>
      <enumerator name='wxTHREAD_RUNNING' value='2'/>
      <enumerator name='wxTHREAD_NOT_RUNNING' value='3'/>
      <enumerator name='wxTHREAD_KILLED' value='4'/>
      <enumerator name='wxTHREAD_MISC_ERROR' value='5'/>
    </enum-decl>
    <enum-decl name='wxThreadKind' filepath='include/wx/thread.h' line='67' column='1' id='type-id-169'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxTHREAD_DETACHED' value='0'/>
      <enumerator name='wxTHREAD_JOINABLE' value='1'/>
    </enum-decl>
    <enum-decl name='wxMutexType' filepath='include/wx/thread.h' line='112' column='1' id='type-id-170'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxMUTEX_DEFAULT' value='0'/>
      <enumerator name='wxMUTEX_RECURSIVE' value='1'/>
    </enum-decl>
    <class-decl name='wxMutex' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='137' column='1' id='type-id-171'>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_internal' type-id='type-id-172' visibility='default' filepath='include/wx/thread.h' line='174' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxCriticalSectionType' filepath='include/wx/thread.h' line='231' column='1' id='type-id-173'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxCRITSEC_DEFAULT' value='0'/>
      <enumerator name='wxCRITSEC_NON_RECURSIVE' value='1'/>
    </enum-decl>
    <class-decl name='wxCriticalSection' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='242' column='1' id='type-id-174'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_mutex' type-id='type-id-171' visibility='default' filepath='include/wx/thread.h' line='259' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='Leave' mangled-name='_ZN17wxCriticalSection5LeaveEv' filepath='include/wx/thread.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxCriticalSection5LeaveEv@@WXU_3.2'>
          <parameter type-id='type-id-175' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Enter' mangled-name='_ZN17wxCriticalSection5EnterEv' filepath='include/wx/thread.h' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxCriticalSection5EnterEv@@WXU_3.2'>
          <parameter type-id='type-id-175' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxCriticalSectionLocker' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='301' column='1' id='type-id-176'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_critsect' type-id='type-id-177' visibility='default' filepath='include/wx/thread.h' line='316' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxThreadHelperThread' size-in-bits='320' visibility='default' filepath='include/wx/thread.h' line='658' column='1' id='type-id-178'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-179'/>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_owner' type-id='type-id-180' visibility='default' filepath='include/wx/thread.h' line='673' column='1'/>
      </data-member>
      <member-function access='protected' vtable-offset='3'>
        <function-decl name='Entry' mangled-name='_ZN20wxThreadHelperThread5EntryEv' filepath='include/wx/thread.h' line='761' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-181' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxThreadHelper' size-in-bits='256' visibility='default' filepath='include/wx/thread.h' line='686' column='1' id='type-id-182'>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_thread' type-id='type-id-183' visibility='default' filepath='include/wx/thread.h' line='748' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_kind' type-id='type-id-169' visibility='default' filepath='include/wx/thread.h' line='749' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_critSection' type-id='type-id-174' visibility='default' filepath='include/wx/thread.h' line='750' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThreadHelper' mangled-name='_ZN14wxThreadHelperD4Ev' filepath='include/wx/thread.h' line='714' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-184' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='Entry' mangled-name='_ZN14wxThreadHelper5EntryEv' filepath='include/wx/thread.h' line='735' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-184' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxTypeIdentifier' size-in-bits='64' visibility='default' filepath='include/wx/typeinfo.h' line='63' column='1' id='type-id-185'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_className' type-id='type-id-186' visibility='default' filepath='include/wx/typeinfo.h' line='81' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxUint16' type-id='type-id-28' filepath='include/wx/types.h' line='57' column='1' id='type-id-187'/>
    <typedef-decl name='wxInt32' type-id='type-id-19' filepath='include/wx/types.h' line='145' column='1' id='type-id-188'/>
    <typedef-decl name='wxUint32' type-id='type-id-15' filepath='include/wx/types.h' line='146' column='1' id='type-id-189'/>
    <class-decl name='wxUniChar' size-in-bits='32' visibility='default' filepath='include/wx/unichar.h' line='29' column='1' id='type-id-140'>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-189' filepath='include/wx/unichar.h' line='35' column='1' id='type-id-190'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_value' type-id='type-id-190' visibility='default' filepath='include/wx/unichar.h' line='212' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxUniCharRef' size-in-bits='64' visibility='default' filepath='include/wx/unichar.h' line='220' column='1' id='type-id-134'>
      <member-type access='private'>
        <typedef-decl name='iterator' type-id='type-id-136' filepath='include/wx/unichar.h' line='223' column='1' id='type-id-191'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_pos' type-id='type-id-191' visibility='default' filepath='include/wx/unichar.h' line='325' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxURLError' filepath='include/wx/url.h' line='25' column='1' id='type-id-192'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxURL_NOERR' value='0'/>
      <enumerator name='wxURL_SNTXERR' value='1'/>
      <enumerator name='wxURL_NOPROTO' value='2'/>
      <enumerator name='wxURL_NOHOST' value='3'/>
      <enumerator name='wxURL_NOPATH' value='4'/>
      <enumerator name='wxURL_CONNERR' value='5'/>
      <enumerator name='wxURL_PROTOERR' value='6'/>
    </enum-decl>
    <class-decl name='wxURL' size-in-bits='3648' visibility='default' filepath='include/wx/url.h' line='46' column='1' id='type-id-193'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-194'/>
      <data-member access='protected' static='yes'>
        <var-decl name='ms_protocols' type-id='type-id-195' mangled-name='_ZN5wxURL12ms_protocolsE' visibility='default' filepath='src/common/url.cpp' line='32' column='1' elf-symbol-id='_ZN5wxURL12ms_protocolsE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' static='yes'>
        <var-decl name='ms_proxyDefault' type-id='type-id-196' mangled-name='_ZN5wxURL15ms_proxyDefaultE' visibility='default' filepath='src/common/url.cpp' line='40' column='1' elf-symbol-id='_ZN5wxURL15ms_proxyDefaultE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' static='yes'>
        <var-decl name='ms_useDefaultProxy' type-id='type-id-3' mangled-name='_ZN5wxURL18ms_useDefaultProxyE' visibility='default' filepath='src/common/url.cpp' line='41' column='1' elf-symbol-id='_ZN5wxURL18ms_useDefaultProxyE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2944'>
        <var-decl name='m_proxy' type-id='type-id-196' visibility='default' filepath='include/wx/url.h' line='81' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='3008'>
        <var-decl name='m_useProxy' type-id='type-id-3' visibility='default' filepath='include/wx/url.h' line='82' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='3072'>
        <var-decl name='m_protoinfo' type-id='type-id-195' visibility='default' filepath='include/wx/url.h' line='94' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='3136'>
        <var-decl name='m_protocol' type-id='type-id-197' visibility='default' filepath='include/wx/url.h' line='95' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='3200'>
        <var-decl name='m_error' type-id='type-id-192' visibility='default' filepath='include/wx/url.h' line='97' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='3264'>
        <var-decl name='m_url' type-id='type-id-121' visibility='default' filepath='include/wx/url.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-107' mangled-name='_ZN5wxURL12ms_classInfoE' visibility='default' filepath='src/common/url.cpp' line='29' column='1' elf-symbol-id='_ZN5wxURL12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='SetProxy' mangled-name='_ZN5wxURL8SetProxyERK8wxString' filepath='src/common/url.cpp' line='392' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5wxURL8SetProxyERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-198' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-97' name='sUrl' filepath='include/wx/url.h' line='49' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='SetDefaultProxy' mangled-name='_ZN5wxURL15SetDefaultProxyERK8wxString' filepath='src/common/url.cpp' line='357' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5wxURL15SetDefaultProxyERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-97'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='GetInputStream' mangled-name='_ZN5wxURL14GetInputStreamEv' filepath='src/common/url.cpp' line='265' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5wxURL14GetInputStreamEv@@WXU_3.2'>
          <parameter type-id='type-id-198' name='this' is-artificial='yes'/>
          <return type-id='type-id-199'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='FetchProtocol' mangled-name='_ZN5wxURL13FetchProtocolEv' filepath='src/common/url.cpp' line='242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5wxURL13FetchProtocolEv@@WXU_3.2'>
          <parameter type-id='type-id-198' name='this' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='Free' mangled-name='_ZN5wxURL4FreeEv' filepath='src/common/url.cpp' line='221' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5wxURL4FreeEv@@WXU_3.2'>
          <parameter type-id='type-id-200' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='CleanData' mangled-name='_ZN5wxURL9CleanDataEv' filepath='src/common/url.cpp' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5wxURL9CleanDataEv@@WXU_3.2'>
          <parameter type-id='type-id-200' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='ParseURL' mangled-name='_ZN5wxURL8ParseURLEv' filepath='src/common/url.cpp' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5wxURL8ParseURLEv@@WXU_3.2'>
          <parameter type-id='type-id-198' name='this' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='operator=' mangled-name='_ZN5wxURLaSERKS_' filepath='src/common/url.cpp' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5wxURLaSERKS_@@WXU_3.2'>
          <parameter type-id='type-id-198' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-201' name='url' filepath='src/common/url.cpp' line='130' column='1'/>
          <return type-id='type-id-202'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='operator=' mangled-name='_ZN5wxURLaSERK5wxURI' filepath='src/common/url.cpp' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5wxURLaSERK5wxURI@@WXU_3.2'>
          <parameter type-id='type-id-198' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-203' name='uri' filepath='src/common/url.cpp' line='117' column='1'/>
          <return type-id='type-id-202'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='operator=' mangled-name='_ZN5wxURLaSERK8wxString' filepath='src/common/url.cpp' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5wxURLaSERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-198' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-97' name='url' filepath='src/common/url.cpp' line='107' column='1'/>
          <return type-id='type-id-202'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='Init' mangled-name='_ZN5wxURL4InitERK8wxString' filepath='src/common/url.cpp' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5wxURL4InitERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-198' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-97' name='sUrl' filepath='include/wx/url.h' line='49' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxURL' mangled-name='_ZN5wxURLC2ERKS_' filepath='src/common/url.cpp' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5wxURLC2ERKS_@@WXU_3.2'>
          <parameter type-id='type-id-198' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-201' name='url' filepath='src/common/url.cpp' line='70' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxURL' mangled-name='_ZN5wxURLC2ERK5wxURI' filepath='src/common/url.cpp' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5wxURLC2ERK5wxURI@@WXU_3.2'>
          <parameter type-id='type-id-198' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-203' name='uri' filepath='src/common/url.cpp' line='64' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxURL' mangled-name='_ZN5wxURLC2ERK8wxString' filepath='src/common/url.cpp' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5wxURLC2ERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-198' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-97' name='sUrl' filepath='include/wx/url.h' line='49' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxURL' mangled-name='_ZN5wxURLD4Ev' filepath='include/wx/url.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-200' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxURL' mangled-name='_ZN5wxURLD0Ev' filepath='include/wx/url.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5wxURLD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-200' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxURL' mangled-name='_ZN5wxURLD1Ev' filepath='include/wx/url.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5wxURLD1Ev@@WXU_3.2'>
          <parameter type-id='type-id-200' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxURL' mangled-name='_ZN5wxURLD2Ev' filepath='include/wx/url.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN5wxURLD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-200' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK5wxURL12GetClassInfoEv' filepath='src/common/url.cpp' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK5wxURL12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-204' is-artificial='yes'/>
          <return type-id='type-id-117'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxVector&lt;wxClassInfo*&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-205'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-120' filepath='include/wx/vector.h' line='179' column='1' id='type-id-206'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-117' filepath='include/wx/vector.h' line='181' column='1' id='type-id-207'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-209' filepath='include/wx/vector.h' line='184' column='1' id='type-id-208'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-211' filepath='include/wx/vector.h' line='185' column='1' id='type-id-210'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-212'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-213'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_INITIAL_SIZE' type-id='type-id-214' mangled-name='_ZN8wxVectorIP11wxClassInfoE18ALLOC_INITIAL_SIZEE' visibility='default' filepath='include/wx/vector.h' line='592' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-206' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-206' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-209' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVector&lt;wxString&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-215'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-120' filepath='include/wx/vector.h' line='179' column='1' id='type-id-216'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-121' filepath='include/wx/vector.h' line='181' column='1' id='type-id-217'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-219' filepath='include/wx/vector.h' line='184' column='1' id='type-id-218'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-221' filepath='include/wx/vector.h' line='185' column='1' id='type-id-220'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-222'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-223'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_INITIAL_SIZE' type-id='type-id-224' mangled-name='_ZN8wxVectorI8wxStringE18ALLOC_INITIAL_SIZEE' visibility='default' filepath='include/wx/vector.h' line='592' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-216' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-216' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-219' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxTemporaryFileInputStream' size-in-bits='960' visibility='default' filepath='src/common/fs_inet.cpp' line='33' column='1' id='type-id-225'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-226'/>
      <data-member access='protected' layout-offset-in-bits='576'>
        <var-decl name='m_filename' type-id='type-id-121' visibility='default' filepath='src/common/fs_inet.cpp' line='52' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxTemporaryFileInputStream' mangled-name='_ZN26wxTemporaryFileInputStreamD0Ev' filepath='src/common/fs_inet.cpp' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-227' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxTemporaryFileInputStream' mangled-name='_ZN26wxTemporaryFileInputStreamD2Ev' filepath='src/common/fs_inet.cpp' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-227' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxTemporaryFileInputStream' mangled-name='_ZN26wxTemporaryFileInputStreamD4Ev' filepath='src/common/fs_inet.cpp' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-227' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxFileSystemInternetModule' size-in-bits='640' visibility='default' filepath='src/common/fs_inet.cpp' line='139' column='1' id='type-id-228'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-229'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-107' mangled-name='_ZN26wxFileSystemInternetModule12ms_classInfoE' visibility='default' filepath='src/common/fs_inet.cpp' line='166' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='m_handler' type-id='type-id-230' visibility='default' filepath='src/common/fs_inet.cpp' line='163' column='1'/>
      </data-member>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK26wxFileSystemInternetModule12GetClassInfoEv' filepath='src/common/fs_inet.cpp' line='166' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-231' is-artificial='yes'/>
          <return type-id='type-id-117'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='OnInit' mangled-name='_ZN26wxFileSystemInternetModule6OnInitEv' filepath='src/common/fs_inet.cpp' line='150' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-232' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='OnExit' mangled-name='_ZN26wxFileSystemInternetModule6OnExitEv' filepath='src/common/fs_inet.cpp' line='157' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-232' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='lconv' size-in-bits='768' is-struct='yes' visibility='default' filepath='/usr/include/locale.h' line='51' column='1' id='type-id-233'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='decimal_point' type-id='type-id-156' visibility='default' filepath='/usr/include/locale.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thousands_sep' type-id='type-id-156' visibility='default' filepath='/usr/include/locale.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='grouping' type-id='type-id-156' visibility='default' filepath='/usr/include/locale.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='int_curr_symbol' type-id='type-id-156' visibility='default' filepath='/usr/include/locale.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='currency_symbol' type-id='type-id-156' visibility='default' filepath='/usr/include/locale.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mon_decimal_point' type-id='type-id-156' visibility='default' filepath='/usr/include/locale.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mon_thousands_sep' type-id='type-id-156' visibility='default' filepath='/usr/include/locale.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mon_grouping' type-id='type-id-156' visibility='default' filepath='/usr/include/locale.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='positive_sign' type-id='type-id-156' visibility='default' filepath='/usr/include/locale.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='negative_sign' type-id='type-id-156' visibility='default' filepath='/usr/include/locale.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='int_frac_digits' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <var-decl name='frac_digits' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='p_cs_precedes' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='664'>
        <var-decl name='p_sep_by_space' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='n_cs_precedes' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='680'>
        <var-decl name='n_sep_by_space' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='688'>
        <var-decl name='p_sign_posn' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='696'>
        <var-decl name='n_sign_posn' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='int_p_cs_precedes' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='712'>
        <var-decl name='int_p_sep_by_space' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='720'>
        <var-decl name='int_n_cs_precedes' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='728'>
        <var-decl name='int_n_sep_by_space' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='int_p_sign_posn' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='744'>
        <var-decl name='int_n_sign_posn' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='fpos_t' type-id='type-id-234' filepath='/usr/include/stdio.h' line='86' column='1' id='type-id-235'/>
    <class-decl name='div_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-236' visibility='default' filepath='/usr/include/stdlib.h' line='60' column='1' id='type-id-237'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-19' visibility='default' filepath='/usr/include/stdlib.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rem' type-id='type-id-19' visibility='default' filepath='/usr/include/stdlib.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='div_t' type-id='type-id-237' filepath='/usr/include/stdlib.h' line='63' column='1' id='type-id-236'/>
    <class-decl name='ldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-238' visibility='default' filepath='/usr/include/stdlib.h' line='68' column='1' id='type-id-239'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-21' visibility='default' filepath='/usr/include/stdlib.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-21' visibility='default' filepath='/usr/include/stdlib.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ldiv_t' type-id='type-id-239' filepath='/usr/include/stdlib.h' line='71' column='1' id='type-id-238'/>
    <class-decl name='lldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-240' visibility='default' filepath='/usr/include/stdlib.h' line='78' column='1' id='type-id-241'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-22' visibility='default' filepath='/usr/include/stdlib.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-22' visibility='default' filepath='/usr/include/stdlib.h' line='80' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='lldiv_t' type-id='type-id-241' filepath='/usr/include/stdlib.h' line='81' column='1' id='type-id-240'/>
    <typedef-decl name='__compar_fn_t' type-id='type-id-242' filepath='/usr/include/stdlib.h' line='816' column='1' id='type-id-243'/>
    <typedef-decl name='__off_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-244'/>
    <typedef-decl name='__off64_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1' id='type-id-245'/>
    <typedef-decl name='__time_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='160' column='1' id='type-id-246'/>
    <typedef-decl name='__ssize_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='194' column='1' id='type-id-247'/>
    <typedef-decl name='FILE' type-id='type-id-248' filepath='/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-249'/>
    <typedef-decl name='__FILE' type-id='type-id-248' filepath='/usr/include/x86_64-linux-gnu/bits/types/__FILE.h' line='5' column='1' id='type-id-250'/>
    <class-decl name='_G_fpos64_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='10' column='1' id='type-id-251'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__pos' type-id='type-id-245' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__state' type-id='type-id-252' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='13' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__fpos64_t' type-id='type-id-251' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='14' column='1' id='type-id-234'/>
    <class-decl name='__mbstate_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-252' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='14' column='1' id='type-id-253'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='17' column='1' id='type-id-254'>
          <data-member access='public'>
            <var-decl name='__wch' type-id='type-id-15' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='18' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='__wchb' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='19' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='type-id-254' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='20' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__mbstate_t' type-id='type-id-253' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='21' column='1' id='type-id-252'/>
    <typedef-decl name='mbstate_t' type-id='type-id-252' filepath='/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h' line='6' column='1' id='type-id-255'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-30' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='43' column='1' id='type-id-256'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='49' column='1' id='type-id-248'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-156' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-156' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-156' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-156' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-156' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-156' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-156' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-156' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-156' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-156' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-156' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-257' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-258' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-244' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-28' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-25' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-8' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-259' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-245' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-260' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-261' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-258' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-16' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-120' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-10' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='7' column='1' id='type-id-262'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-186' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='time_t' type-id='type-id-246' filepath='/usr/include/x86_64-linux-gnu/bits/types/time_t.h' line='10' column='1' id='type-id-263'/>
    <typedef-decl name='wint_t' type-id='type-id-15' filepath='/usr/include/x86_64-linux-gnu/bits/types/wint_t.h' line='20' column='1' id='type-id-264'/>
    <typedef-decl name='off_t' type-id='type-id-245' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='87' column='1' id='type-id-92'/>
    <typedef-decl name='ssize_t' type-id='type-id-247' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='108' column='1' id='type-id-265'/>
    <typedef-decl name='ptrdiff_t' type-id='type-id-21' filepath='/usr/lib/gcc/x86_64-linux-gnu/11/include/stddef.h' line='143' column='1' id='type-id-132'/>
    <typedef-decl name='size_t' type-id='type-id-6' filepath='/usr/lib/gcc/x86_64-linux-gnu/11/include/stddef.h' line='209' column='1' id='type-id-120'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-266'/>
    <pointer-type-def type-id='type-id-248' size-in-bits='64' id='type-id-258'/>
    <pointer-type-def type-id='type-id-267' size-in-bits='64' id='type-id-260'/>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-259'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-257'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' id='type-id-261'/>
    <pointer-type-def type-id='type-id-250' size-in-bits='64' id='type-id-270'/>
    <reference-type-def kind='lvalue' type-id='type-id-271' size-in-bits='64' id='type-id-272'/>
    <reference-type-def kind='lvalue' type-id='type-id-273' size-in-bits='64' id='type-id-274'/>
    <reference-type-def kind='lvalue' type-id='type-id-275' size-in-bits='64' id='type-id-276'/>
    <pointer-type-def type-id='type-id-275' size-in-bits='64' id='type-id-277'/>
    <reference-type-def kind='lvalue' type-id='type-id-278' size-in-bits='64' id='type-id-279'/>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-280'/>
    <reference-type-def kind='lvalue' type-id='type-id-281' size-in-bits='64' id='type-id-282'/>
    <pointer-type-def type-id='type-id-281' size-in-bits='64' id='type-id-283'/>
    <qualified-type-def type-id='type-id-283' const='yes' id='type-id-284'/>
    <reference-type-def kind='lvalue' type-id='type-id-285' size-in-bits='64' id='type-id-286'/>
    <pointer-type-def type-id='type-id-285' size-in-bits='64' id='type-id-287'/>
    <reference-type-def kind='lvalue' type-id='type-id-288' size-in-bits='64' id='type-id-289'/>
    <pointer-type-def type-id='type-id-288' size-in-bits='64' id='type-id-290'/>
    <pointer-type-def type-id='type-id-291' size-in-bits='64' id='type-id-292'/>
    <pointer-type-def type-id='type-id-293' size-in-bits='64' id='type-id-294'/>
    <qualified-type-def type-id='type-id-294' const='yes' id='type-id-295'/>
    <reference-type-def kind='lvalue' type-id='type-id-4' size-in-bits='64' id='type-id-296'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-156'/>
    <qualified-type-def type-id='type-id-156' const='yes' id='type-id-297'/>
    <reference-type-def kind='lvalue' type-id='type-id-297' size-in-bits='64' id='type-id-298'/>
    <pointer-type-def type-id='type-id-156' size-in-bits='64' id='type-id-299'/>
    <qualified-type-def type-id='type-id-271' const='yes' id='type-id-300'/>
    <reference-type-def kind='lvalue' type-id='type-id-300' size-in-bits='64' id='type-id-301'/>
    <qualified-type-def type-id='type-id-273' const='yes' id='type-id-302'/>
    <reference-type-def kind='lvalue' type-id='type-id-302' size-in-bits='64' id='type-id-303'/>
    <qualified-type-def type-id='type-id-275' const='yes' id='type-id-304'/>
    <pointer-type-def type-id='type-id-304' size-in-bits='64' id='type-id-305'/>
    <qualified-type-def type-id='type-id-278' const='yes' id='type-id-306'/>
    <pointer-type-def type-id='type-id-306' size-in-bits='64' id='type-id-307'/>
    <qualified-type-def type-id='type-id-281' const='yes' id='type-id-308'/>
    <pointer-type-def type-id='type-id-308' size-in-bits='64' id='type-id-309'/>
    <qualified-type-def type-id='type-id-309' const='yes' id='type-id-310'/>
    <qualified-type-def type-id='type-id-285' const='yes' id='type-id-311'/>
    <pointer-type-def type-id='type-id-311' size-in-bits='64' id='type-id-312'/>
    <qualified-type-def type-id='type-id-288' const='yes' id='type-id-313'/>
    <reference-type-def kind='lvalue' type-id='type-id-313' size-in-bits='64' id='type-id-314'/>
    <pointer-type-def type-id='type-id-313' size-in-bits='64' id='type-id-315'/>
    <qualified-type-def type-id='type-id-316' const='yes' id='type-id-317'/>
    <reference-type-def kind='lvalue' type-id='type-id-317' size-in-bits='64' id='type-id-318'/>
    <qualified-type-def type-id='type-id-291' const='yes' id='type-id-319'/>
    <reference-type-def kind='lvalue' type-id='type-id-319' size-in-bits='64' id='type-id-320'/>
    <pointer-type-def type-id='type-id-319' size-in-bits='64' id='type-id-321'/>
    <qualified-type-def type-id='type-id-293' const='yes' id='type-id-322'/>
    <reference-type-def kind='lvalue' type-id='type-id-322' size-in-bits='64' id='type-id-323'/>
    <pointer-type-def type-id='type-id-322' size-in-bits='64' id='type-id-324'/>
    <qualified-type-def type-id='type-id-4' const='yes' id='type-id-325'/>
    <reference-type-def kind='lvalue' type-id='type-id-325' size-in-bits='64' id='type-id-326'/>
    <pointer-type-def type-id='type-id-325' size-in-bits='64' id='type-id-186'/>
    <qualified-type-def type-id='type-id-186' const='yes' id='type-id-327'/>
    <reference-type-def kind='lvalue' type-id='type-id-327' size-in-bits='64' id='type-id-328'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-329'/>
    <qualified-type-def type-id='type-id-235' const='yes' id='type-id-330'/>
    <pointer-type-def type-id='type-id-330' size-in-bits='64' id='type-id-331'/>
    <qualified-type-def type-id='type-id-19' const='yes' id='type-id-332'/>
    <qualified-type-def type-id='type-id-255' const='yes' id='type-id-333'/>
    <pointer-type-def type-id='type-id-333' size-in-bits='64' id='type-id-334'/>
    <qualified-type-def type-id='type-id-120' const='yes' id='type-id-157'/>
    <qualified-type-def type-id='type-id-335' const='yes' id='type-id-336'/>
    <reference-type-def kind='lvalue' type-id='type-id-336' size-in-bits='64' id='type-id-337'/>
    <pointer-type-def type-id='type-id-336' size-in-bits='64' id='type-id-338'/>
    <qualified-type-def type-id='type-id-339' const='yes' id='type-id-340'/>
    <reference-type-def kind='lvalue' type-id='type-id-340' size-in-bits='64' id='type-id-341'/>
    <qualified-type-def type-id='type-id-342' const='yes' id='type-id-343'/>
    <reference-type-def kind='lvalue' type-id='type-id-343' size-in-bits='64' id='type-id-344'/>
    <pointer-type-def type-id='type-id-343' size-in-bits='64' id='type-id-345'/>
    <qualified-type-def type-id='type-id-345' const='yes' id='type-id-346'/>
    <qualified-type-def type-id='type-id-347' const='yes' id='type-id-348'/>
    <reference-type-def kind='lvalue' type-id='type-id-348' size-in-bits='64' id='type-id-349'/>
    <qualified-type-def type-id='type-id-142' const='yes' id='type-id-350'/>
    <reference-type-def kind='lvalue' type-id='type-id-350' size-in-bits='64' id='type-id-351'/>
    <qualified-type-def type-id='type-id-352' const='yes' id='type-id-353'/>
    <qualified-type-def type-id='type-id-354' const='yes' id='type-id-355'/>
    <reference-type-def kind='lvalue' type-id='type-id-355' size-in-bits='64' id='type-id-356'/>
    <pointer-type-def type-id='type-id-355' size-in-bits='64' id='type-id-357'/>
    <qualified-type-def type-id='type-id-358' const='yes' id='type-id-359'/>
    <reference-type-def kind='lvalue' type-id='type-id-359' size-in-bits='64' id='type-id-360'/>
    <qualified-type-def type-id='type-id-361' const='yes' id='type-id-362'/>
    <reference-type-def kind='lvalue' type-id='type-id-362' size-in-bits='64' id='type-id-363'/>
    <qualified-type-def type-id='type-id-364' const='yes' id='type-id-365'/>
    <reference-type-def kind='lvalue' type-id='type-id-365' size-in-bits='64' id='type-id-366'/>
    <qualified-type-def type-id='type-id-367' const='yes' id='type-id-368'/>
    <reference-type-def kind='lvalue' type-id='type-id-368' size-in-bits='64' id='type-id-369'/>
    <qualified-type-def type-id='type-id-370' const='yes' id='type-id-371'/>
    <reference-type-def kind='lvalue' type-id='type-id-371' size-in-bits='64' id='type-id-372'/>
    <pointer-type-def type-id='type-id-371' size-in-bits='64' id='type-id-373'/>
    <qualified-type-def type-id='type-id-374' const='yes' id='type-id-375'/>
    <reference-type-def kind='lvalue' type-id='type-id-375' size-in-bits='64' id='type-id-376'/>
    <pointer-type-def type-id='type-id-375' size-in-bits='64' id='type-id-377'/>
    <qualified-type-def type-id='type-id-378' const='yes' id='type-id-379'/>
    <reference-type-def kind='lvalue' type-id='type-id-379' size-in-bits='64' id='type-id-380'/>
    <pointer-type-def type-id='type-id-379' size-in-bits='64' id='type-id-381'/>
    <qualified-type-def type-id='type-id-382' const='yes' id='type-id-383'/>
    <reference-type-def kind='lvalue' type-id='type-id-383' size-in-bits='64' id='type-id-384'/>
    <pointer-type-def type-id='type-id-383' size-in-bits='64' id='type-id-385'/>
    <qualified-type-def type-id='type-id-386' const='yes' id='type-id-387'/>
    <reference-type-def kind='lvalue' type-id='type-id-387' size-in-bits='64' id='type-id-388'/>
    <pointer-type-def type-id='type-id-387' size-in-bits='64' id='type-id-389'/>
    <qualified-type-def type-id='type-id-390' const='yes' id='type-id-391'/>
    <reference-type-def kind='lvalue' type-id='type-id-391' size-in-bits='64' id='type-id-392'/>
    <qualified-type-def type-id='type-id-393' const='yes' id='type-id-394'/>
    <pointer-type-def type-id='type-id-394' size-in-bits='64' id='type-id-395'/>
    <qualified-type-def type-id='type-id-396' const='yes' id='type-id-397'/>
    <pointer-type-def type-id='type-id-397' size-in-bits='64' id='type-id-398'/>
    <qualified-type-def type-id='type-id-399' const='yes' id='type-id-400'/>
    <reference-type-def kind='lvalue' type-id='type-id-400' size-in-bits='64' id='type-id-401'/>
    <qualified-type-def type-id='type-id-402' const='yes' id='type-id-403'/>
    <pointer-type-def type-id='type-id-403' size-in-bits='64' id='type-id-404'/>
    <qualified-type-def type-id='type-id-404' const='yes' id='type-id-405'/>
    <qualified-type-def type-id='type-id-262' const='yes' id='type-id-406'/>
    <reference-type-def kind='lvalue' type-id='type-id-406' size-in-bits='64' id='type-id-407'/>
    <pointer-type-def type-id='type-id-406' size-in-bits='64' id='type-id-408'/>
    <qualified-type-def type-id='type-id-27' const='yes' id='type-id-409'/>
    <pointer-type-def type-id='type-id-409' size-in-bits='64' id='type-id-410'/>
    <qualified-type-def type-id='type-id-31' const='yes' id='type-id-411'/>
    <reference-type-def kind='lvalue' type-id='type-id-411' size-in-bits='64' id='type-id-412'/>
    <pointer-type-def type-id='type-id-411' size-in-bits='64' id='type-id-123'/>
    <qualified-type-def type-id='type-id-123' const='yes' id='type-id-413'/>
    <reference-type-def kind='lvalue' type-id='type-id-413' size-in-bits='64' id='type-id-414'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-415'/>
    <qualified-type-def type-id='type-id-36' const='yes' id='type-id-416'/>
    <reference-type-def kind='lvalue' type-id='type-id-416' size-in-bits='64' id='type-id-417'/>
    <pointer-type-def type-id='type-id-416' size-in-bits='64' id='type-id-418'/>
    <qualified-type-def type-id='type-id-118' const='yes' id='type-id-419'/>
    <reference-type-def kind='lvalue' type-id='type-id-419' size-in-bits='64' id='type-id-420'/>
    <pointer-type-def type-id='type-id-419' size-in-bits='64' id='type-id-421'/>
    <qualified-type-def type-id='type-id-421' const='yes' id='type-id-166'/>
    <qualified-type-def type-id='type-id-33' const='yes' id='type-id-422'/>
    <pointer-type-def type-id='type-id-422' size-in-bits='64' id='type-id-116'/>
    <qualified-type-def type-id='type-id-54' const='yes' id='type-id-423'/>
    <qualified-type-def type-id='type-id-55' const='yes' id='type-id-424'/>
    <reference-type-def kind='lvalue' type-id='type-id-424' size-in-bits='64' id='type-id-425'/>
    <qualified-type-def type-id='type-id-56' const='yes' id='type-id-426'/>
    <reference-type-def kind='lvalue' type-id='type-id-426' size-in-bits='64' id='type-id-427'/>
    <qualified-type-def type-id='type-id-50' const='yes' id='type-id-428'/>
    <reference-type-def kind='lvalue' type-id='type-id-428' size-in-bits='64' id='type-id-429'/>
    <qualified-type-def type-id='type-id-51' const='yes' id='type-id-430'/>
    <pointer-type-def type-id='type-id-430' size-in-bits='64' id='type-id-431'/>
    <qualified-type-def type-id='type-id-52' const='yes' id='type-id-432'/>
    <reference-type-def kind='lvalue' type-id='type-id-432' size-in-bits='64' id='type-id-433'/>
    <qualified-type-def type-id='type-id-53' const='yes' id='type-id-434'/>
    <pointer-type-def type-id='type-id-434' size-in-bits='64' id='type-id-435'/>
    <qualified-type-def type-id='type-id-107' const='yes' id='type-id-436'/>
    <reference-type-def kind='lvalue' type-id='type-id-436' size-in-bits='64' id='type-id-437'/>
    <pointer-type-def type-id='type-id-436' size-in-bits='64' id='type-id-113'/>
    <qualified-type-def type-id='type-id-108' const='yes' id='type-id-438'/>
    <pointer-type-def type-id='type-id-438' size-in-bits='64' id='type-id-439'/>
    <qualified-type-def type-id='type-id-111' const='yes' id='type-id-440'/>
    <reference-type-def kind='lvalue' type-id='type-id-440' size-in-bits='64' id='type-id-441'/>
    <qualified-type-def type-id='type-id-174' const='yes' id='type-id-442'/>
    <reference-type-def kind='lvalue' type-id='type-id-442' size-in-bits='64' id='type-id-443'/>
    <qualified-type-def type-id='type-id-176' const='yes' id='type-id-444'/>
    <reference-type-def kind='lvalue' type-id='type-id-444' size-in-bits='64' id='type-id-445'/>
    <qualified-type-def type-id='type-id-80' const='yes' id='type-id-446'/>
    <reference-type-def kind='lvalue' type-id='type-id-446' size-in-bits='64' id='type-id-447'/>
    <pointer-type-def type-id='type-id-446' size-in-bits='64' id='type-id-448'/>
    <qualified-type-def type-id='type-id-67' const='yes' id='type-id-449'/>
    <reference-type-def kind='lvalue' type-id='type-id-449' size-in-bits='64' id='type-id-450'/>
    <pointer-type-def type-id='type-id-449' size-in-bits='64' id='type-id-451'/>
    <qualified-type-def type-id='type-id-76' const='yes' id='type-id-452'/>
    <reference-type-def kind='lvalue' type-id='type-id-452' size-in-bits='64' id='type-id-453'/>
    <pointer-type-def type-id='type-id-452' size-in-bits='64' id='type-id-454'/>
    <qualified-type-def type-id='type-id-77' const='yes' id='type-id-455'/>
    <reference-type-def kind='lvalue' type-id='type-id-455' size-in-bits='64' id='type-id-456'/>
    <pointer-type-def type-id='type-id-455' size-in-bits='64' id='type-id-457'/>
    <qualified-type-def type-id='type-id-82' const='yes' id='type-id-458'/>
    <reference-type-def kind='lvalue' type-id='type-id-458' size-in-bits='64' id='type-id-87'/>
    <qualified-type-def type-id='type-id-459' const='yes' id='type-id-460'/>
    <pointer-type-def type-id='type-id-460' size-in-bits='64' id='type-id-461'/>
    <qualified-type-def type-id='type-id-88' const='yes' id='type-id-462'/>
    <reference-type-def kind='lvalue' type-id='type-id-462' size-in-bits='64' id='type-id-463'/>
    <pointer-type-def type-id='type-id-462' size-in-bits='64' id='type-id-464'/>
    <qualified-type-def type-id='type-id-464' const='yes' id='type-id-465'/>
    <qualified-type-def type-id='type-id-226' const='yes' id='type-id-466'/>
    <pointer-type-def type-id='type-id-466' size-in-bits='64' id='type-id-467'/>
    <qualified-type-def type-id='type-id-95' const='yes' id='type-id-468'/>
    <pointer-type-def type-id='type-id-468' size-in-bits='64' id='type-id-469'/>
    <qualified-type-def type-id='type-id-228' const='yes' id='type-id-470'/>
    <pointer-type-def type-id='type-id-470' size-in-bits='64' id='type-id-231'/>
    <qualified-type-def type-id='type-id-164' const='yes' id='type-id-471'/>
    <reference-type-def kind='lvalue' type-id='type-id-471' size-in-bits='64' id='type-id-472'/>
    <pointer-type-def type-id='type-id-471' size-in-bits='64' id='type-id-473'/>
    <qualified-type-def type-id='type-id-474' const='yes' id='type-id-475'/>
    <pointer-type-def type-id='type-id-475' size-in-bits='64' id='type-id-476'/>
    <qualified-type-def type-id='type-id-78' const='yes' id='type-id-477'/>
    <reference-type-def kind='lvalue' type-id='type-id-477' size-in-bits='64' id='type-id-478'/>
    <qualified-type-def type-id='type-id-100' const='yes' id='type-id-479'/>
    <reference-type-def kind='lvalue' type-id='type-id-479' size-in-bits='64' id='type-id-480'/>
    <pointer-type-def type-id='type-id-479' size-in-bits='64' id='type-id-481'/>
    <qualified-type-def type-id='type-id-482' const='yes' id='type-id-483'/>
    <reference-type-def kind='lvalue' type-id='type-id-483' size-in-bits='64' id='type-id-484'/>
    <qualified-type-def type-id='type-id-229' const='yes' id='type-id-485'/>
    <pointer-type-def type-id='type-id-485' size-in-bits='64' id='type-id-486'/>
    <qualified-type-def type-id='type-id-171' const='yes' id='type-id-487'/>
    <reference-type-def kind='lvalue' type-id='type-id-487' size-in-bits='64' id='type-id-488'/>
    <pointer-type-def type-id='type-id-487' size-in-bits='64' id='type-id-489'/>
    <qualified-type-def type-id='type-id-490' const='yes' id='type-id-491'/>
    <pointer-type-def type-id='type-id-491' size-in-bits='64' id='type-id-492'/>
    <qualified-type-def type-id='type-id-81' const='yes' id='type-id-493'/>
    <pointer-type-def type-id='type-id-493' size-in-bits='64' id='type-id-86'/>
    <qualified-type-def type-id='type-id-104' const='yes' id='type-id-494'/>
    <pointer-type-def type-id='type-id-494' size-in-bits='64' id='type-id-495'/>
    <qualified-type-def type-id='type-id-102' const='yes' id='type-id-496'/>
    <reference-type-def kind='lvalue' type-id='type-id-496' size-in-bits='64' id='type-id-497'/>
    <pointer-type-def type-id='type-id-496' size-in-bits='64' id='type-id-498'/>
    <qualified-type-def type-id='type-id-48' const='yes' id='type-id-499'/>
    <reference-type-def kind='lvalue' type-id='type-id-499' size-in-bits='64' id='type-id-500'/>
    <qualified-type-def type-id='type-id-39' const='yes' id='type-id-501'/>
    <reference-type-def kind='lvalue' type-id='type-id-501' size-in-bits='64' id='type-id-502'/>
    <pointer-type-def type-id='type-id-501' size-in-bits='64' id='type-id-503'/>
    <qualified-type-def type-id='type-id-40' const='yes' id='type-id-504'/>
    <pointer-type-def type-id='type-id-504' size-in-bits='64' id='type-id-505'/>
    <qualified-type-def type-id='type-id-41' const='yes' id='type-id-506'/>
    <pointer-type-def type-id='type-id-506' size-in-bits='64' id='type-id-507'/>
    <qualified-type-def type-id='type-id-44' const='yes' id='type-id-508'/>
    <reference-type-def kind='lvalue' type-id='type-id-508' size-in-bits='64' id='type-id-509'/>
    <pointer-type-def type-id='type-id-508' size-in-bits='64' id='type-id-510'/>
    <qualified-type-def type-id='type-id-510' const='yes' id='type-id-511'/>
    <qualified-type-def type-id='type-id-45' const='yes' id='type-id-512'/>
    <pointer-type-def type-id='type-id-512' size-in-bits='64' id='type-id-513'/>
    <qualified-type-def type-id='type-id-46' const='yes' id='type-id-514'/>
    <pointer-type-def type-id='type-id-514' size-in-bits='64' id='type-id-515'/>
    <qualified-type-def type-id='type-id-515' const='yes' id='type-id-516'/>
    <qualified-type-def type-id='type-id-49' const='yes' id='type-id-517'/>
    <reference-type-def kind='lvalue' type-id='type-id-517' size-in-bits='64' id='type-id-518'/>
    <qualified-type-def type-id='type-id-160' const='yes' id='type-id-519'/>
    <reference-type-def kind='lvalue' type-id='type-id-519' size-in-bits='64' id='type-id-520'/>
    <qualified-type-def type-id='type-id-121' const='yes' id='type-id-521'/>
    <reference-type-def kind='lvalue' type-id='type-id-521' size-in-bits='64' id='type-id-97'/>
    <pointer-type-def type-id='type-id-521' size-in-bits='64' id='type-id-119'/>
    <qualified-type-def type-id='type-id-119' const='yes' id='type-id-37'/>
    <qualified-type-def type-id='type-id-155' const='yes' id='type-id-522'/>
    <pointer-type-def type-id='type-id-522' size-in-bits='64' id='type-id-523'/>
    <qualified-type-def type-id='type-id-125' const='yes' id='type-id-524'/>
    <qualified-type-def type-id='type-id-137' const='yes' id='type-id-38'/>
    <reference-type-def kind='lvalue' type-id='type-id-38' size-in-bits='64' id='type-id-525'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-526'/>
    <qualified-type-def type-id='type-id-130' const='yes' id='type-id-527'/>
    <reference-type-def kind='lvalue' type-id='type-id-527' size-in-bits='64' id='type-id-528'/>
    <pointer-type-def type-id='type-id-527' size-in-bits='64' id='type-id-529'/>
    <qualified-type-def type-id='type-id-143' const='yes' id='type-id-530'/>
    <reference-type-def kind='lvalue' type-id='type-id-530' size-in-bits='64' id='type-id-531'/>
    <pointer-type-def type-id='type-id-530' size-in-bits='64' id='type-id-532'/>
    <qualified-type-def type-id='type-id-147' const='yes' id='type-id-533'/>
    <reference-type-def kind='lvalue' type-id='type-id-533' size-in-bits='64' id='type-id-534'/>
    <pointer-type-def type-id='type-id-533' size-in-bits='64' id='type-id-535'/>
    <qualified-type-def type-id='type-id-66' const='yes' id='type-id-536'/>
    <pointer-type-def type-id='type-id-536' size-in-bits='64' id='type-id-537'/>
    <qualified-type-def type-id='type-id-158' const='yes' id='type-id-538'/>
    <reference-type-def kind='lvalue' type-id='type-id-538' size-in-bits='64' id='type-id-539'/>
    <qualified-type-def type-id='type-id-163' const='yes' id='type-id-540'/>
    <pointer-type-def type-id='type-id-540' size-in-bits='64' id='type-id-541'/>
    <qualified-type-def type-id='type-id-182' const='yes' id='type-id-542'/>
    <pointer-type-def type-id='type-id-542' size-in-bits='64' id='type-id-543'/>
    <qualified-type-def type-id='type-id-178' const='yes' id='type-id-544'/>
    <reference-type-def kind='lvalue' type-id='type-id-544' size-in-bits='64' id='type-id-545'/>
    <qualified-type-def type-id='type-id-79' const='yes' id='type-id-546'/>
    <reference-type-def kind='lvalue' type-id='type-id-546' size-in-bits='64' id='type-id-547'/>
    <pointer-type-def type-id='type-id-546' size-in-bits='64' id='type-id-548'/>
    <qualified-type-def type-id='type-id-185' const='yes' id='type-id-549'/>
    <reference-type-def kind='lvalue' type-id='type-id-549' size-in-bits='64' id='type-id-550'/>
    <pointer-type-def type-id='type-id-549' size-in-bits='64' id='type-id-551'/>
    <qualified-type-def type-id='type-id-551' const='yes' id='type-id-552'/>
    <qualified-type-def type-id='type-id-101' const='yes' id='type-id-553'/>
    <reference-type-def kind='lvalue' type-id='type-id-553' size-in-bits='64' id='type-id-554'/>
    <pointer-type-def type-id='type-id-553' size-in-bits='64' id='type-id-555'/>
    <qualified-type-def type-id='type-id-193' const='yes' id='type-id-556'/>
    <pointer-type-def type-id='type-id-556' size-in-bits='64' id='type-id-204'/>
    <qualified-type-def type-id='type-id-204' const='yes' id='type-id-557'/>
    <qualified-type-def type-id='type-id-140' const='yes' id='type-id-129'/>
    <reference-type-def kind='lvalue' type-id='type-id-129' size-in-bits='64' id='type-id-558'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-559'/>
    <qualified-type-def type-id='type-id-559' const='yes' id='type-id-560'/>
    <qualified-type-def type-id='type-id-134' const='yes' id='type-id-561'/>
    <reference-type-def kind='lvalue' type-id='type-id-561' size-in-bits='64' id='type-id-562'/>
    <pointer-type-def type-id='type-id-561' size-in-bits='64' id='type-id-563'/>
    <qualified-type-def type-id='type-id-205' const='yes' id='type-id-564'/>
    <reference-type-def kind='lvalue' type-id='type-id-564' size-in-bits='64' id='type-id-565'/>
    <pointer-type-def type-id='type-id-564' size-in-bits='64' id='type-id-566'/>
    <qualified-type-def type-id='type-id-206' const='yes' id='type-id-214'/>
    <qualified-type-def type-id='type-id-207' const='yes' id='type-id-567'/>
    <reference-type-def kind='lvalue' type-id='type-id-567' size-in-bits='64' id='type-id-568'/>
    <pointer-type-def type-id='type-id-567' size-in-bits='64' id='type-id-211'/>
    <qualified-type-def type-id='type-id-215' const='yes' id='type-id-569'/>
    <reference-type-def kind='lvalue' type-id='type-id-569' size-in-bits='64' id='type-id-570'/>
    <pointer-type-def type-id='type-id-569' size-in-bits='64' id='type-id-571'/>
    <qualified-type-def type-id='type-id-216' const='yes' id='type-id-224'/>
    <qualified-type-def type-id='type-id-217' const='yes' id='type-id-572'/>
    <reference-type-def kind='lvalue' type-id='type-id-572' size-in-bits='64' id='type-id-573'/>
    <pointer-type-def type-id='type-id-572' size-in-bits='64' id='type-id-221'/>
    <qualified-type-def type-id='type-id-58' const='yes' id='type-id-574'/>
    <reference-type-def kind='lvalue' type-id='type-id-574' size-in-bits='64' id='type-id-575'/>
    <qualified-type-def type-id='type-id-59' const='yes' id='type-id-576'/>
    <reference-type-def kind='lvalue' type-id='type-id-576' size-in-bits='64' id='type-id-577'/>
    <qualified-type-def type-id='type-id-61' const='yes' id='type-id-578'/>
    <pointer-type-def type-id='type-id-578' size-in-bits='64' id='type-id-579'/>
    <qualified-type-def type-id='type-id-63' const='yes' id='type-id-580'/>
    <pointer-type-def type-id='type-id-580' size-in-bits='64' id='type-id-581'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-582'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-583'/>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-584'/>
    <pointer-type-def type-id='type-id-585' size-in-bits='64' id='type-id-242'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-586'/>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' id='type-id-587'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-588'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-589'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-590'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-591'/>
    <pointer-type-def type-id='type-id-255' size-in-bits='64' id='type-id-592'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-593'/>
    <reference-type-def kind='lvalue' type-id='type-id-335' size-in-bits='64' id='type-id-594'/>
    <reference-type-def kind='rvalue' type-id='type-id-335' size-in-bits='64' id='type-id-595'/>
    <pointer-type-def type-id='type-id-335' size-in-bits='64' id='type-id-596'/>
    <pointer-type-def type-id='type-id-597' size-in-bits='64' id='type-id-598'/>
    <pointer-type-def type-id='type-id-599' size-in-bits='64' id='type-id-600'/>
    <reference-type-def kind='lvalue' type-id='type-id-339' size-in-bits='64' id='type-id-601'/>
    <reference-type-def kind='lvalue' type-id='type-id-602' size-in-bits='64' id='type-id-603'/>
    <reference-type-def kind='lvalue' type-id='type-id-342' size-in-bits='64' id='type-id-604'/>
    <reference-type-def kind='rvalue' type-id='type-id-342' size-in-bits='64' id='type-id-605'/>
    <pointer-type-def type-id='type-id-342' size-in-bits='64' id='type-id-606'/>
    <qualified-type-def type-id='type-id-606' const='yes' id='type-id-607'/>
    <pointer-type-def type-id='type-id-608' size-in-bits='64' id='type-id-609'/>
    <qualified-type-def type-id='type-id-609' const='yes' id='type-id-610'/>
    <pointer-type-def type-id='type-id-611' size-in-bits='64' id='type-id-612'/>
    <reference-type-def kind='lvalue' type-id='type-id-347' size-in-bits='64' id='type-id-613'/>
    <reference-type-def kind='lvalue' type-id='type-id-352' size-in-bits='64' id='type-id-614'/>
    <reference-type-def kind='lvalue' type-id='type-id-354' size-in-bits='64' id='type-id-615'/>
    <reference-type-def kind='rvalue' type-id='type-id-354' size-in-bits='64' id='type-id-616'/>
    <pointer-type-def type-id='type-id-354' size-in-bits='64' id='type-id-617'/>
    <reference-type-def kind='lvalue' type-id='type-id-358' size-in-bits='64' id='type-id-618'/>
    <reference-type-def kind='rvalue' type-id='type-id-358' size-in-bits='64' id='type-id-619'/>
    <pointer-type-def type-id='type-id-358' size-in-bits='64' id='type-id-620'/>
    <reference-type-def kind='lvalue' type-id='type-id-361' size-in-bits='64' id='type-id-621'/>
    <reference-type-def kind='rvalue' type-id='type-id-361' size-in-bits='64' id='type-id-622'/>
    <pointer-type-def type-id='type-id-361' size-in-bits='64' id='type-id-623'/>
    <qualified-type-def type-id='type-id-623' const='yes' id='type-id-624'/>
    <reference-type-def kind='lvalue' type-id='type-id-364' size-in-bits='64' id='type-id-625'/>
    <reference-type-def kind='lvalue' type-id='type-id-367' size-in-bits='64' id='type-id-626'/>
    <reference-type-def kind='lvalue' type-id='type-id-370' size-in-bits='64' id='type-id-627'/>
    <pointer-type-def type-id='type-id-370' size-in-bits='64' id='type-id-628'/>
    <reference-type-def kind='lvalue' type-id='type-id-378' size-in-bits='64' id='type-id-629'/>
    <pointer-type-def type-id='type-id-378' size-in-bits='64' id='type-id-630'/>
    <reference-type-def kind='lvalue' type-id='type-id-386' size-in-bits='64' id='type-id-631'/>
    <pointer-type-def type-id='type-id-386' size-in-bits='64' id='type-id-632'/>
    <pointer-type-def type-id='type-id-393' size-in-bits='64' id='type-id-633'/>
    <pointer-type-def type-id='type-id-396' size-in-bits='64' id='type-id-634'/>
    <reference-type-def kind='rvalue' type-id='type-id-635' size-in-bits='64' id='type-id-636'/>
    <pointer-type-def type-id='type-id-262' size-in-bits='64' id='type-id-637'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-638'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-639'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-640'/>
    <pointer-type-def type-id='type-id-641' size-in-bits='64' id='type-id-642'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-16'/>
    <reference-type-def kind='lvalue' type-id='type-id-31' size-in-bits='64' id='type-id-643'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-644'/>
    <qualified-type-def type-id='type-id-644' const='yes' id='type-id-645'/>
    <reference-type-def kind='lvalue' type-id='type-id-645' size-in-bits='64' id='type-id-646'/>
    <pointer-type-def type-id='type-id-644' size-in-bits='64' id='type-id-647'/>
    <reference-type-def kind='lvalue' type-id='type-id-36' size-in-bits='64' id='type-id-648'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-649'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-650'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-651'/>
    <reference-type-def kind='lvalue' type-id='type-id-50' size-in-bits='64' id='type-id-652'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-653'/>
    <reference-type-def kind='lvalue' type-id='type-id-52' size-in-bits='64' id='type-id-654'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-655'/>
    <reference-type-def kind='lvalue' type-id='type-id-107' size-in-bits='64' id='type-id-656'/>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-117'/>
    <qualified-type-def type-id='type-id-117' const='yes' id='type-id-657'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-658'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-659'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-114'/>
    <reference-type-def kind='lvalue' type-id='type-id-111' size-in-bits='64' id='type-id-660'/>
    <reference-type-def kind='lvalue' type-id='type-id-174' size-in-bits='64' id='type-id-177'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-661'/>
    <qualified-type-def type-id='type-id-661' const='yes' id='type-id-175'/>
    <reference-type-def kind='lvalue' type-id='type-id-176' size-in-bits='64' id='type-id-662'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-663'/>
    <qualified-type-def type-id='type-id-663' const='yes' id='type-id-664'/>
    <reference-type-def kind='lvalue' type-id='type-id-80' size-in-bits='64' id='type-id-665'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-666'/>
    <reference-type-def kind='lvalue' type-id='type-id-67' size-in-bits='64' id='type-id-667'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-668'/>
    <qualified-type-def type-id='type-id-668' const='yes' id='type-id-669'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-670'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-671'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-672'/>
    <reference-type-def kind='lvalue' type-id='type-id-75' size-in-bits='64' id='type-id-673'/>
    <reference-type-def kind='lvalue' type-id='type-id-674' size-in-bits='64' id='type-id-85'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-675'/>
    <pointer-type-def type-id='type-id-676' size-in-bits='64' id='type-id-83'/>
    <pointer-type-def type-id='type-id-459' size-in-bits='64' id='type-id-99'/>
    <qualified-type-def type-id='type-id-99' const='yes' id='type-id-677'/>
    <reference-type-def kind='lvalue' type-id='type-id-88' size-in-bits='64' id='type-id-678'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-679'/>
    <qualified-type-def type-id='type-id-679' const='yes' id='type-id-680'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-681'/>
    <qualified-type-def type-id='type-id-681' const='yes' id='type-id-682'/>
    <pointer-type-def type-id='type-id-683' size-in-bits='64' id='type-id-684'/>
    <qualified-type-def type-id='type-id-684' const='yes' id='type-id-685'/>
    <reference-type-def kind='lvalue' type-id='type-id-686' size-in-bits='64' id='type-id-98'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-230'/>
    <qualified-type-def type-id='type-id-230' const='yes' id='type-id-687'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-232'/>
    <qualified-type-def type-id='type-id-232' const='yes' id='type-id-688'/>
    <reference-type-def kind='lvalue' type-id='type-id-164' size-in-bits='64' id='type-id-689'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-690'/>
    <pointer-type-def type-id='type-id-691' size-in-bits='64' id='type-id-115'/>
    <reference-type-def kind='lvalue' type-id='type-id-474' size-in-bits='64' id='type-id-692'/>
    <pointer-type-def type-id='type-id-474' size-in-bits='64' id='type-id-199'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-96'/>
    <reference-type-def kind='lvalue' type-id='type-id-100' size-in-bits='64' id='type-id-693'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-694'/>
    <qualified-type-def type-id='type-id-694' const='yes' id='type-id-695'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-696'/>
    <reference-type-def kind='lvalue' type-id='type-id-171' size-in-bits='64' id='type-id-697'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-698'/>
    <pointer-type-def type-id='type-id-699' size-in-bits='64' id='type-id-172'/>
    <pointer-type-def type-id='type-id-490' size-in-bits='64' id='type-id-700'/>
    <pointer-type-def type-id='type-id-701' size-in-bits='64' id='type-id-105'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-84'/>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-702'/>
    <reference-type-def kind='lvalue' type-id='type-id-703' size-in-bits='64' id='type-id-704'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-705'/>
    <qualified-type-def type-id='type-id-705' const='yes' id='type-id-706'/>
    <reference-type-def kind='lvalue' type-id='type-id-707' size-in-bits='64' id='type-id-708'/>
    <reference-type-def kind='lvalue' type-id='type-id-102' size-in-bits='64' id='type-id-709'/>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-103'/>
    <reference-type-def kind='lvalue' type-id='type-id-39' size-in-bits='64' id='type-id-710'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-711'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-712'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-43'/>
    <reference-type-def kind='lvalue' type-id='type-id-44' size-in-bits='64' id='type-id-713'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-714'/>
    <qualified-type-def type-id='type-id-714' const='yes' id='type-id-715'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-716'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-47'/>
    <reference-type-def kind='lvalue' type-id='type-id-121' size-in-bits='64' id='type-id-717'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-718'/>
    <qualified-type-def type-id='type-id-718' const='yes' id='type-id-719'/>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-720'/>
    <qualified-type-def type-id='type-id-720' const='yes' id='type-id-721'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-722'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-723'/>
    <reference-type-def kind='lvalue' type-id='type-id-137' size-in-bits='64' id='type-id-724'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-725'/>
    <reference-type-def kind='lvalue' type-id='type-id-130' size-in-bits='64' id='type-id-726'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-727'/>
    <reference-type-def kind='lvalue' type-id='type-id-143' size-in-bits='64' id='type-id-728'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-729'/>
    <reference-type-def kind='lvalue' type-id='type-id-147' size-in-bits='64' id='type-id-730'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-731'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-227'/>
    <qualified-type-def type-id='type-id-227' const='yes' id='type-id-732'/>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-183'/>
    <reference-type-def kind='lvalue' type-id='type-id-182' size-in-bits='64' id='type-id-180'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-184'/>
    <reference-type-def kind='lvalue' type-id='type-id-178' size-in-bits='64' id='type-id-733'/>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-181'/>
    <reference-type-def kind='lvalue' type-id='type-id-79' size-in-bits='64' id='type-id-734'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-735'/>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-736'/>
    <qualified-type-def type-id='type-id-736' const='yes' id='type-id-737'/>
    <reference-type-def kind='lvalue' type-id='type-id-101' size-in-bits='64' id='type-id-738'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-739'/>
    <pointer-type-def type-id='type-id-193' size-in-bits='64' id='type-id-200'/>
    <qualified-type-def type-id='type-id-200' const='yes' id='type-id-198'/>
    <reference-type-def kind='lvalue' type-id='type-id-140' size-in-bits='64' id='type-id-740'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-741'/>
    <qualified-type-def type-id='type-id-741' const='yes' id='type-id-742'/>
    <reference-type-def kind='lvalue' type-id='type-id-134' size-in-bits='64' id='type-id-743'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-744'/>
    <reference-type-def kind='lvalue' type-id='type-id-205' size-in-bits='64' id='type-id-745'/>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-746'/>
    <qualified-type-def type-id='type-id-746' const='yes' id='type-id-747'/>
    <reference-type-def kind='lvalue' type-id='type-id-207' size-in-bits='64' id='type-id-748'/>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-209'/>
    <reference-type-def kind='lvalue' type-id='type-id-215' size-in-bits='64' id='type-id-749'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-750'/>
    <qualified-type-def type-id='type-id-750' const='yes' id='type-id-751'/>
    <reference-type-def kind='lvalue' type-id='type-id-217' size-in-bits='64' id='type-id-752'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-219'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-753'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-754'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-755'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-756'/>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' id='type-id-757'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-267'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-268'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-269'/>
    <class-decl name='wxEvent' visibility='default' is-declaration-only='yes' id='type-id-674'>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK7wxEvent12GetClassInfoEv' filepath='include/wx/event.h' line='1140' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <return type-id='type-id-117'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='6'>
        <function-decl name='GetEventCategory' mangled-name='_ZNK7wxEvent16GetEventCategoryEv' filepath='include/wx/event.h' line='1010' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-758' is-artificial='yes'/>
          <return type-id='type-id-759'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEventFunctor' visibility='default' is-declaration-only='yes' id='type-id-82'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD4Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-675' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK14wxEventFunctor13GetEvtHandlerEv' filepath='include/wx/event.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-760' is-artificial='yes'/>
          <return type-id='type-id-83'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK14wxEventFunctor12GetEvtMethodEv' filepath='include/wx/event.h' line='250' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-760' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEvtHandler' visibility='default' is-declaration-only='yes' id='type-id-676'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEvtHandler' mangled-name='_ZN12wxEvtHandlerD2Ev' filepath='include/wx/event.h' line='3639' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-83' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEvtHandler' mangled-name='_ZN12wxEvtHandlerD2Ev' filepath='include/wx/event.h' line='3639' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-83' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEvtHandler' mangled-name='_ZN12wxEvtHandlerD4Ev' filepath='include/wx/event.h' line='3639' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-83' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK12wxEvtHandler12GetClassInfoEv' filepath='include/wx/event.h' line='4096' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-761' is-artificial='yes'/>
          <return type-id='type-id-117'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='SetNextHandler' mangled-name='_ZN12wxEvtHandler14SetNextHandlerEPS_' filepath='include/wx/event.h' line='3647' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-83' is-artificial='yes'/>
          <parameter type-id='type-id-83'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='SetPreviousHandler' mangled-name='_ZN12wxEvtHandler18SetPreviousHandlerEPS_' filepath='include/wx/event.h' line='3648' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-83' is-artificial='yes'/>
          <parameter type-id='type-id-83'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='ProcessEvent' mangled-name='_ZN12wxEvtHandler12ProcessEventER7wxEvent' filepath='include/wx/event.h' line='3677' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-83' is-artificial='yes'/>
          <parameter type-id='type-id-85'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='QueueEvent' mangled-name='_ZN12wxEvtHandler10QueueEventEP7wxEvent' filepath='include/wx/event.h' line='3705' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-83' is-artificial='yes'/>
          <parameter type-id='type-id-762'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='AddPendingEvent' mangled-name='_ZN12wxEvtHandler15AddPendingEventERK7wxEvent' filepath='include/wx/event.h' line='3709' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-83' is-artificial='yes'/>
          <parameter type-id='type-id-763'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='SearchEventTable' mangled-name='_ZN12wxEvtHandler16SearchEventTableER12wxEventTableR7wxEvent' filepath='include/wx/event.h' line='3964' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-83' is-artificial='yes'/>
          <parameter type-id='type-id-764'/>
          <parameter type-id='type-id-85'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='11'>
        <function-decl name='TryBefore' mangled-name='_ZN12wxEvtHandler9TryBeforeER7wxEvent' filepath='include/wx/event.h' line='3994' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-83' is-artificial='yes'/>
          <parameter type-id='type-id-85'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='12'>
        <function-decl name='TryAfter' mangled-name='_ZN12wxEvtHandler8TryAfterER7wxEvent' filepath='include/wx/event.h' line='4014' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-83' is-artificial='yes'/>
          <parameter type-id='type-id-85'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='13'>
        <function-decl name='OnDynamicBind' mangled-name='_ZN12wxEvtHandler13OnDynamicBindER24wxDynamicEventTableEntry' filepath='include/wx/event.h' line='4029' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-83' is-artificial='yes'/>
          <parameter type-id='type-id-765'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='14'>
        <function-decl name='GetEventTable' mangled-name='_ZNK12wxEvtHandler13GetEventTableEv' filepath='include/wx/event.h' line='4036' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-761' is-artificial='yes'/>
          <return type-id='type-id-766'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='15'>
        <function-decl name='GetEventHashTable' mangled-name='_ZNK12wxEvtHandler17GetEventHashTableEv' filepath='include/wx/event.h' line='4039' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-761' is-artificial='yes'/>
          <return type-id='type-id-767'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='16'>
        <function-decl name='DoSetClientObject' mangled-name='_ZN12wxEvtHandler17DoSetClientObjectEP12wxClientData' filepath='include/wx/event.h' line='4073' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-83' is-artificial='yes'/>
          <parameter type-id='type-id-768'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='17'>
        <function-decl name='DoGetClientObject' mangled-name='_ZNK12wxEvtHandler17DoGetClientObjectEv' filepath='include/wx/event.h' line='4074' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-761' is-artificial='yes'/>
          <return type-id='type-id-768'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='18'>
        <function-decl name='DoSetClientData' mangled-name='_ZN12wxEvtHandler15DoSetClientDataEPv' filepath='include/wx/event.h' line='4076' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-83' is-artificial='yes'/>
          <parameter type-id='type-id-16'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='19'>
        <function-decl name='DoGetClientData' mangled-name='_ZNK12wxEvtHandler15DoGetClientDataEv' filepath='include/wx/event.h' line='4077' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-761' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='20'>
        <function-decl name='WXReservedEvtHandler1' mangled-name='_ZN12wxEvtHandler21WXReservedEvtHandler1EPv' filepath='include/wx/event.h' line='4083' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-83' is-artificial='yes'/>
          <parameter type-id='type-id-16'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='21'>
        <function-decl name='WXReservedEvtHandler2' mangled-name='_ZN12wxEvtHandler21WXReservedEvtHandler2EPv' filepath='include/wx/event.h' line='4084' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-83' is-artificial='yes'/>
          <parameter type-id='type-id-16'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxFSFile' visibility='default' is-declaration-only='yes' id='type-id-459'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFSFile' mangled-name='_ZN8wxFSFileD0Ev' filepath='include/wx/filesys.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-99' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFSFile' mangled-name='_ZN8wxFSFileD2Ev' filepath='include/wx/filesys.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-99' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFSFile' mangled-name='_ZN8wxFSFileD4Ev' filepath='include/wx/filesys.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-99' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK8wxFSFile12GetClassInfoEv' filepath='include/wx/filesys.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-461' is-artificial='yes'/>
          <return type-id='type-id-117'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxFileInputStream' visibility='default' is-declaration-only='yes' id='type-id-226'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFileInputStream' mangled-name='_ZN17wxFileInputStreamD2Ev' filepath='include/wx/wfstream.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-681' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFileInputStream' mangled-name='_ZN17wxFileInputStreamD4Ev' filepath='include/wx/wfstream.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-681' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='IsOk' mangled-name='_ZNK17wxFileInputStream4IsOkEv' filepath='include/wx/wfstream.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-467' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='7'>
        <function-decl name='GetLength' mangled-name='_ZNK17wxFileInputStream9GetLengthEv' filepath='include/wx/wfstream.h' line='38' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-467' is-artificial='yes'/>
          <return type-id='type-id-93'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='8'>
        <function-decl name='IsSeekable' mangled-name='_ZNK17wxFileInputStream10IsSeekableEv' filepath='include/wx/wfstream.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-467' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='9'>
        <function-decl name='OnSysSeek' mangled-name='_ZN17wxFileInputStream9OnSysSeekEl10wxSeekMode' filepath='include/wx/wfstream.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-681' is-artificial='yes'/>
          <parameter type-id='type-id-93'/>
          <parameter type-id='type-id-90'/>
          <return type-id='type-id-93'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='10'>
        <function-decl name='OnSysTell' mangled-name='_ZNK17wxFileInputStream9OnSysTellEv' filepath='include/wx/wfstream.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-467' is-artificial='yes'/>
          <return type-id='type-id-93'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='18'>
        <function-decl name='OnSysRead' mangled-name='_ZN17wxFileInputStream9OnSysReadEPvm' filepath='include/wx/wfstream.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-681' is-artificial='yes'/>
          <parameter type-id='type-id-16'/>
          <parameter type-id='type-id-120'/>
          <return type-id='type-id-120'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxFileOutputStream' visibility='default' is-declaration-only='yes' id='type-id-683'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFileOutputStream' mangled-name='_ZN18wxFileOutputStreamD1Ev' filepath='include/wx/wfstream.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-684' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFileOutputStream' mangled-name='_ZN18wxFileOutputStreamD4Ev' filepath='include/wx/wfstream.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-684' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxFileSystem' visibility='default' is-declaration-only='yes' id='type-id-686'/>
    <class-decl name='wxFileSystemHandler' visibility='default' is-declaration-only='yes' id='type-id-95'>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK19wxFileSystemHandler12GetClassInfoEv' filepath='include/wx/filesys.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-469' is-artificial='yes'/>
          <return type-id='type-id-117'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='FindFirst' mangled-name='_ZN19wxFileSystemHandler9FindFirstERK8wxStringi' filepath='include/wx/filesys.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-230' is-artificial='yes'/>
          <parameter type-id='type-id-97'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-121'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='FindNext' mangled-name='_ZN19wxFileSystemHandler8FindNextEv' filepath='include/wx/filesys.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-230' is-artificial='yes'/>
          <return type-id='type-id-121'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxHashTable' visibility='default' is-declaration-only='yes' id='type-id-691'/>
    <class-decl name='wxHashTable_Node' visibility='default' is-declaration-only='yes' id='type-id-110'/>
    <class-decl name='wxInputStream' visibility='default' is-declaration-only='yes' id='type-id-474'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxInputStream' mangled-name='_ZN13wxInputStreamD2Ev' filepath='include/wx/stream.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-199' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxInputStream' mangled-name='_ZN13wxInputStreamD4Ev' filepath='include/wx/stream.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-199' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK13wxInputStream12GetClassInfoEv' filepath='include/wx/stream.h' line='224' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-476' is-artificial='yes'/>
          <return type-id='type-id-117'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <function-decl name='Peek' mangled-name='_ZN13wxInputStream4PeekEv' filepath='include/wx/stream.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-199' is-artificial='yes'/>
          <return type-id='type-id-4'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <function-decl name='Read' mangled-name='_ZN13wxInputStream4ReadEPvm' filepath='include/wx/stream.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-199' is-artificial='yes'/>
          <parameter type-id='type-id-16'/>
          <parameter type-id='type-id-120'/>
          <return type-id='type-id-692'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='13'>
        <function-decl name='LastRead' mangled-name='_ZNK13wxInputStream8LastReadEv' filepath='include/wx/stream.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-476' is-artificial='yes'/>
          <return type-id='type-id-120'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='14'>
        <function-decl name='CanRead' mangled-name='_ZNK13wxInputStream7CanReadEv' filepath='include/wx/stream.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-476' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='15'>
        <function-decl name='Eof' mangled-name='_ZNK13wxInputStream3EofEv' filepath='include/wx/stream.h' line='158' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-476' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <function-decl name='SeekI' mangled-name='_ZN13wxInputStream5SeekIEl10wxSeekMode' filepath='include/wx/stream.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-199' is-artificial='yes'/>
          <parameter type-id='type-id-93'/>
          <parameter type-id='type-id-90'/>
          <return type-id='type-id-93'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='17'>
        <function-decl name='TellI' mangled-name='_ZNK13wxInputStream5TellIEv' filepath='include/wx/stream.h' line='186' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-476' is-artificial='yes'/>
          <return type-id='type-id-93'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxMBConv' visibility='default' is-declaration-only='yes' id='type-id-482'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMBConv' mangled-name='_ZN8wxMBConvD0Ev' filepath='include/wx/strconv.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-769' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMBConv' mangled-name='_ZN8wxMBConvD0Ev' filepath='include/wx/strconv.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-769' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMBConv' mangled-name='_ZN8wxMBConvD0Ev' filepath='include/wx/strconv.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-769' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMBConv' mangled-name='_ZN8wxMBConvD2Ev' filepath='include/wx/strconv.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-769' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMBConv' mangled-name='_ZN8wxMBConvD2Ev' filepath='include/wx/strconv.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-769' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMBConv' mangled-name='_ZN8wxMBConvD2Ev' filepath='include/wx/strconv.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-769' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMBConv' mangled-name='_ZN8wxMBConvD4Ev' filepath='include/wx/strconv.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-769' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='0'>
        <function-decl name='ToWChar' mangled-name='_ZNK8wxMBConv7ToWCharEPwmPKcm' filepath='include/wx/strconv.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-770' is-artificial='yes'/>
          <parameter type-id='type-id-644'/>
          <parameter type-id='type-id-120'/>
          <parameter type-id='type-id-186'/>
          <parameter type-id='type-id-120'/>
          <return type-id='type-id-120'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='1'>
        <function-decl name='FromWChar' mangled-name='_ZNK8wxMBConv9FromWCharEPcmPKwm' filepath='include/wx/strconv.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-770' is-artificial='yes'/>
          <parameter type-id='type-id-156'/>
          <parameter type-id='type-id-120'/>
          <parameter type-id='type-id-123'/>
          <parameter type-id='type-id-120'/>
          <return type-id='type-id-120'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetMaxCharLen' mangled-name='_ZNK8wxMBConv13GetMaxCharLenEv' filepath='include/wx/strconv.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-770' is-artificial='yes'/>
          <return type-id='type-id-120'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='GetMBNulLen' mangled-name='_ZNK8wxMBConv11GetMBNulLenEv' filepath='include/wx/strconv.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-770' is-artificial='yes'/>
          <return type-id='type-id-120'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='IsUTF8' mangled-name='_ZNK8wxMBConv6IsUTF8Ev' filepath='include/wx/strconv.h' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-770' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='MB2WC' mangled-name='_ZNK8wxMBConv5MB2WCEPwPKcm' filepath='include/wx/strconv.h' line='165' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-770' is-artificial='yes'/>
          <parameter type-id='type-id-644'/>
          <parameter type-id='type-id-186'/>
          <parameter type-id='type-id-120'/>
          <return type-id='type-id-120'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='6'>
        <function-decl name='WC2MB' mangled-name='_ZNK8wxMBConv5WC2MBEPcPKwm' filepath='include/wx/strconv.h' line='166' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-770' is-artificial='yes'/>
          <parameter type-id='type-id-156'/>
          <parameter type-id='type-id-123'/>
          <parameter type-id='type-id-120'/>
          <return type-id='type-id-120'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxModule' visibility='default' is-declaration-only='yes' id='type-id-229'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxModule' mangled-name='_ZN8wxModuleD0Ev' filepath='include/wx/module.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-696' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxModule' mangled-name='_ZN8wxModuleD0Ev' filepath='include/wx/module.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-696' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxModule' mangled-name='_ZN8wxModuleD0Ev' filepath='include/wx/module.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-696' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxModule' mangled-name='_ZN8wxModuleD0Ev' filepath='include/wx/module.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-696' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxModule' mangled-name='_ZN8wxModuleD0Ev' filepath='include/wx/module.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-696' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxModule' mangled-name='_ZN8wxModuleD2Ev' filepath='include/wx/module.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-696' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxModule' mangled-name='_ZN8wxModuleD2Ev' filepath='include/wx/module.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-696' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxModule' mangled-name='_ZN8wxModuleD2Ev' filepath='include/wx/module.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-696' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxModule' mangled-name='_ZN8wxModuleD2Ev' filepath='include/wx/module.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-696' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxModule' mangled-name='_ZN8wxModuleD2Ev' filepath='include/wx/module.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-696' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxModule' mangled-name='_ZN8wxModuleD4Ev' filepath='include/wx/module.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-696' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK8wxModule12GetClassInfoEv' filepath='include/wx/module.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-486' is-artificial='yes'/>
          <return type-id='type-id-117'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxMutexInternal' visibility='default' is-declaration-only='yes' id='type-id-699'/>
    <class-decl name='wxObject' visibility='default' is-declaration-only='yes' id='type-id-490'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-700' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-700' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-700' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-700' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-700' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-700' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-700' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-700' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-700' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-700' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-700' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-700' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-700' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-700' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-700' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-700' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-700' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-700' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-700' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-700' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-700' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-700' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD4Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-700' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK8wxObject12GetClassInfoEv' filepath='include/wx/object.h' line='446' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-492' is-artificial='yes'/>
          <return type-id='type-id-117'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='3'>
        <function-decl name='CreateRefData' mangled-name='_ZNK8wxObject13CreateRefDataEv' filepath='include/wx/object.h' line='464' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-492' is-artificial='yes'/>
          <return type-id='type-id-702'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='4'>
        <function-decl name='CloneRefData' mangled-name='_ZNK8wxObject12CloneRefDataEPK12wxRefCounter' filepath='include/wx/object.h' line='467' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-492' is-artificial='yes'/>
          <parameter type-id='type-id-495'/>
          <return type-id='type-id-702'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxOutputStream' visibility='default' is-declaration-only='yes' id='type-id-703'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxOutputStream' mangled-name='_ZN14wxOutputStreamD2Ev' filepath='include/wx/stream.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-771' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxOutputStream' mangled-name='_ZN14wxOutputStreamD4Ev' filepath='include/wx/stream.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-771' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK14wxOutputStream12GetClassInfoEv' filepath='include/wx/stream.h' line='266' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-772' is-artificial='yes'/>
          <return type-id='type-id-117'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <function-decl name='Write' mangled-name='_ZN14wxOutputStream5WriteEPKvm' filepath='include/wx/stream.h' line='239' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-771' is-artificial='yes'/>
          <parameter type-id='type-id-16'/>
          <parameter type-id='type-id-120'/>
          <return type-id='type-id-704'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <function-decl name='SeekO' mangled-name='_ZN14wxOutputStream5SeekOEl10wxSeekMode' filepath='include/wx/stream.h' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-771' is-artificial='yes'/>
          <parameter type-id='type-id-93'/>
          <parameter type-id='type-id-90'/>
          <return type-id='type-id-93'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='13'>
        <function-decl name='TellO' mangled-name='_ZNK14wxOutputStream5TellOEv' filepath='include/wx/stream.h' line='249' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-772' is-artificial='yes'/>
          <return type-id='type-id-93'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='14'>
        <function-decl name='LastWrite' mangled-name='_ZNK14wxOutputStream9LastWriteEv' filepath='include/wx/stream.h' line='251' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-772' is-artificial='yes'/>
          <return type-id='type-id-120'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <function-decl name='Sync' mangled-name='_ZN14wxOutputStream4SyncEv' filepath='include/wx/stream.h' line='253' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-771' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <function-decl name='Close' mangled-name='_ZN14wxOutputStream5CloseEv' filepath='include/wx/stream.h' line='254' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-771' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxThread' visibility='default' is-declaration-only='yes' id='type-id-179'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD4Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='0'>
        <function-decl name='TestDestroy' mangled-name='_ZN8wxThread11TestDestroyEv' filepath='include/wx/thread.h' line='593' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='4'>
        <function-decl name='OnDelete' mangled-name='_ZN8wxThread8OnDeleteEv' filepath='include/wx/thread.h' line='622' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='5'>
        <function-decl name='OnKill' mangled-name='_ZN8wxThread6OnKillEv' filepath='include/wx/thread.h' line='626' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='6'>
        <function-decl name='OnExit' mangled-name='_ZN8wxThread6OnExitEv' filepath='include/wx/thread.h' line='631' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-183' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <namespace-decl name='wxPrivate'>
      <class-decl name='UntypedBufferData' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='30' column='1' id='type-id-42'>
        <member-type access='public'>
          <enum-decl name='Kind' filepath='include/wx/buffer.h' line='32' column='1' id='type-id-773'>
            <underlying-type type-id='type-id-26'/>
            <enumerator name='Owned' value='0'/>
            <enumerator name='NonOwned' value='1'/>
          </enum-decl>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='m_str' type-id='type-id-16' visibility='default' filepath='include/wx/buffer.h' line='47' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='m_length' type-id='type-id-120' visibility='default' filepath='include/wx/buffer.h' line='48' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='m_ref' type-id='type-id-28' visibility='default' filepath='include/wx/buffer.h' line='51' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='144'>
          <var-decl name='m_owned' type-id='type-id-3' visibility='default' filepath='include/wx/buffer.h' line='53' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='wxVectorMemOpsMovable&lt;wxClassInfo*&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/vector.h' line='75' column='1' id='type-id-774'/>
      <class-decl name='wxVectorMemOpsGeneric&lt;wxString&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/vector.h' line='92' column='1' id='type-id-775'/>
    </namespace-decl>
    <class-decl name='wxProtocol' visibility='default' filepath='include/wx/protocol/protocol.h' line='50' column='1' is-declaration-only='yes' id='type-id-707'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-776'/>
      <data-member access='protected' layout-offset-in-bits='2016'>
        <var-decl name='m_uiDefaultTimeout' type-id='type-id-189' visibility='default' filepath='include/wx/protocol/protocol.h' line='120' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2048'>
        <var-decl name='m_username' type-id='type-id-121' visibility='default' filepath='include/wx/protocol/protocol.h' line='122' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2432'>
        <var-decl name='m_password' type-id='type-id-121' visibility='default' filepath='include/wx/protocol/protocol.h' line='123' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='2816'>
        <var-decl name='m_lastError' type-id='type-id-777' visibility='default' filepath='include/wx/protocol/protocol.h' line='126' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2880'>
        <var-decl name='m_log' type-id='type-id-778' visibility='default' filepath='include/wx/protocol/protocol.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-107' mangled-name='_ZN10wxProtocol12ms_classInfoE' visibility='default' filepath='src/common/protocol.cpp' line='57' column='1' elf-symbol-id='_ZN10wxProtocol12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='LogResponse' mangled-name='_ZN10wxProtocol11LogResponseERK8wxString' filepath='src/common/protocol.cpp' line='210' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10wxProtocol11LogResponseERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-779' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-97' name='str' filepath='src/common/protocol.cpp' line='210' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='LogRequest' mangled-name='_ZN10wxProtocol10LogRequestERK8wxString' filepath='src/common/protocol.cpp' line='204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10wxProtocol10LogRequestERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-779' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-97' name='str' filepath='src/common/protocol.cpp' line='210' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetLog' mangled-name='_ZN10wxProtocol6SetLogEP13wxProtocolLog' filepath='src/common/protocol.cpp' line='198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10wxProtocol6SetLogEP13wxProtocolLog@@WXU_3.2'>
          <parameter type-id='type-id-779' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-778' name='log' filepath='src/common/protocol.cpp' line='198' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='ReadLine' mangled-name='_ZN10wxProtocol8ReadLineEP12wxSocketBaseR8wxString' filepath='src/common/protocol.cpp' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10wxProtocol8ReadLineEP12wxSocketBaseR8wxString@@WXU_3.2'>
          <parameter type-id='type-id-780'/>
          <parameter type-id='type-id-717'/>
          <return type-id='type-id-777'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Reconnect' mangled-name='_ZN10wxProtocol9ReconnectEv' filepath='src/common/protocol.cpp' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10wxProtocol9ReconnectEv@@WXU_3.2'>
          <parameter type-id='type-id-779' name='this' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxProtocol' mangled-name='_ZN10wxProtocolC2Ev' filepath='src/common/protocol.cpp' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10wxProtocolC2Ev@@WXU_3.2'>
          <parameter type-id='type-id-197' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxProtocol' mangled-name='_ZN10wxProtocolC2Ev' filepath='src/common/protocol.cpp' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10wxProtocolC2Ev@@WXU_3.2'>
          <parameter type-id='type-id-197' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxProtocol' mangled-name='_ZN10wxProtocolD4Ev' filepath='include/wx/protocol/protocol.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-197' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxProtocol' mangled-name='_ZN10wxProtocolD0Ev' filepath='include/wx/protocol/protocol.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10wxProtocolD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-197' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxProtocol' mangled-name='_ZN10wxProtocolD0Ev' filepath='include/wx/protocol/protocol.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10wxProtocolD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-197' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxProtocol' mangled-name='_ZN10wxProtocolD0Ev' filepath='include/wx/protocol/protocol.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10wxProtocolD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-197' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxProtocol' mangled-name='_ZN10wxProtocolD2Ev' filepath='include/wx/protocol/protocol.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10wxProtocolD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-197' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxProtocol' mangled-name='_ZN10wxProtocolD2Ev' filepath='include/wx/protocol/protocol.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10wxProtocolD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-197' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK10wxProtocol12GetClassInfoEv' filepath='src/common/protocol.cpp' line='57' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK10wxProtocol12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-781' is-artificial='yes'/>
          <return type-id='type-id-117'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='SetTimeout' mangled-name='_ZN10wxProtocol10SetTimeoutEl' filepath='include/wx/protocol/protocol.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-197' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='Connect' mangled-name='_ZN10wxProtocol7ConnectERK13wxSockAddressb' filepath='include/wx/protocol/protocol.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-197' is-artificial='yes'/>
          <parameter type-id='type-id-782'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <function-decl name='Connect' mangled-name='_ZN10wxProtocol7ConnectERK8wxString' filepath='include/wx/protocol/protocol.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-197' is-artificial='yes'/>
          <parameter type-id='type-id-97'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <function-decl name='ReadLine' mangled-name='_ZN10wxProtocol8ReadLineER8wxString' filepath='include/wx/protocol/protocol.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10wxProtocol8ReadLineER8wxString@@WXU_3.2'>
          <parameter type-id='type-id-197' is-artificial='yes'/>
          <parameter type-id='type-id-717'/>
          <return type-id='type-id-777'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <function-decl name='Abort' mangled-name='_ZN10wxProtocol5AbortEv' filepath='include/wx/protocol/protocol.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-197' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <function-decl name='GetInputStream' mangled-name='_ZN10wxProtocol14GetInputStreamERK8wxString' filepath='include/wx/protocol/protocol.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-197' is-artificial='yes'/>
          <parameter type-id='type-id-97'/>
          <return type-id='type-id-199'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='16'>
        <function-decl name='GetContentType' mangled-name='_ZNK10wxProtocol14GetContentTypeEv' filepath='include/wx/protocol/protocol.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-781' is-artificial='yes'/>
          <return type-id='type-id-121'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='17'>
        <function-decl name='GetError' mangled-name='_ZNK10wxProtocol8GetErrorEv' filepath='include/wx/protocol/protocol.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-781' is-artificial='yes'/>
          <return type-id='type-id-777'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <function-decl name='SetDefaultTimeout' mangled-name='_ZN10wxProtocol17SetDefaultTimeoutEj' filepath='include/wx/protocol/protocol.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN10wxProtocol17SetDefaultTimeoutEj@@WXU_3.2'>
          <parameter type-id='type-id-197' is-artificial='yes'/>
          <parameter type-id='type-id-189'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <function-decl name='setlocale' filepath='/usr/include/locale.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-186'/>
      <return type-id='type-id-156'/>
    </function-decl>
    <function-decl name='localeconv' filepath='/usr/include/locale.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-587'/>
    </function-decl>
    <function-decl name='remove' filepath='/usr/include/stdio.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-186'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='rename' filepath='/usr/include/stdio.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-186'/>
      <parameter type-id='type-id-186'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-266'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='tmpnam' filepath='/usr/include/stdio.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-156'/>
      <return type-id='type-id-156'/>
    </function-decl>
    <function-decl name='fflush' filepath='/usr/include/stdio.h' line='230' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-266'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='setbuf' filepath='/usr/include/stdio.h' line='328' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-266'/>
      <parameter type-id='type-id-156'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='setvbuf' filepath='/usr/include/stdio.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-266'/>
      <parameter type-id='type-id-156'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-120'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='fgetc' filepath='/usr/include/stdio.h' line='513' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-266'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='getc' filepath='/usr/include/stdio.h' line='514' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-266'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='getchar' filepath='/usr/include/stdio.h' line='520' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='fgets' filepath='/usr/include/stdio.h' line='592' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-156'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-266'/>
      <return type-id='type-id-156'/>
    </function-decl>
    <function-decl name='ungetc' filepath='/usr/include/stdio.h' line='668' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-266'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='fread' filepath='/usr/include/stdio.h' line='675' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-120'/>
      <parameter type-id='type-id-120'/>
      <parameter type-id='type-id-266'/>
      <return type-id='type-id-120'/>
    </function-decl>
    <function-decl name='fseek' filepath='/usr/include/stdio.h' line='713' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-266'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='ftell' filepath='/usr/include/stdio.h' line='718' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-266'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='rewind' filepath='/usr/include/stdio.h' line='723' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-266'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='clearerr' filepath='/usr/include/stdio.h' line='786' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-266'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='feof' filepath='/usr/include/stdio.h' line='788' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-266'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='ferror' filepath='/usr/include/stdio.h' line='790' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-266'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='perror' filepath='/usr/include/stdio.h' line='804' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-186'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='atof' filepath='/usr/include/stdlib.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-186'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='atoi' filepath='/usr/include/stdlib.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-186'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='atol' filepath='/usr/include/stdlib.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-186'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='atoll' filepath='/usr/include/stdlib.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-186'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='strtod' filepath='/usr/include/stdlib.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-186'/>
      <parameter type-id='type-id-299'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='strtof' filepath='/usr/include/stdlib.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-186'/>
      <parameter type-id='type-id-299'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='strtold' filepath='/usr/include/stdlib.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-186'/>
      <parameter type-id='type-id-299'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='strtol' filepath='/usr/include/stdlib.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-186'/>
      <parameter type-id='type-id-299'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='strtoul' filepath='/usr/include/stdlib.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-186'/>
      <parameter type-id='type-id-299'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='strtoll' filepath='/usr/include/stdlib.h' line='201' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-186'/>
      <parameter type-id='type-id-299'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='strtoull' filepath='/usr/include/stdlib.h' line='206' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-186'/>
      <parameter type-id='type-id-299'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='rand' filepath='/usr/include/stdlib.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='srand' filepath='/usr/include/stdlib.h' line='456' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='555' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='atexit' filepath='/usr/include/stdlib.h' line='602' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-642'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='quick_exit' filepath='/usr/include/stdlib.h' line='630' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='641' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-186'/>
      <return type-id='type-id-156'/>
    </function-decl>
    <function-decl name='system' filepath='/usr/include/stdlib.h' line='791' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-186'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='bsearch' filepath='/usr/include/stdlib.h' line='828' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-120'/>
      <parameter type-id='type-id-120'/>
      <parameter type-id='type-id-243'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='qsort' filepath='/usr/include/stdlib.h' line='838' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-120'/>
      <parameter type-id='type-id-120'/>
      <parameter type-id='type-id-243'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='div' filepath='/usr/include/stdlib.h' line='860' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-236'/>
    </function-decl>
    <function-decl name='ldiv' filepath='/usr/include/stdlib.h' line='862' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-238'/>
    </function-decl>
    <function-decl name='lldiv' filepath='/usr/include/stdlib.h' line='866' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-240'/>
    </function-decl>
    <function-decl name='mblen' filepath='/usr/include/stdlib.h' line='930' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-186'/>
      <parameter type-id='type-id-120'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='mbtowc' filepath='/usr/include/stdlib.h' line='933' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-644'/>
      <parameter type-id='type-id-186'/>
      <parameter type-id='type-id-120'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='wctomb' filepath='/usr/include/stdlib.h' line='937' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-156'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='mbstowcs' filepath='/usr/include/stdlib.h' line='941' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-644'/>
      <parameter type-id='type-id-186'/>
      <parameter type-id='type-id-120'/>
      <return type-id='type-id-120'/>
    </function-decl>
    <function-decl name='wcstombs' filepath='/usr/include/stdlib.h' line='945' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-156'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-120'/>
      <return type-id='type-id-120'/>
    </function-decl>
    <function-decl name='strcmp' filepath='/usr/include/string.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-186'/>
      <parameter type-id='type-id-186'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='wcscpy' filepath='/usr/include/wchar.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-644'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-644'/>
    </function-decl>
    <function-decl name='wcsncpy' filepath='/usr/include/wchar.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-644'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-120'/>
      <return type-id='type-id-644'/>
    </function-decl>
    <function-decl name='wcscat' filepath='/usr/include/wchar.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-644'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-644'/>
    </function-decl>
    <function-decl name='wcsncat' filepath='/usr/include/wchar.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-644'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-120'/>
      <return type-id='type-id-644'/>
    </function-decl>
    <function-decl name='wcscmp' filepath='/usr/include/wchar.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='wcsncmp' filepath='/usr/include/wchar.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-120'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='wcscoll' filepath='/usr/include/wchar.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='wcsxfrm' filepath='/usr/include/wchar.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-644'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-120'/>
      <return type-id='type-id-120'/>
    </function-decl>
    <function-decl name='wcscspn' filepath='/usr/include/wchar.h' line='188' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-120'/>
    </function-decl>
    <function-decl name='wcsspn' filepath='/usr/include/wchar.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-120'/>
    </function-decl>
    <function-decl name='wcstok' filepath='/usr/include/wchar.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-644'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-647'/>
      <return type-id='type-id-644'/>
    </function-decl>
    <function-decl name='wcslen' filepath='/usr/include/wchar.h' line='223' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <return type-id='type-id-120'/>
    </function-decl>
    <function-decl name='wmemcmp' filepath='/usr/include/wchar.h' line='259' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-120'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='wmemcpy' filepath='/usr/include/wchar.h' line='263' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-644'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-120'/>
      <return type-id='type-id-644'/>
    </function-decl>
    <function-decl name='wmemmove' filepath='/usr/include/wchar.h' line='268' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-644'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-120'/>
      <return type-id='type-id-644'/>
    </function-decl>
    <function-decl name='wmemset' filepath='/usr/include/wchar.h' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-644'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-120'/>
      <return type-id='type-id-644'/>
    </function-decl>
    <function-decl name='btowc' filepath='/usr/include/wchar.h' line='285' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-264'/>
    </function-decl>
    <function-decl name='wctob' filepath='/usr/include/wchar.h' line='289' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-264'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='mbsinit' filepath='/usr/include/wchar.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-334'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='mbrtowc' filepath='/usr/include/wchar.h' line='297' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-644'/>
      <parameter type-id='type-id-186'/>
      <parameter type-id='type-id-120'/>
      <parameter type-id='type-id-592'/>
      <return type-id='type-id-120'/>
    </function-decl>
    <function-decl name='wcrtomb' filepath='/usr/include/wchar.h' line='302' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-156'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-592'/>
      <return type-id='type-id-120'/>
    </function-decl>
    <function-decl name='mbrlen' filepath='/usr/include/wchar.h' line='308' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-186'/>
      <parameter type-id='type-id-120'/>
      <parameter type-id='type-id-592'/>
      <return type-id='type-id-120'/>
    </function-decl>
    <function-decl name='mbsrtowcs' filepath='/usr/include/wchar.h' line='338' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-644'/>
      <parameter type-id='type-id-329'/>
      <parameter type-id='type-id-120'/>
      <parameter type-id='type-id-592'/>
      <return type-id='type-id-120'/>
    </function-decl>
    <function-decl name='wcsrtombs' filepath='/usr/include/wchar.h' line='344' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-156'/>
      <parameter type-id='type-id-415'/>
      <parameter type-id='type-id-120'/>
      <parameter type-id='type-id-592'/>
      <return type-id='type-id-120'/>
    </function-decl>
    <function-decl name='wcstod' filepath='/usr/include/wchar.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-647'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='wcstof' filepath='/usr/include/wchar.h' line='383' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-647'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='wcstold' filepath='/usr/include/wchar.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-647'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='wcstol' filepath='/usr/include/wchar.h' line='429' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-647'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='wcstoul' filepath='/usr/include/wchar.h' line='434' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-647'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='wcstoll' filepath='/usr/include/wchar.h' line='442' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-647'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='wcstoull' filepath='/usr/include/wchar.h' line='449' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-647'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='fwide' filepath='/usr/include/wchar.h' line='588' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-270'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='fwprintf' filepath='/usr/include/wchar.h' line='595' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-270'/>
      <parameter type-id='type-id-123'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='wprintf' filepath='/usr/include/wchar.h' line='602' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='swprintf' filepath='/usr/include/wchar.h' line='605' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-644'/>
      <parameter type-id='type-id-120'/>
      <parameter type-id='type-id-123'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='vfwprintf' filepath='/usr/include/wchar.h' line='613' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-270'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-638'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='vwprintf' filepath='/usr/include/wchar.h' line='621' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-638'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='vswprintf' filepath='/usr/include/wchar.h' line='626' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-644'/>
      <parameter type-id='type-id-120'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-638'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='fgetwc' filepath='/usr/include/wchar.h' line='744' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-270'/>
      <return type-id='type-id-264'/>
    </function-decl>
    <function-decl name='getwc' filepath='/usr/include/wchar.h' line='745' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-270'/>
      <return type-id='type-id-264'/>
    </function-decl>
    <function-decl name='getwchar' filepath='/usr/include/wchar.h' line='751' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-264'/>
    </function-decl>
    <function-decl name='fputwc' filepath='/usr/include/wchar.h' line='758' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-270'/>
      <return type-id='type-id-264'/>
    </function-decl>
    <function-decl name='putwc' filepath='/usr/include/wchar.h' line='759' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-270'/>
      <return type-id='type-id-264'/>
    </function-decl>
    <function-decl name='putwchar' filepath='/usr/include/wchar.h' line='765' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-264'/>
    </function-decl>
    <function-decl name='fgetws' filepath='/usr/include/wchar.h' line='773' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-644'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-270'/>
      <return type-id='type-id-644'/>
    </function-decl>
    <function-decl name='fputws' filepath='/usr/include/wchar.h' line='780' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-270'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='ungetwc' filepath='/usr/include/wchar.h' line='788' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-264'/>
      <parameter type-id='type-id-270'/>
      <return type-id='type-id-264'/>
    </function-decl>
    <function-decl name='wcsftime' filepath='/usr/include/wchar.h' line='852' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-644'/>
      <parameter type-id='type-id-120'/>
      <parameter type-id='type-id-123'/>
      <parameter type-id='type-id-408'/>
      <return type-id='type-id-120'/>
    </function-decl>
    <namespace-decl name='std'>
      <class-decl name='allocator_traits&lt;std::allocator&lt;char&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='411' column='1' id='type-id-783'>
        <member-type access='public'>
          <typedef-decl name='allocator_type' type-id='type-id-358' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='414' column='1' id='type-id-364'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-4' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='417' column='1' id='type-id-784'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-156' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='420' column='1' id='type-id-785'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_pointer' type-id='type-id-186' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='423' column='1' id='type-id-786'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-16' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='429' column='1' id='type-id-787'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-789' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='435' column='1' id='type-id-788'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-358' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='450' column='1' id='type-id-790'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator_traits&lt;std::allocator&lt;wchar_t&gt; &gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='411' column='1' id='type-id-791'>
        <member-type access='public'>
          <typedef-decl name='allocator_type' type-id='type-id-361' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='414' column='1' id='type-id-367'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-31' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='417' column='1' id='type-id-792'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-644' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='420' column='1' id='type-id-793'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_pointer' type-id='type-id-123' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='423' column='1' id='type-id-794'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_void_pointer' type-id='type-id-16' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='429' column='1' id='type-id-795'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-789' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='435' column='1' id='type-id-796'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='rebind_alloc' type-id='type-id-361' filepath='/usr/include/c++/11/bits/alloc_traits.h' line='450' column='1' id='type-id-797'/>
        </member-type>
      </class-decl>
      <class-decl name='allocator&lt;char&gt;' size-in-bits='8' visibility='default' filepath='/usr/include/c++/11/bits/allocator.h' line='124' column='1' id='type-id-358'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-291'/>
      </class-decl>
      <class-decl name='allocator&lt;wchar_t&gt;' size-in-bits='8' visibility='default' filepath='/usr/include/c++/11/bits/allocator.h' line='124' column='1' id='type-id-361'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-293'/>
      </class-decl>
      <class-decl name='char_traits&lt;wchar_t&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/char_traits.h' line='479' column='1' id='type-id-798'>
        <member-type access='public'>
          <typedef-decl name='char_type' type-id='type-id-31' filepath='/usr/include/c++/11/bits/char_traits.h' line='481' column='1' id='type-id-386'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='int_type' type-id='type-id-264' filepath='/usr/include/c++/11/bits/char_traits.h' line='482' column='1' id='type-id-390'/>
        </member-type>
      </class-decl>
      <class-decl name='__false_type' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/cpp_type_traits.h' line='74' column='1' id='type-id-799'/>
      <class-decl name='input_iterator_tag' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='93' column='1' id='type-id-800'/>
      <class-decl name='forward_iterator_tag' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='99' column='1' id='type-id-801'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-800'/>
      </class-decl>
      <class-decl name='bidirectional_iterator_tag' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='103' column='1' id='type-id-802'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-801'/>
      </class-decl>
      <class-decl name='random_access_iterator_tag' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='107' column='1' id='type-id-803'>
        <base-class access='public' layout-offset-in-bits='0' type-id='type-id-802'/>
      </class-decl>
      <class-decl name='iterator_traits&lt;char*&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='210' column='1' id='type-id-804'>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-806' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='214' column='1' id='type-id-805'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-156' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='215' column='1' id='type-id-807'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-296' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='216' column='1' id='type-id-808'/>
        </member-type>
      </class-decl>
      <class-decl name='iterator_traits&lt;wchar_t*&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='210' column='1' id='type-id-809'>
        <member-type access='public'>
          <typedef-decl name='iterator_category' type-id='type-id-803' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='212' column='1' id='type-id-810'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-806' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='214' column='1' id='type-id-811'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-644' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='215' column='1' id='type-id-812'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-643' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='216' column='1' id='type-id-813'/>
        </member-type>
      </class-decl>
      <class-decl name='iterator_traits&lt;char const*&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='221' column='1' id='type-id-814'>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-806' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='225' column='1' id='type-id-815'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-186' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='226' column='1' id='type-id-816'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-326' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='227' column='1' id='type-id-817'/>
        </member-type>
      </class-decl>
      <class-decl name='iterator_traits&lt;wchar_t const*&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='221' column='1' id='type-id-818'>
        <member-type access='public'>
          <typedef-decl name='iterator_category' type-id='type-id-803' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='223' column='1' id='type-id-819'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-806' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='225' column='1' id='type-id-820'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-123' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='226' column='1' id='type-id-821'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-412' filepath='/usr/include/c++/11/bits/stl_iterator_base_types.h' line='227' column='1' id='type-id-822'/>
        </member-type>
      </class-decl>
      <typedef-decl name='string' type-id='type-id-335' filepath='/usr/include/c++/11/bits/stringfwd.h' line='79' column='1' id='type-id-399'/>
      <typedef-decl name='wstring' type-id='type-id-342' filepath='/usr/include/c++/11/bits/stringfwd.h' line='83' column='1' id='type-id-159'/>
      <class-decl name='initializer_list&lt;char&gt;' size-in-bits='128' visibility='default' filepath='/usr/include/c++/11/initializer_list' line='47' column='1' id='type-id-393'>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-789' filepath='/usr/include/c++/11/initializer_list' line='53' column='1' id='type-id-823'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='type-id-186' filepath='/usr/include/c++/11/initializer_list' line='54' column='1' id='type-id-824'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-186' filepath='/usr/include/c++/11/initializer_list' line='55' column='1' id='type-id-825'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_array' type-id='type-id-824' visibility='default' filepath='/usr/include/c++/11/initializer_list' line='58' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_len' type-id='type-id-823' visibility='default' filepath='/usr/include/c++/11/initializer_list' line='59' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='initializer_list&lt;wchar_t&gt;' size-in-bits='128' visibility='default' filepath='/usr/include/c++/11/initializer_list' line='47' column='1' id='type-id-396'>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-789' filepath='/usr/include/c++/11/initializer_list' line='53' column='1' id='type-id-826'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='iterator' type-id='type-id-123' filepath='/usr/include/c++/11/initializer_list' line='54' column='1' id='type-id-827'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-123' filepath='/usr/include/c++/11/initializer_list' line='55' column='1' id='type-id-828'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_array' type-id='type-id-827' visibility='default' filepath='/usr/include/c++/11/initializer_list' line='58' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_len' type-id='type-id-826' visibility='default' filepath='/usr/include/c++/11/initializer_list' line='59' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='basic_string_view&lt;char, std::char_traits&lt;char&gt; &gt;' size-in-bits='128' visibility='default' filepath='/usr/include/c++/11/string_view' line='98' column='1' id='type-id-370'>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-4' filepath='/usr/include/c++/11/string_view' line='108' column='1' id='type-id-374'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_pointer' type-id='type-id-377' filepath='/usr/include/c++/11/string_view' line='110' column='1' id='type-id-829'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-376' filepath='/usr/include/c++/11/string_view' line='112' column='1' id='type-id-830'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-377' filepath='/usr/include/c++/11/string_view' line='113' column='1' id='type-id-831'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-833' filepath='/usr/include/c++/11/string_view' line='115' column='1' id='type-id-832'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-789' filepath='/usr/include/c++/11/string_view' line='117' column='1' id='type-id-834'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_len' type-id='type-id-789' visibility='default' filepath='/usr/include/c++/11/string_view' line='511' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_str' type-id='type-id-186' visibility='default' filepath='/usr/include/c++/11/string_view' line='512' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='basic_string_view&lt;wchar_t, std::char_traits&lt;wchar_t&gt; &gt;' size-in-bits='128' visibility='default' filepath='/usr/include/c++/11/string_view' line='98' column='1' id='type-id-378'>
        <member-type access='public'>
          <typedef-decl name='value_type' type-id='type-id-31' filepath='/usr/include/c++/11/string_view' line='108' column='1' id='type-id-382'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_pointer' type-id='type-id-385' filepath='/usr/include/c++/11/string_view' line='110' column='1' id='type-id-835'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reference' type-id='type-id-384' filepath='/usr/include/c++/11/string_view' line='112' column='1' id='type-id-836'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_iterator' type-id='type-id-385' filepath='/usr/include/c++/11/string_view' line='113' column='1' id='type-id-837'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='const_reverse_iterator' type-id='type-id-839' filepath='/usr/include/c++/11/string_view' line='115' column='1' id='type-id-838'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='size_type' type-id='type-id-789' filepath='/usr/include/c++/11/string_view' line='117' column='1' id='type-id-840'/>
        </member-type>
        <data-member access='private' layout-offset-in-bits='0'>
          <var-decl name='_M_len' type-id='type-id-789' visibility='default' filepath='/usr/include/c++/11/string_view' line='511' column='1'/>
        </data-member>
        <data-member access='private' layout-offset-in-bits='64'>
          <var-decl name='_M_str' type-id='type-id-123' visibility='default' filepath='/usr/include/c++/11/string_view' line='512' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='remove_reference&lt;std::allocator&lt;wchar_t&gt;&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/type_traits' line='1607' column='1' id='type-id-841'>
        <member-type access='public'>
          <typedef-decl name='type' type-id='type-id-361' filepath='/usr/include/c++/11/type_traits' line='1608' column='1' id='type-id-635'/>
        </member-type>
      </class-decl>
      <typedef-decl name='size_t' type-id='type-id-6' filepath='/usr/include/x86_64-linux-gnu/c++/11/bits/c++config.h' line='280' column='1' id='type-id-789'/>
      <typedef-decl name='ptrdiff_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/c++/11/bits/c++config.h' line='281' column='1' id='type-id-806'/>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;char const*, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-842'/>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;char*, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-843'/>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;wchar_t const*, std::__cxx11::basic_string&lt;wchar_t, std::char_traits&lt;wchar_t&gt;, std::allocator&lt;wchar_t&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-844'/>
      <class-decl name='reverse_iterator&lt;__gnu_cxx::__normal_iterator&lt;wchar_t*, std::__cxx11::basic_string&lt;wchar_t, std::char_traits&lt;wchar_t&gt;, std::allocator&lt;wchar_t&gt; &gt; &gt; &gt;' visibility='default' is-declaration-only='yes' id='type-id-845'/>
      <class-decl name='reverse_iterator&lt;char const*&gt;' visibility='default' is-declaration-only='yes' id='type-id-833'/>
      <class-decl name='reverse_iterator&lt;wchar_t const*&gt;' visibility='default' is-declaration-only='yes' id='type-id-839'/>
      <class-decl name='type_info' visibility='default' is-declaration-only='yes' id='type-id-402'/>
      <namespace-decl name='__exception_ptr'>
        <class-decl name='exception_ptr' size-in-bits='64' visibility='default' filepath='/usr/include/c++/11/bits/exception_ptr.h' line='86' column='1' id='type-id-354'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='_M_exception_object' type-id='type-id-16' visibility='default' filepath='/usr/include/c++/11/bits/exception_ptr.h' line='88' column='1'/>
          </data-member>
        </class-decl>
      </namespace-decl>
      <namespace-decl name='__cxx11'>
        <class-decl name='basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt;' size-in-bits='256' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='85' column='1' id='type-id-335'>
          <member-type access='private'>
            <typedef-decl name='_Char_alloc_type' type-id='type-id-847' filepath='/usr/include/c++/11/bits/basic_string.h' line='88' column='1' id='type-id-846'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='allocator_type' type-id='type-id-846' filepath='/usr/include/c++/11/bits/basic_string.h' line='95' column='1' id='type-id-339'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='size_type' type-id='type-id-848' filepath='/usr/include/c++/11/bits/basic_string.h' line='96' column='1' id='type-id-602'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-850' filepath='/usr/include/c++/11/bits/basic_string.h' line='98' column='1' id='type-id-849'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_reference' type-id='type-id-852' filepath='/usr/include/c++/11/bits/basic_string.h' line='99' column='1' id='type-id-851'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='pointer' type-id='type-id-854' filepath='/usr/include/c++/11/bits/basic_string.h' line='100' column='1' id='type-id-853'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_pointer' type-id='type-id-856' filepath='/usr/include/c++/11/bits/basic_string.h' line='101' column='1' id='type-id-855'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='iterator' type-id='type-id-278' filepath='/usr/include/c++/11/bits/basic_string.h' line='102' column='1' id='type-id-857'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_iterator' type-id='type-id-275' filepath='/usr/include/c++/11/bits/basic_string.h' line='104' column='1' id='type-id-858'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_reverse_iterator' type-id='type-id-842' filepath='/usr/include/c++/11/bits/basic_string.h' line='105' column='1' id='type-id-859'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reverse_iterator' type-id='type-id-843' filepath='/usr/include/c++/11/bits/basic_string.h' line='106' column='1' id='type-id-860'/>
          </member-type>
          <member-type access='protected'>
            <typedef-decl name='__const_iterator' type-id='type-id-858' filepath='/usr/include/c++/11/bits/basic_string.h' line='116' column='1' id='type-id-861'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='__sv_type' type-id='type-id-370' filepath='/usr/include/c++/11/bits/basic_string.h' line='122' column='1' id='type-id-862'/>
          </member-type>
          <member-type access='private'>
            <class-decl name='__sv_wrapper' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='140' column='1' id='type-id-599'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='_M_sv' type-id='type-id-862' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='143' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <member-type access='private'>
            <class-decl name='_Alloc_hider' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='158' column='1' id='type-id-597'>
              <base-class access='public' layout-offset-in-bits='0' type-id='type-id-358'/>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='_M_p' type-id='type-id-853' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='171' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <member-type access='private'>
            <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='180' column='1' id='type-id-863'>
              <data-member access='public'>
                <var-decl name='_M_local_buf' type-id='type-id-5' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='181' column='1'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='_M_allocated_capacity' type-id='type-id-602' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='182' column='1'/>
              </data-member>
            </union-decl>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='_M_dataplus' type-id='type-id-597' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='174' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='_M_string_length' type-id='type-id-602' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='175' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='128'>
            <var-decl name='' type-id='type-id-863' visibility='default'/>
          </data-member>
        </class-decl>
        <class-decl name='basic_string&lt;wchar_t, std::char_traits&lt;wchar_t&gt;, std::allocator&lt;wchar_t&gt; &gt;' size-in-bits='256' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='85' column='1' id='type-id-342'>
          <member-type access='private'>
            <typedef-decl name='_Char_alloc_type' type-id='type-id-865' filepath='/usr/include/c++/11/bits/basic_string.h' line='88' column='1' id='type-id-864'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='allocator_type' type-id='type-id-864' filepath='/usr/include/c++/11/bits/basic_string.h' line='95' column='1' id='type-id-347'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='size_type' type-id='type-id-866' filepath='/usr/include/c++/11/bits/basic_string.h' line='96' column='1' id='type-id-352'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-868' filepath='/usr/include/c++/11/bits/basic_string.h' line='98' column='1' id='type-id-867'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_reference' type-id='type-id-870' filepath='/usr/include/c++/11/bits/basic_string.h' line='99' column='1' id='type-id-869'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='pointer' type-id='type-id-872' filepath='/usr/include/c++/11/bits/basic_string.h' line='100' column='1' id='type-id-871'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_pointer' type-id='type-id-874' filepath='/usr/include/c++/11/bits/basic_string.h' line='101' column='1' id='type-id-873'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='iterator' type-id='type-id-285' filepath='/usr/include/c++/11/bits/basic_string.h' line='102' column='1' id='type-id-136'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_iterator' type-id='type-id-281' filepath='/usr/include/c++/11/bits/basic_string.h' line='104' column='1' id='type-id-142'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_reverse_iterator' type-id='type-id-844' filepath='/usr/include/c++/11/bits/basic_string.h' line='105' column='1' id='type-id-875'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reverse_iterator' type-id='type-id-845' filepath='/usr/include/c++/11/bits/basic_string.h' line='106' column='1' id='type-id-876'/>
          </member-type>
          <member-type access='protected'>
            <typedef-decl name='__const_iterator' type-id='type-id-142' filepath='/usr/include/c++/11/bits/basic_string.h' line='116' column='1' id='type-id-877'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='__sv_type' type-id='type-id-378' filepath='/usr/include/c++/11/bits/basic_string.h' line='122' column='1' id='type-id-878'/>
          </member-type>
          <member-type access='private'>
            <class-decl name='__sv_wrapper' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='140' column='1' id='type-id-611'>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='_M_sv' type-id='type-id-878' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='143' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <member-type access='private'>
            <class-decl name='_Alloc_hider' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='158' column='1' id='type-id-608'>
              <base-class access='public' layout-offset-in-bits='0' type-id='type-id-361'/>
              <data-member access='public' layout-offset-in-bits='0'>
                <var-decl name='_M_p' type-id='type-id-871' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='171' column='1'/>
              </data-member>
            </class-decl>
          </member-type>
          <member-type access='private'>
            <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='/usr/include/c++/11/bits/basic_string.h' line='177' column='1' id='type-id-879'>
              <underlying-type type-id='type-id-26'/>
              <enumerator name='_S_local_capacity' value='3'/>
            </enum-decl>
          </member-type>
          <member-type access='private'>
            <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='180' column='1' id='type-id-880'>
              <data-member access='public'>
                <var-decl name='_M_local_buf' type-id='type-id-32' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='181' column='1'/>
              </data-member>
              <data-member access='public'>
                <var-decl name='_M_allocated_capacity' type-id='type-id-352' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='182' column='1'/>
              </data-member>
            </union-decl>
          </member-type>
          <data-member access='public' static='yes'>
            <var-decl name='npos' type-id='type-id-353' mangled-name='_ZNSt7__cxx1112basic_stringIwSt11char_traitsIwESaIwEE4nposE' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='109' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='_M_dataplus' type-id='type-id-608' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='174' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='64'>
            <var-decl name='_M_string_length' type-id='type-id-352' visibility='default' filepath='/usr/include/c++/11/bits/basic_string.h' line='175' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='128'>
            <var-decl name='' type-id='type-id-880' visibility='default'/>
          </data-member>
          <member-function access='private'>
            <function-decl name='_M_construct&lt;wchar_t const*&gt;' mangled-name='_ZNSt7__cxx1112basic_stringIwSt11char_traitsIwESaIwEE12_M_constructIPKwEEvT_S8_St20forward_iterator_tag' filepath='/usr/include/c++/11/bits/basic_string.tcc' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt7__cxx1112basic_stringIwSt11char_traitsIwESaIwEE12_M_constructIPKwEEvT_S8_St20forward_iterator_tag@@WXU_3.2'>
              <parameter type-id='type-id-607' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-123' name='__beg' filepath='/usr/include/c++/11/bits/basic_string.tcc' line='207' column='1'/>
              <parameter type-id='type-id-123' name='__end' filepath='/usr/include/c++/11/bits/basic_string.tcc' line='207' column='1'/>
              <parameter type-id='type-id-801'/>
              <return type-id='type-id-30'/>
            </function-decl>
          </member-function>
          <member-function access='private'>
            <function-decl name='_M_construct&lt;__gnu_cxx::__normal_iterator&lt;wchar_t const*, std::__cxx11::basic_string&lt;wchar_t&gt; &gt; &gt;' mangled-name='_ZNSt7__cxx1112basic_stringIwSt11char_traitsIwESaIwEE12_M_constructIN9__gnu_cxx17__normal_iteratorIPKwS4_EEEEvT_SB_St20forward_iterator_tag' filepath='/usr/include/c++/11/bits/basic_string.tcc' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNSt7__cxx1112basic_stringIwSt11char_traitsIwESaIwEE12_M_constructIN9__gnu_cxx17__normal_iteratorIPKwS4_EEEEvT_SB_St20forward_iterator_tag@@WXU_3.2'>
              <parameter type-id='type-id-607' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-281' name='__beg' filepath='/usr/include/c++/11/bits/basic_string.tcc' line='207' column='1'/>
              <parameter type-id='type-id-281' name='__end' filepath='/usr/include/c++/11/bits/basic_string.tcc' line='207' column='1'/>
              <parameter type-id='type-id-801'/>
              <return type-id='type-id-30'/>
            </function-decl>
          </member-function>
        </class-decl>
      </namespace-decl>
    </namespace-decl>
    <namespace-decl name='__gnu_cxx'>
      <class-decl name='_Char_types&lt;wchar_t&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/char_traits.h' line='65' column='1' id='type-id-881'>
        <member-type access='public'>
          <typedef-decl name='int_type' type-id='type-id-6' filepath='/usr/include/c++/11/bits/char_traits.h' line='67' column='1' id='type-id-882'/>
        </member-type>
      </class-decl>
      <class-decl name='char_traits&lt;wchar_t&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='/usr/include/c++/11/bits/char_traits.h' line='90' column='1' id='type-id-883'>
        <member-type access='public'>
          <typedef-decl name='char_type' type-id='type-id-31' filepath='/usr/include/c++/11/bits/char_traits.h' line='92' column='1' id='type-id-288'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='int_type' type-id='type-id-882' filepath='/usr/include/c++/11/bits/char_traits.h' line='93' column='1' id='type-id-316'/>
        </member-type>
      </class-decl>
      <class-decl name='__normal_iterator&lt;char const*, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;' size-in-bits='64' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='987' column='1' id='type-id-275'>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-815' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='998' column='1' id='type-id-884'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-817' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='999' column='1' id='type-id-885'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-816' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='1000' column='1' id='type-id-886'/>
        </member-type>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='_M_current' type-id='type-id-186' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='990' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__normal_iterator&lt;char*, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; &gt;' size-in-bits='64' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='987' column='1' id='type-id-278'>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-805' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='998' column='1' id='type-id-887'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-808' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='999' column='1' id='type-id-888'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='pointer' type-id='type-id-807' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='1000' column='1' id='type-id-889'/>
        </member-type>
        <data-member access='protected' layout-offset-in-bits='0'>
          <var-decl name='_M_current' type-id='type-id-156' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='990' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__normal_iterator&lt;wchar_t const*, std::__cxx11::basic_string&lt;wchar_t, std::char_traits&lt;wchar_t&gt;, std::allocator&lt;wchar_t&gt; &gt; &gt;' size-in-bits='64' visibility='default' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='987' column='1' id='type-id-281'>
        <member-type access='public'>
          <typedef-decl name='iterator_category' type-id='type-id-819' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='996' column='1' id='type-id-890'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='difference_type' type-id='type-id-820' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='998' column='1' id='type-id-891'/>
        </member-type>
        <member-type access='public'>
          <typedef-decl name='reference' type-id='type-id-822' filepath='/usr/include/c++/11/bits/stl_iterator.h' line='999' column='1' id='type-id-892'/>
        </member-type>
        <member-type access='public'>
