<abi-corpus version='2.0' architecture='elf-amd-x86_64' soname='libwx_gtk3u_xrc-3.2.so.0'>
  <elf-needed>
    <dependency name='libwx_gtk3u_html-3.2.so.0'/>
    <dependency name='libwx_gtk3u_core-3.2.so.0'/>
    <dependency name='libwx_baseu_xml-3.2.so.0'/>
    <dependency name='libwx_baseu-3.2.so.0'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_Z23wxXmlInitResourceModulev' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN13wxXmlResource10AddHandlerEP20wxXmlResourceHandler' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN13wxXmlResource10DoGetXRCIDEPKci' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN13wxXmlResource10DoLoadFileERK8wxString' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN13wxXmlResource10LoadBitmapERK8wxString' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_ZTV25wxHyperlinkCtrlXmlHandler' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV25wxRadioBoxButtonsInfoList' size='48' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV25wxSystemThemedControlBase' size='40' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV25wxUnknownWidgetXmlHandler' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV26wxBitmapComboBoxXmlHandler' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV26wxDatePickerCtrlCommonBaseI24wxDateTimePickerCtrlBaseE' size='1752' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV26wxFilePickerCtrlXmlHandler' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV26wxFontPickerCtrlXmlHandler' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV26wxGenericCommandLinkButton' size='1832' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV26wxGenericDirCtrlXmlHandler' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV26wxScrolledWindowXmlHandler' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV26wxSpinCtrlDoubleXmlHandler' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV26wxSplitterWindowXmlHandler' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV27wxCollapsiblePaneXmlHandler' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV27wxEditableListBoxXmlHandler' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV28wxColourPickerCtrlXmlHandler' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV28wxXmlResourceHandlerImplBase' size='408' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV29wxActivityIndicatorXmlHandler' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV29wxCommandLinkButtonXmlHandler' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV29wxSimpleHtmlListBoxXmlHandler' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV30wxOwnerDrawnComboBoxXmlHandler' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV31wxPropertySheetDialogXmlHandler' size='80' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV32wxStdDialogButtonSizerXmlHandler' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV9wxPenBase' size='216' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/xrc/xh_activityindicator.cpp' language='LANG_C_plus_plus_14'>
    <type-decl name='__float128' size-in-bits='128' id='type-id-1'/>
    <type-decl name='__int128' size-in-bits='128' id='type-id-2'/>
    <type-decl name='bool' size-in-bits='8' id='type-id-3'/>
    <type-decl name='char' size-in-bits='8' id='type-id-4'/>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='128' id='type-id-5'>
      <subrange length='16' type-id='type-id-6' id='type-id-7'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='8' id='type-id-8'>
      <subrange length='1' type-id='type-id-6' id='type-id-9'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='160' id='type-id-10'>
      <subrange length='20' type-id='type-id-6' id='type-id-11'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='32' id='type-id-12'>
      <subrange length='4' type-id='type-id-6' id='type-id-13'/>
    </array-type-def>
    <class-decl name='typedef __va_list_tag __va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-16' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='type-id-17'/>
    <type-decl name='float' size-in-bits='32' id='type-id-18'/>
    <type-decl name='int' size-in-bits='32' id='type-id-19'/>
    <type-decl name='long double' size-in-bits='128' id='type-id-20'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-21'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-22'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-23'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-24'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-25'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-26'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-27'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-15'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-6'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-28'/>
    <type-decl name='variadic parameter type' id='type-id-29'/>
    <type-decl name='void' id='type-id-30'/>
    <type-decl name='wchar_t' size-in-bits='32' id='type-id-31'/>
    <array-type-def dimensions='1' type-id='type-id-31' size-in-bits='128' id='type-id-32'>
      <subrange length='4' type-id='type-id-6' id='type-id-13'/>
    </array-type-def>
    <class-decl name='wxActivityIndicatorBase' size-in-bits='5696' visibility='default' filepath='include/wx/activityindicator.h' line='25' column='1' id='type-id-33'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-34'/>
      <member-function access='public' const='yes' vtable-offset='74'>
        <function-decl name='AcceptsFocus' mangled-name='_ZNK23wxActivityIndicatorBase12AcceptsFocusEv' filepath='include/wx/activityindicator.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='109'>
        <function-decl name='HasTransparentBackground' mangled-name='_ZN23wxActivityIndicatorBase24HasTransparentBackgroundEv' filepath='include/wx/activityindicator.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-36' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='161'>
        <function-decl name='GetDefaultBorder' mangled-name='_ZNK23wxActivityIndicatorBase16GetDefaultBorderEv' filepath='include/wx/activityindicator.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <return type-id='type-id-37'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='212'>
        <function-decl name='Start' mangled-name='_ZN23wxActivityIndicatorBase5StartEv' filepath='include/wx/activityindicator.h' line='29' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-36' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='213'>
        <function-decl name='Stop' mangled-name='_ZN23wxActivityIndicatorBase4StopEv' filepath='include/wx/activityindicator.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-36' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='214'>
        <function-decl name='IsRunning' mangled-name='_ZNK23wxActivityIndicatorBase9IsRunningEv' filepath='include/wx/activityindicator.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxArrayString' size-in-bits='320' visibility='default' filepath='include/wx/arrstr.h' line='157' column='1' id='type-id-38'>
      <member-type access='public'>
        <typedef-decl name='CompareFunction' type-id='type-id-40' filepath='include/wx/arrstr.h' line='161' column='1' id='type-id-39'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CompareFunction2' type-id='type-id-42' filepath='include/wx/arrstr.h' line='165' column='1' id='type-id-41'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-44' filepath='include/wx/arrstr.h' line='267' column='1' id='type-id-43'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-46' filepath='include/wx/arrstr.h' line='270' column='1' id='type-id-45'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-48' filepath='include/wx/arrstr.h' line='271' column='1' id='type-id-47'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-50' filepath='include/wx/arrstr.h' line='272' column='1' id='type-id-49'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-52' filepath='include/wx/arrstr.h' line='273' column='1' id='type-id-51'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-54' filepath='include/wx/arrstr.h' line='275' column='1' id='type-id-53'/>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator' size-in-bits='64' visibility='default' filepath='include/wx/arrstr.h' line='278' column='1' id='type-id-55'>
          <member-type access='private'>
            <typedef-decl name='value_type' type-id='type-id-44' filepath='include/wx/arrstr.h' line='280' column='1' id='type-id-56'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='type-id-58' filepath='include/wx/arrstr.h' line='281' column='1' id='type-id-57'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reference' type-id='type-id-60' filepath='include/wx/arrstr.h' line='282' column='1' id='type-id-59'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='itor' type-id='type-id-55' filepath='include/wx/arrstr.h' line='283' column='1' id='type-id-61'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_ptr' type-id='type-id-57' visibility='default' filepath='include/wx/arrstr.h' line='289' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_reverse_iterator' size-in-bits='64' visibility='default' filepath='include/wx/arrstr.h' line='304' column='1' id='type-id-62'>
          <member-type access='private'>
            <typedef-decl name='value_type' type-id='type-id-44' filepath='include/wx/arrstr.h' line='306' column='1' id='type-id-63'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='type-id-65' filepath='include/wx/arrstr.h' line='307' column='1' id='type-id-64'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reference' type-id='type-id-67' filepath='include/wx/arrstr.h' line='308' column='1' id='type-id-66'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='itor' type-id='type-id-62' filepath='include/wx/arrstr.h' line='309' column='1' id='type-id-68'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_ptr' type-id='type-id-64' visibility='default' filepath='include/wx/arrstr.h' line='315' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_compareFunction' type-id='type-id-39' visibility='default' filepath='include/wx/arrstr.h' line='393' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_nSize' type-id='type-id-54' visibility='default' filepath='include/wx/arrstr.h' line='406' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_nCount' type-id='type-id-54' visibility='default' filepath='include/wx/arrstr.h' line='407' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_pItems' type-id='type-id-69' visibility='default' filepath='include/wx/arrstr.h' line='409' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_autoSort' type-id='type-id-3' visibility='default' filepath='include/wx/arrstr.h' line='411' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxArtClient' type-id='type-id-44' filepath='include/wx/artprov.h' line='30' column='1' id='type-id-70'/>
    <class-decl name='wxBitmapBundle' size-in-bits='64' visibility='default' filepath='include/wx/bmpbndl.h' line='28' column='1' id='type-id-71'>
      <member-type access='private'>
        <typedef-decl name='wxBitmapBundleImplPtr' type-id='type-id-73' filepath='include/wx/bmpbndl.h' line='173' column='1' id='type-id-72'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_impl' type-id='type-id-72' visibility='default' filepath='include/wx/bmpbndl.h' line='179' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxScopedCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='66' column='1' id='type-id-74'>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-4' filepath='include/wx/buffer.h' line='69' column='1' id='type-id-75'/>
      </member-type>
      <member-type access='protected'>
        <class-decl name='Data' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='164' column='1' id='type-id-76'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-77'/>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-78' visibility='default' filepath='include/wx/buffer.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxScopedCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='66' column='1' id='type-id-79'>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-31' filepath='include/wx/buffer.h' line='69' column='1' id='type-id-80'/>
      </member-type>
      <member-type access='protected'>
        <class-decl name='Data' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='164' column='1' id='type-id-81'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-77'/>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-82' visibility='default' filepath='include/wx/buffer.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxScopedCharBuffer' type-id='type-id-74' filepath='include/wx/buffer.h' line='241' column='1' id='type-id-83'/>
    <typedef-decl name='wxScopedWCharBuffer' type-id='type-id-79' filepath='include/wx/buffer.h' line='242' column='1' id='type-id-84'/>
    <class-decl name='wxCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='247' column='1' id='type-id-85'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-74'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-4' filepath='include/wx/buffer.h' line='253' column='1' id='type-id-86'/>
      </member-type>
    </class-decl>
    <class-decl name='wxCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='247' column='1' id='type-id-87'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-79'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-31' filepath='include/wx/buffer.h' line='253' column='1' id='type-id-88'/>
      </member-type>
    </class-decl>
    <class-decl name='wxCharBuffer' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='357' column='1' id='type-id-89'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-85'/>
      <member-type access='public'>
        <typedef-decl name='wxCharTypeBufferBase' type-id='type-id-85' filepath='include/wx/buffer.h' line='360' column='1' id='type-id-90'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='wxScopedCharTypeBufferBase' type-id='type-id-74' filepath='include/wx/buffer.h' line='361' column='1' id='type-id-91'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWritableCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='393' column='1' id='type-id-92'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-85'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-75' filepath='include/wx/buffer.h' line='396' column='1' id='type-id-93'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWritableCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='393' column='1' id='type-id-94'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-87'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-80' filepath='include/wx/buffer.h' line='396' column='1' id='type-id-95'/>
      </member-type>
    </class-decl>
    <typedef-decl name='wxWritableCharBuffer' type-id='type-id-92' filepath='include/wx/buffer.h' line='410' column='1' id='type-id-96'/>
    <typedef-decl name='wxWritableWCharBuffer' type-id='type-id-94' filepath='include/wx/buffer.h' line='411' column='1' id='type-id-97'/>
    <typedef-decl name='wxChar' type-id='type-id-31' filepath='include/wx/chartype.h' line='123' column='1' id='type-id-98'/>
    <typedef-decl name='wxStringCharType' type-id='type-id-31' filepath='include/wx/chartype.h' line='170' column='1' id='type-id-99'/>
    <class-decl name='wxClientData' size-in-bits='64' visibility='default' filepath='include/wx/clntdata.h' line='98' column='1' id='type-id-100'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxClientData' mangled-name='_ZN12wxClientDataD4Ev' filepath='include/wx/clntdata.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-101' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='wxDirection' filepath='include/wx/defs.h' line='1363' column='1' id='type-id-102'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxLEFT' value='16'/>
      <enumerator name='wxRIGHT' value='32'/>
      <enumerator name='wxUP' value='64'/>
      <enumerator name='wxDOWN' value='128'/>
      <enumerator name='wxTOP' value='64'/>
      <enumerator name='wxBOTTOM' value='128'/>
      <enumerator name='wxNORTH' value='64'/>
      <enumerator name='wxSOUTH' value='128'/>
      <enumerator name='wxWEST' value='16'/>
      <enumerator name='wxEAST' value='32'/>
      <enumerator name='wxALL' value='240'/>
      <enumerator name='wxDIRECTION_MASK' value='240'/>
    </enum-decl>
    <enum-decl name='wxBorder' filepath='include/wx/defs.h' line='1443' column='1' id='type-id-37'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxBORDER_DEFAULT' value='0'/>
      <enumerator name='wxBORDER_NONE' value='2097152'/>
      <enumerator name='wxBORDER_STATIC' value='16777216'/>
      <enumerator name='wxBORDER_SIMPLE' value='33554432'/>
      <enumerator name='wxBORDER_RAISED' value='67108864'/>
      <enumerator name='wxBORDER_SUNKEN' value='134217728'/>
      <enumerator name='wxBORDER_DOUBLE' value='268435456'/>
      <enumerator name='wxBORDER_THEME' value='268435456'/>
      <enumerator name='wxBORDER_MASK' value='522190848'/>
    </enum-decl>
    <enum-decl name='wxBackgroundStyle' filepath='include/wx/defs.h' line='1816' column='1' id='type-id-103'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxBG_STYLE_ERASE' value='0'/>
      <enumerator name='wxBG_STYLE_SYSTEM' value='1'/>
      <enumerator name='wxBG_STYLE_PAINT' value='2'/>
      <enumerator name='wxBG_STYLE_TRANSPARENT' value='3'/>
      <enumerator name='wxBG_STYLE_COLOUR' value='4'/>
      <enumerator name='wxBG_STYLE_CUSTOM' value='2'/>
    </enum-decl>
    <typedef-decl name='wxWindowID' type-id='type-id-19' filepath='include/wx/defs.h' line='2069' column='1' id='type-id-104'/>
    <enum-decl name='wxHitTest' filepath='include/wx/defs.h' line='2099' column='1' id='type-id-105'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxHT_NOWHERE' value='0'/>
      <enumerator name='wxHT_SCROLLBAR_FIRST' value='0'/>
      <enumerator name='wxHT_SCROLLBAR_ARROW_LINE_1' value='1'/>
      <enumerator name='wxHT_SCROLLBAR_ARROW_LINE_2' value='2'/>
      <enumerator name='wxHT_SCROLLBAR_ARROW_PAGE_1' value='3'/>
      <enumerator name='wxHT_SCROLLBAR_ARROW_PAGE_2' value='4'/>
      <enumerator name='wxHT_SCROLLBAR_THUMB' value='5'/>
      <enumerator name='wxHT_SCROLLBAR_BAR_1' value='6'/>
      <enumerator name='wxHT_SCROLLBAR_BAR_2' value='7'/>
      <enumerator name='wxHT_SCROLLBAR_LAST' value='8'/>
      <enumerator name='wxHT_WINDOW_OUTSIDE' value='9'/>
      <enumerator name='wxHT_WINDOW_INSIDE' value='10'/>
      <enumerator name='wxHT_WINDOW_VERT_SCROLLBAR' value='11'/>
      <enumerator name='wxHT_WINDOW_HORZ_SCROLLBAR' value='12'/>
      <enumerator name='wxHT_WINDOW_CORNER' value='13'/>
      <enumerator name='wxHT_MAX' value='14'/>
    </enum-decl>
    <typedef-decl name='GdkWindow' type-id='type-id-106' filepath='include/wx/defs.h' line='3091' column='1' id='type-id-107'/>
    <typedef-decl name='GtkWidget' type-id='type-id-108' filepath='include/wx/defs.h' line='3103' column='1' id='type-id-109'/>
    <typedef-decl name='GtkRcStyle' type-id='type-id-110' filepath='include/wx/defs.h' line='3104' column='1' id='type-id-111'/>
    <typedef-decl name='WXWidget' type-id='type-id-112' filepath='include/wx/defs.h' line='3115' column='1' id='type-id-113'/>
    <class-decl name='wxArray_SortFunction&lt;_GdkWindow*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-114'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-116' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-115'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-115' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArray_SortFunction&lt;const wxEventTableEntry*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-117'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-119' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-118'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-118' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArray_SortFunction&lt;int&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-120'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-122' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-121'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-121' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;_GdkWindow*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-123'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-125' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-124'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-124' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;const wxEventTableEntry*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-126'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-128' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-127'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-127' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;int&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-129'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-131' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-130'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-130' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxBaseArray&lt;_GdkWindow*, wxSortedArray_SortFunction&lt;_GdkWindow*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-132'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-133'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-124' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-134'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-115' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-135'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-137' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-136'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseArray&lt;const wxEventTableEntry*, wxSortedArray_SortFunction&lt;const wxEventTableEntry*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-138'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-139'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-127' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-140'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-118' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-141'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-143' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-142'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseArray&lt;int, wxSortedArray_SortFunction&lt;int&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-144'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-145'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-130' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-146'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-121' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-147'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-149' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-148'/>
      </member-type>
    </class-decl>
    <class-decl name='wxArrayInt' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='858' column='1' id='type-id-150'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-144'/>
    </class-decl>
    <typedef-decl name='wxEventType' type-id='type-id-19' filepath='include/wx/event.h' line='77' column='1' id='type-id-151'/>
    <class-decl name='wxObjectEventFunctor' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='258' column='1' id='type-id-152'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-153'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-154' visibility='default' filepath='include/wx/event.h' line='288' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxObjectEventFunctorclEP12wxEvtHandlerR7wxEvent' filepath='include/wx/event.h' line='4105' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-155' is-artificial='yes'/>
          <parameter type-id='type-id-154'/>
          <parameter type-id='type-id-156'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxObjectEventFunctor10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-157' is-artificial='yes'/>
          <parameter type-id='type-id-158'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxObjectEventFunctor13GetEvtHandlerEv' filepath='include/wx/event.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-157' is-artificial='yes'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxObjectEventFunctor12GetEvtMethodEv' filepath='include/wx/event.h' line='284' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-157' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEventTableEntryBase' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3469' column='1' id='type-id-159'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_id' type-id='type-id-19' visibility='default' filepath='include/wx/event.h' line='3504' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='m_lastId' type-id='type-id-19' visibility='default' filepath='include/wx/event.h' line='3505' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='m_fn' type-id='type-id-160' visibility='default' filepath='include/wx/event.h' line='3508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='m_callbackUserData' type-id='type-id-161' visibility='default' filepath='include/wx/event.h' line='3511' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTableEntry' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3518' column='1' id='type-id-162'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-159'/>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_eventType' type-id='type-id-163' visibility='default' filepath='include/wx/event.h' line='3532' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxDynamicEventTableEntry' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3539' column='1' id='type-id-164'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-159'/>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_eventType' type-id='type-id-19' visibility='default' filepath='include/wx/event.h' line='3550' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTable' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3560' column='1' id='type-id-165'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='baseTable' type-id='type-id-166' visibility='default' filepath='include/wx/event.h' line='3562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='entries' type-id='type-id-167' visibility='default' filepath='include/wx/event.h' line='3563' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTableEntryPointerArray' size-in-bits='192' visibility='default' filepath='include/wx/event.h' line='3570' column='1' id='type-id-168'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-138'/>
    </class-decl>
    <class-decl name='wxEventHashTable' size-in-bits='384' visibility='default' filepath='include/wx/event.h' line='3572' column='1' id='type-id-169'>
      <member-type access='private'>
        <class-decl name='EventTypeTable' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3576' column='1' id='type-id-170'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='eventType' type-id='type-id-151' visibility='default' filepath='include/wx/event.h' line='3578' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='eventEntryTable' type-id='type-id-168' visibility='default' filepath='include/wx/event.h' line='3579' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='EventTypeTablePointer' type-id='type-id-172' filepath='include/wx/event.h' line='3581' column='1' id='type-id-171'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_table' type-id='type-id-173' visibility='default' filepath='include/wx/event.h' line='3617' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_rebuildHash' type-id='type-id-3' visibility='default' filepath='include/wx/event.h' line='3618' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_size' type-id='type-id-54' visibility='default' filepath='include/wx/event.h' line='3620' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_eventTypeTable' type-id='type-id-174' visibility='default' filepath='include/wx/event.h' line='3621' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='256'>
        <var-decl name='m_previous' type-id='type-id-175' visibility='default' filepath='include/wx/event.h' line='3624' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='320'>
        <var-decl name='m_next' type-id='type-id-175' visibility='default' filepath='include/wx/event.h' line='3625' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSize' size-in-bits='64' visibility='default' filepath='include/wx/gdicmn.h' line='282' column='1' id='type-id-176'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='286' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRealPoint' size-in-bits='128' visibility='default' filepath='include/wx/gdicmn.h' line='459' column='1' id='type-id-177'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-17' visibility='default' filepath='include/wx/gdicmn.h' line='462' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='y' type-id='type-id-17' visibility='default' filepath='include/wx/gdicmn.h' line='463' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxPoint' size-in-bits='64' visibility='default' filepath='include/wx/gdicmn.h' line='577' column='1' id='type-id-178'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='580' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='580' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRect' size-in-bits='128' visibility='default' filepath='include/wx/gdicmn.h' line='733' column='1' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='width' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='height' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GdkEventKey' type-id='type-id-180' filepath='include/wx/gtk/window.h' line='25' column='1' id='type-id-181'/>
    <class-decl name='wxArrayGdkWindows' size-in-bits='192' visibility='default' filepath='include/wx/gtk/window.h' line='28' column='1' id='type-id-182'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-132'/>
    </class-decl>
    <enum-decl name='wxLayoutDirection' filepath='include/wx/localedefs.h' line='20' column='1' id='type-id-183'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxLayout_Default' value='0'/>
      <enumerator name='wxLayout_LeftToRight' value='1'/>
      <enumerator name='wxLayout_RightToLeft' value='2'/>
    </enum-decl>
    <class-decl name='wxRefCounter' size-in-bits='128' visibility='default' filepath='include/wx/object.h' line='228' column='1' id='type-id-184'>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_count' type-id='type-id-19' visibility='default' filepath='include/wx/object.h' line='245' column='1'/>
      </data-member>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRefCounter' mangled-name='_ZN12wxRefCounterD4Ev' filepath='include/wx/object.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-185' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='wxObjectRefData' type-id='type-id-184' filepath='include/wx/object.h' line='258' column='1' id='type-id-186'/>
    <class-decl name='wxObjectDataPtr&lt;wxBitmapBundleImpl&gt;' size-in-bits='64' visibility='default' filepath='include/wx/object.h' line='266' column='1' id='type-id-73'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_ptr' type-id='type-id-187' visibility='default' filepath='include/wx/object.h' line='366' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxObjectConstructorFn' type-id='type-id-188' filepath='include/wx/rtti.h' line='39' column='1' id='type-id-189'/>
    <class-decl name='wxClassInfo' size-in-bits='384' visibility='default' filepath='include/wx/rtti.h' line='41' column='1' id='type-id-190'>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-191'>
          <member-type access='private'>
            <typedef-decl name='Node' type-id='type-id-193' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-192'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-191' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-194'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-196' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-195'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-197' visibility='default' filepath='include/wx/rtti.h' line='106' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_table' type-id='type-id-198' visibility='default' filepath='include/wx/rtti.h' line='106' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_className' type-id='type-id-199' visibility='default' filepath='include/wx/rtti.h' line='109' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_objectSize' type-id='type-id-19' visibility='default' filepath='include/wx/rtti.h' line='110' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_objectConstructor' type-id='type-id-189' visibility='default' filepath='include/wx/rtti.h' line='111' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_baseInfo1' type-id='type-id-196' visibility='default' filepath='include/wx/rtti.h' line='115' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_baseInfo2' type-id='type-id-196' visibility='default' filepath='include/wx/rtti.h' line='116' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='sm_first' type-id='type-id-200' mangled-name='_ZN11wxClassInfo8sm_firstE' visibility='default' filepath='include/wx/rtti.h' line='121' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='m_next' type-id='type-id-200' visibility='default' filepath='include/wx/rtti.h' line='122' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxCStrData' size-in-bits='192' visibility='default' filepath='include/wx/string.h' line='152' column='1' id='type-id-201'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_str' type-id='type-id-202' visibility='default' filepath='include/wx/string.h' line='245' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_offset' type-id='type-id-54' visibility='default' filepath='include/wx/string.h' line='252' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_owned' type-id='type-id-3' visibility='default' filepath='include/wx/string.h' line='254' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxString' size-in-bits='384' visibility='default' filepath='include/wx/string.h' line='301' column='1' id='type-id-44'>
      <member-type access='private'>
        <class-decl name='SubstrBufFromType&lt;wchar_t const*&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='337' column='1' id='type-id-203'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='data' type-id='type-id-204' visibility='default' filepath='include/wx/string.h' line='339' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='len' type-id='type-id-54' visibility='default' filepath='include/wx/string.h' line='340' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='SubstrBufFromType&lt;wxScopedCharTypeBuffer&lt;wchar_t&gt; &gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='337' column='1' id='type-id-205'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='data' type-id='type-id-79' visibility='default' filepath='include/wx/string.h' line='339' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='len' type-id='type-id-54' visibility='default' filepath='include/wx/string.h' line='340' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='SubstrBufFromWC' type-id='type-id-203' filepath='include/wx/string.h' line='354' column='1' id='type-id-206'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='SubstrBufFromMB' type-id='type-id-205' filepath='include/wx/string.h' line='355' column='1' id='type-id-207'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-54' filepath='include/wx/string.h' line='752' column='1' id='type-id-208'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-210' filepath='include/wx/string.h' line='753' column='1' id='type-id-209'/>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='963' column='1' id='type-id-211'>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-213' filepath='include/wx/string.h' line='965' column='1' id='type-id-212'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-215' filepath='include/wx/string.h' line='965' column='1' id='type-id-214'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='underlying_iterator' type-id='type-id-217' filepath='include/wx/string.h' line='965' column='1' id='type-id-216'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-216' visibility='default' filepath='include/wx/string.h' line='965' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='994' column='1' id='type-id-218'>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-213' filepath='include/wx/string.h' line='998' column='1' id='type-id-219'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-221' filepath='include/wx/string.h' line='998' column='1' id='type-id-220'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='underlying_iterator' type-id='type-id-223' filepath='include/wx/string.h' line='998' column='1' id='type-id-222'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-222' visibility='default' filepath='include/wx/string.h' line='998' column='1'/>
          </data-member>
          <member-function access='public' const='yes'>
            <function-decl name='operator!=' mangled-name='_ZNK8wxString14const_iteratorneERKNS_8iteratorE' filepath='include/wx/string.h' line='4175' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8wxString14const_iteratorneERKNS_8iteratorE@@WXU_3.2'>
              <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-225' name='i' filepath='include/wx/string.h' line='4175' column='1'/>
              <return type-id='type-id-3'/>
            </function-decl>
          </member-function>
          <member-function access='public' const='yes'>
            <function-decl name='operator==' mangled-name='_ZNK8wxString14const_iteratoreqERKNS_8iteratorE' filepath='include/wx/string.h' line='4173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK8wxString14const_iteratoreqERKNS_8iteratorE@@WXU_3.2'>
              <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
              <parameter type-id='type-id-225' name='i' filepath='include/wx/string.h' line='4175' column='1'/>
              <return type-id='type-id-3'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator_impl&lt;wxString::const_iterator&gt;' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='1060' column='1' id='type-id-226'>
          <member-type access='public'>
            <typedef-decl name='iterator_type' type-id='type-id-218' filepath='include/wx/string.h' line='1063' column='1' id='type-id-227'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-219' filepath='include/wx/string.h' line='1067' column='1' id='type-id-228'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-220' filepath='include/wx/string.h' line='1068' column='1' id='type-id-229'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-227' visibility='default' filepath='include/wx/string.h' line='1115' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator_impl&lt;wxString::iterator&gt;' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='1060' column='1' id='type-id-230'>
          <member-type access='public'>
            <typedef-decl name='iterator_type' type-id='type-id-211' filepath='include/wx/string.h' line='1063' column='1' id='type-id-231'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-212' filepath='include/wx/string.h' line='1067' column='1' id='type-id-232'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-214' filepath='include/wx/string.h' line='1068' column='1' id='type-id-233'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-231' visibility='default' filepath='include/wx/string.h' line='1115' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reverse_iterator' type-id='type-id-230' filepath='include/wx/string.h' line='1118' column='1' id='type-id-234'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reverse_iterator' type-id='type-id-226' filepath='include/wx/string.h' line='1119' column='1' id='type-id-235'/>
      </member-type>
      <member-type access='public'>
        <enum-decl name='caseCompare' filepath='include/wx/string.h' line='2386' column='1' id='type-id-236'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='exact' value='0'/>
          <enumerator name='ignoreCase' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='stripType' filepath='include/wx/string.h' line='2388' column='1' id='type-id-237'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='leading' value='1'/>
          <enumerator name='trailing' value='2'/>
          <enumerator name='both' value='3'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='ConvertedBuffer&lt;char&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='3599' column='1' id='type-id-238'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_str' type-id='type-id-239' visibility='default' filepath='include/wx/string.h' line='3625' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_len' type-id='type-id-54' visibility='default' filepath='include/wx/string.h' line='3626' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_impl' type-id='type-id-240' visibility='default' filepath='include/wx/string.h' line='3589' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_convertedToChar' type-id='type-id-238' visibility='default' filepath='include/wx/string.h' line='3677' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='npos' type-id='type-id-241' mangled-name='_ZN8wxString4nposE' visibility='default' filepath='include/wx/string.h' line='308' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxStdWideString' type-id='type-id-242' filepath='include/wx/stringimpl.h' line='70' column='1' id='type-id-243'/>
    <typedef-decl name='wxStdString' type-id='type-id-243' filepath='include/wx/stringimpl.h' line='76' column='1' id='type-id-244'/>
    <typedef-decl name='wxStringImpl' type-id='type-id-244' filepath='include/wx/stringimpl.h' line='90' column='1' id='type-id-240'/>
    <class-decl name='wxFormatString' size-in-bits='320' visibility='default' filepath='include/wx/strvararg.h' line='137' column='1' id='type-id-245'>
      <member-type access='public'>
        <enum-decl name='ArgumentType' filepath='include/wx/strvararg.h' line='161' column='1' id='type-id-246'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Arg_Unused' value='0'/>
          <enumerator name='Arg_Char' value='1'/>
          <enumerator name='Arg_Pointer' value='2'/>
          <enumerator name='Arg_String' value='6'/>
          <enumerator name='Arg_Int' value='9'/>
          <enumerator name='Arg_LongInt' value='16'/>
          <enumerator name='Arg_LongLongInt' value='16'/>
          <enumerator name='Arg_Double' value='64'/>
          <enumerator name='Arg_LongDouble' value='128'/>
          <enumerator name='Arg_Size_t' value='16'/>
          <enumerator name='Arg_IntPtr' value='512'/>
          <enumerator name='Arg_ShortIntPtr' value='1024'/>
          <enumerator name='Arg_LongIntPtr' value='2048'/>
          <enumerator name='Arg_Unknown' value='32768'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_convertedWChar' type-id='type-id-84' visibility='default' filepath='include/wx/strvararg.h' line='232' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_char' type-id='type-id-83' visibility='default' filepath='include/wx/strvararg.h' line='236' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_wchar' type-id='type-id-84' visibility='default' filepath='include/wx/strvararg.h' line='237' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_str' type-id='type-id-247' visibility='default' filepath='include/wx/strvararg.h' line='242' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_cstr' type-id='type-id-248' visibility='default' filepath='include/wx/strvararg.h' line='243' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxMutexError' filepath='include/wx/thread.h' line='28' column='1' id='type-id-249'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxMUTEX_NO_ERROR' value='0'/>
      <enumerator name='wxMUTEX_INVALID' value='1'/>
      <enumerator name='wxMUTEX_DEAD_LOCK' value='2'/>
      <enumerator name='wxMUTEX_BUSY' value='3'/>
      <enumerator name='wxMUTEX_UNLOCKED' value='4'/>
      <enumerator name='wxMUTEX_TIMEOUT' value='5'/>
      <enumerator name='wxMUTEX_MISC_ERROR' value='6'/>
    </enum-decl>
    <enum-decl name='wxThreadError' filepath='include/wx/thread.h' line='57' column='1' id='type-id-250'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxTHREAD_NO_ERROR' value='0'/>
      <enumerator name='wxTHREAD_NO_RESOURCE' value='1'/>
      <enumerator name='wxTHREAD_RUNNING' value='2'/>
      <enumerator name='wxTHREAD_NOT_RUNNING' value='3'/>
      <enumerator name='wxTHREAD_KILLED' value='4'/>
      <enumerator name='wxTHREAD_MISC_ERROR' value='5'/>
    </enum-decl>
    <enum-decl name='wxThreadKind' filepath='include/wx/thread.h' line='67' column='1' id='type-id-251'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxTHREAD_DETACHED' value='0'/>
      <enumerator name='wxTHREAD_JOINABLE' value='1'/>
    </enum-decl>
    <enum-decl name='wxMutexType' filepath='include/wx/thread.h' line='112' column='1' id='type-id-252'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxMUTEX_DEFAULT' value='0'/>
      <enumerator name='wxMUTEX_RECURSIVE' value='1'/>
    </enum-decl>
    <class-decl name='wxMutex' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='137' column='1' id='type-id-253'>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_internal' type-id='type-id-254' visibility='default' filepath='include/wx/thread.h' line='174' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxCriticalSectionType' filepath='include/wx/thread.h' line='231' column='1' id='type-id-255'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxCRITSEC_DEFAULT' value='0'/>
      <enumerator name='wxCRITSEC_NON_RECURSIVE' value='1'/>
    </enum-decl>
    <class-decl name='wxCriticalSection' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='242' column='1' id='type-id-256'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_mutex' type-id='type-id-253' visibility='default' filepath='include/wx/thread.h' line='259' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='Leave' mangled-name='_ZN17wxCriticalSection5LeaveEv' filepath='include/wx/thread.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxCriticalSection5LeaveEv@@WXU_3.2'>
          <parameter type-id='type-id-257' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Enter' mangled-name='_ZN17wxCriticalSection5EnterEv' filepath='include/wx/thread.h' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxCriticalSection5EnterEv@@WXU_3.2'>
          <parameter type-id='type-id-257' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxCriticalSectionLocker' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='301' column='1' id='type-id-258'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_critsect' type-id='type-id-259' visibility='default' filepath='include/wx/thread.h' line='316' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxThreadHelperThread' size-in-bits='320' visibility='default' filepath='include/wx/thread.h' line='658' column='1' id='type-id-260'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-261'/>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_owner' type-id='type-id-262' visibility='default' filepath='include/wx/thread.h' line='673' column='1'/>
      </data-member>
      <member-function access='protected' vtable-offset='3'>
        <function-decl name='Entry' mangled-name='_ZN20wxThreadHelperThread5EntryEv' filepath='include/wx/thread.h' line='761' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-263' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxThreadHelper' size-in-bits='256' visibility='default' filepath='include/wx/thread.h' line='686' column='1' id='type-id-264'>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_thread' type-id='type-id-265' visibility='default' filepath='include/wx/thread.h' line='748' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_kind' type-id='type-id-251' visibility='default' filepath='include/wx/thread.h' line='749' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_critSection' type-id='type-id-256' visibility='default' filepath='include/wx/thread.h' line='750' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThreadHelper' mangled-name='_ZN14wxThreadHelperD4Ev' filepath='include/wx/thread.h' line='714' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-266' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='Entry' mangled-name='_ZN14wxThreadHelper5EntryEv' filepath='include/wx/thread.h' line='735' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-266' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxTypeIdentifier' size-in-bits='64' visibility='default' filepath='include/wx/typeinfo.h' line='63' column='1' id='type-id-267'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_className' type-id='type-id-268' visibility='default' filepath='include/wx/typeinfo.h' line='81' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxCoord' type-id='type-id-19' filepath='include/wx/types.h' line='26' column='1' id='type-id-269'/>
    <typedef-decl name='wxUint8' type-id='type-id-27' filepath='include/wx/types.h' line='43' column='1' id='type-id-270'/>
    <typedef-decl name='wxByte' type-id='type-id-270' filepath='include/wx/types.h' line='44' column='1' id='type-id-271'/>
    <typedef-decl name='wxUint16' type-id='type-id-28' filepath='include/wx/types.h' line='57' column='1' id='type-id-272'/>
    <typedef-decl name='wxUint32' type-id='type-id-15' filepath='include/wx/types.h' line='146' column='1' id='type-id-273'/>
    <class-decl name='wxUniChar' size-in-bits='32' visibility='default' filepath='include/wx/unichar.h' line='29' column='1' id='type-id-221'>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-273' filepath='include/wx/unichar.h' line='35' column='1' id='type-id-274'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_value' type-id='type-id-274' visibility='default' filepath='include/wx/unichar.h' line='212' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxUniCharRef' size-in-bits='64' visibility='default' filepath='include/wx/unichar.h' line='220' column='1' id='type-id-215'>
      <member-type access='private'>
        <typedef-decl name='iterator' type-id='type-id-217' filepath='include/wx/unichar.h' line='223' column='1' id='type-id-275'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_pos' type-id='type-id-275' visibility='default' filepath='include/wx/unichar.h' line='325' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVector&lt;_GdkWindow*&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-133'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-54' filepath='include/wx/vector.h' line='179' column='1' id='type-id-276'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-278' filepath='include/wx/vector.h' line='181' column='1' id='type-id-277'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-280' filepath='include/wx/vector.h' line='184' column='1' id='type-id-279'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-282' filepath='include/wx/vector.h' line='185' column='1' id='type-id-281'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-283' filepath='include/wx/vector.h' line='187' column='1' id='type-id-137'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-284'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-285'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_INITIAL_SIZE' type-id='type-id-286' mangled-name='_ZN8wxVectorIP10_GdkWindowE18ALLOC_INITIAL_SIZEE' visibility='default' filepath='include/wx/vector.h' line='592' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-276' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-276' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-280' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVector&lt;const wxEventTableEntry*&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-139'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-54' filepath='include/wx/vector.h' line='179' column='1' id='type-id-287'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-167' filepath='include/wx/vector.h' line='181' column='1' id='type-id-288'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-290' filepath='include/wx/vector.h' line='184' column='1' id='type-id-289'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-292' filepath='include/wx/vector.h' line='185' column='1' id='type-id-291'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-293' filepath='include/wx/vector.h' line='187' column='1' id='type-id-143'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-294'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-295'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_INITIAL_SIZE' type-id='type-id-296' mangled-name='_ZN8wxVectorIPK17wxEventTableEntryE18ALLOC_INITIAL_SIZEE' visibility='default' filepath='include/wx/vector.h' line='592' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-287' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-287' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-290' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVector&lt;int&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-145'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-54' filepath='include/wx/vector.h' line='179' column='1' id='type-id-297'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-19' filepath='include/wx/vector.h' line='181' column='1' id='type-id-298'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_pointer' type-id='type-id-300' filepath='include/wx/vector.h' line='183' column='1' id='type-id-299'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-302' filepath='include/wx/vector.h' line='184' column='1' id='type-id-301'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-300' filepath='include/wx/vector.h' line='185' column='1' id='type-id-303'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-304' filepath='include/wx/vector.h' line='187' column='1' id='type-id-149'/>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator' size-in-bits='64' visibility='default' filepath='include/wx/vector.h' line='189' column='1' id='type-id-305'>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-213' filepath='include/wx/vector.h' line='195' column='1' id='type-id-306'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-19' filepath='include/wx/vector.h' line='196' column='1' id='type-id-307'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='pointer' type-id='type-id-309' filepath='include/wx/vector.h' line='197' column='1' id='type-id-308'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-311' filepath='include/wx/vector.h' line='198' column='1' id='type-id-310'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_ptr' type-id='type-id-309' visibility='default' filepath='include/wx/vector.h' line='245' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_reverse_iterator' size-in-bits='64' visibility='default' filepath='include/wx/vector.h' line='250' column='1' id='type-id-312'>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-213' filepath='include/wx/vector.h' line='256' column='1' id='type-id-313'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-19' filepath='include/wx/vector.h' line='257' column='1' id='type-id-314'/>
          </member-type>
          <data-member access='protected' layout-offset-in-bits='0'>
            <var-decl name='m_ptr' type-id='type-id-315' visibility='default' filepath='include/wx/vector.h' line='308' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_INITIAL_SIZE' type-id='type-id-316' mangled-name='_ZN8wxVectorIiE18ALLOC_INITIAL_SIZEE' visibility='default' filepath='include/wx/vector.h' line='592' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-297' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-297' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-302' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVector&lt;wxBitmap&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-317'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-54' filepath='include/wx/vector.h' line='179' column='1' id='type-id-318'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-320' filepath='include/wx/vector.h' line='181' column='1' id='type-id-319'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-322' filepath='include/wx/vector.h' line='184' column='1' id='type-id-321'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-324' filepath='include/wx/vector.h' line='185' column='1' id='type-id-323'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-325'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-326'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_INITIAL_SIZE' type-id='type-id-327' mangled-name='_ZN8wxVectorI8wxBitmapE18ALLOC_INITIAL_SIZEE' visibility='default' filepath='include/wx/vector.h' line='592' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-318' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-318' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-322' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVector&lt;wxBitmapBundle&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-328'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-54' filepath='include/wx/vector.h' line='179' column='1' id='type-id-329'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-71' filepath='include/wx/vector.h' line='181' column='1' id='type-id-330'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-332' filepath='include/wx/vector.h' line='184' column='1' id='type-id-331'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-334' filepath='include/wx/vector.h' line='185' column='1' id='type-id-333'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-335'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-336'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_INITIAL_SIZE' type-id='type-id-337' mangled-name='_ZN8wxVectorI14wxBitmapBundleE18ALLOC_INITIAL_SIZEE' visibility='default' filepath='include/wx/vector.h' line='592' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-329' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-329' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-332' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVisualAttributes' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/wx/window.h' line='77' column='1' id='type-id-338'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='font' type-id='type-id-339' visibility='default' filepath='include/wx/window.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='colFg' type-id='type-id-340' visibility='default' filepath='include/wx/window.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='colBg' type-id='type-id-340' visibility='default' filepath='include/wx/window.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxWindowVariant' filepath='include/wx/window.h' line='92' column='1' id='type-id-341'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxWINDOW_VARIANT_NORMAL' value='0'/>
      <enumerator name='wxWINDOW_VARIANT_SMALL' value='1'/>
      <enumerator name='wxWINDOW_VARIANT_MINI' value='2'/>
      <enumerator name='wxWINDOW_VARIANT_LARGE' value='3'/>
      <enumerator name='wxWINDOW_VARIANT_MAX' value='4'/>
    </enum-decl>
    <enum-decl name='wxShowEffect' filepath='include/wx/window.h' line='106' column='1' id='type-id-342'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxSHOW_EFFECT_NONE' value='0'/>
      <enumerator name='wxSHOW_EFFECT_ROLL_TO_LEFT' value='1'/>
      <enumerator name='wxSHOW_EFFECT_ROLL_TO_RIGHT' value='2'/>
      <enumerator name='wxSHOW_EFFECT_ROLL_TO_TOP' value='3'/>
      <enumerator name='wxSHOW_EFFECT_ROLL_TO_BOTTOM' value='4'/>
      <enumerator name='wxSHOW_EFFECT_SLIDE_TO_LEFT' value='5'/>
      <enumerator name='wxSHOW_EFFECT_SLIDE_TO_RIGHT' value='6'/>
      <enumerator name='wxSHOW_EFFECT_SLIDE_TO_TOP' value='7'/>
      <enumerator name='wxSHOW_EFFECT_SLIDE_TO_BOTTOM' value='8'/>
      <enumerator name='wxSHOW_EFFECT_BLEND' value='9'/>
      <enumerator name='wxSHOW_EFFECT_EXPAND' value='10'/>
      <enumerator name='wxSHOW_EFFECT_MAX' value='11'/>
    </enum-decl>
    <class-decl name='wxWindowIDRef' size-in-bits='32' visibility='default' filepath='include/wx/windowid.h' line='26' column='1' id='type-id-343'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_id' type-id='type-id-104' visibility='default' filepath='include/wx/windowid.h' line='114' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxXmlResourceHandlerImplBase' size-in-bits='192' visibility='default' filepath='include/wx/xrc/xmlreshandler.h' line='48' column='1' id='type-id-344'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-345'/>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_handler' type-id='type-id-346' visibility='default' filepath='include/wx/xrc/xmlreshandler.h' line='134' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxXmlResourceHandlerImplBase' mangled-name='_ZN28wxXmlResourceHandlerImplBaseD0Ev' filepath='include/wx/xrc/xmlreshandler.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxXmlResourceHandlerImplBase' mangled-name='_ZN28wxXmlResourceHandlerImplBaseD2Ev' filepath='include/wx/xrc/xmlreshandler.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxXmlResourceHandlerImplBase' mangled-name='_ZN28wxXmlResourceHandlerImplBaseD4Ev' filepath='include/wx/xrc/xmlreshandler.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='CreateResource' mangled-name='_ZN28wxXmlResourceHandlerImplBase14CreateResourceEP9wxXmlNodeP8wxObjectS3_' filepath='include/wx/xrc/xmlreshandler.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-348'/>
          <parameter type-id='type-id-161'/>
          <parameter type-id='type-id-161'/>
          <return type-id='type-id-161'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='6'>
        <function-decl name='IsOfClass' mangled-name='_ZNK28wxXmlResourceHandlerImplBase9IsOfClassEP9wxXmlNodeRK8wxString' filepath='include/wx/xrc/xmlreshandler.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-349' is-artificial='yes'/>
          <parameter type-id='type-id-348'/>
          <parameter type-id='type-id-350'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='7'>
        <function-decl name='IsObjectNode' mangled-name='_ZNK28wxXmlResourceHandlerImplBase12IsObjectNodeEPK9wxXmlNode' filepath='include/wx/xrc/xmlreshandler.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-349' is-artificial='yes'/>
          <parameter type-id='type-id-351'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='GetNodeContent' mangled-name='_ZN28wxXmlResourceHandlerImplBase14GetNodeContentEPK9wxXmlNode' filepath='include/wx/xrc/xmlreshandler.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-351'/>
          <return type-id='type-id-44'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='9'>
        <function-decl name='GetNodeParent' mangled-name='_ZNK28wxXmlResourceHandlerImplBase13GetNodeParentEPK9wxXmlNode' filepath='include/wx/xrc/xmlreshandler.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-349' is-artificial='yes'/>
          <parameter type-id='type-id-351'/>
          <return type-id='type-id-348'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='10'>
        <function-decl name='GetNodeNext' mangled-name='_ZNK28wxXmlResourceHandlerImplBase11GetNodeNextEPK9wxXmlNode' filepath='include/wx/xrc/xmlreshandler.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-349' is-artificial='yes'/>
          <parameter type-id='type-id-351'/>
          <return type-id='type-id-348'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='11'>
        <function-decl name='GetNodeChildren' mangled-name='_ZNK28wxXmlResourceHandlerImplBase15GetNodeChildrenEPK9wxXmlNode' filepath='include/wx/xrc/xmlreshandler.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-349' is-artificial='yes'/>
          <parameter type-id='type-id-351'/>
          <return type-id='type-id-348'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <function-decl name='HasParam' mangled-name='_ZN28wxXmlResourceHandlerImplBase8HasParamERK8wxString' filepath='include/wx/xrc/xmlreshandler.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <function-decl name='GetParamNode' mangled-name='_ZN28wxXmlResourceHandlerImplBase12GetParamNodeERK8wxString' filepath='include/wx/xrc/xmlreshandler.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <return type-id='type-id-348'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <function-decl name='GetParamValue' mangled-name='_ZN28wxXmlResourceHandlerImplBase13GetParamValueERK8wxString' filepath='include/wx/xrc/xmlreshandler.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <return type-id='type-id-44'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <function-decl name='GetParamValue' mangled-name='_ZN28wxXmlResourceHandlerImplBase13GetParamValueEPK9wxXmlNode' filepath='include/wx/xrc/xmlreshandler.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-351'/>
          <return type-id='type-id-44'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <function-decl name='GetStyle' mangled-name='_ZN28wxXmlResourceHandlerImplBase8GetStyleERK8wxStringi' filepath='include/wx/xrc/xmlreshandler.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <function-decl name='GetNodeText' mangled-name='_ZN28wxXmlResourceHandlerImplBase11GetNodeTextEPK9wxXmlNodei' filepath='include/wx/xrc/xmlreshandler.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-351'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-44'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <function-decl name='GetID' mangled-name='_ZN28wxXmlResourceHandlerImplBase5GetIDEv' filepath='include/wx/xrc/xmlreshandler.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <function-decl name='GetName' mangled-name='_ZN28wxXmlResourceHandlerImplBase7GetNameEv' filepath='include/wx/xrc/xmlreshandler.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <return type-id='type-id-44'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='GetBool' mangled-name='_ZN28wxXmlResourceHandlerImplBase7GetBoolERK8wxStringb' filepath='include/wx/xrc/xmlreshandler.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='21'>
        <function-decl name='GetLong' mangled-name='_ZN28wxXmlResourceHandlerImplBase7GetLongERK8wxStringl' filepath='include/wx/xrc/xmlreshandler.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-21'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <function-decl name='GetFloat' mangled-name='_ZN28wxXmlResourceHandlerImplBase8GetFloatERK8wxStringf' filepath='include/wx/xrc/xmlreshandler.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <parameter type-id='type-id-18'/>
          <return type-id='type-id-18'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='23'>
        <function-decl name='GetColour' mangled-name='_ZN28wxXmlResourceHandlerImplBase9GetColourERK8wxStringRK8wxColour' filepath='include/wx/xrc/xmlreshandler.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <parameter type-id='type-id-352'/>
          <return type-id='type-id-340'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='24'>
        <function-decl name='GetSize' mangled-name='_ZN28wxXmlResourceHandlerImplBase7GetSizeERK8wxStringP8wxWindow' filepath='include/wx/xrc/xmlreshandler.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <parameter type-id='type-id-353'/>
          <return type-id='type-id-176'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='25'>
        <function-decl name='GetPosition' mangled-name='_ZN28wxXmlResourceHandlerImplBase11GetPositionERK8wxString' filepath='include/wx/xrc/xmlreshandler.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <return type-id='type-id-178'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='26'>
        <function-decl name='GetDimension' mangled-name='_ZN28wxXmlResourceHandlerImplBase12GetDimensionERK8wxStringiP8wxWindow' filepath='include/wx/xrc/xmlreshandler.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <parameter type-id='type-id-269'/>
          <parameter type-id='type-id-353'/>
          <return type-id='type-id-269'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='27'>
        <function-decl name='GetPairInts' mangled-name='_ZN28wxXmlResourceHandlerImplBase11GetPairIntsERK8wxString' filepath='include/wx/xrc/xmlreshandler.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <return type-id='type-id-176'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='28'>
        <function-decl name='GetDirection' mangled-name='_ZN28wxXmlResourceHandlerImplBase12GetDirectionERK8wxString11wxDirection' filepath='include/wx/xrc/xmlreshandler.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <parameter type-id='type-id-102'/>
          <return type-id='type-id-102'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='29'>
        <function-decl name='GetBitmap' mangled-name='_ZN28wxXmlResourceHandlerImplBase9GetBitmapERK8wxStringS2_6wxSize' filepath='include/wx/xrc/xmlreshandler.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <parameter type-id='type-id-354'/>
          <parameter type-id='type-id-176'/>
          <return type-id='type-id-320'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='30'>
        <function-decl name='GetBitmap' mangled-name='_ZN28wxXmlResourceHandlerImplBase9GetBitmapEPK9wxXmlNodeRK8wxString6wxSize' filepath='include/wx/xrc/xmlreshandler.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-351'/>
          <parameter type-id='type-id-354'/>
          <parameter type-id='type-id-176'/>
          <return type-id='type-id-320'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='31'>
        <function-decl name='GetBitmapBundle' mangled-name='_ZN28wxXmlResourceHandlerImplBase15GetBitmapBundleERK8wxStringS2_6wxSize' filepath='include/wx/xrc/xmlreshandler.h' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <parameter type-id='type-id-354'/>
          <parameter type-id='type-id-176'/>
          <return type-id='type-id-71'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='32'>
        <function-decl name='GetBitmapBundle' mangled-name='_ZN28wxXmlResourceHandlerImplBase15GetBitmapBundleEPK9wxXmlNodeRK8wxString6wxSize' filepath='include/wx/xrc/xmlreshandler.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-351'/>
          <parameter type-id='type-id-354'/>
          <parameter type-id='type-id-176'/>
          <return type-id='type-id-71'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='33'>
        <function-decl name='GetIcon' mangled-name='_ZN28wxXmlResourceHandlerImplBase7GetIconERK8wxStringS2_6wxSize' filepath='include/wx/xrc/xmlreshandler.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <parameter type-id='type-id-354'/>
          <parameter type-id='type-id-176'/>
          <return type-id='type-id-355'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='34'>
        <function-decl name='GetIcon' mangled-name='_ZN28wxXmlResourceHandlerImplBase7GetIconEPK9wxXmlNodeRK8wxString6wxSize' filepath='include/wx/xrc/xmlreshandler.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-351'/>
          <parameter type-id='type-id-354'/>
          <parameter type-id='type-id-176'/>
          <return type-id='type-id-355'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='35'>
        <function-decl name='GetIconBundle' mangled-name='_ZN28wxXmlResourceHandlerImplBase13GetIconBundleERK8wxStringS2_' filepath='include/wx/xrc/xmlreshandler.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <parameter type-id='type-id-354'/>
          <return type-id='type-id-356'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='36'>
        <function-decl name='GetImageList' mangled-name='_ZN28wxXmlResourceHandlerImplBase12GetImageListERK8wxString' filepath='include/wx/xrc/xmlreshandler.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <return type-id='type-id-357'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='37'>
        <function-decl name='GetAnimation' mangled-name='_ZN28wxXmlResourceHandlerImplBase12GetAnimationERK8wxStringP19wxAnimationCtrlBase' filepath='include/wx/xrc/xmlreshandler.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <parameter type-id='type-id-358'/>
          <return type-id='type-id-359'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='38'>
        <function-decl name='GetFont' mangled-name='_ZN28wxXmlResourceHandlerImplBase7GetFontERK8wxStringP8wxWindow' filepath='include/wx/xrc/xmlreshandler.h' line='114' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <parameter type-id='type-id-353'/>
          <return type-id='type-id-339'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='39'>
        <function-decl name='GetBoolAttr' mangled-name='_ZN28wxXmlResourceHandlerImplBase11GetBoolAttrERK8wxStringb' filepath='include/wx/xrc/xmlreshandler.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='40'>
        <function-decl name='GetFilePath' mangled-name='_ZN28wxXmlResourceHandlerImplBase11GetFilePathEPK9wxXmlNode' filepath='include/wx/xrc/xmlreshandler.h' line='116' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-351'/>
          <return type-id='type-id-44'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='41'>
        <function-decl name='SetupWindow' mangled-name='_ZN28wxXmlResourceHandlerImplBase11SetupWindowEP8wxWindow' filepath='include/wx/xrc/xmlreshandler.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-353'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='42'>
        <function-decl name='CreateChildren' mangled-name='_ZN28wxXmlResourceHandlerImplBase14CreateChildrenEP8wxObjectb' filepath='include/wx/xrc/xmlreshandler.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-161'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='43'>
        <function-decl name='CreateChildrenPrivately' mangled-name='_ZN28wxXmlResourceHandlerImplBase23CreateChildrenPrivatelyEP8wxObjectP9wxXmlNode' filepath='include/wx/xrc/xmlreshandler.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-161'/>
          <parameter type-id='type-id-348'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='44'>
        <function-decl name='CreateResFromNode' mangled-name='_ZN28wxXmlResourceHandlerImplBase17CreateResFromNodeEP9wxXmlNodeP8wxObjectS3_' filepath='include/wx/xrc/xmlreshandler.h' line='121' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-348'/>
          <parameter type-id='type-id-161'/>
          <parameter type-id='type-id-161'/>
          <return type-id='type-id-161'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='45'>
        <function-decl name='GetCurFileSystem' mangled-name='_ZN28wxXmlResourceHandlerImplBase16GetCurFileSystemEv' filepath='include/wx/xrc/xmlreshandler.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <return type-id='type-id-360'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='46'>
        <function-decl name='ReportError' mangled-name='_ZN28wxXmlResourceHandlerImplBase11ReportErrorEP9wxXmlNodeRK8wxString' filepath='include/wx/xrc/xmlreshandler.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-348'/>
          <parameter type-id='type-id-350'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='47'>
        <function-decl name='ReportError' mangled-name='_ZN28wxXmlResourceHandlerImplBase11ReportErrorERK8wxString' filepath='include/wx/xrc/xmlreshandler.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='48'>
        <function-decl name='ReportParamError' mangled-name='_ZN28wxXmlResourceHandlerImplBase16ReportParamErrorERK8wxStringS2_' filepath='include/wx/xrc/xmlreshandler.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-347' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <parameter type-id='type-id-350'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='lconv' size-in-bits='768' is-struct='yes' visibility='default' filepath='/usr/include/locale.h' line='51' column='1' id='type-id-361'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='decimal_point' type-id='type-id-239' visibility='default' filepath='/usr/include/locale.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thousands_sep' type-id='type-id-239' visibility='default' filepath='/usr/include/locale.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='grouping' type-id='type-id-239' visibility='default' filepath='/usr/include/locale.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='int_curr_symbol' type-id='type-id-239' visibility='default' filepath='/usr/include/locale.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='currency_symbol' type-id='type-id-239' visibility='default' filepath='/usr/include/locale.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mon_decimal_point' type-id='type-id-239' visibility='default' filepath='/usr/include/locale.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mon_thousands_sep' type-id='type-id-239' visibility='default' filepath='/usr/include/locale.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mon_grouping' type-id='type-id-239' visibility='default' filepath='/usr/include/locale.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='positive_sign' type-id='type-id-239' visibility='default' filepath='/usr/include/locale.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='negative_sign' type-id='type-id-239' visibility='default' filepath='/usr/include/locale.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='int_frac_digits' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <var-decl name='frac_digits' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='p_cs_precedes' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='664'>
        <var-decl name='p_sep_by_space' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='n_cs_precedes' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='680'>
        <var-decl name='n_sep_by_space' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='688'>
        <var-decl name='p_sign_posn' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='696'>
        <var-decl name='n_sign_posn' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='int_p_cs_precedes' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='712'>
        <var-decl name='int_p_sep_by_space' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='720'>
        <var-decl name='int_n_cs_precedes' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='728'>
        <var-decl name='int_n_sep_by_space' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='int_p_sign_posn' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='744'>
        <var-decl name='int_n_sign_posn' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='fpos_t' type-id='type-id-362' filepath='/usr/include/stdio.h' line='86' column='1' id='type-id-363'/>
    <class-decl name='div_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-364' visibility='default' filepath='/usr/include/stdlib.h' line='60' column='1' id='type-id-365'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-19' visibility='default' filepath='/usr/include/stdlib.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rem' type-id='type-id-19' visibility='default' filepath='/usr/include/stdlib.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='div_t' type-id='type-id-365' filepath='/usr/include/stdlib.h' line='63' column='1' id='type-id-364'/>
    <class-decl name='ldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-366' visibility='default' filepath='/usr/include/stdlib.h' line='68' column='1' id='type-id-367'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-21' visibility='default' filepath='/usr/include/stdlib.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-21' visibility='default' filepath='/usr/include/stdlib.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ldiv_t' type-id='type-id-367' filepath='/usr/include/stdlib.h' line='71' column='1' id='type-id-366'/>
    <class-decl name='lldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-368' visibility='default' filepath='/usr/include/stdlib.h' line='78' column='1' id='type-id-369'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-22' visibility='default' filepath='/usr/include/stdlib.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-22' visibility='default' filepath='/usr/include/stdlib.h' line='80' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='lldiv_t' type-id='type-id-369' filepath='/usr/include/stdlib.h' line='81' column='1' id='type-id-368'/>
    <typedef-decl name='__compar_fn_t' type-id='type-id-370' filepath='/usr/include/stdlib.h' line='816' column='1' id='type-id-371'/>
    <typedef-decl name='__off_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-372'/>
    <typedef-decl name='__off64_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1' id='type-id-373'/>
    <typedef-decl name='FILE' type-id='type-id-374' filepath='/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-375'/>
    <typedef-decl name='__FILE' type-id='type-id-374' filepath='/usr/include/x86_64-linux-gnu/bits/types/__FILE.h' line='5' column='1' id='type-id-376'/>
    <class-decl name='_G_fpos64_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='10' column='1' id='type-id-377'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__pos' type-id='type-id-373' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__state' type-id='type-id-378' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='13' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__fpos64_t' type-id='type-id-377' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='14' column='1' id='type-id-362'/>
    <class-decl name='__mbstate_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-378' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='14' column='1' id='type-id-379'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='17' column='1' id='type-id-380'>
          <data-member access='public'>
            <var-decl name='__wch' type-id='type-id-15' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='18' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='__wchb' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='19' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='type-id-380' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='20' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__mbstate_t' type-id='type-id-379' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='21' column='1' id='type-id-378'/>
    <typedef-decl name='mbstate_t' type-id='type-id-378' filepath='/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h' line='6' column='1' id='type-id-381'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-30' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='43' column='1' id='type-id-382'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='49' column='1' id='type-id-374'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-239' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-239' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-239' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-239' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-239' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-239' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-239' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-239' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-239' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-239' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-239' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-383' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-384' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-372' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-28' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-25' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-8' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-385' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-373' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-386' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-387' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-384' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-16' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-54' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-10' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='7' column='1' id='type-id-388'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-268' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wint_t' type-id='type-id-15' filepath='/usr/include/x86_64-linux-gnu/bits/types/wint_t.h' line='20' column='1' id='type-id-389'/>
    <typedef-decl name='ptrdiff_t' type-id='type-id-21' filepath='/usr/lib/gcc/x86_64-linux-gnu/11/include/stddef.h' line='143' column='1' id='type-id-213'/>
    <typedef-decl name='size_t' type-id='type-id-6' filepath='/usr/lib/gcc/x86_64-linux-gnu/11/include/stddef.h' line='209' column='1' id='type-id-54'/>
    <pointer-type-def type-id='type-id-375' size-in-bits='64' id='type-id-390'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-391'/>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-392'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-393'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-112'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-278'/>
    <qualified-type-def type-id='type-id-278' const='yes' id='type-id-394'/>
    <reference-type-def kind='lvalue' type-id='type-id-394' size-in-bits='64' id='type-id-395'/>
    <reference-type-def kind='lvalue' type-id='type-id-278' size-in-bits='64' id='type-id-396'/>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-397'/>
    <pointer-type-def type-id='type-id-374' size-in-bits='64' id='type-id-384'/>
    <pointer-type-def type-id='type-id-398' size-in-bits='64' id='type-id-386'/>
    <pointer-type-def type-id='type-id-382' size-in-bits='64' id='type-id-385'/>
    <pointer-type-def type-id='type-id-399' size-in-bits='64' id='type-id-383'/>
    <pointer-type-def type-id='type-id-400' size-in-bits='64' id='type-id-387'/>
    <pointer-type-def type-id='type-id-376' size-in-bits='64' id='type-id-401'/>
    <reference-type-def kind='lvalue' type-id='type-id-402' size-in-bits='64' id='type-id-403'/>
    <reference-type-def kind='lvalue' type-id='type-id-404' size-in-bits='64' id='type-id-405'/>
    <reference-type-def kind='lvalue' type-id='type-id-406' size-in-bits='64' id='type-id-407'/>
    <pointer-type-def type-id='type-id-406' size-in-bits='64' id='type-id-408'/>
    <reference-type-def kind='lvalue' type-id='type-id-409' size-in-bits='64' id='type-id-410'/>
    <pointer-type-def type-id='type-id-409' size-in-bits='64' id='type-id-411'/>
    <reference-type-def kind='lvalue' type-id='type-id-412' size-in-bits='64' id='type-id-413'/>
    <pointer-type-def type-id='type-id-412' size-in-bits='64' id='type-id-414'/>
    <reference-type-def kind='lvalue' type-id='type-id-415' size-in-bits='64' id='type-id-416'/>
    <pointer-type-def type-id='type-id-415' size-in-bits='64' id='type-id-417'/>
    <reference-type-def kind='lvalue' type-id='type-id-418' size-in-bits='64' id='type-id-419'/>
    <pointer-type-def type-id='type-id-418' size-in-bits='64' id='type-id-420'/>
    <pointer-type-def type-id='type-id-421' size-in-bits='64' id='type-id-422'/>
    <pointer-type-def type-id='type-id-423' size-in-bits='64' id='type-id-424'/>
    <qualified-type-def type-id='type-id-424' const='yes' id='type-id-425'/>
    <reference-type-def kind='lvalue' type-id='type-id-4' size-in-bits='64' id='type-id-426'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-239'/>
    <qualified-type-def type-id='type-id-239' const='yes' id='type-id-427'/>
    <reference-type-def kind='lvalue' type-id='type-id-427' size-in-bits='64' id='type-id-428'/>
    <pointer-type-def type-id='type-id-239' size-in-bits='64' id='type-id-429'/>
    <qualified-type-def type-id='type-id-402' const='yes' id='type-id-430'/>
    <reference-type-def kind='lvalue' type-id='type-id-430' size-in-bits='64' id='type-id-431'/>
    <qualified-type-def type-id='type-id-404' const='yes' id='type-id-432'/>
    <reference-type-def kind='lvalue' type-id='type-id-432' size-in-bits='64' id='type-id-433'/>
    <qualified-type-def type-id='type-id-406' const='yes' id='type-id-434'/>
    <pointer-type-def type-id='type-id-434' size-in-bits='64' id='type-id-435'/>
    <qualified-type-def type-id='type-id-409' const='yes' id='type-id-436'/>
    <pointer-type-def type-id='type-id-436' size-in-bits='64' id='type-id-437'/>
    <qualified-type-def type-id='type-id-412' const='yes' id='type-id-438'/>
    <pointer-type-def type-id='type-id-438' size-in-bits='64' id='type-id-439'/>
    <qualified-type-def type-id='type-id-415' const='yes' id='type-id-440'/>
    <pointer-type-def type-id='type-id-440' size-in-bits='64' id='type-id-441'/>
    <qualified-type-def type-id='type-id-418' const='yes' id='type-id-442'/>
    <reference-type-def kind='lvalue' type-id='type-id-442' size-in-bits='64' id='type-id-443'/>
    <pointer-type-def type-id='type-id-442' size-in-bits='64' id='type-id-444'/>
    <qualified-type-def type-id='type-id-445' const='yes' id='type-id-446'/>
    <reference-type-def kind='lvalue' type-id='type-id-446' size-in-bits='64' id='type-id-447'/>
    <qualified-type-def type-id='type-id-421' const='yes' id='type-id-448'/>
    <reference-type-def kind='lvalue' type-id='type-id-448' size-in-bits='64' id='type-id-449'/>
    <pointer-type-def type-id='type-id-448' size-in-bits='64' id='type-id-450'/>
    <qualified-type-def type-id='type-id-423' const='yes' id='type-id-451'/>
    <reference-type-def kind='lvalue' type-id='type-id-451' size-in-bits='64' id='type-id-452'/>
    <pointer-type-def type-id='type-id-451' size-in-bits='64' id='type-id-453'/>
    <qualified-type-def type-id='type-id-4' const='yes' id='type-id-454'/>
    <reference-type-def kind='lvalue' type-id='type-id-454' size-in-bits='64' id='type-id-455'/>
    <pointer-type-def type-id='type-id-454' size-in-bits='64' id='type-id-268'/>
    <qualified-type-def type-id='type-id-268' const='yes' id='type-id-456'/>
    <reference-type-def kind='lvalue' type-id='type-id-456' size-in-bits='64' id='type-id-457'/>
    <pointer-type-def type-id='type-id-456' size-in-bits='64' id='type-id-458'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-459'/>
    <qualified-type-def type-id='type-id-363' const='yes' id='type-id-460'/>
    <pointer-type-def type-id='type-id-460' size-in-bits='64' id='type-id-461'/>
    <qualified-type-def type-id='type-id-19' const='yes' id='type-id-462'/>
    <reference-type-def kind='lvalue' type-id='type-id-462' size-in-bits='64' id='type-id-163'/>
    <qualified-type-def type-id='type-id-381' const='yes' id='type-id-463'/>
    <pointer-type-def type-id='type-id-463' size-in-bits='64' id='type-id-464'/>
    <qualified-type-def type-id='type-id-465' const='yes' id='type-id-466'/>
    <reference-type-def kind='lvalue' type-id='type-id-466' size-in-bits='64' id='type-id-467'/>
    <pointer-type-def type-id='type-id-466' size-in-bits='64' id='type-id-468'/>
    <qualified-type-def type-id='type-id-469' const='yes' id='type-id-470'/>
    <reference-type-def kind='lvalue' type-id='type-id-470' size-in-bits='64' id='type-id-471'/>
    <qualified-type-def type-id='type-id-472' const='yes' id='type-id-473'/>
    <reference-type-def kind='lvalue' type-id='type-id-473' size-in-bits='64' id='type-id-474'/>
    <pointer-type-def type-id='type-id-473' size-in-bits='64' id='type-id-475'/>
    <qualified-type-def type-id='type-id-475' const='yes' id='type-id-476'/>
    <qualified-type-def type-id='type-id-477' const='yes' id='type-id-478'/>
    <reference-type-def kind='lvalue' type-id='type-id-478' size-in-bits='64' id='type-id-479'/>
    <qualified-type-def type-id='type-id-480' const='yes' id='type-id-481'/>
    <qualified-type-def type-id='type-id-482' const='yes' id='type-id-483'/>
    <reference-type-def kind='lvalue' type-id='type-id-483' size-in-bits='64' id='type-id-484'/>
    <pointer-type-def type-id='type-id-483' size-in-bits='64' id='type-id-485'/>
    <qualified-type-def type-id='type-id-486' const='yes' id='type-id-487'/>
    <reference-type-def kind='lvalue' type-id='type-id-487' size-in-bits='64' id='type-id-488'/>
    <qualified-type-def type-id='type-id-489' const='yes' id='type-id-490'/>
    <reference-type-def kind='lvalue' type-id='type-id-490' size-in-bits='64' id='type-id-491'/>
    <qualified-type-def type-id='type-id-492' const='yes' id='type-id-493'/>
    <reference-type-def kind='lvalue' type-id='type-id-493' size-in-bits='64' id='type-id-494'/>
    <qualified-type-def type-id='type-id-495' const='yes' id='type-id-496'/>
    <reference-type-def kind='lvalue' type-id='type-id-496' size-in-bits='64' id='type-id-497'/>
    <qualified-type-def type-id='type-id-498' const='yes' id='type-id-499'/>
    <reference-type-def kind='lvalue' type-id='type-id-499' size-in-bits='64' id='type-id-500'/>
    <pointer-type-def type-id='type-id-499' size-in-bits='64' id='type-id-501'/>
    <qualified-type-def type-id='type-id-502' const='yes' id='type-id-503'/>
    <reference-type-def kind='lvalue' type-id='type-id-503' size-in-bits='64' id='type-id-504'/>
    <pointer-type-def type-id='type-id-503' size-in-bits='64' id='type-id-505'/>
    <qualified-type-def type-id='type-id-506' const='yes' id='type-id-507'/>
    <reference-type-def kind='lvalue' type-id='type-id-507' size-in-bits='64' id='type-id-508'/>
    <pointer-type-def type-id='type-id-507' size-in-bits='64' id='type-id-509'/>
    <qualified-type-def type-id='type-id-510' const='yes' id='type-id-511'/>
    <reference-type-def kind='lvalue' type-id='type-id-511' size-in-bits='64' id='type-id-512'/>
    <pointer-type-def type-id='type-id-511' size-in-bits='64' id='type-id-513'/>
    <qualified-type-def type-id='type-id-514' const='yes' id='type-id-515'/>
    <reference-type-def kind='lvalue' type-id='type-id-515' size-in-bits='64' id='type-id-516'/>
    <pointer-type-def type-id='type-id-515' size-in-bits='64' id='type-id-517'/>
    <qualified-type-def type-id='type-id-518' const='yes' id='type-id-519'/>
    <reference-type-def kind='lvalue' type-id='type-id-519' size-in-bits='64' id='type-id-520'/>
    <qualified-type-def type-id='type-id-521' const='yes' id='type-id-522'/>
    <pointer-type-def type-id='type-id-522' size-in-bits='64' id='type-id-523'/>
    <qualified-type-def type-id='type-id-524' const='yes' id='type-id-525'/>
    <pointer-type-def type-id='type-id-525' size-in-bits='64' id='type-id-526'/>
    <qualified-type-def type-id='type-id-527' const='yes' id='type-id-528'/>
    <reference-type-def kind='lvalue' type-id='type-id-528' size-in-bits='64' id='type-id-529'/>
    <qualified-type-def type-id='type-id-530' const='yes' id='type-id-531'/>
    <pointer-type-def type-id='type-id-531' size-in-bits='64' id='type-id-532'/>
    <qualified-type-def type-id='type-id-532' const='yes' id='type-id-533'/>
    <qualified-type-def type-id='type-id-388' const='yes' id='type-id-534'/>
    <pointer-type-def type-id='type-id-534' size-in-bits='64' id='type-id-535'/>
    <qualified-type-def type-id='type-id-27' const='yes' id='type-id-536'/>
    <pointer-type-def type-id='type-id-536' size-in-bits='64' id='type-id-537'/>
    <qualified-type-def type-id='type-id-31' const='yes' id='type-id-538'/>
    <reference-type-def kind='lvalue' type-id='type-id-538' size-in-bits='64' id='type-id-539'/>
    <pointer-type-def type-id='type-id-538' size-in-bits='64' id='type-id-204'/>
    <qualified-type-def type-id='type-id-204' const='yes' id='type-id-540'/>
    <reference-type-def kind='lvalue' type-id='type-id-540' size-in-bits='64' id='type-id-541'/>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-542'/>
    <qualified-type-def type-id='type-id-543' const='yes' id='type-id-544'/>
    <reference-type-def kind='lvalue' type-id='type-id-544' size-in-bits='64' id='type-id-545'/>
    <qualified-type-def type-id='type-id-546' const='yes' id='type-id-547'/>
    <pointer-type-def type-id='type-id-547' size-in-bits='64' id='type-id-548'/>
    <qualified-type-def type-id='type-id-33' const='yes' id='type-id-549'/>
    <pointer-type-def type-id='type-id-549' size-in-bits='64' id='type-id-35'/>
    <qualified-type-def type-id='type-id-550' const='yes' id='type-id-551'/>
    <pointer-type-def type-id='type-id-551' size-in-bits='64' id='type-id-552'/>
    <qualified-type-def type-id='type-id-38' const='yes' id='type-id-553'/>
    <reference-type-def kind='lvalue' type-id='type-id-553' size-in-bits='64' id='type-id-554'/>
    <pointer-type-def type-id='type-id-553' size-in-bits='64' id='type-id-555'/>
    <qualified-type-def type-id='type-id-62' const='yes' id='type-id-556'/>
    <pointer-type-def type-id='type-id-556' size-in-bits='64' id='type-id-557'/>
    <qualified-type-def type-id='type-id-68' const='yes' id='type-id-558'/>
    <reference-type-def kind='lvalue' type-id='type-id-558' size-in-bits='64' id='type-id-559'/>
    <qualified-type-def type-id='type-id-63' const='yes' id='type-id-560'/>
    <reference-type-def kind='lvalue' type-id='type-id-560' size-in-bits='64' id='type-id-67'/>
    <pointer-type-def type-id='type-id-560' size-in-bits='64' id='type-id-65'/>
    <qualified-type-def type-id='type-id-55' const='yes' id='type-id-561'/>
    <reference-type-def kind='lvalue' type-id='type-id-561' size-in-bits='64' id='type-id-562'/>
    <pointer-type-def type-id='type-id-561' size-in-bits='64' id='type-id-563'/>
    <qualified-type-def type-id='type-id-61' const='yes' id='type-id-564'/>
    <reference-type-def kind='lvalue' type-id='type-id-564' size-in-bits='64' id='type-id-565'/>
    <qualified-type-def type-id='type-id-43' const='yes' id='type-id-566'/>
    <reference-type-def kind='lvalue' type-id='type-id-566' size-in-bits='64' id='type-id-52'/>
    <pointer-type-def type-id='type-id-566' size-in-bits='64' id='type-id-48'/>
    <qualified-type-def type-id='type-id-70' const='yes' id='type-id-567'/>
    <reference-type-def kind='lvalue' type-id='type-id-567' size-in-bits='64' id='type-id-354'/>
    <qualified-type-def type-id='type-id-132' const='yes' id='type-id-568'/>
    <pointer-type-def type-id='type-id-568' size-in-bits='64' id='type-id-569'/>
    <qualified-type-def type-id='type-id-138' const='yes' id='type-id-570'/>
    <pointer-type-def type-id='type-id-570' size-in-bits='64' id='type-id-571'/>
    <qualified-type-def type-id='type-id-144' const='yes' id='type-id-572'/>
    <pointer-type-def type-id='type-id-572' size-in-bits='64' id='type-id-573'/>
    <qualified-type-def type-id='type-id-320' const='yes' id='type-id-574'/>
    <reference-type-def kind='lvalue' type-id='type-id-574' size-in-bits='64' id='type-id-575'/>
    <qualified-type-def type-id='type-id-71' const='yes' id='type-id-576'/>
    <reference-type-def kind='lvalue' type-id='type-id-576' size-in-bits='64' id='type-id-577'/>
    <pointer-type-def type-id='type-id-576' size-in-bits='64' id='type-id-578'/>
    <qualified-type-def type-id='type-id-271' const='yes' id='type-id-579'/>
    <pointer-type-def type-id='type-id-579' size-in-bits='64' id='type-id-580'/>
    <qualified-type-def type-id='type-id-201' const='yes' id='type-id-581'/>
    <reference-type-def kind='lvalue' type-id='type-id-581' size-in-bits='64' id='type-id-582'/>
    <pointer-type-def type-id='type-id-581' size-in-bits='64' id='type-id-583'/>
    <qualified-type-def type-id='type-id-583' const='yes' id='type-id-248'/>
    <qualified-type-def type-id='type-id-98' const='yes' id='type-id-584'/>
    <pointer-type-def type-id='type-id-584' size-in-bits='64' id='type-id-199'/>
    <qualified-type-def type-id='type-id-89' const='yes' id='type-id-585'/>
    <qualified-type-def type-id='type-id-90' const='yes' id='type-id-586'/>
    <reference-type-def kind='lvalue' type-id='type-id-586' size-in-bits='64' id='type-id-587'/>
    <qualified-type-def type-id='type-id-91' const='yes' id='type-id-588'/>
    <reference-type-def kind='lvalue' type-id='type-id-588' size-in-bits='64' id='type-id-589'/>
    <qualified-type-def type-id='type-id-85' const='yes' id='type-id-590'/>
    <reference-type-def kind='lvalue' type-id='type-id-590' size-in-bits='64' id='type-id-591'/>
    <qualified-type-def type-id='type-id-86' const='yes' id='type-id-592'/>
    <pointer-type-def type-id='type-id-592' size-in-bits='64' id='type-id-593'/>
    <qualified-type-def type-id='type-id-87' const='yes' id='type-id-594'/>
    <reference-type-def kind='lvalue' type-id='type-id-594' size-in-bits='64' id='type-id-595'/>
    <qualified-type-def type-id='type-id-88' const='yes' id='type-id-596'/>
    <pointer-type-def type-id='type-id-596' size-in-bits='64' id='type-id-597'/>
    <qualified-type-def type-id='type-id-190' const='yes' id='type-id-598'/>
    <reference-type-def kind='lvalue' type-id='type-id-598' size-in-bits='64' id='type-id-599'/>
    <pointer-type-def type-id='type-id-598' size-in-bits='64' id='type-id-196'/>
    <qualified-type-def type-id='type-id-196' const='yes' id='type-id-600'/>
    <qualified-type-def type-id='type-id-191' const='yes' id='type-id-601'/>
    <pointer-type-def type-id='type-id-601' size-in-bits='64' id='type-id-602'/>
    <qualified-type-def type-id='type-id-194' const='yes' id='type-id-603'/>
    <reference-type-def kind='lvalue' type-id='type-id-603' size-in-bits='64' id='type-id-604'/>
    <qualified-type-def type-id='type-id-340' const='yes' id='type-id-605'/>
    <reference-type-def kind='lvalue' type-id='type-id-605' size-in-bits='64' id='type-id-352'/>
    <qualified-type-def type-id='type-id-34' const='yes' id='type-id-606'/>
    <pointer-type-def type-id='type-id-606' size-in-bits='64' id='type-id-607'/>
    <qualified-type-def type-id='type-id-608' const='yes' id='type-id-609'/>
    <pointer-type-def type-id='type-id-609' size-in-bits='64' id='type-id-610'/>
    <qualified-type-def type-id='type-id-256' const='yes' id='type-id-611'/>
    <reference-type-def kind='lvalue' type-id='type-id-611' size-in-bits='64' id='type-id-612'/>
    <qualified-type-def type-id='type-id-258' const='yes' id='type-id-613'/>
    <reference-type-def kind='lvalue' type-id='type-id-613' size-in-bits='64' id='type-id-614'/>
    <qualified-type-def type-id='type-id-615' const='yes' id='type-id-616'/>
    <reference-type-def kind='lvalue' type-id='type-id-616' size-in-bits='64' id='type-id-617'/>
    <qualified-type-def type-id='type-id-164' const='yes' id='type-id-618'/>
    <reference-type-def kind='lvalue' type-id='type-id-618' size-in-bits='64' id='type-id-619'/>
    <qualified-type-def type-id='type-id-620' const='yes' id='type-id-621'/>
    <reference-type-def kind='lvalue' type-id='type-id-621' size-in-bits='64' id='type-id-622'/>
    <qualified-type-def type-id='type-id-153' const='yes' id='type-id-623'/>
    <reference-type-def kind='lvalue' type-id='type-id-623' size-in-bits='64' id='type-id-158'/>
    <qualified-type-def type-id='type-id-169' const='yes' id='type-id-624'/>
    <reference-type-def kind='lvalue' type-id='type-id-624' size-in-bits='64' id='type-id-625'/>
    <qualified-type-def type-id='type-id-165' const='yes' id='type-id-626'/>
    <reference-type-def kind='lvalue' type-id='type-id-626' size-in-bits='64' id='type-id-173'/>
    <pointer-type-def type-id='type-id-626' size-in-bits='64' id='type-id-166'/>
    <qualified-type-def type-id='type-id-162' const='yes' id='type-id-627'/>
    <reference-type-def kind='lvalue' type-id='type-id-627' size-in-bits='64' id='type-id-628'/>
    <pointer-type-def type-id='type-id-627' size-in-bits='64' id='type-id-167'/>
    <qualified-type-def type-id='type-id-167' const='yes' id='type-id-629'/>
    <reference-type-def kind='lvalue' type-id='type-id-629' size-in-bits='64' id='type-id-630'/>
    <reference-type-def kind='lvalue' type-id='type-id-167' size-in-bits='64' id='type-id-631'/>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-632'/>
    <qualified-type-def type-id='type-id-159' const='yes' id='type-id-633'/>
    <reference-type-def kind='lvalue' type-id='type-id-633' size-in-bits='64' id='type-id-634'/>
    <qualified-type-def type-id='type-id-635' const='yes' id='type-id-636'/>
    <pointer-type-def type-id='type-id-636' size-in-bits='64' id='type-id-637'/>
    <qualified-type-def type-id='type-id-339' const='yes' id='type-id-638'/>
    <reference-type-def kind='lvalue' type-id='type-id-638' size-in-bits='64' id='type-id-639'/>
    <pointer-type-def type-id='type-id-638' size-in-bits='64' id='type-id-640'/>
    <qualified-type-def type-id='type-id-245' const='yes' id='type-id-641'/>
    <reference-type-def kind='lvalue' type-id='type-id-641' size-in-bits='64' id='type-id-642'/>
    <pointer-type-def type-id='type-id-641' size-in-bits='64' id='type-id-643'/>
    <qualified-type-def type-id='type-id-355' const='yes' id='type-id-644'/>
    <reference-type-def kind='lvalue' type-id='type-id-644' size-in-bits='64' id='type-id-645'/>
    <qualified-type-def type-id='type-id-356' const='yes' id='type-id-646'/>
    <reference-type-def kind='lvalue' type-id='type-id-646' size-in-bits='64' id='type-id-647'/>
    <qualified-type-def type-id='type-id-648' const='yes' id='type-id-649'/>
    <reference-type-def kind='lvalue' type-id='type-id-649' size-in-bits='64' id='type-id-650'/>
    <qualified-type-def type-id='type-id-651' const='yes' id='type-id-652'/>
    <reference-type-def kind='lvalue' type-id='type-id-652' size-in-bits='64' id='type-id-653'/>
    <qualified-type-def type-id='type-id-253' const='yes' id='type-id-654'/>
    <reference-type-def kind='lvalue' type-id='type-id-654' size-in-bits='64' id='type-id-655'/>
    <pointer-type-def type-id='type-id-654' size-in-bits='64' id='type-id-656'/>
    <qualified-type-def type-id='type-id-345' const='yes' id='type-id-657'/>
    <reference-type-def kind='lvalue' type-id='type-id-657' size-in-bits='64' id='type-id-658'/>
    <pointer-type-def type-id='type-id-657' size-in-bits='64' id='type-id-659'/>
    <qualified-type-def type-id='type-id-73' const='yes' id='type-id-660'/>
    <reference-type-def kind='lvalue' type-id='type-id-660' size-in-bits='64' id='type-id-661'/>
    <pointer-type-def type-id='type-id-660' size-in-bits='64' id='type-id-662'/>
    <qualified-type-def type-id='type-id-152' const='yes' id='type-id-663'/>
    <pointer-type-def type-id='type-id-663' size-in-bits='64' id='type-id-157'/>
    <qualified-type-def type-id='type-id-186' const='yes' id='type-id-664'/>
    <pointer-type-def type-id='type-id-664' size-in-bits='64' id='type-id-665'/>
    <qualified-type-def type-id='type-id-178' const='yes' id='type-id-666'/>
    <reference-type-def kind='lvalue' type-id='type-id-666' size-in-bits='64' id='type-id-667'/>
    <pointer-type-def type-id='type-id-666' size-in-bits='64' id='type-id-668'/>
    <qualified-type-def type-id='type-id-177' const='yes' id='type-id-669'/>
    <reference-type-def kind='lvalue' type-id='type-id-669' size-in-bits='64' id='type-id-670'/>
    <qualified-type-def type-id='type-id-179' const='yes' id='type-id-671'/>
    <reference-type-def kind='lvalue' type-id='type-id-671' size-in-bits='64' id='type-id-672'/>
    <pointer-type-def type-id='type-id-671' size-in-bits='64' id='type-id-673'/>
    <qualified-type-def type-id='type-id-184' const='yes' id='type-id-674'/>
    <reference-type-def kind='lvalue' type-id='type-id-674' size-in-bits='64' id='type-id-675'/>
    <pointer-type-def type-id='type-id-674' size-in-bits='64' id='type-id-676'/>
    <qualified-type-def type-id='type-id-83' const='yes' id='type-id-677'/>
    <reference-type-def kind='lvalue' type-id='type-id-677' size-in-bits='64' id='type-id-678'/>
    <qualified-type-def type-id='type-id-74' const='yes' id='type-id-679'/>
    <reference-type-def kind='lvalue' type-id='type-id-679' size-in-bits='64' id='type-id-680'/>
    <pointer-type-def type-id='type-id-679' size-in-bits='64' id='type-id-681'/>
    <qualified-type-def type-id='type-id-75' const='yes' id='type-id-682'/>
    <pointer-type-def type-id='type-id-682' size-in-bits='64' id='type-id-683'/>
    <qualified-type-def type-id='type-id-76' const='yes' id='type-id-684'/>
    <pointer-type-def type-id='type-id-684' size-in-bits='64' id='type-id-685'/>
    <qualified-type-def type-id='type-id-79' const='yes' id='type-id-686'/>
    <reference-type-def kind='lvalue' type-id='type-id-686' size-in-bits='64' id='type-id-687'/>
    <pointer-type-def type-id='type-id-686' size-in-bits='64' id='type-id-688'/>
    <qualified-type-def type-id='type-id-80' const='yes' id='type-id-689'/>
    <pointer-type-def type-id='type-id-689' size-in-bits='64' id='type-id-690'/>
    <qualified-type-def type-id='type-id-81' const='yes' id='type-id-691'/>
    <pointer-type-def type-id='type-id-691' size-in-bits='64' id='type-id-692'/>
    <qualified-type-def type-id='type-id-84' const='yes' id='type-id-693'/>
    <reference-type-def kind='lvalue' type-id='type-id-693' size-in-bits='64' id='type-id-694'/>
    <qualified-type-def type-id='type-id-176' const='yes' id='type-id-695'/>
    <reference-type-def kind='lvalue' type-id='type-id-695' size-in-bits='64' id='type-id-696'/>
    <pointer-type-def type-id='type-id-695' size-in-bits='64' id='type-id-697'/>
    <qualified-type-def type-id='type-id-243' const='yes' id='type-id-698'/>
    <reference-type-def kind='lvalue' type-id='type-id-698' size-in-bits='64' id='type-id-699'/>
    <qualified-type-def type-id='type-id-44' const='yes' id='type-id-700'/>
    <reference-type-def kind='lvalue' type-id='type-id-700' size-in-bits='64' id='type-id-350'/>
    <pointer-type-def type-id='type-id-700' size-in-bits='64' id='type-id-202'/>
    <qualified-type-def type-id='type-id-202' const='yes' id='type-id-247'/>
    <qualified-type-def type-id='type-id-238' const='yes' id='type-id-701'/>
    <pointer-type-def type-id='type-id-701' size-in-bits='64' id='type-id-702'/>
    <qualified-type-def type-id='type-id-206' const='yes' id='type-id-703'/>
    <qualified-type-def type-id='type-id-218' const='yes' id='type-id-704'/>
    <reference-type-def kind='lvalue' type-id='type-id-704' size-in-bits='64' id='type-id-705'/>
    <pointer-type-def type-id='type-id-704' size-in-bits='64' id='type-id-706'/>
    <qualified-type-def type-id='type-id-211' const='yes' id='type-id-707'/>
    <reference-type-def kind='lvalue' type-id='type-id-707' size-in-bits='64' id='type-id-225'/>
    <pointer-type-def type-id='type-id-707' size-in-bits='64' id='type-id-708'/>
    <qualified-type-def type-id='type-id-226' const='yes' id='type-id-709'/>
    <reference-type-def kind='lvalue' type-id='type-id-709' size-in-bits='64' id='type-id-710'/>
    <pointer-type-def type-id='type-id-709' size-in-bits='64' id='type-id-711'/>
    <qualified-type-def type-id='type-id-230' const='yes' id='type-id-712'/>
    <reference-type-def kind='lvalue' type-id='type-id-712' size-in-bits='64' id='type-id-713'/>
    <pointer-type-def type-id='type-id-712' size-in-bits='64' id='type-id-714'/>
    <qualified-type-def type-id='type-id-99' const='yes' id='type-id-715'/>
    <pointer-type-def type-id='type-id-715' size-in-bits='64' id='type-id-716'/>
    <qualified-type-def type-id='type-id-240' const='yes' id='type-id-717'/>
    <reference-type-def kind='lvalue' type-id='type-id-717' size-in-bits='64' id='type-id-718'/>
    <qualified-type-def type-id='type-id-719' const='yes' id='type-id-720'/>
    <pointer-type-def type-id='type-id-720' size-in-bits='64' id='type-id-721'/>
    <qualified-type-def type-id='type-id-264' const='yes' id='type-id-722'/>
    <pointer-type-def type-id='type-id-722' size-in-bits='64' id='type-id-723'/>
    <qualified-type-def type-id='type-id-260' const='yes' id='type-id-724'/>
    <reference-type-def kind='lvalue' type-id='type-id-724' size-in-bits='64' id='type-id-725'/>
    <qualified-type-def type-id='type-id-267' const='yes' id='type-id-726'/>
    <reference-type-def kind='lvalue' type-id='type-id-726' size-in-bits='64' id='type-id-727'/>
    <pointer-type-def type-id='type-id-726' size-in-bits='64' id='type-id-728'/>
    <qualified-type-def type-id='type-id-728' const='yes' id='type-id-729'/>
    <qualified-type-def type-id='type-id-221' const='yes' id='type-id-210'/>
    <reference-type-def kind='lvalue' type-id='type-id-210' size-in-bits='64' id='type-id-730'/>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' id='type-id-731'/>
    <qualified-type-def type-id='type-id-215' const='yes' id='type-id-732'/>
    <reference-type-def kind='lvalue' type-id='type-id-732' size-in-bits='64' id='type-id-733'/>
    <pointer-type-def type-id='type-id-732' size-in-bits='64' id='type-id-734'/>
    <qualified-type-def type-id='type-id-735' const='yes' id='type-id-736'/>
    <reference-type-def kind='lvalue' type-id='type-id-736' size-in-bits='64' id='type-id-737'/>
    <qualified-type-def type-id='type-id-133' const='yes' id='type-id-738'/>
    <reference-type-def kind='lvalue' type-id='type-id-738' size-in-bits='64' id='type-id-739'/>
    <pointer-type-def type-id='type-id-738' size-in-bits='64' id='type-id-740'/>
    <qualified-type-def type-id='type-id-276' const='yes' id='type-id-286'/>
    <qualified-type-def type-id='type-id-277' const='yes' id='type-id-741'/>
    <reference-type-def kind='lvalue' type-id='type-id-741' size-in-bits='64' id='type-id-283'/>
    <pointer-type-def type-id='type-id-741' size-in-bits='64' id='type-id-282'/>
    <qualified-type-def type-id='type-id-139' const='yes' id='type-id-742'/>
    <reference-type-def kind='lvalue' type-id='type-id-742' size-in-bits='64' id='type-id-743'/>
    <pointer-type-def type-id='type-id-742' size-in-bits='64' id='type-id-744'/>
    <qualified-type-def type-id='type-id-287' const='yes' id='type-id-296'/>
    <qualified-type-def type-id='type-id-288' const='yes' id='type-id-745'/>
    <reference-type-def kind='lvalue' type-id='type-id-745' size-in-bits='64' id='type-id-293'/>
    <pointer-type-def type-id='type-id-745' size-in-bits='64' id='type-id-292'/>
    <qualified-type-def type-id='type-id-145' const='yes' id='type-id-746'/>
    <reference-type-def kind='lvalue' type-id='type-id-746' size-in-bits='64' id='type-id-747'/>
    <pointer-type-def type-id='type-id-746' size-in-bits='64' id='type-id-748'/>
    <qualified-type-def type-id='type-id-297' const='yes' id='type-id-316'/>
    <qualified-type-def type-id='type-id-298' const='yes' id='type-id-749'/>
    <reference-type-def kind='lvalue' type-id='type-id-749' size-in-bits='64' id='type-id-304'/>
    <pointer-type-def type-id='type-id-749' size-in-bits='64' id='type-id-300'/>
    <qualified-type-def type-id='type-id-317' const='yes' id='type-id-750'/>
    <reference-type-def kind='lvalue' type-id='type-id-750' size-in-bits='64' id='type-id-751'/>
    <pointer-type-def type-id='type-id-750' size-in-bits='64' id='type-id-752'/>
    <qualified-type-def type-id='type-id-318' const='yes' id='type-id-327'/>
    <qualified-type-def type-id='type-id-319' const='yes' id='type-id-753'/>
    <reference-type-def kind='lvalue' type-id='type-id-753' size-in-bits='64' id='type-id-754'/>
    <pointer-type-def type-id='type-id-753' size-in-bits='64' id='type-id-324'/>
    <qualified-type-def type-id='type-id-328' const='yes' id='type-id-755'/>
    <reference-type-def kind='lvalue' type-id='type-id-755' size-in-bits='64' id='type-id-756'/>
    <qualified-type-def type-id='type-id-757' const='yes' id='type-id-758'/>
    <pointer-type-def type-id='type-id-758' size-in-bits='64' id='type-id-759'/>
    <qualified-type-def type-id='type-id-760' const='yes' id='type-id-761'/>
    <pointer-type-def type-id='type-id-761' size-in-bits='64' id='type-id-762'/>
    <qualified-type-def type-id='type-id-762' const='yes' id='type-id-763'/>
    <qualified-type-def type-id='type-id-343' const='yes' id='type-id-764'/>
    <reference-type-def kind='lvalue' type-id='type-id-764' size-in-bits='64' id='type-id-765'/>
    <pointer-type-def type-id='type-id-764' size-in-bits='64' id='type-id-766'/>
    <qualified-type-def type-id='type-id-93' const='yes' id='type-id-767'/>
    <pointer-type-def type-id='type-id-767' size-in-bits='64' id='type-id-768'/>
    <qualified-type-def type-id='type-id-95' const='yes' id='type-id-769'/>
    <pointer-type-def type-id='type-id-769' size-in-bits='64' id='type-id-770'/>
    <qualified-type-def type-id='type-id-771' const='yes' id='type-id-772'/>
    <pointer-type-def type-id='type-id-772' size-in-bits='64' id='type-id-351'/>
    <qualified-type-def type-id='type-id-773' const='yes' id='type-id-774'/>
    <pointer-type-def type-id='type-id-774' size-in-bits='64' id='type-id-775'/>
    <qualified-type-def type-id='type-id-775' const='yes' id='type-id-776'/>
    <qualified-type-def type-id='type-id-344' const='yes' id='type-id-777'/>
    <pointer-type-def type-id='type-id-777' size-in-bits='64' id='type-id-349'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-778'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-779'/>
    <pointer-type-def type-id='type-id-363' size-in-bits='64' id='type-id-780'/>
    <pointer-type-def type-id='type-id-781' size-in-bits='64' id='type-id-116'/>
    <pointer-type-def type-id='type-id-782' size-in-bits='64' id='type-id-125'/>
    <pointer-type-def type-id='type-id-783' size-in-bits='64' id='type-id-119'/>
    <pointer-type-def type-id='type-id-784' size-in-bits='64' id='type-id-128'/>
    <pointer-type-def type-id='type-id-785' size-in-bits='64' id='type-id-40'/>
    <pointer-type-def type-id='type-id-786' size-in-bits='64' id='type-id-122'/>
    <pointer-type-def type-id='type-id-787' size-in-bits='64' id='type-id-131'/>
    <pointer-type-def type-id='type-id-788' size-in-bits='64' id='type-id-370'/>
    <pointer-type-def type-id='type-id-789' size-in-bits='64' id='type-id-42'/>
    <reference-type-def kind='lvalue' type-id='type-id-19' size-in-bits='64' id='type-id-790'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-791'/>
    <pointer-type-def type-id='type-id-361' size-in-bits='64' id='type-id-792'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-793'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-794'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-795'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-796'/>
    <pointer-type-def type-id='type-id-381' size-in-bits='64' id='type-id-797'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-798'/>
    <reference-type-def kind='lvalue' type-id='type-id-465' size-in-bits='64' id='type-id-799'/>
    <reference-type-def kind='rvalue' type-id='type-id-465' size-in-bits='64' id='type-id-800'/>
    <pointer-type-def type-id='type-id-465' size-in-bits='64' id='type-id-801'/>
    <pointer-type-def type-id='type-id-802' size-in-bits='64' id='type-id-803'/>
    <pointer-type-def type-id='type-id-804' size-in-bits='64' id='type-id-805'/>
    <reference-type-def kind='lvalue' type-id='type-id-469' size-in-bits='64' id='type-id-806'/>
    <reference-type-def kind='lvalue' type-id='type-id-807' size-in-bits='64' id='type-id-808'/>
    <reference-type-def kind='lvalue' type-id='type-id-472' size-in-bits='64' id='type-id-809'/>
    <reference-type-def kind='rvalue' type-id='type-id-472' size-in-bits='64' id='type-id-810'/>
    <pointer-type-def type-id='type-id-472' size-in-bits='64' id='type-id-811'/>
    <qualified-type-def type-id='type-id-811' const='yes' id='type-id-812'/>
    <pointer-type-def type-id='type-id-813' size-in-bits='64' id='type-id-814'/>
    <qualified-type-def type-id='type-id-814' const='yes' id='type-id-815'/>
    <pointer-type-def type-id='type-id-816' size-in-bits='64' id='type-id-817'/>
    <reference-type-def kind='lvalue' type-id='type-id-477' size-in-bits='64' id='type-id-818'/>
    <reference-type-def kind='lvalue' type-id='type-id-480' size-in-bits='64' id='type-id-819'/>
    <reference-type-def kind='lvalue' type-id='type-id-482' size-in-bits='64' id='type-id-820'/>
    <reference-type-def kind='rvalue' type-id='type-id-482' size-in-bits='64' id='type-id-821'/>
    <pointer-type-def type-id='type-id-482' size-in-bits='64' id='type-id-822'/>
    <reference-type-def kind='lvalue' type-id='type-id-486' size-in-bits='64' id='type-id-823'/>
    <reference-type-def kind='rvalue' type-id='type-id-486' size-in-bits='64' id='type-id-824'/>
    <pointer-type-def type-id='type-id-486' size-in-bits='64' id='type-id-825'/>
    <reference-type-def kind='lvalue' type-id='type-id-489' size-in-bits='64' id='type-id-826'/>
    <reference-type-def kind='rvalue' type-id='type-id-489' size-in-bits='64' id='type-id-827'/>
    <pointer-type-def type-id='type-id-489' size-in-bits='64' id='type-id-828'/>
    <qualified-type-def type-id='type-id-828' const='yes' id='type-id-829'/>
    <reference-type-def kind='lvalue' type-id='type-id-492' size-in-bits='64' id='type-id-830'/>
    <reference-type-def kind='lvalue' type-id='type-id-495' size-in-bits='64' id='type-id-831'/>
    <reference-type-def kind='lvalue' type-id='type-id-498' size-in-bits='64' id='type-id-832'/>
    <pointer-type-def type-id='type-id-498' size-in-bits='64' id='type-id-833'/>
    <reference-type-def kind='lvalue' type-id='type-id-506' size-in-bits='64' id='type-id-834'/>
    <pointer-type-def type-id='type-id-506' size-in-bits='64' id='type-id-835'/>
    <reference-type-def kind='lvalue' type-id='type-id-514' size-in-bits='64' id='type-id-836'/>
    <pointer-type-def type-id='type-id-514' size-in-bits='64' id='type-id-837'/>
    <pointer-type-def type-id='type-id-521' size-in-bits='64' id='type-id-838'/>
    <pointer-type-def type-id='type-id-524' size-in-bits='64' id='type-id-839'/>
    <reference-type-def kind='rvalue' type-id='type-id-840' size-in-bits='64' id='type-id-841'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-842'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-843'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-844'/>
    <pointer-type-def type-id='type-id-845' size-in-bits='64' id='type-id-846'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-16'/>
    <reference-type-def kind='lvalue' type-id='type-id-31' size-in-bits='64' id='type-id-847'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-848'/>
    <qualified-type-def type-id='type-id-848' const='yes' id='type-id-849'/>
    <reference-type-def kind='lvalue' type-id='type-id-849' size-in-bits='64' id='type-id-850'/>
    <pointer-type-def type-id='type-id-848' size-in-bits='64' id='type-id-851'/>
    <pointer-type-def type-id='type-id-546' size-in-bits='64' id='type-id-852'/>
    <qualified-type-def type-id='type-id-852' const='yes' id='type-id-853'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-36'/>
    <pointer-type-def type-id='type-id-550' size-in-bits='64' id='type-id-854'/>
    <qualified-type-def type-id='type-id-854' const='yes' id='type-id-855'/>
    <pointer-type-def type-id='type-id-856' size-in-bits='64' id='type-id-359'/>
    <pointer-type-def type-id='type-id-857' size-in-bits='64' id='type-id-358'/>
    <reference-type-def kind='lvalue' type-id='type-id-182' size-in-bits='64' id='type-id-858'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-859'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-860'/>
    <qualified-type-def type-id='type-id-860' const='yes' id='type-id-861'/>
    <reference-type-def kind='lvalue' type-id='type-id-38' size-in-bits='64' id='type-id-862'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-863'/>
    <qualified-type-def type-id='type-id-863' const='yes' id='type-id-864'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-865'/>
    <reference-type-def kind='lvalue' type-id='type-id-68' size-in-bits='64' id='type-id-866'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-867'/>
    <reference-type-def kind='lvalue' type-id='type-id-61' size-in-bits='64' id='type-id-868'/>
    <reference-type-def kind='lvalue' type-id='type-id-56' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-58'/>
    <reference-type-def kind='lvalue' type-id='type-id-43' size-in-bits='64' id='type-id-50'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-46'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-869'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-870'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-871'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-872'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-873'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-874'/>
    <qualified-type-def type-id='type-id-874' const='yes' id='type-id-875'/>
    <reference-type-def kind='lvalue' type-id='type-id-71' size-in-bits='64' id='type-id-876'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-877'/>
    <reference-type-def kind='lvalue' type-id='type-id-878' size-in-bits='64' id='type-id-879'/>
    <pointer-type-def type-id='type-id-878' size-in-bits='64' id='type-id-187'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' id='type-id-880'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-881'/>
    <reference-type-def kind='lvalue' type-id='type-id-85' size-in-bits='64' id='type-id-882'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-883'/>
    <reference-type-def kind='lvalue' type-id='type-id-87' size-in-bits='64' id='type-id-884'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-885'/>
    <reference-type-def kind='lvalue' type-id='type-id-190' size-in-bits='64' id='type-id-886'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' id='type-id-200'/>
    <qualified-type-def type-id='type-id-200' const='yes' id='type-id-887'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-888'/>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' id='type-id-197'/>
    <reference-type-def kind='lvalue' type-id='type-id-194' size-in-bits='64' id='type-id-889'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-101'/>
    <reference-type-def kind='lvalue' type-id='type-id-890' size-in-bits='64' id='type-id-891'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-892'/>
    <qualified-type-def type-id='type-id-892' const='yes' id='type-id-893'/>
    <pointer-type-def type-id='type-id-608' size-in-bits='64' id='type-id-894'/>
    <reference-type-def kind='lvalue' type-id='type-id-256' size-in-bits='64' id='type-id-259'/>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-895'/>
    <qualified-type-def type-id='type-id-895' const='yes' id='type-id-257'/>
    <reference-type-def kind='lvalue' type-id='type-id-258' size-in-bits='64' id='type-id-896'/>
    <pointer-type-def type-id='type-id-258' size-in-bits='64' id='type-id-897'/>
    <qualified-type-def type-id='type-id-897' const='yes' id='type-id-898'/>
    <reference-type-def kind='lvalue' type-id='type-id-899' size-in-bits='64' id='type-id-900'/>
    <pointer-type-def type-id='type-id-901' size-in-bits='64' id='type-id-902'/>
    <reference-type-def kind='lvalue' type-id='type-id-164' size-in-bits='64' id='type-id-903'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-904'/>
    <reference-type-def kind='lvalue' type-id='type-id-620' size-in-bits='64' id='type-id-156'/>
    <pointer-type-def type-id='type-id-620' size-in-bits='64' id='type-id-905'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-160'/>
    <reference-type-def kind='lvalue' type-id='type-id-169' size-in-bits='64' id='type-id-906'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-175'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-172'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-174'/>
    <reference-type-def kind='lvalue' type-id='type-id-165' size-in-bits='64' id='type-id-907'/>
    <reference-type-def kind='lvalue' type-id='type-id-162' size-in-bits='64' id='type-id-908'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-909'/>
    <reference-type-def kind='lvalue' type-id='type-id-159' size-in-bits='64' id='type-id-910'/>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-911'/>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-912'/>
    <pointer-type-def type-id='type-id-635' size-in-bits='64' id='type-id-154'/>
    <reference-type-def kind='lvalue' type-id='type-id-913' size-in-bits='64' id='type-id-360'/>
    <reference-type-def kind='lvalue' type-id='type-id-339' size-in-bits='64' id='type-id-914'/>
    <reference-type-def kind='lvalue' type-id='type-id-245' size-in-bits='64' id='type-id-915'/>
    <pointer-type-def type-id='type-id-245' size-in-bits='64' id='type-id-916'/>
    <pointer-type-def type-id='type-id-917' size-in-bits='64' id='type-id-198'/>
    <reference-type-def kind='lvalue' type-id='type-id-918' size-in-bits='64' id='type-id-919'/>
    <pointer-type-def type-id='type-id-920' size-in-bits='64' id='type-id-357'/>
    <pointer-type-def type-id='type-id-921' size-in-bits='64' id='type-id-922'/>
    <reference-type-def kind='lvalue' type-id='type-id-253' size-in-bits='64' id='type-id-923'/>
    <pointer-type-def type-id='type-id-253' size-in-bits='64' id='type-id-924'/>
    <pointer-type-def type-id='type-id-925' size-in-bits='64' id='type-id-254'/>
    <reference-type-def kind='lvalue' type-id='type-id-345' size-in-bits='64' id='type-id-926'/>
    <pointer-type-def type-id='type-id-345' size-in-bits='64' id='type-id-161'/>
    <pointer-type-def type-id='type-id-927' size-in-bits='64' id='type-id-188'/>
    <qualified-type-def type-id='type-id-161' const='yes' id='type-id-928'/>
    <reference-type-def kind='lvalue' type-id='type-id-73' size-in-bits='64' id='type-id-929'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-930'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-155'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-931'/>
    <reference-type-def kind='lvalue' type-id='type-id-178' size-in-bits='64' id='type-id-932'/>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-933'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-934'/>
    <reference-type-def kind='lvalue' type-id='type-id-177' size-in-bits='64' id='type-id-935'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-936'/>
    <reference-type-def kind='lvalue' type-id='type-id-179' size-in-bits='64' id='type-id-937'/>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-938'/>
    <reference-type-def kind='lvalue' type-id='type-id-184' size-in-bits='64' id='type-id-939'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-185'/>
    <reference-type-def kind='lvalue' type-id='type-id-74' size-in-bits='64' id='type-id-940'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-941'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-942'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-78'/>
    <reference-type-def kind='lvalue' type-id='type-id-79' size-in-bits='64' id='type-id-943'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-944'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-945'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-82'/>
    <reference-type-def kind='lvalue' type-id='type-id-176' size-in-bits='64' id='type-id-946'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-947'/>
    <qualified-type-def type-id='type-id-947' const='yes' id='type-id-948'/>
    <pointer-type-def type-id='type-id-949' size-in-bits='64' id='type-id-950'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-951'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-952'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-953'/>
    <reference-type-def kind='lvalue' type-id='type-id-44' size-in-bits='64' id='type-id-954'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-69'/>
    <qualified-type-def type-id='type-id-69' const='yes' id='type-id-955'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-956'/>
    <qualified-type-def type-id='type-id-956' const='yes' id='type-id-957'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-958'/>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-959'/>
    <reference-type-def kind='lvalue' type-id='type-id-218' size-in-bits='64' id='type-id-960'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-961'/>
    <reference-type-def kind='lvalue' type-id='type-id-211' size-in-bits='64' id='type-id-962'/>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' id='type-id-963'/>
    <reference-type-def kind='lvalue' type-id='type-id-226' size-in-bits='64' id='type-id-964'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-965'/>
    <reference-type-def kind='lvalue' type-id='type-id-230' size-in-bits='64' id='type-id-966'/>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' id='type-id-967'/>
    <pointer-type-def type-id='type-id-261' size-in-bits='64' id='type-id-265'/>
    <reference-type-def kind='lvalue' type-id='type-id-264' size-in-bits='64' id='type-id-262'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-266'/>
    <reference-type-def kind='lvalue' type-id='type-id-260' size-in-bits='64' id='type-id-968'/>
    <pointer-type-def type-id='type-id-260' size-in-bits='64' id='type-id-263'/>
    <pointer-type-def type-id='type-id-969' size-in-bits='64' id='type-id-970'/>
    <pointer-type-def type-id='type-id-267' size-in-bits='64' id='type-id-971'/>
    <qualified-type-def type-id='type-id-971' const='yes' id='type-id-972'/>
    <reference-type-def kind='lvalue' type-id='type-id-221' size-in-bits='64' id='type-id-973'/>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' id='type-id-974'/>
    <reference-type-def kind='lvalue' type-id='type-id-215' size-in-bits='64' id='type-id-975'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-976'/>
    <reference-type-def kind='lvalue' type-id='type-id-977' size-in-bits='64' id='type-id-978'/>
    <pointer-type-def type-id='type-id-735' size-in-bits='64' id='type-id-979'/>
    <reference-type-def kind='lvalue' type-id='type-id-133' size-in-bits='64' id='type-id-980'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-981'/>
    <reference-type-def kind='lvalue' type-id='type-id-277' size-in-bits='64' id='type-id-982'/>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' id='type-id-280'/>
    <reference-type-def kind='lvalue' type-id='type-id-139' size-in-bits='64' id='type-id-983'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-984'/>
    <reference-type-def kind='lvalue' type-id='type-id-288' size-in-bits='64' id='type-id-985'/>
    <pointer-type-def type-id='type-id-288' size-in-bits='64' id='type-id-290'/>
    <reference-type-def kind='lvalue' type-id='type-id-145' size-in-bits='64' id='type-id-986'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-987'/>
    <qualified-type-def type-id='type-id-987' const='yes' id='type-id-988'/>
    <reference-type-def kind='lvalue' type-id='type-id-298' size-in-bits='64' id='type-id-989'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' id='type-id-302'/>
    <reference-type-def kind='lvalue' type-id='type-id-317' size-in-bits='64' id='type-id-990'/>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' id='type-id-991'/>
    <reference-type-def kind='lvalue' type-id='type-id-319' size-in-bits='64' id='type-id-992'/>
    <pointer-type-def type-id='type-id-319' size-in-bits='64' id='type-id-322'/>
    <pointer-type-def type-id='type-id-757' size-in-bits='64' id='type-id-353'/>
    <pointer-type-def type-id='type-id-760' size-in-bits='64' id='type-id-993'/>
    <qualified-type-def type-id='type-id-993' const='yes' id='type-id-994'/>
    <reference-type-def kind='lvalue' type-id='type-id-343' size-in-bits='64' id='type-id-995'/>
    <pointer-type-def type-id='type-id-343' size-in-bits='64' id='type-id-996'/>
    <qualified-type-def type-id='type-id-996' const='yes' id='type-id-997'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-998'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-999'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-1000'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-1001'/>
    <pointer-type-def type-id='type-id-771' size-in-bits='64' id='type-id-348'/>
    <pointer-type-def type-id='type-id-773' size-in-bits='64' id='type-id-346'/>
    <qualified-type-def type-id='type-id-346' const='yes' id='type-id-1002'/>
    <pointer-type-def type-id='type-id-344' size-in-bits='64' id='type-id-347'/>
    <class-decl name='_GdkEventKey' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-180'/>
    <class-decl name='_GdkWindow' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-106'/>
    <class-decl name='_GtkRcStyle' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-110'/>
    <class-decl name='_GtkWidget' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-108'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-398'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-399'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-400'/>
    <class-decl name='wxAcceleratorTable' visibility='default' is-declaration-only='yes' id='type-id-543'/>
    <class-decl name='wxActivityIndicator' visibility='default' is-declaration-only='yes' id='type-id-546'>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK19wxActivityIndicator12GetClassInfoEv' filepath='include/wx/gtk/activityindicator.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-548' is-artificial='yes'/>
          <return type-id='type-id-200'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='174'>
        <function-decl name='DoGetBestClientSize' mangled-name='_ZNK19wxActivityIndicator19DoGetBestClientSizeEv' filepath='include/wx/gtk/activityindicator.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-548' is-artificial='yes'/>
          <return type-id='type-id-176'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='212'>
        <function-decl name='Start' mangled-name='_ZN19wxActivityIndicator5StartEv' filepath='include/wx/gtk/activityindicator.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-852' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='213'>
        <function-decl name='Stop' mangled-name='_ZN19wxActivityIndicator4StopEv' filepath='include/wx/gtk/activityindicator.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-852' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='214'>
        <function-decl name='IsRunning' mangled-name='_ZNK19wxActivityIndicator9IsRunningEv' filepath='include/wx/gtk/activityindicator.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-548' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxAnimation' visibility='default' is-declaration-only='yes' id='type-id-856'>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK11wxAnimation12GetClassInfoEv' filepath='include/wx/animate.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1003' is-artificial='yes'/>
          <return type-id='type-id-200'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxAnimationCtrlBase' visibility='default' is-declaration-only='yes' id='type-id-857'>
      <member-function access='public' vtable-offset='218'>
        <function-decl name='SetInactiveBitmap' mangled-name='_ZN19wxAnimationCtrlBase17SetInactiveBitmapERK14wxBitmapBundle' filepath='include/wx/animate.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-358' is-artificial='yes'/>
          <parameter type-id='type-id-577'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='220'>
        <function-decl name='UpdateStaticImage' mangled-name='_ZN19wxAnimationCtrlBase17UpdateStaticImageEv' filepath='include/wx/animate.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-358' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxBitmap' visibility='default' is-declaration-only='yes' id='type-id-320'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD0Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD0Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD0Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD0Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD0Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD0Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD0Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD1Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD1Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD1Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD1Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD1Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD1Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD1Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD1Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD2Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxBitmap' mangled-name='_ZN8wxBitmapD4Ev' filepath='include/wx/gtk/bitmap.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK8wxBitmap12GetClassInfoEv' filepath='include/wx/gtk/bitmap.h' line='186' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1005' is-artificial='yes'/>
          <return type-id='type-id-200'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='6'>
        <function-decl name='CreateGDIRefData' mangled-name='_ZNK8wxBitmap16CreateGDIRefDataEv' filepath='include/wx/gtk/bitmap.h' line='158' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1005' is-artificial='yes'/>
          <return type-id='type-id-1006'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='7'>
        <function-decl name='CloneGDIRefData' mangled-name='_ZNK8wxBitmap15CloneGDIRefDataEPK12wxGDIRefData' filepath='include/wx/gtk/bitmap.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1005' is-artificial='yes'/>
          <parameter type-id='type-id-1007'/>
          <return type-id='type-id-1006'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='Create' mangled-name='_ZN8wxBitmap6CreateEiii' filepath='include/wx/gtk/bitmap.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='Create' mangled-name='_ZN8wxBitmap6CreateERK6wxSizei' filepath='include/wx/gtk/bitmap.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-696'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='10'>
        <function-decl name='GetHeight' mangled-name='_ZNK8wxBitmap9GetHeightEv' filepath='include/wx/gtk/bitmap.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1005' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='11'>
        <function-decl name='GetWidth' mangled-name='_ZNK8wxBitmap8GetWidthEv' filepath='include/wx/gtk/bitmap.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1005' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='12'>
        <function-decl name='GetDepth' mangled-name='_ZNK8wxBitmap8GetDepthEv' filepath='include/wx/gtk/bitmap.h' line='98' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1005' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <function-decl name='SetScaleFactor' mangled-name='_ZN8wxBitmap14SetScaleFactorEd' filepath='include/wx/gtk/bitmap.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-17'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='14'>
        <function-decl name='GetScaleFactor' mangled-name='_ZNK8wxBitmap14GetScaleFactorEv' filepath='include/wx/gtk/bitmap.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1005' is-artificial='yes'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='15'>
        <function-decl name='ConvertToImage' mangled-name='_ZNK8wxBitmap14ConvertToImageEv' filepath='include/wx/gtk/bitmap.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1005' is-artificial='yes'/>
          <return type-id='type-id-648'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='16'>
        <function-decl name='GetMask' mangled-name='_ZNK8wxBitmap7GetMaskEv' filepath='include/wx/gtk/bitmap.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1005' is-artificial='yes'/>
          <return type-id='type-id-1008'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <function-decl name='SetMask' mangled-name='_ZN8wxBitmap7SetMaskEP6wxMask' filepath='include/wx/gtk/bitmap.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-1008'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='18'>
        <function-decl name='GetSubBitmap' mangled-name='_ZNK8wxBitmap12GetSubBitmapERK6wxRect' filepath='include/wx/gtk/bitmap.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1005' is-artificial='yes'/>
          <parameter type-id='type-id-672'/>
          <return type-id='type-id-320'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='19'>
        <function-decl name='SaveFile' mangled-name='_ZNK8wxBitmap8SaveFileERK8wxString12wxBitmapTypePK9wxPalette' filepath='include/wx/gtk/bitmap.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1005' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <parameter type-id='type-id-1009'/>
          <parameter type-id='type-id-1010'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='LoadFile' mangled-name='_ZN8wxBitmap8LoadFileERK8wxString12wxBitmapType' filepath='include/wx/gtk/bitmap.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <parameter type-id='type-id-1009'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='21'>
        <function-decl name='GetPalette' mangled-name='_ZNK8wxBitmap10GetPaletteEv' filepath='include/wx/gtk/bitmap.h' line='114' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1005' is-artificial='yes'/>
          <return type-id='type-id-1011'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <function-decl name='SetPalette' mangled-name='_ZN8wxBitmap10SetPaletteERK9wxPalette' filepath='include/wx/gtk/bitmap.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-1012'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='23'>
        <function-decl name='HasAlpha' mangled-name='_ZNK8wxBitmap8HasAlphaEv' filepath='include/wx/gtk/bitmap.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1005' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='25'>
        <function-decl name='SetHeight' mangled-name='_ZN8wxBitmap9SetHeightEi' filepath='include/wx/gtk/bitmap.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='26'>
        <function-decl name='SetWidth' mangled-name='_ZN8wxBitmap8SetWidthEi' filepath='include/wx/gtk/bitmap.h' line='126' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='27'>
        <function-decl name='SetDepth' mangled-name='_ZN8wxBitmap8SetDepthEi' filepath='include/wx/gtk/bitmap.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='29'>
        <function-decl name='DoCreate' mangled-name='_ZN8wxBitmap8DoCreateERK6wxSizedi' filepath='include/wx/gtk/bitmap.h' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1004' is-artificial='yes'/>
          <parameter type-id='type-id-696'/>
          <parameter type-id='type-id-17'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxBitmapBundleImpl' visibility='default' is-declaration-only='yes' id='type-id-878'/>
    <class-decl name='wxColour' visibility='default' is-declaration-only='yes' id='type-id-340'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD0Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD0Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD0Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD0Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD0Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD0Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD0Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD0Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD0Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD0Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD0Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD1Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD1Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD1Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD1Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD1Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD1Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD1Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD1Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD1Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD1Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD1Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD1Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD4Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK8wxColour12GetClassInfoEv' filepath='include/wx/gtk/colour.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1014' is-artificial='yes'/>
          <return type-id='type-id-200'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='8'>
        <function-decl name='Red' mangled-name='_ZNK8wxColour3RedEv' filepath='include/wx/gtk/colour.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1014' is-artificial='yes'/>
          <return type-id='type-id-27'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='9'>
        <function-decl name='Green' mangled-name='_ZNK8wxColour5GreenEv' filepath='include/wx/gtk/colour.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1014' is-artificial='yes'/>
          <return type-id='type-id-27'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='10'>
        <function-decl name='Blue' mangled-name='_ZNK8wxColour4BlueEv' filepath='include/wx/gtk/colour.h' line='38' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1014' is-artificial='yes'/>
          <return type-id='type-id-27'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='11'>
        <function-decl name='Alpha' mangled-name='_ZNK8wxColour5AlphaEv' filepath='include/wx/gtk/colour.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1014' is-artificial='yes'/>
          <return type-id='type-id-27'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='14'>
        <function-decl name='InitRGBA' mangled-name='_ZN8wxColour8InitRGBAEhhhh' filepath='include/wx/gtk/colour.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-27'/>
          <parameter type-id='type-id-27'/>
          <parameter type-id='type-id-27'/>
          <parameter type-id='type-id-27'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='15'>
        <function-decl name='FromString' mangled-name='_ZN8wxColour10FromStringERK8wxString' filepath='include/wx/gtk/colour.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1013' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxCommandEvent' visibility='default' is-declaration-only='yes' id='type-id-890'>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK14wxCommandEvent12GetClassInfoEv' filepath='include/wx/event.h' line='1660' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1015' is-artificial='yes'/>
          <return type-id='type-id-200'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='Clone' mangled-name='_ZNK14wxCommandEvent5CloneEv' filepath='include/wx/event.h' line='1651' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1015' is-artificial='yes'/>
          <return type-id='type-id-905'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='6'>
        <function-decl name='GetEventCategory' mangled-name='_ZNK14wxCommandEvent16GetEventCategoryEv' filepath='include/wx/event.h' line='1652' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1015' is-artificial='yes'/>
          <return type-id='type-id-1016'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxControl' visibility='default' is-declaration-only='yes' id='type-id-34'>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK9wxControl12GetClassInfoEv' filepath='include/wx/gtk/control.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-607' is-artificial='yes'/>
          <return type-id='type-id-200'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='105'>
        <function-decl name='GetDefaultAttributes' mangled-name='_ZNK9wxControl20GetDefaultAttributesEv' filepath='include/wx/gtk/control.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-607' is-artificial='yes'/>
          <return type-id='type-id-338'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='111'>
        <function-decl name='SetFont' mangled-name='_ZN9wxControl7SetFontERK6wxFont' filepath='include/wx/gtk/control.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-892' is-artificial='yes'/>
          <parameter type-id='type-id-639'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='173'>
        <function-decl name='DoGetBestSize' mangled-name='_ZNK9wxControl13DoGetBestSizeEv' filepath='include/wx/gtk/control.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-607' is-artificial='yes'/>
          <return type-id='type-id-176'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='211'>
        <function-decl name='UseGTKStyleBase' mangled-name='_ZNK9wxControl15UseGTKStyleBaseEv' filepath='include/wx/gtk/control.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-607' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxControlBase' visibility='default' is-declaration-only='yes' id='type-id-608'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD4Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='23'>
        <function-decl name='SetLabel' mangled-name='_ZN13wxControlBase8SetLabelERK8wxString' filepath='include/wx/control.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='24'>
        <function-decl name='GetLabel' mangled-name='_ZNK13wxControlBase8GetLabelEv' filepath='include/wx/control.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-610' is-artificial='yes'/>
          <return type-id='type-id-44'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='116'>
        <function-decl name='DoUpdateWindowUI' mangled-name='_ZN13wxControlBase16DoUpdateWindowUIER15wxUpdateUIEvent' filepath='include/wx/control.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-978'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='152'>
        <function-decl name='ShouldInheritColours' mangled-name='_ZNK13wxControlBase20ShouldInheritColoursEv' filepath='include/wx/control.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-610' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='161'>
        <function-decl name='GetDefaultBorder' mangled-name='_ZNK13wxControlBase16GetDefaultBorderEv' filepath='include/wx/control.h' line='161' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-610' is-artificial='yes'/>
          <return type-id='type-id-37'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='206'>
        <function-decl name='SetLabelText' mangled-name='_ZN13wxControlBase12SetLabelTextERK8wxString' filepath='include/wx/control.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='207'>
        <function-decl name='GetLabelText' mangled-name='_ZNK13wxControlBase12GetLabelTextEv' filepath='include/wx/control.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-610' is-artificial='yes'/>
          <return type-id='type-id-44'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='208'>
        <function-decl name='Command' mangled-name='_ZN13wxControlBase7CommandER14wxCommandEvent' filepath='include/wx/control.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-891'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='209'>
        <function-decl name='DoSetLabelMarkup' mangled-name='_ZN13wxControlBase16DoSetLabelMarkupERK8wxString' filepath='include/wx/control.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-894' is-artificial='yes'/>
          <parameter type-id='type-id-350'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='210'>
        <function-decl name='DoGetSizeFromTextSize' mangled-name='_ZNK13wxControlBase21DoGetSizeFromTextSizeEii' filepath='include/wx/control.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-610' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-176'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxCursor' visibility='default' is-declaration-only='yes' id='type-id-615'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxCursor' mangled-name='_ZN8wxCursorD0Ev' filepath='include/wx/gtk/cursor.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1017' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxCursor' mangled-name='_ZN8wxCursorD0Ev' filepath='include/wx/gtk/cursor.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1017' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxCursor' mangled-name='_ZN8wxCursorD1Ev' filepath='include/wx/gtk/cursor.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1017' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxCursor' mangled-name='_ZN8wxCursorD1Ev' filepath='include/wx/gtk/cursor.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1017' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxCursor' mangled-name='_ZN8wxCursorD1Ev' filepath='include/wx/gtk/cursor.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1017' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxCursor' mangled-name='_ZN8wxCursorD1Ev' filepath='include/wx/gtk/cursor.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1017' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxCursor' mangled-name='_ZN8wxCursorD1Ev' filepath='include/wx/gtk/cursor.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1017' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxCursor' mangled-name='_ZN8wxCursorD4Ev' filepath='include/wx/gtk/cursor.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1017' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK8wxCursor12GetClassInfoEv' filepath='include/wx/gtk/cursor.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1018' is-artificial='yes'/>
          <return type-id='type-id-200'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='6'>
        <function-decl name='CreateGDIRefData' mangled-name='_ZNK8wxCursor16CreateGDIRefDataEv' filepath='include/wx/gtk/cursor.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1018' is-artificial='yes'/>
          <return type-id='type-id-1006'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='7'>
        <function-decl name='CloneGDIRefData' mangled-name='_ZNK8wxCursor15CloneGDIRefDataEPK12wxGDIRefData' filepath='include/wx/gtk/cursor.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1018' is-artificial='yes'/>
          <parameter type-id='type-id-1007'/>
          <return type-id='type-id-1006'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='8'>
        <function-decl name='GetHotSpot' mangled-name='_ZNK8wxCursor10GetHotSpotEv' filepath='include/wx/gtk/cursor.h' line='38' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1018' is-artificial='yes'/>
          <return type-id='type-id-178'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxDC' visibility='default' is-declaration-only='yes' id='type-id-899'/>
    <class-decl name='wxDropTarget' visibility='default' is-declaration-only='yes' id='type-id-901'/>
    <class-decl name='wxEvent' visibility='default' is-declaration-only='yes' id='type-id-620'>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK7wxEvent12GetClassInfoEv' filepath='include/wx/event.h' line='1140' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1019' is-artificial='yes'/>
          <return type-id='type-id-200'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='6'>
        <function-decl name='GetEventCategory' mangled-name='_ZNK7wxEvent16GetEventCategoryEv' filepath='include/wx/event.h' line='1010' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1019' is-artificial='yes'/>
          <return type-id='type-id-1016'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEventFunctor' visibility='default' is-declaration-only='yes' id='type-id-153'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD4Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK14wxEventFunctor13GetEvtHandlerEv' filepath='include/wx/event.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1020' is-artificial='yes'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK14wxEventFunctor12GetEvtMethodEv' filepath='include/wx/event.h' line='250' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1020' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEvtHandler' visibility='default' is-declaration-only='yes' id='type-id-635'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEvtHandler' mangled-name='_ZN12wxEvtHandlerD2Ev' filepath='include/wx/event.h' line='3639' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-154' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEvtHandler' mangled-name='_ZN12wxEvtHandlerD2Ev' filepath='include/wx/event.h' line='3639' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-154' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEvtHandler' mangled-name='_ZN12wxEvtHandlerD4Ev' filepath='include/wx/event.h' line='3639' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-154' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK12wxEvtHandler12GetClassInfoEv' filepath='include/wx/event.h' line='4096' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-637' is-artificial='yes'/>
          <return type-id='type-id-200'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='SetNextHandler' mangled-name='_ZN12wxEvtHandler14SetNextHandlerEPS_' filepath='include/wx/event.h' line='3647' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-154' is-artificial='yes'/>
          <parameter type-id='type-id-154'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='SetPreviousHandler' mangled-name='_ZN12wxEvtHandler18SetPreviousHandlerEPS_' filepath='include/wx/event.h' line='3648' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-154' is-artificial='yes'/>
          <parameter type-id='type-id-154'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='ProcessEvent' mangled-name='_ZN12wxEvtHandler12ProcessEventER7wxEvent' filepath='include/wx/event.h' line='3677' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-154' is-artificial='yes'/>
          <parameter type-id='type-id-156'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='QueueEvent' mangled-name='_ZN12wxEvtHandler10QueueEventEP7wxEvent' filepath='include/wx/event.h' line='3705' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-154' is-artificial='yes'/>
          <parameter type-id='type-id-905'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='AddPendingEvent' mangled-name='_ZN12wxEvtHandler15AddPendingEventERK7wxEvent' filepath='include/wx/event.h' line='3709' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-154' is-artificial='yes'/>
          <parameter type-id='type-id-622'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='SearchEventTable' mangled-name='_ZN12wxEvtHandler16SearchEventTableER12wxEventTableR7wxEvent' filepath='include/wx/event.h' line='3964' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-154' is-artificial='yes'/>
          <parameter type-id='type-id-907'/>
          <parameter type-id='type-id-156'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='11'>
        <function-decl name='TryBefore' mangled-name='_ZN12wxEvtHandler9TryBeforeER7wxEvent' filepath='include/wx/event.h' line='3994' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-154' is-artificial='yes'/>
          <parameter type-id='type-id-156'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='12'>
        <function-decl name='TryAfter' mangled-name='_ZN12wxEvtHandler8TryAfterER7wxEvent' filepath='include/wx/event.h' line='4014' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-154' is-artificial='yes'/>
          <parameter type-id='type-id-156'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='13'>
