<abi-corpus version='2.0' architecture='elf-amd-x86_64' soname='libwx_gtk3u_media-3.2.so.0'>
  <elf-needed>
    <dependency name='libgtk-3.so.0'/>
    <dependency name='libgdk-3.so.0'/>
    <dependency name='libcairo.so.2'/>
    <dependency name='libgobject-2.0.so.0'/>
    <dependency name='libglib-2.0.so.0'/>
    <dependency name='libwx_gtk3u_core-3.2.so.0'/>
    <dependency name='libwx_baseu-3.2.so.0'/>
    <dependency name='libgstvideo-1.0.so.0'/>
    <dependency name='libgstreamer-1.0.so.0'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_ZN11wxMediaCtrl11NextBackendEPN11wxClassInfo14const_iteratorE' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN11wxMediaCtrl12DoMoveWindowEiiii' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN11wxMediaCtrl15GetPlaybackRateEv' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN11wxMediaCtrl15SetPlaybackRateEd' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_ZN11wxMediaCtrl12ms_classInfoE' size='48' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN12wxMediaEvent12ms_classInfoE' size='48' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN14wxMediaBackend12ms_classInfoE' size='48' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN23wxGStreamerMediaBackend12ms_classInfoE' size='48' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTI11wxMediaCtrl' size='24' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTI12wxMediaEvent' size='24' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTI14wxMediaBackend' size='24' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTI23wxGStreamerMediaBackend' size='24' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTI24wxMediaBackendCommonBase' size='24' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS11wxMediaCtrl' size='14' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS12wxMediaEvent' size='15' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS14wxMediaBackend' size='17' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS23wxGStreamerMediaBackend' size='26' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS24wxMediaBackendCommonBase' size='27' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV11wxMediaCtrl' size='1712' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV12wxMediaEvent' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV14wxMediaBackend' size='240' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV23wxGStreamerMediaBackend' size='240' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV24wxMediaBackendCommonBase' size='240' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_MEDIA_FINISHED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_MEDIA_LOADED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_MEDIA_PAUSE' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_MEDIA_PLAY' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_MEDIA_STATECHANGED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_MEDIA_STOP' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/common/mediactrlcmn.cpp' language='LANG_C_plus_plus_14'>
    <type-decl name='__float128' size-in-bits='128' id='type-id-1'/>
    <type-decl name='__int128' size-in-bits='128' id='type-id-2'/>
    <type-decl name='bool' size-in-bits='8' id='type-id-3'/>
    <type-decl name='char' size-in-bits='8' id='type-id-4'/>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='128' id='type-id-5'>
      <subrange length='16' type-id='type-id-6' id='type-id-7'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='8' id='type-id-8'>
      <subrange length='1' type-id='type-id-6' id='type-id-9'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='160' id='type-id-10'>
      <subrange length='20' type-id='type-id-6' id='type-id-11'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='32' id='type-id-12'>
      <subrange length='4' type-id='type-id-6' id='type-id-13'/>
    </array-type-def>
    <class-decl name='typedef __va_list_tag __va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-16' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='type-id-17'/>
    <type-decl name='float' size-in-bits='32' id='type-id-18'/>
    <type-decl name='int' size-in-bits='32' id='type-id-19'/>
    <type-decl name='long double' size-in-bits='128' id='type-id-20'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-21'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-22'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-23'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-24'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-25'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-26'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-27'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-15'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-6'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-28'/>
    <type-decl name='variadic parameter type' id='type-id-29'/>
    <type-decl name='void' id='type-id-30'/>
    <type-decl name='wchar_t' size-in-bits='32' id='type-id-31'/>
    <array-type-def dimensions='1' type-id='type-id-31' size-in-bits='128' id='type-id-32'>
      <subrange length='4' type-id='type-id-6' id='type-id-13'/>
    </array-type-def>
    <class-decl name='wxScopedCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='66' column='1' id='type-id-33'>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-4' filepath='include/wx/buffer.h' line='69' column='1' id='type-id-34'/>
      </member-type>
      <member-type access='protected'>
        <class-decl name='Data' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='164' column='1' id='type-id-35'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-36'/>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-37' visibility='default' filepath='include/wx/buffer.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxScopedCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='66' column='1' id='type-id-38'>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-31' filepath='include/wx/buffer.h' line='69' column='1' id='type-id-39'/>
      </member-type>
      <member-type access='protected'>
        <class-decl name='Data' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='164' column='1' id='type-id-40'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-36'/>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-41' visibility='default' filepath='include/wx/buffer.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxScopedCharBuffer' type-id='type-id-33' filepath='include/wx/buffer.h' line='241' column='1' id='type-id-42'/>
    <typedef-decl name='wxScopedWCharBuffer' type-id='type-id-38' filepath='include/wx/buffer.h' line='242' column='1' id='type-id-43'/>
    <class-decl name='wxCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='247' column='1' id='type-id-44'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-33'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-4' filepath='include/wx/buffer.h' line='253' column='1' id='type-id-45'/>
      </member-type>
    </class-decl>
    <class-decl name='wxCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='247' column='1' id='type-id-46'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-38'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-31' filepath='include/wx/buffer.h' line='253' column='1' id='type-id-47'/>
      </member-type>
    </class-decl>
    <class-decl name='wxCharBuffer' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='357' column='1' id='type-id-48'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-44'/>
      <member-type access='public'>
        <typedef-decl name='wxCharTypeBufferBase' type-id='type-id-44' filepath='include/wx/buffer.h' line='360' column='1' id='type-id-49'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='wxScopedCharTypeBufferBase' type-id='type-id-33' filepath='include/wx/buffer.h' line='361' column='1' id='type-id-50'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWritableCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='393' column='1' id='type-id-51'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-44'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-34' filepath='include/wx/buffer.h' line='396' column='1' id='type-id-52'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWritableCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='393' column='1' id='type-id-53'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-46'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-39' filepath='include/wx/buffer.h' line='396' column='1' id='type-id-54'/>
      </member-type>
    </class-decl>
    <typedef-decl name='wxWritableCharBuffer' type-id='type-id-51' filepath='include/wx/buffer.h' line='410' column='1' id='type-id-55'/>
    <typedef-decl name='wxWritableWCharBuffer' type-id='type-id-53' filepath='include/wx/buffer.h' line='411' column='1' id='type-id-56'/>
    <typedef-decl name='wxChar' type-id='type-id-31' filepath='include/wx/chartype.h' line='123' column='1' id='type-id-57'/>
    <typedef-decl name='wxStringCharType' type-id='type-id-31' filepath='include/wx/chartype.h' line='170' column='1' id='type-id-58'/>
    <class-decl name='wxClientData' size-in-bits='64' visibility='default' filepath='include/wx/clntdata.h' line='98' column='1' id='type-id-59'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxClientData' mangled-name='_ZN12wxClientDataD4Ev' filepath='include/wx/clntdata.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-60' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='wxBorder' filepath='include/wx/defs.h' line='1443' column='1' id='type-id-61'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxBORDER_DEFAULT' value='0'/>
      <enumerator name='wxBORDER_NONE' value='2097152'/>
      <enumerator name='wxBORDER_STATIC' value='16777216'/>
      <enumerator name='wxBORDER_SIMPLE' value='33554432'/>
      <enumerator name='wxBORDER_RAISED' value='67108864'/>
      <enumerator name='wxBORDER_SUNKEN' value='134217728'/>
      <enumerator name='wxBORDER_DOUBLE' value='268435456'/>
      <enumerator name='wxBORDER_THEME' value='268435456'/>
      <enumerator name='wxBORDER_MASK' value='522190848'/>
    </enum-decl>
    <enum-decl name='wxBackgroundStyle' filepath='include/wx/defs.h' line='1816' column='1' id='type-id-62'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxBG_STYLE_ERASE' value='0'/>
      <enumerator name='wxBG_STYLE_SYSTEM' value='1'/>
      <enumerator name='wxBG_STYLE_PAINT' value='2'/>
      <enumerator name='wxBG_STYLE_TRANSPARENT' value='3'/>
      <enumerator name='wxBG_STYLE_COLOUR' value='4'/>
      <enumerator name='wxBG_STYLE_CUSTOM' value='2'/>
    </enum-decl>
    <enum-decl name='wxKeyType' filepath='include/wx/defs.h' line='1857' column='1' id='type-id-63'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxKEY_NONE' value='0'/>
      <enumerator name='wxKEY_INTEGER' value='1'/>
      <enumerator name='wxKEY_STRING' value='2'/>
    </enum-decl>
    <typedef-decl name='wxWindowID' type-id='type-id-19' filepath='include/wx/defs.h' line='2069' column='1' id='type-id-64'/>
    <enum-decl name='wxHitTest' filepath='include/wx/defs.h' line='2099' column='1' id='type-id-65'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxHT_NOWHERE' value='0'/>
      <enumerator name='wxHT_SCROLLBAR_FIRST' value='0'/>
      <enumerator name='wxHT_SCROLLBAR_ARROW_LINE_1' value='1'/>
      <enumerator name='wxHT_SCROLLBAR_ARROW_LINE_2' value='2'/>
      <enumerator name='wxHT_SCROLLBAR_ARROW_PAGE_1' value='3'/>
      <enumerator name='wxHT_SCROLLBAR_ARROW_PAGE_2' value='4'/>
      <enumerator name='wxHT_SCROLLBAR_THUMB' value='5'/>
      <enumerator name='wxHT_SCROLLBAR_BAR_1' value='6'/>
      <enumerator name='wxHT_SCROLLBAR_BAR_2' value='7'/>
      <enumerator name='wxHT_SCROLLBAR_LAST' value='8'/>
      <enumerator name='wxHT_WINDOW_OUTSIDE' value='9'/>
      <enumerator name='wxHT_WINDOW_INSIDE' value='10'/>
      <enumerator name='wxHT_WINDOW_VERT_SCROLLBAR' value='11'/>
      <enumerator name='wxHT_WINDOW_HORZ_SCROLLBAR' value='12'/>
      <enumerator name='wxHT_WINDOW_CORNER' value='13'/>
      <enumerator name='wxHT_MAX' value='14'/>
    </enum-decl>
    <typedef-decl name='GdkWindow' type-id='type-id-66' filepath='include/wx/defs.h' line='3091' column='1' id='type-id-67'/>
    <typedef-decl name='GtkWidget' type-id='type-id-68' filepath='include/wx/defs.h' line='3103' column='1' id='type-id-69'/>
    <typedef-decl name='GtkRcStyle' type-id='type-id-70' filepath='include/wx/defs.h' line='3104' column='1' id='type-id-71'/>
    <typedef-decl name='WXWidget' type-id='type-id-72' filepath='include/wx/defs.h' line='3115' column='1' id='type-id-73'/>
    <class-decl name='wxArray_SortFunction&lt;_GdkWindow*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-74'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-76' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-75'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-75' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArray_SortFunction&lt;const wxEventTableEntry*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-77'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-79' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-78'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-78' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;_GdkWindow*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-80'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-82' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-81'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-81' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;const wxEventTableEntry*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-83'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-85' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-84'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-84' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxBaseArray&lt;_GdkWindow*, wxSortedArray_SortFunction&lt;_GdkWindow*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-86'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-87'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-81' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-88'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-75' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-89'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-91' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-90'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseArray&lt;const wxEventTableEntry*, wxSortedArray_SortFunction&lt;const wxEventTableEntry*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-92'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-93'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-84' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-94'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-78' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-95'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-97' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-96'/>
      </member-type>
    </class-decl>
    <typedef-decl name='wxEventType' type-id='type-id-19' filepath='include/wx/event.h' line='77' column='1' id='type-id-98'/>
    <class-decl name='wxEventTypeTag&lt;wxMediaEvent&gt;' size-in-bits='32' visibility='default' filepath='include/wx/event.h' line='202' column='1' id='type-id-99'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_type' type-id='type-id-98' visibility='default' filepath='include/wx/event.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxObjectEventFunctor' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='258' column='1' id='type-id-100'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-101'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-102' visibility='default' filepath='include/wx/event.h' line='288' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxObjectEventFunctorclEP12wxEvtHandlerR7wxEvent' filepath='include/wx/event.h' line='4105' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <parameter type-id='type-id-102'/>
          <parameter type-id='type-id-104'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxObjectEventFunctor10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-105' is-artificial='yes'/>
          <parameter type-id='type-id-106'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxObjectEventFunctor13GetEvtHandlerEv' filepath='include/wx/event.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-105' is-artificial='yes'/>
          <return type-id='type-id-102'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxObjectEventFunctor12GetEvtMethodEv' filepath='include/wx/event.h' line='284' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-105' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='wxEventCategory' filepath='include/wx/event.h' line='911' column='1' id='type-id-107'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxEVT_CATEGORY_UI' value='1'/>
      <enumerator name='wxEVT_CATEGORY_USER_INPUT' value='2'/>
      <enumerator name='wxEVT_CATEGORY_SOCKET' value='4'/>
      <enumerator name='wxEVT_CATEGORY_TIMER' value='8'/>
      <enumerator name='wxEVT_CATEGORY_THREAD' value='16'/>
      <enumerator name='wxEVT_CATEGORY_UNKNOWN' value='32'/>
      <enumerator name='wxEVT_CATEGORY_CLIPBOARD' value='64'/>
      <enumerator name='wxEVT_CATEGORY_NATIVE_EVENTS' value='3'/>
      <enumerator name='wxEVT_CATEGORY_ALL' value='127'/>
    </enum-decl>
    <class-decl name='wxEventBasicPayloadMixin' size-in-bits='512' visibility='default' filepath='include/wx/event.h' line='1254' column='1' id='type-id-108'>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_cmdString' type-id='type-id-109' visibility='default' filepath='include/wx/event.h' line='1275' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='384'>
        <var-decl name='m_commandInt' type-id='type-id-19' visibility='default' filepath='include/wx/event.h' line='1276' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='448'>
        <var-decl name='m_extraLong' type-id='type-id-21' visibility='default' filepath='include/wx/event.h' line='1277' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTableEntryBase' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3469' column='1' id='type-id-110'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_id' type-id='type-id-19' visibility='default' filepath='include/wx/event.h' line='3504' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='m_lastId' type-id='type-id-19' visibility='default' filepath='include/wx/event.h' line='3505' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='m_fn' type-id='type-id-111' visibility='default' filepath='include/wx/event.h' line='3508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='m_callbackUserData' type-id='type-id-112' visibility='default' filepath='include/wx/event.h' line='3511' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTableEntry' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3518' column='1' id='type-id-113'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-110'/>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_eventType' type-id='type-id-114' visibility='default' filepath='include/wx/event.h' line='3532' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxDynamicEventTableEntry' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3539' column='1' id='type-id-115'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-110'/>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_eventType' type-id='type-id-19' visibility='default' filepath='include/wx/event.h' line='3550' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTable' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3560' column='1' id='type-id-116'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='baseTable' type-id='type-id-117' visibility='default' filepath='include/wx/event.h' line='3562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='entries' type-id='type-id-118' visibility='default' filepath='include/wx/event.h' line='3563' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTableEntryPointerArray' size-in-bits='192' visibility='default' filepath='include/wx/event.h' line='3570' column='1' id='type-id-119'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-92'/>
    </class-decl>
    <class-decl name='wxEventHashTable' size-in-bits='384' visibility='default' filepath='include/wx/event.h' line='3572' column='1' id='type-id-120'>
      <member-type access='private'>
        <class-decl name='EventTypeTable' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3576' column='1' id='type-id-121'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='eventType' type-id='type-id-98' visibility='default' filepath='include/wx/event.h' line='3578' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='eventEntryTable' type-id='type-id-119' visibility='default' filepath='include/wx/event.h' line='3579' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='EventTypeTablePointer' type-id='type-id-123' filepath='include/wx/event.h' line='3581' column='1' id='type-id-122'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_table' type-id='type-id-124' visibility='default' filepath='include/wx/event.h' line='3617' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_rebuildHash' type-id='type-id-3' visibility='default' filepath='include/wx/event.h' line='3618' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_size' type-id='type-id-125' visibility='default' filepath='include/wx/event.h' line='3620' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_eventTypeTable' type-id='type-id-126' visibility='default' filepath='include/wx/event.h' line='3621' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='256'>
        <var-decl name='m_previous' type-id='type-id-127' visibility='default' filepath='include/wx/event.h' line='3624' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='320'>
        <var-decl name='m_next' type-id='type-id-127' visibility='default' filepath='include/wx/event.h' line='3625' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxSeekMode' filepath='include/wx/filefn.h' line='55' column='1' id='type-id-128'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxFromStart' value='0'/>
      <enumerator name='wxFromCurrent' value='1'/>
      <enumerator name='wxFromEnd' value='2'/>
    </enum-decl>
    <typedef-decl name='wxFileOffset' type-id='type-id-129' filepath='include/wx/filefn.h' line='343' column='1' id='type-id-130'/>
    <class-decl name='wxSize' size-in-bits='64' visibility='default' filepath='include/wx/gdicmn.h' line='282' column='1' id='type-id-131'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='286' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRealPoint' size-in-bits='128' visibility='default' filepath='include/wx/gdicmn.h' line='459' column='1' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-17' visibility='default' filepath='include/wx/gdicmn.h' line='462' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='y' type-id='type-id-17' visibility='default' filepath='include/wx/gdicmn.h' line='463' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxPoint' size-in-bits='64' visibility='default' filepath='include/wx/gdicmn.h' line='577' column='1' id='type-id-133'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='580' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='580' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRect' size-in-bits='128' visibility='default' filepath='include/wx/gdicmn.h' line='733' column='1' id='type-id-134'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='width' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='height' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GdkEventKey' type-id='type-id-135' filepath='include/wx/gtk/window.h' line='25' column='1' id='type-id-136'/>
    <class-decl name='wxArrayGdkWindows' size-in-bits='192' visibility='default' filepath='include/wx/gtk/window.h' line='28' column='1' id='type-id-137'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-86'/>
    </class-decl>
    <union-decl name='wxHashKeyValue' size-in-bits='64' visibility='default' filepath='include/wx/hash.h' line='33' column='1' id='type-id-138'>
      <data-member access='public'>
        <var-decl name='integer' type-id='type-id-21' visibility='default' filepath='include/wx/hash.h' line='35' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='string' type-id='type-id-139' visibility='default' filepath='include/wx/hash.h' line='36' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='wxHashTableBase_Node' size-in-bits='256' visibility='default' filepath='include/wx/hash.h' line='46' column='1' id='type-id-140'>
      <member-type access='private'>
        <typedef-decl name='_Node' type-id='type-id-140' filepath='include/wx/hash.h' line='49' column='1' id='type-id-141'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_next' type-id='type-id-142' visibility='default' filepath='include/wx/hash.h' line='68' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_key' type-id='type-id-138' visibility='default' filepath='include/wx/hash.h' line='71' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_value' type-id='type-id-16' visibility='default' filepath='include/wx/hash.h' line='74' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_hashPtr' type-id='type-id-143' visibility='default' filepath='include/wx/hash.h' line='81' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxHashTableBase' size-in-bits='384' visibility='default' filepath='include/wx/hash.h' line='84' column='1' id='type-id-144'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-145'/>
      <member-type access='public'>
        <typedef-decl name='Node' type-id='type-id-140' filepath='include/wx/hash.h' line='91' column='1' id='type-id-146'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_size' type-id='type-id-125' visibility='default' filepath='include/wx/hash.h' line='140' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_count' type-id='type-id-125' visibility='default' filepath='include/wx/hash.h' line='143' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='256'>
        <var-decl name='m_table' type-id='type-id-147' visibility='default' filepath='include/wx/hash.h' line='146' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='320'>
        <var-decl name='m_keyType' type-id='type-id-63' visibility='default' filepath='include/wx/hash.h' line='149' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='352'>
        <var-decl name='m_deleteContents' type-id='type-id-3' visibility='default' filepath='include/wx/hash.h' line='152' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxHashTableBase' mangled-name='_ZN15wxHashTableBaseD4Ev' filepath='include/wx/hash.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-143' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='5'>
        <function-decl name='DoDeleteContents' mangled-name='_ZN15wxHashTableBase16DoDeleteContentsEP20wxHashTableBase_Node' filepath='include/wx/hash.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-143' is-artificial='yes'/>
          <parameter type-id='type-id-142'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxHashTable_Node' size-in-bits='256' visibility='default' filepath='include/wx/hash.h' line='162' column='1' id='type-id-148'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-140'/>
    </class-decl>
    <enum-decl name='wxLayoutDirection' filepath='include/wx/localedefs.h' line='20' column='1' id='type-id-149'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxLayout_Default' value='0'/>
      <enumerator name='wxLayout_LeftToRight' value='1'/>
      <enumerator name='wxLayout_RightToLeft' value='2'/>
    </enum-decl>
    <typedef-decl name='wxLongLong' type-id='type-id-150' filepath='include/wx/longlong.h' line='90' column='1' id='type-id-151'/>
    <class-decl name='wxLongLongNative' size-in-bits='64' visibility='default' filepath='include/wx/longlong.h' line='106' column='1' id='type-id-150'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_ll' type-id='type-id-22' visibility='default' filepath='include/wx/longlong.h' line='343' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxULongLongNative' size-in-bits='64' visibility='default' filepath='include/wx/longlong.h' line='347' column='1' id='type-id-152'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_ll' type-id='type-id-23' visibility='default' filepath='include/wx/longlong.h' line='562' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxMediaState' filepath='include/wx/mediactrl.h' line='52' column='1' id='type-id-153'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxMEDIASTATE_STOPPED' value='0'/>
      <enumerator name='wxMEDIASTATE_PAUSED' value='1'/>
      <enumerator name='wxMEDIASTATE_PLAYING' value='2'/>
    </enum-decl>
    <enum-decl name='wxMediaCtrlPlayerControls' filepath='include/wx/mediactrl.h' line='59' column='1' id='type-id-154'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxMEDIACTRLPLAYERCONTROLS_NONE' value='0'/>
      <enumerator name='wxMEDIACTRLPLAYERCONTROLS_STEP' value='1'/>
      <enumerator name='wxMEDIACTRLPLAYERCONTROLS_VOLUME' value='2'/>
      <enumerator name='wxMEDIACTRLPLAYERCONTROLS_DEFAULT' value='3'/>
    </enum-decl>
    <class-decl name='wxMediaBackendCommonBase' size-in-bits='192' visibility='default' filepath='include/wx/mediactrl.h' line='350' column='1' id='type-id-155'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-156'/>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_ctrl' type-id='type-id-157' visibility='default' filepath='include/wx/mediactrl.h' line='384' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='QueueStopEvent' mangled-name='_ZN24wxMediaBackendCommonBase14QueueStopEventEv' filepath='src/common/mediactrlcmn.cpp' line='519' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN24wxMediaBackendCommonBase14QueueStopEventEv@@WXU_3.2'>
          <parameter type-id='type-id-158' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='QueuePauseEvent' mangled-name='_ZN24wxMediaBackendCommonBase15QueuePauseEventEv' filepath='src/common/mediactrlcmn.cpp' line='513' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN24wxMediaBackendCommonBase15QueuePauseEventEv@@WXU_3.2'>
          <parameter type-id='type-id-158' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='QueuePlayEvent' mangled-name='_ZN24wxMediaBackendCommonBase14QueuePlayEventEv' filepath='src/common/mediactrlcmn.cpp' line='507' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN24wxMediaBackendCommonBase14QueuePlayEventEv@@WXU_3.2'>
          <parameter type-id='type-id-158' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='QueueEvent' mangled-name='_ZN24wxMediaBackendCommonBase10QueueEventEi' filepath='src/common/mediactrlcmn.cpp' line='501' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN24wxMediaBackendCommonBase10QueueEventEi@@WXU_3.2'>
          <parameter type-id='type-id-158' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-98' name='evtType' filepath='src/common/mediactrlcmn.cpp' line='501' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SendStopEvent' mangled-name='_ZN24wxMediaBackendCommonBase13SendStopEventEv' filepath='src/common/mediactrlcmn.cpp' line='494' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN24wxMediaBackendCommonBase13SendStopEventEv@@WXU_3.2'>
          <parameter type-id='type-id-158' name='this' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='NotifyMovieLoaded' mangled-name='_ZN24wxMediaBackendCommonBase17NotifyMovieLoadedEv' filepath='src/common/mediactrlcmn.cpp' line='486' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN24wxMediaBackendCommonBase17NotifyMovieLoadedEv@@WXU_3.2'>
          <parameter type-id='type-id-158' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='NotifyMovieSizeChanged' mangled-name='_ZN24wxMediaBackendCommonBase22NotifyMovieSizeChangedEv' filepath='src/common/mediactrlcmn.cpp' line='467' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN24wxMediaBackendCommonBase22NotifyMovieSizeChangedEv@@WXU_3.2'>
          <parameter type-id='type-id-158' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxRefCounter' size-in-bits='128' visibility='default' filepath='include/wx/object.h' line='228' column='1' id='type-id-159'>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_count' type-id='type-id-19' visibility='default' filepath='include/wx/object.h' line='245' column='1'/>
      </data-member>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRefCounter' mangled-name='_ZN12wxRefCounterD4Ev' filepath='include/wx/object.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-160' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='wxObjectRefData' type-id='type-id-159' filepath='include/wx/object.h' line='258' column='1' id='type-id-161'/>
    <typedef-decl name='wxObjectConstructorFn' type-id='type-id-162' filepath='include/wx/rtti.h' line='39' column='1' id='type-id-163'/>
    <class-decl name='wxClassInfo' size-in-bits='384' visibility='default' filepath='include/wx/rtti.h' line='41' column='1' id='type-id-164'>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-165'>
          <member-type access='private'>
            <typedef-decl name='Node' type-id='type-id-148' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-166'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-165' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-167'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-169' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-168'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-170' visibility='default' filepath='include/wx/rtti.h' line='106' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_table' type-id='type-id-171' visibility='default' filepath='include/wx/rtti.h' line='106' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_className' type-id='type-id-172' visibility='default' filepath='include/wx/rtti.h' line='109' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_objectSize' type-id='type-id-19' visibility='default' filepath='include/wx/rtti.h' line='110' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_objectConstructor' type-id='type-id-163' visibility='default' filepath='include/wx/rtti.h' line='111' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_baseInfo1' type-id='type-id-169' visibility='default' filepath='include/wx/rtti.h' line='115' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_baseInfo2' type-id='type-id-169' visibility='default' filepath='include/wx/rtti.h' line='116' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='sm_first' type-id='type-id-173' mangled-name='_ZN11wxClassInfo8sm_firstE' visibility='default' filepath='include/wx/rtti.h' line='121' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='m_next' type-id='type-id-173' visibility='default' filepath='include/wx/rtti.h' line='122' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxCStrData' size-in-bits='192' visibility='default' filepath='include/wx/string.h' line='152' column='1' id='type-id-174'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_str' type-id='type-id-175' visibility='default' filepath='include/wx/string.h' line='245' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_offset' type-id='type-id-125' visibility='default' filepath='include/wx/string.h' line='252' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_owned' type-id='type-id-3' visibility='default' filepath='include/wx/string.h' line='254' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxString' size-in-bits='384' visibility='default' filepath='include/wx/string.h' line='301' column='1' id='type-id-109'>
      <member-type access='private'>
        <class-decl name='SubstrBufFromType&lt;wchar_t const*&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='337' column='1' id='type-id-176'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='data' type-id='type-id-177' visibility='default' filepath='include/wx/string.h' line='339' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='len' type-id='type-id-125' visibility='default' filepath='include/wx/string.h' line='340' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='SubstrBufFromType&lt;wxScopedCharTypeBuffer&lt;wchar_t&gt; &gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='337' column='1' id='type-id-178'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='data' type-id='type-id-38' visibility='default' filepath='include/wx/string.h' line='339' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='len' type-id='type-id-125' visibility='default' filepath='include/wx/string.h' line='340' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='SubstrBufFromWC' type-id='type-id-176' filepath='include/wx/string.h' line='354' column='1' id='type-id-179'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='SubstrBufFromMB' type-id='type-id-178' filepath='include/wx/string.h' line='355' column='1' id='type-id-180'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-125' filepath='include/wx/string.h' line='752' column='1' id='type-id-181'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-183' filepath='include/wx/string.h' line='753' column='1' id='type-id-182'/>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='963' column='1' id='type-id-184'>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-186' filepath='include/wx/string.h' line='965' column='1' id='type-id-185'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-188' filepath='include/wx/string.h' line='965' column='1' id='type-id-187'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='underlying_iterator' type-id='type-id-190' filepath='include/wx/string.h' line='965' column='1' id='type-id-189'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-189' visibility='default' filepath='include/wx/string.h' line='965' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='994' column='1' id='type-id-191'>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-186' filepath='include/wx/string.h' line='998' column='1' id='type-id-192'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-194' filepath='include/wx/string.h' line='998' column='1' id='type-id-193'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='underlying_iterator' type-id='type-id-196' filepath='include/wx/string.h' line='998' column='1' id='type-id-195'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-195' visibility='default' filepath='include/wx/string.h' line='998' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator_impl&lt;wxString::const_iterator&gt;' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='1060' column='1' id='type-id-197'>
          <member-type access='public'>
            <typedef-decl name='iterator_type' type-id='type-id-191' filepath='include/wx/string.h' line='1063' column='1' id='type-id-198'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-192' filepath='include/wx/string.h' line='1067' column='1' id='type-id-199'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-193' filepath='include/wx/string.h' line='1068' column='1' id='type-id-200'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-198' visibility='default' filepath='include/wx/string.h' line='1115' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator_impl&lt;wxString::iterator&gt;' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='1060' column='1' id='type-id-201'>
          <member-type access='public'>
            <typedef-decl name='iterator_type' type-id='type-id-184' filepath='include/wx/string.h' line='1063' column='1' id='type-id-202'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-185' filepath='include/wx/string.h' line='1067' column='1' id='type-id-203'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-187' filepath='include/wx/string.h' line='1068' column='1' id='type-id-204'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-202' visibility='default' filepath='include/wx/string.h' line='1115' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reverse_iterator' type-id='type-id-201' filepath='include/wx/string.h' line='1118' column='1' id='type-id-205'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reverse_iterator' type-id='type-id-197' filepath='include/wx/string.h' line='1119' column='1' id='type-id-206'/>
      </member-type>
      <member-type access='public'>
        <enum-decl name='caseCompare' filepath='include/wx/string.h' line='2386' column='1' id='type-id-207'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='exact' value='0'/>
          <enumerator name='ignoreCase' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='stripType' filepath='include/wx/string.h' line='2388' column='1' id='type-id-208'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='leading' value='1'/>
          <enumerator name='trailing' value='2'/>
          <enumerator name='both' value='3'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='ConvertedBuffer&lt;char&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='3599' column='1' id='type-id-209'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_str' type-id='type-id-210' visibility='default' filepath='include/wx/string.h' line='3625' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_len' type-id='type-id-125' visibility='default' filepath='include/wx/string.h' line='3626' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_impl' type-id='type-id-211' visibility='default' filepath='include/wx/string.h' line='3589' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_convertedToChar' type-id='type-id-209' visibility='default' filepath='include/wx/string.h' line='3677' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='npos' type-id='type-id-212' mangled-name='_ZN8wxString4nposE' visibility='default' filepath='include/wx/string.h' line='308' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxStdWideString' type-id='type-id-213' filepath='include/wx/stringimpl.h' line='70' column='1' id='type-id-214'/>
    <typedef-decl name='wxStdString' type-id='type-id-214' filepath='include/wx/stringimpl.h' line='76' column='1' id='type-id-215'/>
    <typedef-decl name='wxStringImpl' type-id='type-id-215' filepath='include/wx/stringimpl.h' line='90' column='1' id='type-id-211'/>
    <class-decl name='wxFormatString' size-in-bits='320' visibility='default' filepath='include/wx/strvararg.h' line='137' column='1' id='type-id-216'>
      <member-type access='public'>
        <enum-decl name='ArgumentType' filepath='include/wx/strvararg.h' line='161' column='1' id='type-id-217'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Arg_Unused' value='0'/>
          <enumerator name='Arg_Char' value='1'/>
          <enumerator name='Arg_Pointer' value='2'/>
          <enumerator name='Arg_String' value='6'/>
          <enumerator name='Arg_Int' value='9'/>
          <enumerator name='Arg_LongInt' value='16'/>
          <enumerator name='Arg_LongLongInt' value='16'/>
          <enumerator name='Arg_Double' value='64'/>
          <enumerator name='Arg_LongDouble' value='128'/>
          <enumerator name='Arg_Size_t' value='16'/>
          <enumerator name='Arg_IntPtr' value='512'/>
          <enumerator name='Arg_ShortIntPtr' value='1024'/>
          <enumerator name='Arg_LongIntPtr' value='2048'/>
          <enumerator name='Arg_Unknown' value='32768'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_convertedWChar' type-id='type-id-43' visibility='default' filepath='include/wx/strvararg.h' line='232' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_char' type-id='type-id-42' visibility='default' filepath='include/wx/strvararg.h' line='236' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_wchar' type-id='type-id-43' visibility='default' filepath='include/wx/strvararg.h' line='237' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_str' type-id='type-id-218' visibility='default' filepath='include/wx/strvararg.h' line='242' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_cstr' type-id='type-id-219' visibility='default' filepath='include/wx/strvararg.h' line='243' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxMutexError' filepath='include/wx/thread.h' line='28' column='1' id='type-id-220'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxMUTEX_NO_ERROR' value='0'/>
      <enumerator name='wxMUTEX_INVALID' value='1'/>
      <enumerator name='wxMUTEX_DEAD_LOCK' value='2'/>
      <enumerator name='wxMUTEX_BUSY' value='3'/>
      <enumerator name='wxMUTEX_UNLOCKED' value='4'/>
      <enumerator name='wxMUTEX_TIMEOUT' value='5'/>
      <enumerator name='wxMUTEX_MISC_ERROR' value='6'/>
    </enum-decl>
    <enum-decl name='wxThreadError' filepath='include/wx/thread.h' line='57' column='1' id='type-id-221'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxTHREAD_NO_ERROR' value='0'/>
      <enumerator name='wxTHREAD_NO_RESOURCE' value='1'/>
      <enumerator name='wxTHREAD_RUNNING' value='2'/>
      <enumerator name='wxTHREAD_NOT_RUNNING' value='3'/>
      <enumerator name='wxTHREAD_KILLED' value='4'/>
      <enumerator name='wxTHREAD_MISC_ERROR' value='5'/>
    </enum-decl>
    <enum-decl name='wxThreadKind' filepath='include/wx/thread.h' line='67' column='1' id='type-id-222'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxTHREAD_DETACHED' value='0'/>
      <enumerator name='wxTHREAD_JOINABLE' value='1'/>
    </enum-decl>
    <enum-decl name='wxMutexType' filepath='include/wx/thread.h' line='112' column='1' id='type-id-223'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxMUTEX_DEFAULT' value='0'/>
      <enumerator name='wxMUTEX_RECURSIVE' value='1'/>
    </enum-decl>
    <class-decl name='wxMutex' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='137' column='1' id='type-id-224'>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_internal' type-id='type-id-225' visibility='default' filepath='include/wx/thread.h' line='174' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxCriticalSectionType' filepath='include/wx/thread.h' line='231' column='1' id='type-id-226'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxCRITSEC_DEFAULT' value='0'/>
      <enumerator name='wxCRITSEC_NON_RECURSIVE' value='1'/>
    </enum-decl>
    <class-decl name='wxCriticalSection' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='242' column='1' id='type-id-227'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_mutex' type-id='type-id-224' visibility='default' filepath='include/wx/thread.h' line='259' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='Leave' mangled-name='_ZN17wxCriticalSection5LeaveEv' filepath='include/wx/thread.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxCriticalSection5LeaveEv@@WXU_3.2'>
          <parameter type-id='type-id-228' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Enter' mangled-name='_ZN17wxCriticalSection5EnterEv' filepath='include/wx/thread.h' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxCriticalSection5EnterEv@@WXU_3.2'>
          <parameter type-id='type-id-228' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxCriticalSectionLocker' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='301' column='1' id='type-id-229'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_critsect' type-id='type-id-230' visibility='default' filepath='include/wx/thread.h' line='316' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxThreadHelperThread' size-in-bits='320' visibility='default' filepath='include/wx/thread.h' line='658' column='1' id='type-id-231'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-232'/>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_owner' type-id='type-id-233' visibility='default' filepath='include/wx/thread.h' line='673' column='1'/>
      </data-member>
      <member-function access='protected' vtable-offset='3'>
        <function-decl name='Entry' mangled-name='_ZN20wxThreadHelperThread5EntryEv' filepath='include/wx/thread.h' line='761' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-234' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxThreadHelper' size-in-bits='256' visibility='default' filepath='include/wx/thread.h' line='686' column='1' id='type-id-235'>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_thread' type-id='type-id-236' visibility='default' filepath='include/wx/thread.h' line='748' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_kind' type-id='type-id-222' visibility='default' filepath='include/wx/thread.h' line='749' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_critSection' type-id='type-id-227' visibility='default' filepath='include/wx/thread.h' line='750' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThreadHelper' mangled-name='_ZN14wxThreadHelperD4Ev' filepath='include/wx/thread.h' line='714' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-237' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='Entry' mangled-name='_ZN14wxThreadHelper5EntryEv' filepath='include/wx/thread.h' line='735' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-237' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxTypeIdentifier' size-in-bits='64' visibility='default' filepath='include/wx/typeinfo.h' line='63' column='1' id='type-id-238'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_className' type-id='type-id-239' visibility='default' filepath='include/wx/typeinfo.h' line='81' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxCoord' type-id='type-id-19' filepath='include/wx/types.h' line='26' column='1' id='type-id-240'/>
    <typedef-decl name='wxUint8' type-id='type-id-27' filepath='include/wx/types.h' line='43' column='1' id='type-id-241'/>
    <typedef-decl name='wxByte' type-id='type-id-241' filepath='include/wx/types.h' line='44' column='1' id='type-id-242'/>
    <typedef-decl name='wxUint16' type-id='type-id-28' filepath='include/wx/types.h' line='57' column='1' id='type-id-243'/>
    <typedef-decl name='wxInt32' type-id='type-id-19' filepath='include/wx/types.h' line='145' column='1' id='type-id-244'/>
    <typedef-decl name='wxUint32' type-id='type-id-15' filepath='include/wx/types.h' line='146' column='1' id='type-id-245'/>
    <class-decl name='wxUniChar' size-in-bits='32' visibility='default' filepath='include/wx/unichar.h' line='29' column='1' id='type-id-194'>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-245' filepath='include/wx/unichar.h' line='35' column='1' id='type-id-246'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_value' type-id='type-id-246' visibility='default' filepath='include/wx/unichar.h' line='212' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxUniCharRef' size-in-bits='64' visibility='default' filepath='include/wx/unichar.h' line='220' column='1' id='type-id-188'>
      <member-type access='private'>
        <typedef-decl name='iterator' type-id='type-id-190' filepath='include/wx/unichar.h' line='223' column='1' id='type-id-247'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_pos' type-id='type-id-247' visibility='default' filepath='include/wx/unichar.h' line='325' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVector&lt;_GdkWindow*&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-87'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-125' filepath='include/wx/vector.h' line='179' column='1' id='type-id-248'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-250' filepath='include/wx/vector.h' line='181' column='1' id='type-id-249'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-252' filepath='include/wx/vector.h' line='184' column='1' id='type-id-251'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-254' filepath='include/wx/vector.h' line='185' column='1' id='type-id-253'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-255' filepath='include/wx/vector.h' line='187' column='1' id='type-id-91'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-256'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-257'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_INITIAL_SIZE' type-id='type-id-258' mangled-name='_ZN8wxVectorIP10_GdkWindowE18ALLOC_INITIAL_SIZEE' visibility='default' filepath='include/wx/vector.h' line='592' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-248' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-248' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-252' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVector&lt;const wxEventTableEntry*&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-93'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-125' filepath='include/wx/vector.h' line='179' column='1' id='type-id-259'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-118' filepath='include/wx/vector.h' line='181' column='1' id='type-id-260'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-262' filepath='include/wx/vector.h' line='184' column='1' id='type-id-261'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-264' filepath='include/wx/vector.h' line='185' column='1' id='type-id-263'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-265' filepath='include/wx/vector.h' line='187' column='1' id='type-id-97'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-266'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-267'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_INITIAL_SIZE' type-id='type-id-268' mangled-name='_ZN8wxVectorIPK17wxEventTableEntryE18ALLOC_INITIAL_SIZEE' visibility='default' filepath='include/wx/vector.h' line='592' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-259' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-259' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-262' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVisualAttributes' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/wx/window.h' line='77' column='1' id='type-id-269'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='font' type-id='type-id-270' visibility='default' filepath='include/wx/window.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='colFg' type-id='type-id-271' visibility='default' filepath='include/wx/window.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='colBg' type-id='type-id-271' visibility='default' filepath='include/wx/window.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxWindowVariant' filepath='include/wx/window.h' line='92' column='1' id='type-id-272'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxWINDOW_VARIANT_NORMAL' value='0'/>
      <enumerator name='wxWINDOW_VARIANT_SMALL' value='1'/>
      <enumerator name='wxWINDOW_VARIANT_MINI' value='2'/>
      <enumerator name='wxWINDOW_VARIANT_LARGE' value='3'/>
      <enumerator name='wxWINDOW_VARIANT_MAX' value='4'/>
    </enum-decl>
    <enum-decl name='wxShowEffect' filepath='include/wx/window.h' line='106' column='1' id='type-id-273'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxSHOW_EFFECT_NONE' value='0'/>
      <enumerator name='wxSHOW_EFFECT_ROLL_TO_LEFT' value='1'/>
      <enumerator name='wxSHOW_EFFECT_ROLL_TO_RIGHT' value='2'/>
      <enumerator name='wxSHOW_EFFECT_ROLL_TO_TOP' value='3'/>
      <enumerator name='wxSHOW_EFFECT_ROLL_TO_BOTTOM' value='4'/>
      <enumerator name='wxSHOW_EFFECT_SLIDE_TO_LEFT' value='5'/>
      <enumerator name='wxSHOW_EFFECT_SLIDE_TO_RIGHT' value='6'/>
      <enumerator name='wxSHOW_EFFECT_SLIDE_TO_TOP' value='7'/>
      <enumerator name='wxSHOW_EFFECT_SLIDE_TO_BOTTOM' value='8'/>
      <enumerator name='wxSHOW_EFFECT_BLEND' value='9'/>
      <enumerator name='wxSHOW_EFFECT_EXPAND' value='10'/>
      <enumerator name='wxSHOW_EFFECT_MAX' value='11'/>
    </enum-decl>
    <class-decl name='wxWindowIDRef' size-in-bits='32' visibility='default' filepath='include/wx/windowid.h' line='26' column='1' id='type-id-274'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_id' type-id='type-id-64' visibility='default' filepath='include/wx/windowid.h' line='114' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxForceLinkbasewxmediabackends' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/common/mediactrlcmn.cpp' line='536' column='1' id='type-id-275'/>
    <class-decl name='_GtkWidget' size-in-bits='256' is-struct='yes' visibility='default' filepath='/usr/include/gtk-3.0/gtk/gtkwidget.h' line='133' column='1' id='type-id-68'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-276' visibility='default' filepath='/usr/include/gtk-3.0/gtk/gtkwidget.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-277' visibility='default' filepath='/usr/include/gtk-3.0/gtk/gtkwidget.h' line='139' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='lconv' size-in-bits='768' is-struct='yes' visibility='default' filepath='/usr/include/locale.h' line='51' column='1' id='type-id-278'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='decimal_point' type-id='type-id-210' visibility='default' filepath='/usr/include/locale.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thousands_sep' type-id='type-id-210' visibility='default' filepath='/usr/include/locale.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='grouping' type-id='type-id-210' visibility='default' filepath='/usr/include/locale.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='int_curr_symbol' type-id='type-id-210' visibility='default' filepath='/usr/include/locale.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='currency_symbol' type-id='type-id-210' visibility='default' filepath='/usr/include/locale.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mon_decimal_point' type-id='type-id-210' visibility='default' filepath='/usr/include/locale.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mon_thousands_sep' type-id='type-id-210' visibility='default' filepath='/usr/include/locale.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mon_grouping' type-id='type-id-210' visibility='default' filepath='/usr/include/locale.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='positive_sign' type-id='type-id-210' visibility='default' filepath='/usr/include/locale.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='negative_sign' type-id='type-id-210' visibility='default' filepath='/usr/include/locale.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='int_frac_digits' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <var-decl name='frac_digits' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='p_cs_precedes' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='664'>
        <var-decl name='p_sep_by_space' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='n_cs_precedes' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='680'>
        <var-decl name='n_sep_by_space' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='688'>
        <var-decl name='p_sign_posn' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='696'>
        <var-decl name='n_sign_posn' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='int_p_cs_precedes' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='712'>
        <var-decl name='int_p_sep_by_space' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='720'>
        <var-decl name='int_n_cs_precedes' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='728'>
        <var-decl name='int_n_sep_by_space' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='int_p_sign_posn' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='744'>
        <var-decl name='int_n_sign_posn' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='fpos_t' type-id='type-id-279' filepath='/usr/include/stdio.h' line='86' column='1' id='type-id-280'/>
    <class-decl name='div_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-281' visibility='default' filepath='/usr/include/stdlib.h' line='60' column='1' id='type-id-282'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-19' visibility='default' filepath='/usr/include/stdlib.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rem' type-id='type-id-19' visibility='default' filepath='/usr/include/stdlib.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='div_t' type-id='type-id-282' filepath='/usr/include/stdlib.h' line='63' column='1' id='type-id-281'/>
    <class-decl name='ldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-283' visibility='default' filepath='/usr/include/stdlib.h' line='68' column='1' id='type-id-284'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-21' visibility='default' filepath='/usr/include/stdlib.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-21' visibility='default' filepath='/usr/include/stdlib.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ldiv_t' type-id='type-id-284' filepath='/usr/include/stdlib.h' line='71' column='1' id='type-id-283'/>
    <class-decl name='lldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-285' visibility='default' filepath='/usr/include/stdlib.h' line='78' column='1' id='type-id-286'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-22' visibility='default' filepath='/usr/include/stdlib.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-22' visibility='default' filepath='/usr/include/stdlib.h' line='80' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='lldiv_t' type-id='type-id-286' filepath='/usr/include/stdlib.h' line='81' column='1' id='type-id-285'/>
    <typedef-decl name='__compar_fn_t' type-id='type-id-287' filepath='/usr/include/stdlib.h' line='816' column='1' id='type-id-288'/>
    <typedef-decl name='__off_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-289'/>
    <typedef-decl name='__off64_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1' id='type-id-290'/>
    <typedef-decl name='FILE' type-id='type-id-291' filepath='/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-292'/>
    <typedef-decl name='__FILE' type-id='type-id-291' filepath='/usr/include/x86_64-linux-gnu/bits/types/__FILE.h' line='5' column='1' id='type-id-293'/>
    <class-decl name='_G_fpos64_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='10' column='1' id='type-id-294'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__pos' type-id='type-id-290' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__state' type-id='type-id-295' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='13' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__fpos64_t' type-id='type-id-294' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='14' column='1' id='type-id-279'/>
    <class-decl name='__mbstate_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-295' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='14' column='1' id='type-id-296'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='17' column='1' id='type-id-297'>
          <data-member access='public'>
            <var-decl name='__wch' type-id='type-id-15' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='18' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='__wchb' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='19' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='type-id-297' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='20' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__mbstate_t' type-id='type-id-296' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='21' column='1' id='type-id-295'/>
    <typedef-decl name='mbstate_t' type-id='type-id-295' filepath='/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h' line='6' column='1' id='type-id-298'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-30' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='43' column='1' id='type-id-299'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='49' column='1' id='type-id-291'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-210' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-210' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-210' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-210' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-210' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-210' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-210' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-210' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-210' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-210' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-210' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-300' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-301' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-289' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-28' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-25' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-8' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-302' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-290' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-303' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-304' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-301' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-16' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-125' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-10' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='7' column='1' id='type-id-305'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-239' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wint_t' type-id='type-id-15' filepath='/usr/include/x86_64-linux-gnu/bits/types/wint_t.h' line='20' column='1' id='type-id-306'/>
    <typedef-decl name='off_t' type-id='type-id-290' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='87' column='1' id='type-id-129'/>
    <typedef-decl name='ptrdiff_t' type-id='type-id-21' filepath='/usr/lib/gcc/x86_64-linux-gnu/11/include/stddef.h' line='143' column='1' id='type-id-186'/>
    <typedef-decl name='size_t' type-id='type-id-6' filepath='/usr/lib/gcc/x86_64-linux-gnu/11/include/stddef.h' line='209' column='1' id='type-id-125'/>
    <pointer-type-def type-id='type-id-292' size-in-bits='64' id='type-id-307'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-308'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-309'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-310'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-72'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-250'/>
    <qualified-type-def type-id='type-id-250' const='yes' id='type-id-311'/>
    <reference-type-def kind='lvalue' type-id='type-id-311' size-in-bits='64' id='type-id-312'/>
    <reference-type-def kind='lvalue' type-id='type-id-250' size-in-bits='64' id='type-id-313'/>
    <pointer-type-def type-id='type-id-250' size-in-bits='64' id='type-id-314'/>
    <pointer-type-def type-id='type-id-291' size-in-bits='64' id='type-id-301'/>
    <pointer-type-def type-id='type-id-315' size-in-bits='64' id='type-id-303'/>
    <pointer-type-def type-id='type-id-299' size-in-bits='64' id='type-id-302'/>
    <pointer-type-def type-id='type-id-316' size-in-bits='64' id='type-id-300'/>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' id='type-id-304'/>
    <pointer-type-def type-id='type-id-293' size-in-bits='64' id='type-id-318'/>
    <reference-type-def kind='lvalue' type-id='type-id-319' size-in-bits='64' id='type-id-320'/>
    <reference-type-def kind='lvalue' type-id='type-id-321' size-in-bits='64' id='type-id-322'/>
    <reference-type-def kind='lvalue' type-id='type-id-323' size-in-bits='64' id='type-id-324'/>
    <pointer-type-def type-id='type-id-323' size-in-bits='64' id='type-id-325'/>
    <reference-type-def kind='lvalue' type-id='type-id-326' size-in-bits='64' id='type-id-327'/>
    <pointer-type-def type-id='type-id-326' size-in-bits='64' id='type-id-328'/>
    <reference-type-def kind='lvalue' type-id='type-id-329' size-in-bits='64' id='type-id-330'/>
    <pointer-type-def type-id='type-id-329' size-in-bits='64' id='type-id-331'/>
    <reference-type-def kind='lvalue' type-id='type-id-332' size-in-bits='64' id='type-id-333'/>
    <pointer-type-def type-id='type-id-332' size-in-bits='64' id='type-id-334'/>
    <pointer-type-def type-id='type-id-335' size-in-bits='64' id='type-id-336'/>
    <pointer-type-def type-id='type-id-337' size-in-bits='64' id='type-id-338'/>
    <qualified-type-def type-id='type-id-338' const='yes' id='type-id-339'/>
    <reference-type-def kind='lvalue' type-id='type-id-4' size-in-bits='64' id='type-id-340'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-210'/>
    <qualified-type-def type-id='type-id-210' const='yes' id='type-id-341'/>
    <reference-type-def kind='lvalue' type-id='type-id-341' size-in-bits='64' id='type-id-342'/>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' id='type-id-343'/>
    <qualified-type-def type-id='type-id-319' const='yes' id='type-id-344'/>
    <reference-type-def kind='lvalue' type-id='type-id-344' size-in-bits='64' id='type-id-345'/>
    <qualified-type-def type-id='type-id-321' const='yes' id='type-id-346'/>
    <reference-type-def kind='lvalue' type-id='type-id-346' size-in-bits='64' id='type-id-347'/>
    <qualified-type-def type-id='type-id-323' const='yes' id='type-id-348'/>
    <pointer-type-def type-id='type-id-348' size-in-bits='64' id='type-id-349'/>
    <qualified-type-def type-id='type-id-326' const='yes' id='type-id-350'/>
    <pointer-type-def type-id='type-id-350' size-in-bits='64' id='type-id-351'/>
    <qualified-type-def type-id='type-id-329' const='yes' id='type-id-352'/>
    <pointer-type-def type-id='type-id-352' size-in-bits='64' id='type-id-353'/>
    <qualified-type-def type-id='type-id-332' const='yes' id='type-id-354'/>
    <pointer-type-def type-id='type-id-354' size-in-bits='64' id='type-id-355'/>
    <qualified-type-def type-id='type-id-335' const='yes' id='type-id-356'/>
    <reference-type-def kind='lvalue' type-id='type-id-356' size-in-bits='64' id='type-id-357'/>
    <pointer-type-def type-id='type-id-356' size-in-bits='64' id='type-id-358'/>
    <qualified-type-def type-id='type-id-337' const='yes' id='type-id-359'/>
    <reference-type-def kind='lvalue' type-id='type-id-359' size-in-bits='64' id='type-id-360'/>
    <pointer-type-def type-id='type-id-359' size-in-bits='64' id='type-id-361'/>
    <qualified-type-def type-id='type-id-4' const='yes' id='type-id-362'/>
    <reference-type-def kind='lvalue' type-id='type-id-362' size-in-bits='64' id='type-id-363'/>
    <pointer-type-def type-id='type-id-362' size-in-bits='64' id='type-id-239'/>
    <qualified-type-def type-id='type-id-239' const='yes' id='type-id-364'/>
    <reference-type-def kind='lvalue' type-id='type-id-364' size-in-bits='64' id='type-id-365'/>
    <pointer-type-def type-id='type-id-239' size-in-bits='64' id='type-id-366'/>
    <qualified-type-def type-id='type-id-280' const='yes' id='type-id-367'/>
    <pointer-type-def type-id='type-id-367' size-in-bits='64' id='type-id-368'/>
    <qualified-type-def type-id='type-id-19' const='yes' id='type-id-369'/>
    <reference-type-def kind='lvalue' type-id='type-id-369' size-in-bits='64' id='type-id-114'/>
    <qualified-type-def type-id='type-id-298' const='yes' id='type-id-370'/>
    <pointer-type-def type-id='type-id-370' size-in-bits='64' id='type-id-371'/>
    <qualified-type-def type-id='type-id-372' const='yes' id='type-id-373'/>
    <reference-type-def kind='lvalue' type-id='type-id-373' size-in-bits='64' id='type-id-374'/>
    <pointer-type-def type-id='type-id-373' size-in-bits='64' id='type-id-375'/>
    <qualified-type-def type-id='type-id-376' const='yes' id='type-id-377'/>
    <reference-type-def kind='lvalue' type-id='type-id-377' size-in-bits='64' id='type-id-378'/>
    <qualified-type-def type-id='type-id-379' const='yes' id='type-id-380'/>
    <reference-type-def kind='lvalue' type-id='type-id-380' size-in-bits='64' id='type-id-381'/>
    <pointer-type-def type-id='type-id-380' size-in-bits='64' id='type-id-382'/>
    <qualified-type-def type-id='type-id-382' const='yes' id='type-id-383'/>
    <qualified-type-def type-id='type-id-384' const='yes' id='type-id-385'/>
    <reference-type-def kind='lvalue' type-id='type-id-385' size-in-bits='64' id='type-id-386'/>
    <qualified-type-def type-id='type-id-387' const='yes' id='type-id-388'/>
    <qualified-type-def type-id='type-id-389' const='yes' id='type-id-390'/>
    <reference-type-def kind='lvalue' type-id='type-id-390' size-in-bits='64' id='type-id-391'/>
    <pointer-type-def type-id='type-id-390' size-in-bits='64' id='type-id-392'/>
    <qualified-type-def type-id='type-id-393' const='yes' id='type-id-394'/>
    <reference-type-def kind='lvalue' type-id='type-id-394' size-in-bits='64' id='type-id-395'/>
    <qualified-type-def type-id='type-id-396' const='yes' id='type-id-397'/>
    <reference-type-def kind='lvalue' type-id='type-id-397' size-in-bits='64' id='type-id-398'/>
    <qualified-type-def type-id='type-id-399' const='yes' id='type-id-400'/>
    <reference-type-def kind='lvalue' type-id='type-id-400' size-in-bits='64' id='type-id-401'/>
    <qualified-type-def type-id='type-id-402' const='yes' id='type-id-403'/>
    <reference-type-def kind='lvalue' type-id='type-id-403' size-in-bits='64' id='type-id-404'/>
    <qualified-type-def type-id='type-id-405' const='yes' id='type-id-406'/>
    <reference-type-def kind='lvalue' type-id='type-id-406' size-in-bits='64' id='type-id-407'/>
    <pointer-type-def type-id='type-id-406' size-in-bits='64' id='type-id-408'/>
    <qualified-type-def type-id='type-id-409' const='yes' id='type-id-410'/>
    <reference-type-def kind='lvalue' type-id='type-id-410' size-in-bits='64' id='type-id-411'/>
    <pointer-type-def type-id='type-id-410' size-in-bits='64' id='type-id-412'/>
    <qualified-type-def type-id='type-id-413' const='yes' id='type-id-414'/>
    <reference-type-def kind='lvalue' type-id='type-id-414' size-in-bits='64' id='type-id-415'/>
    <pointer-type-def type-id='type-id-414' size-in-bits='64' id='type-id-416'/>
    <qualified-type-def type-id='type-id-417' const='yes' id='type-id-418'/>
    <reference-type-def kind='lvalue' type-id='type-id-418' size-in-bits='64' id='type-id-419'/>
    <pointer-type-def type-id='type-id-418' size-in-bits='64' id='type-id-420'/>
    <qualified-type-def type-id='type-id-421' const='yes' id='type-id-422'/>
    <pointer-type-def type-id='type-id-422' size-in-bits='64' id='type-id-423'/>
    <qualified-type-def type-id='type-id-424' const='yes' id='type-id-425'/>
    <pointer-type-def type-id='type-id-425' size-in-bits='64' id='type-id-426'/>
    <qualified-type-def type-id='type-id-427' const='yes' id='type-id-428'/>
    <reference-type-def kind='lvalue' type-id='type-id-428' size-in-bits='64' id='type-id-429'/>
    <qualified-type-def type-id='type-id-430' const='yes' id='type-id-431'/>
    <pointer-type-def type-id='type-id-431' size-in-bits='64' id='type-id-432'/>
    <qualified-type-def type-id='type-id-432' const='yes' id='type-id-433'/>
    <qualified-type-def type-id='type-id-305' const='yes' id='type-id-434'/>
    <pointer-type-def type-id='type-id-434' size-in-bits='64' id='type-id-435'/>
    <qualified-type-def type-id='type-id-27' const='yes' id='type-id-436'/>
    <pointer-type-def type-id='type-id-436' size-in-bits='64' id='type-id-437'/>
    <qualified-type-def type-id='type-id-31' const='yes' id='type-id-438'/>
    <reference-type-def kind='lvalue' type-id='type-id-438' size-in-bits='64' id='type-id-439'/>
    <pointer-type-def type-id='type-id-438' size-in-bits='64' id='type-id-177'/>
    <qualified-type-def type-id='type-id-177' const='yes' id='type-id-440'/>
    <reference-type-def kind='lvalue' type-id='type-id-440' size-in-bits='64' id='type-id-441'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-442'/>
    <qualified-type-def type-id='type-id-443' const='yes' id='type-id-444'/>
    <reference-type-def kind='lvalue' type-id='type-id-444' size-in-bits='64' id='type-id-445'/>
    <qualified-type-def type-id='type-id-86' const='yes' id='type-id-446'/>
    <pointer-type-def type-id='type-id-446' size-in-bits='64' id='type-id-447'/>
    <qualified-type-def type-id='type-id-92' const='yes' id='type-id-448'/>
    <pointer-type-def type-id='type-id-448' size-in-bits='64' id='type-id-449'/>
    <qualified-type-def type-id='type-id-174' const='yes' id='type-id-450'/>
    <reference-type-def kind='lvalue' type-id='type-id-450' size-in-bits='64' id='type-id-451'/>
    <pointer-type-def type-id='type-id-450' size-in-bits='64' id='type-id-452'/>
    <qualified-type-def type-id='type-id-452' const='yes' id='type-id-219'/>
    <qualified-type-def type-id='type-id-57' const='yes' id='type-id-453'/>
    <pointer-type-def type-id='type-id-453' size-in-bits='64' id='type-id-172'/>
    <qualified-type-def type-id='type-id-48' const='yes' id='type-id-454'/>
    <qualified-type-def type-id='type-id-49' const='yes' id='type-id-455'/>
    <reference-type-def kind='lvalue' type-id='type-id-455' size-in-bits='64' id='type-id-456'/>
    <qualified-type-def type-id='type-id-50' const='yes' id='type-id-457'/>
    <reference-type-def kind='lvalue' type-id='type-id-457' size-in-bits='64' id='type-id-458'/>
    <qualified-type-def type-id='type-id-44' const='yes' id='type-id-459'/>
    <reference-type-def kind='lvalue' type-id='type-id-459' size-in-bits='64' id='type-id-460'/>
    <qualified-type-def type-id='type-id-45' const='yes' id='type-id-461'/>
    <pointer-type-def type-id='type-id-461' size-in-bits='64' id='type-id-462'/>
    <qualified-type-def type-id='type-id-46' const='yes' id='type-id-463'/>
    <reference-type-def kind='lvalue' type-id='type-id-463' size-in-bits='64' id='type-id-464'/>
    <qualified-type-def type-id='type-id-47' const='yes' id='type-id-465'/>
    <pointer-type-def type-id='type-id-465' size-in-bits='64' id='type-id-466'/>
    <qualified-type-def type-id='type-id-164' const='yes' id='type-id-467'/>
    <reference-type-def kind='lvalue' type-id='type-id-467' size-in-bits='64' id='type-id-468'/>
    <pointer-type-def type-id='type-id-467' size-in-bits='64' id='type-id-169'/>
    <qualified-type-def type-id='type-id-169' const='yes' id='type-id-469'/>
    <qualified-type-def type-id='type-id-165' const='yes' id='type-id-470'/>
    <pointer-type-def type-id='type-id-470' size-in-bits='64' id='type-id-471'/>
    <qualified-type-def type-id='type-id-471' const='yes' id='type-id-472'/>
    <qualified-type-def type-id='type-id-167' const='yes' id='type-id-473'/>
    <reference-type-def kind='lvalue' type-id='type-id-473' size-in-bits='64' id='type-id-474'/>
    <qualified-type-def type-id='type-id-271' const='yes' id='type-id-475'/>
    <reference-type-def kind='lvalue' type-id='type-id-475' size-in-bits='64' id='type-id-476'/>
    <qualified-type-def type-id='type-id-477' const='yes' id='type-id-478'/>
    <reference-type-def kind='lvalue' type-id='type-id-478' size-in-bits='64' id='type-id-479'/>
    <pointer-type-def type-id='type-id-478' size-in-bits='64' id='type-id-480'/>
    <qualified-type-def type-id='type-id-481' const='yes' id='type-id-482'/>
    <pointer-type-def type-id='type-id-482' size-in-bits='64' id='type-id-483'/>
    <qualified-type-def type-id='type-id-484' const='yes' id='type-id-485'/>
    <pointer-type-def type-id='type-id-485' size-in-bits='64' id='type-id-486'/>
    <qualified-type-def type-id='type-id-227' const='yes' id='type-id-487'/>
    <reference-type-def kind='lvalue' type-id='type-id-487' size-in-bits='64' id='type-id-488'/>
    <qualified-type-def type-id='type-id-229' const='yes' id='type-id-489'/>
    <reference-type-def kind='lvalue' type-id='type-id-489' size-in-bits='64' id='type-id-490'/>
    <qualified-type-def type-id='type-id-491' const='yes' id='type-id-492'/>
    <reference-type-def kind='lvalue' type-id='type-id-492' size-in-bits='64' id='type-id-493'/>
    <qualified-type-def type-id='type-id-115' const='yes' id='type-id-494'/>
    <reference-type-def kind='lvalue' type-id='type-id-494' size-in-bits='64' id='type-id-495'/>
    <qualified-type-def type-id='type-id-496' const='yes' id='type-id-497'/>
    <reference-type-def kind='lvalue' type-id='type-id-497' size-in-bits='64' id='type-id-498'/>
    <pointer-type-def type-id='type-id-497' size-in-bits='64' id='type-id-499'/>
    <qualified-type-def type-id='type-id-108' const='yes' id='type-id-500'/>
    <reference-type-def kind='lvalue' type-id='type-id-500' size-in-bits='64' id='type-id-501'/>
    <pointer-type-def type-id='type-id-500' size-in-bits='64' id='type-id-502'/>
    <qualified-type-def type-id='type-id-101' const='yes' id='type-id-503'/>
    <reference-type-def kind='lvalue' type-id='type-id-503' size-in-bits='64' id='type-id-106'/>
    <qualified-type-def type-id='type-id-120' const='yes' id='type-id-504'/>
    <reference-type-def kind='lvalue' type-id='type-id-504' size-in-bits='64' id='type-id-505'/>
    <qualified-type-def type-id='type-id-116' const='yes' id='type-id-506'/>
    <reference-type-def kind='lvalue' type-id='type-id-506' size-in-bits='64' id='type-id-124'/>
    <pointer-type-def type-id='type-id-506' size-in-bits='64' id='type-id-117'/>
    <qualified-type-def type-id='type-id-113' const='yes' id='type-id-507'/>
    <reference-type-def kind='lvalue' type-id='type-id-507' size-in-bits='64' id='type-id-508'/>
    <pointer-type-def type-id='type-id-507' size-in-bits='64' id='type-id-118'/>
    <qualified-type-def type-id='type-id-118' const='yes' id='type-id-509'/>
    <reference-type-def kind='lvalue' type-id='type-id-509' size-in-bits='64' id='type-id-510'/>
    <reference-type-def kind='lvalue' type-id='type-id-118' size-in-bits='64' id='type-id-511'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-512'/>
    <qualified-type-def type-id='type-id-110' const='yes' id='type-id-513'/>
    <reference-type-def kind='lvalue' type-id='type-id-513' size-in-bits='64' id='type-id-514'/>
    <qualified-type-def type-id='type-id-98' const='yes' id='type-id-515'/>
    <reference-type-def kind='lvalue' type-id='type-id-515' size-in-bits='64' id='type-id-516'/>
    <qualified-type-def type-id='type-id-99' const='yes' id='type-id-517'/>
    <pointer-type-def type-id='type-id-517' size-in-bits='64' id='type-id-518'/>
    <qualified-type-def type-id='type-id-518' const='yes' id='type-id-519'/>
    <qualified-type-def type-id='type-id-520' const='yes' id='type-id-521'/>
    <pointer-type-def type-id='type-id-521' size-in-bits='64' id='type-id-522'/>
    <qualified-type-def type-id='type-id-270' const='yes' id='type-id-523'/>
    <reference-type-def kind='lvalue' type-id='type-id-523' size-in-bits='64' id='type-id-524'/>
    <pointer-type-def type-id='type-id-523' size-in-bits='64' id='type-id-525'/>
    <qualified-type-def type-id='type-id-216' const='yes' id='type-id-526'/>
    <reference-type-def kind='lvalue' type-id='type-id-526' size-in-bits='64' id='type-id-527'/>
    <pointer-type-def type-id='type-id-526' size-in-bits='64' id='type-id-528'/>
    <qualified-type-def type-id='type-id-144' const='yes' id='type-id-529'/>
    <reference-type-def kind='lvalue' type-id='type-id-529' size-in-bits='64' id='type-id-530'/>
    <pointer-type-def type-id='type-id-529' size-in-bits='64' id='type-id-531'/>
    <qualified-type-def type-id='type-id-140' const='yes' id='type-id-532'/>
    <pointer-type-def type-id='type-id-532' size-in-bits='64' id='type-id-533'/>
    <qualified-type-def type-id='type-id-148' const='yes' id='type-id-534'/>
    <pointer-type-def type-id='type-id-534' size-in-bits='64' id='type-id-535'/>
    <qualified-type-def type-id='type-id-150' const='yes' id='type-id-536'/>
    <reference-type-def kind='lvalue' type-id='type-id-536' size-in-bits='64' id='type-id-537'/>
    <pointer-type-def type-id='type-id-536' size-in-bits='64' id='type-id-538'/>
    <qualified-type-def type-id='type-id-538' const='yes' id='type-id-539'/>
    <qualified-type-def type-id='type-id-540' const='yes' id='type-id-541'/>
    <reference-type-def kind='lvalue' type-id='type-id-541' size-in-bits='64' id='type-id-542'/>
    <qualified-type-def type-id='type-id-156' const='yes' id='type-id-543'/>
    <pointer-type-def type-id='type-id-543' size-in-bits='64' id='type-id-544'/>
    <qualified-type-def type-id='type-id-545' const='yes' id='type-id-546'/>
    <pointer-type-def type-id='type-id-546' size-in-bits='64' id='type-id-547'/>
    <qualified-type-def type-id='type-id-548' const='yes' id='type-id-549'/>
    <reference-type-def kind='lvalue' type-id='type-id-549' size-in-bits='64' id='type-id-550'/>
    <pointer-type-def type-id='type-id-549' size-in-bits='64' id='type-id-551'/>
    <qualified-type-def type-id='type-id-224' const='yes' id='type-id-552'/>
    <reference-type-def kind='lvalue' type-id='type-id-552' size-in-bits='64' id='type-id-553'/>
    <pointer-type-def type-id='type-id-552' size-in-bits='64' id='type-id-554'/>
    <qualified-type-def type-id='type-id-555' const='yes' id='type-id-556'/>
    <reference-type-def kind='lvalue' type-id='type-id-556' size-in-bits='64' id='type-id-557'/>
    <pointer-type-def type-id='type-id-556' size-in-bits='64' id='type-id-558'/>
    <qualified-type-def type-id='type-id-558' const='yes' id='type-id-559'/>
    <qualified-type-def type-id='type-id-145' const='yes' id='type-id-560'/>
    <reference-type-def kind='lvalue' type-id='type-id-560' size-in-bits='64' id='type-id-561'/>
    <pointer-type-def type-id='type-id-560' size-in-bits='64' id='type-id-562'/>
    <qualified-type-def type-id='type-id-100' const='yes' id='type-id-563'/>
    <pointer-type-def type-id='type-id-563' size-in-bits='64' id='type-id-105'/>
    <qualified-type-def type-id='type-id-161' const='yes' id='type-id-564'/>
    <pointer-type-def type-id='type-id-564' size-in-bits='64' id='type-id-565'/>
    <qualified-type-def type-id='type-id-133' const='yes' id='type-id-566'/>
    <reference-type-def kind='lvalue' type-id='type-id-566' size-in-bits='64' id='type-id-567'/>
    <pointer-type-def type-id='type-id-566' size-in-bits='64' id='type-id-568'/>
    <qualified-type-def type-id='type-id-132' const='yes' id='type-id-569'/>
    <reference-type-def kind='lvalue' type-id='type-id-569' size-in-bits='64' id='type-id-570'/>
    <qualified-type-def type-id='type-id-134' const='yes' id='type-id-571'/>
    <reference-type-def kind='lvalue' type-id='type-id-571' size-in-bits='64' id='type-id-572'/>
    <pointer-type-def type-id='type-id-571' size-in-bits='64' id='type-id-573'/>
    <qualified-type-def type-id='type-id-159' const='yes' id='type-id-574'/>
    <reference-type-def kind='lvalue' type-id='type-id-574' size-in-bits='64' id='type-id-575'/>
    <pointer-type-def type-id='type-id-574' size-in-bits='64' id='type-id-576'/>
    <qualified-type-def type-id='type-id-42' const='yes' id='type-id-577'/>
    <reference-type-def kind='lvalue' type-id='type-id-577' size-in-bits='64' id='type-id-578'/>
    <qualified-type-def type-id='type-id-33' const='yes' id='type-id-579'/>
    <reference-type-def kind='lvalue' type-id='type-id-579' size-in-bits='64' id='type-id-580'/>
    <pointer-type-def type-id='type-id-579' size-in-bits='64' id='type-id-581'/>
    <qualified-type-def type-id='type-id-34' const='yes' id='type-id-582'/>
    <pointer-type-def type-id='type-id-582' size-in-bits='64' id='type-id-583'/>
    <qualified-type-def type-id='type-id-35' const='yes' id='type-id-584'/>
    <pointer-type-def type-id='type-id-584' size-in-bits='64' id='type-id-585'/>
    <qualified-type-def type-id='type-id-38' const='yes' id='type-id-586'/>
    <reference-type-def kind='lvalue' type-id='type-id-586' size-in-bits='64' id='type-id-587'/>
    <pointer-type-def type-id='type-id-586' size-in-bits='64' id='type-id-588'/>
    <qualified-type-def type-id='type-id-39' const='yes' id='type-id-589'/>
    <pointer-type-def type-id='type-id-589' size-in-bits='64' id='type-id-590'/>
    <qualified-type-def type-id='type-id-40' const='yes' id='type-id-591'/>
    <pointer-type-def type-id='type-id-591' size-in-bits='64' id='type-id-592'/>
    <qualified-type-def type-id='type-id-43' const='yes' id='type-id-593'/>
    <reference-type-def kind='lvalue' type-id='type-id-593' size-in-bits='64' id='type-id-594'/>
    <qualified-type-def type-id='type-id-131' const='yes' id='type-id-595'/>
    <reference-type-def kind='lvalue' type-id='type-id-595' size-in-bits='64' id='type-id-596'/>
    <pointer-type-def type-id='type-id-595' size-in-bits='64' id='type-id-597'/>
    <qualified-type-def type-id='type-id-214' const='yes' id='type-id-598'/>
    <reference-type-def kind='lvalue' type-id='type-id-598' size-in-bits='64' id='type-id-599'/>
    <qualified-type-def type-id='type-id-109' const='yes' id='type-id-600'/>
    <reference-type-def kind='lvalue' type-id='type-id-600' size-in-bits='64' id='type-id-601'/>
    <pointer-type-def type-id='type-id-600' size-in-bits='64' id='type-id-175'/>
    <qualified-type-def type-id='type-id-175' const='yes' id='type-id-218'/>
    <qualified-type-def type-id='type-id-209' const='yes' id='type-id-602'/>
    <pointer-type-def type-id='type-id-602' size-in-bits='64' id='type-id-603'/>
    <qualified-type-def type-id='type-id-179' const='yes' id='type-id-604'/>
    <qualified-type-def type-id='type-id-191' const='yes' id='type-id-605'/>
    <reference-type-def kind='lvalue' type-id='type-id-605' size-in-bits='64' id='type-id-606'/>
    <pointer-type-def type-id='type-id-605' size-in-bits='64' id='type-id-607'/>
    <qualified-type-def type-id='type-id-184' const='yes' id='type-id-608'/>
    <reference-type-def kind='lvalue' type-id='type-id-608' size-in-bits='64' id='type-id-609'/>
    <pointer-type-def type-id='type-id-608' size-in-bits='64' id='type-id-610'/>
    <qualified-type-def type-id='type-id-197' const='yes' id='type-id-611'/>
    <reference-type-def kind='lvalue' type-id='type-id-611' size-in-bits='64' id='type-id-612'/>
    <pointer-type-def type-id='type-id-611' size-in-bits='64' id='type-id-613'/>
    <qualified-type-def type-id='type-id-201' const='yes' id='type-id-614'/>
    <reference-type-def kind='lvalue' type-id='type-id-614' size-in-bits='64' id='type-id-615'/>
    <pointer-type-def type-id='type-id-614' size-in-bits='64' id='type-id-616'/>
    <qualified-type-def type-id='type-id-58' const='yes' id='type-id-617'/>
    <pointer-type-def type-id='type-id-617' size-in-bits='64' id='type-id-618'/>
    <qualified-type-def type-id='type-id-211' const='yes' id='type-id-619'/>
    <reference-type-def kind='lvalue' type-id='type-id-619' size-in-bits='64' id='type-id-620'/>
    <qualified-type-def type-id='type-id-621' const='yes' id='type-id-622'/>
    <pointer-type-def type-id='type-id-622' size-in-bits='64' id='type-id-623'/>
    <qualified-type-def type-id='type-id-235' const='yes' id='type-id-624'/>
    <pointer-type-def type-id='type-id-624' size-in-bits='64' id='type-id-625'/>
    <qualified-type-def type-id='type-id-231' const='yes' id='type-id-626'/>
    <reference-type-def kind='lvalue' type-id='type-id-626' size-in-bits='64' id='type-id-627'/>
    <qualified-type-def type-id='type-id-238' const='yes' id='type-id-628'/>
    <reference-type-def kind='lvalue' type-id='type-id-628' size-in-bits='64' id='type-id-629'/>
    <pointer-type-def type-id='type-id-628' size-in-bits='64' id='type-id-630'/>
    <qualified-type-def type-id='type-id-630' const='yes' id='type-id-631'/>
    <qualified-type-def type-id='type-id-152' const='yes' id='type-id-632'/>
    <reference-type-def kind='lvalue' type-id='type-id-632' size-in-bits='64' id='type-id-633'/>
    <pointer-type-def type-id='type-id-632' size-in-bits='64' id='type-id-634'/>
    <qualified-type-def type-id='type-id-635' const='yes' id='type-id-636'/>
    <reference-type-def kind='lvalue' type-id='type-id-636' size-in-bits='64' id='type-id-637'/>
    <qualified-type-def type-id='type-id-194' const='yes' id='type-id-183'/>
    <reference-type-def kind='lvalue' type-id='type-id-183' size-in-bits='64' id='type-id-638'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' id='type-id-639'/>
    <qualified-type-def type-id='type-id-188' const='yes' id='type-id-640'/>
    <reference-type-def kind='lvalue' type-id='type-id-640' size-in-bits='64' id='type-id-641'/>
    <pointer-type-def type-id='type-id-640' size-in-bits='64' id='type-id-642'/>
    <qualified-type-def type-id='type-id-643' const='yes' id='type-id-644'/>
    <reference-type-def kind='lvalue' type-id='type-id-644' size-in-bits='64' id='type-id-645'/>
    <qualified-type-def type-id='type-id-87' const='yes' id='type-id-646'/>
    <reference-type-def kind='lvalue' type-id='type-id-646' size-in-bits='64' id='type-id-647'/>
    <pointer-type-def type-id='type-id-646' size-in-bits='64' id='type-id-648'/>
    <qualified-type-def type-id='type-id-248' const='yes' id='type-id-258'/>
    <qualified-type-def type-id='type-id-249' const='yes' id='type-id-649'/>
    <reference-type-def kind='lvalue' type-id='type-id-649' size-in-bits='64' id='type-id-255'/>
    <pointer-type-def type-id='type-id-649' size-in-bits='64' id='type-id-254'/>
    <qualified-type-def type-id='type-id-93' const='yes' id='type-id-650'/>
    <reference-type-def kind='lvalue' type-id='type-id-650' size-in-bits='64' id='type-id-651'/>
    <pointer-type-def type-id='type-id-650' size-in-bits='64' id='type-id-652'/>
    <qualified-type-def type-id='type-id-259' const='yes' id='type-id-268'/>
    <qualified-type-def type-id='type-id-260' const='yes' id='type-id-653'/>
    <reference-type-def kind='lvalue' type-id='type-id-653' size-in-bits='64' id='type-id-265'/>
    <pointer-type-def type-id='type-id-653' size-in-bits='64' id='type-id-264'/>
    <qualified-type-def type-id='type-id-654' const='yes' id='type-id-655'/>
    <pointer-type-def type-id='type-id-655' size-in-bits='64' id='type-id-656'/>
    <qualified-type-def type-id='type-id-657' const='yes' id='type-id-658'/>
    <pointer-type-def type-id='type-id-658' size-in-bits='64' id='type-id-659'/>
    <qualified-type-def type-id='type-id-659' const='yes' id='type-id-660'/>
    <qualified-type-def type-id='type-id-274' const='yes' id='type-id-661'/>
    <reference-type-def kind='lvalue' type-id='type-id-661' size-in-bits='64' id='type-id-662'/>
    <pointer-type-def type-id='type-id-661' size-in-bits='64' id='type-id-663'/>
    <qualified-type-def type-id='type-id-663' const='yes' id='type-id-664'/>
    <qualified-type-def type-id='type-id-52' const='yes' id='type-id-665'/>
    <pointer-type-def type-id='type-id-665' size-in-bits='64' id='type-id-666'/>
    <qualified-type-def type-id='type-id-54' const='yes' id='type-id-667'/>
    <pointer-type-def type-id='type-id-667' size-in-bits='64' id='type-id-668'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-669'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-670'/>
    <pointer-type-def type-id='type-id-280' size-in-bits='64' id='type-id-671'/>
    <pointer-type-def type-id='type-id-672' size-in-bits='64' id='type-id-76'/>
    <pointer-type-def type-id='type-id-673' size-in-bits='64' id='type-id-82'/>
    <pointer-type-def type-id='type-id-674' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-675' size-in-bits='64' id='type-id-85'/>
    <pointer-type-def type-id='type-id-676' size-in-bits='64' id='type-id-287'/>
    <reference-type-def kind='lvalue' type-id='type-id-19' size-in-bits='64' id='type-id-677'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-678'/>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-679'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-680'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-681'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-682'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-683'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' id='type-id-684'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-685'/>
    <reference-type-def kind='lvalue' type-id='type-id-372' size-in-bits='64' id='type-id-686'/>
    <reference-type-def kind='rvalue' type-id='type-id-372' size-in-bits='64' id='type-id-687'/>
    <pointer-type-def type-id='type-id-372' size-in-bits='64' id='type-id-688'/>
    <pointer-type-def type-id='type-id-689' size-in-bits='64' id='type-id-690'/>
    <pointer-type-def type-id='type-id-691' size-in-bits='64' id='type-id-692'/>
    <reference-type-def kind='lvalue' type-id='type-id-376' size-in-bits='64' id='type-id-693'/>
    <reference-type-def kind='lvalue' type-id='type-id-694' size-in-bits='64' id='type-id-695'/>
    <reference-type-def kind='lvalue' type-id='type-id-379' size-in-bits='64' id='type-id-696'/>
    <reference-type-def kind='rvalue' type-id='type-id-379' size-in-bits='64' id='type-id-697'/>
    <pointer-type-def type-id='type-id-379' size-in-bits='64' id='type-id-698'/>
    <qualified-type-def type-id='type-id-698' const='yes' id='type-id-699'/>
    <pointer-type-def type-id='type-id-700' size-in-bits='64' id='type-id-701'/>
    <qualified-type-def type-id='type-id-701' const='yes' id='type-id-702'/>
    <pointer-type-def type-id='type-id-703' size-in-bits='64' id='type-id-704'/>
    <reference-type-def kind='lvalue' type-id='type-id-384' size-in-bits='64' id='type-id-705'/>
    <reference-type-def kind='lvalue' type-id='type-id-387' size-in-bits='64' id='type-id-706'/>
    <reference-type-def kind='lvalue' type-id='type-id-389' size-in-bits='64' id='type-id-707'/>
    <reference-type-def kind='rvalue' type-id='type-id-389' size-in-bits='64' id='type-id-708'/>
    <pointer-type-def type-id='type-id-389' size-in-bits='64' id='type-id-709'/>
    <reference-type-def kind='lvalue' type-id='type-id-393' size-in-bits='64' id='type-id-710'/>
    <reference-type-def kind='rvalue' type-id='type-id-393' size-in-bits='64' id='type-id-711'/>
    <pointer-type-def type-id='type-id-393' size-in-bits='64' id='type-id-712'/>
    <reference-type-def kind='lvalue' type-id='type-id-396' size-in-bits='64' id='type-id-713'/>
    <reference-type-def kind='rvalue' type-id='type-id-396' size-in-bits='64' id='type-id-714'/>
    <pointer-type-def type-id='type-id-396' size-in-bits='64' id='type-id-715'/>
    <qualified-type-def type-id='type-id-715' const='yes' id='type-id-716'/>
    <reference-type-def kind='lvalue' type-id='type-id-399' size-in-bits='64' id='type-id-717'/>
    <reference-type-def kind='lvalue' type-id='type-id-402' size-in-bits='64' id='type-id-718'/>
    <reference-type-def kind='lvalue' type-id='type-id-405' size-in-bits='64' id='type-id-719'/>
    <pointer-type-def type-id='type-id-405' size-in-bits='64' id='type-id-720'/>
    <reference-type-def kind='lvalue' type-id='type-id-413' size-in-bits='64' id='type-id-721'/>
    <pointer-type-def type-id='type-id-413' size-in-bits='64' id='type-id-722'/>
    <pointer-type-def type-id='type-id-421' size-in-bits='64' id='type-id-723'/>
    <pointer-type-def type-id='type-id-424' size-in-bits='64' id='type-id-724'/>
    <reference-type-def kind='rvalue' type-id='type-id-725' size-in-bits='64' id='type-id-726'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-727'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-728'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-729'/>
    <pointer-type-def type-id='type-id-730' size-in-bits='64' id='type-id-731'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-16'/>
    <reference-type-def kind='lvalue' type-id='type-id-31' size-in-bits='64' id='type-id-732'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-733'/>
    <qualified-type-def type-id='type-id-733' const='yes' id='type-id-734'/>
    <reference-type-def kind='lvalue' type-id='type-id-734' size-in-bits='64' id='type-id-735'/>
    <pointer-type-def type-id='type-id-733' size-in-bits='64' id='type-id-736'/>
    <reference-type-def kind='lvalue' type-id='type-id-137' size-in-bits='64' id='type-id-737'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-738'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-739'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-740'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-741'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-742'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-743'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-744'/>
    <reference-type-def kind='lvalue' type-id='type-id-44' size-in-bits='64' id='type-id-745'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-746'/>
    <reference-type-def kind='lvalue' type-id='type-id-46' size-in-bits='64' id='type-id-747'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-748'/>
    <reference-type-def kind='lvalue' type-id='type-id-164' size-in-bits='64' id='type-id-749'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-173'/>
    <qualified-type-def type-id='type-id-173' const='yes' id='type-id-750'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-751'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-170'/>
    <reference-type-def kind='lvalue' type-id='type-id-167' size-in-bits='64' id='type-id-752'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-60'/>
    <reference-type-def kind='lvalue' type-id='type-id-477' size-in-bits='64' id='type-id-753'/>
    <pointer-type-def type-id='type-id-477' size-in-bits='64' id='type-id-754'/>
    <qualified-type-def type-id='type-id-754' const='yes' id='type-id-755'/>
    <pointer-type-def type-id='type-id-481' size-in-bits='64' id='type-id-756'/>
    <pointer-type-def type-id='type-id-484' size-in-bits='64' id='type-id-757'/>
    <reference-type-def kind='lvalue' type-id='type-id-227' size-in-bits='64' id='type-id-230'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' id='type-id-758'/>
    <qualified-type-def type-id='type-id-758' const='yes' id='type-id-228'/>
    <reference-type-def kind='lvalue' type-id='type-id-229' size-in-bits='64' id='type-id-759'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-760'/>
    <qualified-type-def type-id='type-id-760' const='yes' id='type-id-761'/>
    <reference-type-def kind='lvalue' type-id='type-id-762' size-in-bits='64' id='type-id-763'/>
    <pointer-type-def type-id='type-id-764' size-in-bits='64' id='type-id-765'/>
    <reference-type-def kind='lvalue' type-id='type-id-115' size-in-bits='64' id='type-id-766'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-767'/>
    <reference-type-def kind='lvalue' type-id='type-id-496' size-in-bits='64' id='type-id-104'/>
    <pointer-type-def type-id='type-id-496' size-in-bits='64' id='type-id-768'/>
    <qualified-type-def type-id='type-id-768' const='yes' id='type-id-769'/>
    <reference-type-def kind='lvalue' type-id='type-id-108' size-in-bits='64' id='type-id-770'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-771'/>
    <qualified-type-def type-id='type-id-771' const='yes' id='type-id-772'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-111'/>
    <reference-type-def kind='lvalue' type-id='type-id-120' size-in-bits='64' id='type-id-773'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-127'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-123'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-126'/>
    <reference-type-def kind='lvalue' type-id='type-id-116' size-in-bits='64' id='type-id-774'/>
    <reference-type-def kind='lvalue' type-id='type-id-113' size-in-bits='64' id='type-id-775'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-776'/>
    <reference-type-def kind='lvalue' type-id='type-id-110' size-in-bits='64' id='type-id-777'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-778'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-779'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-780'/>
    <qualified-type-def type-id='type-id-780' const='yes' id='type-id-781'/>
    <pointer-type-def type-id='type-id-520' size-in-bits='64' id='type-id-102'/>
    <reference-type-def kind='lvalue' type-id='type-id-270' size-in-bits='64' id='type-id-782'/>
    <pointer-type-def type-id='type-id-275' size-in-bits='64' id='type-id-783'/>
    <qualified-type-def type-id='type-id-783' const='yes' id='type-id-784'/>
    <reference-type-def kind='lvalue' type-id='type-id-216' size-in-bits='64' id='type-id-785'/>
    <pointer-type-def type-id='type-id-216' size-in-bits='64' id='type-id-786'/>
    <pointer-type-def type-id='type-id-787' size-in-bits='64' id='type-id-171'/>
    <reference-type-def kind='lvalue' type-id='type-id-144' size-in-bits='64' id='type-id-788'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-143'/>
    <pointer-type-def type-id='type-id-146' size-in-bits='64' id='type-id-789'/>
    <pointer-type-def type-id='type-id-789' size-in-bits='64' id='type-id-147'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-142'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-790'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-791'/>
    <reference-type-def kind='lvalue' type-id='type-id-792' size-in-bits='64' id='type-id-793'/>
    <reference-type-def kind='lvalue' type-id='type-id-150' size-in-bits='64' id='type-id-794'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-795'/>
    <qualified-type-def type-id='type-id-795' const='yes' id='type-id-796'/>
    <pointer-type-def type-id='type-id-156' size-in-bits='64' id='type-id-797'/>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-798'/>
    <qualified-type-def type-id='type-id-798' const='yes' id='type-id-158'/>
    <pointer-type-def type-id='type-id-545' size-in-bits='64' id='type-id-157'/>
    <qualified-type-def type-id='type-id-157' const='yes' id='type-id-799'/>
    <reference-type-def kind='lvalue' type-id='type-id-548' size-in-bits='64' id='type-id-800'/>
    <pointer-type-def type-id='type-id-548' size-in-bits='64' id='type-id-801'/>
    <qualified-type-def type-id='type-id-801' const='yes' id='type-id-802'/>
    <pointer-type-def type-id='type-id-803' size-in-bits='64' id='type-id-804'/>
    <reference-type-def kind='lvalue' type-id='type-id-224' size-in-bits='64' id='type-id-805'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-806'/>
    <pointer-type-def type-id='type-id-807' size-in-bits='64' id='type-id-225'/>
    <pointer-type-def type-id='type-id-555' size-in-bits='64' id='type-id-808'/>
    <qualified-type-def type-id='type-id-808' const='yes' id='type-id-809'/>
    <reference-type-def kind='lvalue' type-id='type-id-145' size-in-bits='64' id='type-id-810'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-112'/>
    <pointer-type-def type-id='type-id-811' size-in-bits='64' id='type-id-162'/>
    <qualified-type-def type-id='type-id-112' const='yes' id='type-id-812'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-103'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-813'/>
    <reference-type-def kind='lvalue' type-id='type-id-133' size-in-bits='64' id='type-id-814'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-815'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-816'/>
    <reference-type-def kind='lvalue' type-id='type-id-132' size-in-bits='64' id='type-id-817'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-818'/>
    <reference-type-def kind='lvalue' type-id='type-id-134' size-in-bits='64' id='type-id-819'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-820'/>
    <reference-type-def kind='lvalue' type-id='type-id-159' size-in-bits='64' id='type-id-821'/>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-160'/>
    <reference-type-def kind='lvalue' type-id='type-id-33' size-in-bits='64' id='type-id-822'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-823'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-824'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-37'/>
    <reference-type-def kind='lvalue' type-id='type-id-38' size-in-bits='64' id='type-id-825'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-826'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-827'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-41'/>
    <reference-type-def kind='lvalue' type-id='type-id-131' size-in-bits='64' id='type-id-828'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-829'/>
    <qualified-type-def type-id='type-id-829' const='yes' id='type-id-830'/>
    <pointer-type-def type-id='type-id-831' size-in-bits='64' id='type-id-832'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-833'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-834'/>
    <reference-type-def kind='lvalue' type-id='type-id-109' size-in-bits='64' id='type-id-835'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-139'/>
    <qualified-type-def type-id='type-id-139' const='yes' id='type-id-836'/>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-837'/>
    <qualified-type-def type-id='type-id-837' const='yes' id='type-id-838'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-839'/>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-840'/>
    <reference-type-def kind='lvalue' type-id='type-id-191' size-in-bits='64' id='type-id-841'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-842'/>
    <reference-type-def kind='lvalue' type-id='type-id-184' size-in-bits='64' id='type-id-843'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-844'/>
    <reference-type-def kind='lvalue' type-id='type-id-197' size-in-bits='64' id='type-id-845'/>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' id='type-id-846'/>
    <reference-type-def kind='lvalue' type-id='type-id-201' size-in-bits='64' id='type-id-847'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' id='type-id-848'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' id='type-id-236'/>
    <reference-type-def kind='lvalue' type-id='type-id-235' size-in-bits='64' id='type-id-233'/>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-237'/>
    <reference-type-def kind='lvalue' type-id='type-id-231' size-in-bits='64' id='type-id-849'/>
    <pointer-type-def type-id='type-id-231' size-in-bits='64' id='type-id-234'/>
    <pointer-type-def type-id='type-id-850' size-in-bits='64' id='type-id-851'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-852'/>
    <qualified-type-def type-id='type-id-852' const='yes' id='type-id-853'/>
    <reference-type-def kind='lvalue' type-id='type-id-152' size-in-bits='64' id='type-id-854'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-855'/>
    <reference-type-def kind='lvalue' type-id='type-id-194' size-in-bits='64' id='type-id-856'/>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-857'/>
    <reference-type-def kind='lvalue' type-id='type-id-188' size-in-bits='64' id='type-id-858'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-859'/>
    <reference-type-def kind='lvalue' type-id='type-id-860' size-in-bits='64' id='type-id-861'/>
    <pointer-type-def type-id='type-id-643' size-in-bits='64' id='type-id-862'/>
    <reference-type-def kind='lvalue' type-id='type-id-87' size-in-bits='64' id='type-id-863'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-864'/>
    <reference-type-def kind='lvalue' type-id='type-id-249' size-in-bits='64' id='type-id-865'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-252'/>
    <reference-type-def kind='lvalue' type-id='type-id-93' size-in-bits='64' id='type-id-866'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-867'/>
    <reference-type-def kind='lvalue' type-id='type-id-260' size-in-bits='64' id='type-id-868'/>
    <pointer-type-def type-id='type-id-260' size-in-bits='64' id='type-id-262'/>
    <pointer-type-def type-id='type-id-654' size-in-bits='64' id='type-id-869'/>
    <pointer-type-def type-id='type-id-657' size-in-bits='64' id='type-id-870'/>
    <qualified-type-def type-id='type-id-870' const='yes' id='type-id-871'/>
    <reference-type-def kind='lvalue' type-id='type-id-274' size-in-bits='64' id='type-id-872'/>
    <pointer-type-def type-id='type-id-274' size-in-bits='64' id='type-id-873'/>
    <qualified-type-def type-id='type-id-873' const='yes' id='type-id-874'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-875'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-876'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-877'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-878'/>
    <class-decl name='_GdkEventKey' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-135'/>
    <class-decl name='_GdkWindow' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-66'/>
    <class-decl name='_GtkRcStyle' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-70'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-315'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-316'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-317'/>
    <class-decl name='wxAcceleratorTable' visibility='default' is-declaration-only='yes' id='type-id-443'/>
    <class-decl name='wxColour' visibility='default' is-declaration-only='yes' id='type-id-271'/>
    <class-decl name='wxCommandEvent' visibility='default' is-declaration-only='yes' id='type-id-477'>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK14wxCommandEvent12GetClassInfoEv' filepath='include/wx/event.h' line='1660' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-480' is-artificial='yes'/>
          <return type-id='type-id-173'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='Clone' mangled-name='_ZNK14wxCommandEvent5CloneEv' filepath='include/wx/event.h' line='1651' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-480' is-artificial='yes'/>
          <return type-id='type-id-768'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='6'>
        <function-decl name='GetEventCategory' mangled-name='_ZNK14wxCommandEvent16GetEventCategoryEv' filepath='include/wx/event.h' line='1652' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-480' is-artificial='yes'/>
          <return type-id='type-id-107'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxControl' visibility='default' is-declaration-only='yes' id='type-id-481'>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK9wxControl12GetClassInfoEv' filepath='include/wx/gtk/control.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-483' is-artificial='yes'/>
          <return type-id='type-id-173'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='105'>
        <function-decl name='GetDefaultAttributes' mangled-name='_ZNK9wxControl20GetDefaultAttributesEv' filepath='include/wx/gtk/control.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-483' is-artificial='yes'/>
          <return type-id='type-id-269'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='111'>
        <function-decl name='SetFont' mangled-name='_ZN9wxControl7SetFontERK6wxFont' filepath='include/wx/gtk/control.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-756' is-artificial='yes'/>
          <parameter type-id='type-id-524'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='173'>
        <function-decl name='DoGetBestSize' mangled-name='_ZNK9wxControl13DoGetBestSizeEv' filepath='include/wx/gtk/control.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-483' is-artificial='yes'/>
          <return type-id='type-id-131'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='211'>
        <function-decl name='UseGTKStyleBase' mangled-name='_ZNK9wxControl15UseGTKStyleBaseEv' filepath='include/wx/gtk/control.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-483' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxControlBase' visibility='default' is-declaration-only='yes' id='type-id-484'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-757' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD4Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-757' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='23'>
        <function-decl name='SetLabel' mangled-name='_ZN13wxControlBase8SetLabelERK8wxString' filepath='include/wx/control.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-757' is-artificial='yes'/>
          <parameter type-id='type-id-601'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='24'>
        <function-decl name='GetLabel' mangled-name='_ZNK13wxControlBase8GetLabelEv' filepath='include/wx/control.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-486' is-artificial='yes'/>
          <return type-id='type-id-109'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='116'>
        <function-decl name='DoUpdateWindowUI' mangled-name='_ZN13wxControlBase16DoUpdateWindowUIER15wxUpdateUIEvent' filepath='include/wx/control.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-757' is-artificial='yes'/>
          <parameter type-id='type-id-861'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='152'>
        <function-decl name='ShouldInheritColours' mangled-name='_ZNK13wxControlBase20ShouldInheritColoursEv' filepath='include/wx/control.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-486' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='161'>
        <function-decl name='GetDefaultBorder' mangled-name='_ZNK13wxControlBase16GetDefaultBorderEv' filepath='include/wx/control.h' line='161' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-486' is-artificial='yes'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='206'>
        <function-decl name='SetLabelText' mangled-name='_ZN13wxControlBase12SetLabelTextERK8wxString' filepath='include/wx/control.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-757' is-artificial='yes'/>
          <parameter type-id='type-id-601'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='207'>
        <function-decl name='GetLabelText' mangled-name='_ZNK13wxControlBase12GetLabelTextEv' filepath='include/wx/control.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-486' is-artificial='yes'/>
          <return type-id='type-id-109'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='208'>
        <function-decl name='Command' mangled-name='_ZN13wxControlBase7CommandER14wxCommandEvent' filepath='include/wx/control.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-757' is-artificial='yes'/>
          <parameter type-id='type-id-753'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='209'>
        <function-decl name='DoSetLabelMarkup' mangled-name='_ZN13wxControlBase16DoSetLabelMarkupERK8wxString' filepath='include/wx/control.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-757' is-artificial='yes'/>
          <parameter type-id='type-id-601'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='210'>
        <function-decl name='DoGetSizeFromTextSize' mangled-name='_ZNK13wxControlBase21DoGetSizeFromTextSizeEii' filepath='include/wx/control.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-486' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-131'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxCursor' visibility='default' is-declaration-only='yes' id='type-id-491'/>
    <class-decl name='wxDC' visibility='default' is-declaration-only='yes' id='type-id-762'/>
    <class-decl name='wxDropTarget' visibility='default' is-declaration-only='yes' id='type-id-764'/>
    <class-decl name='wxEvent' visibility='default' is-declaration-only='yes' id='type-id-496'>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK7wxEvent12GetClassInfoEv' filepath='include/wx/event.h' line='1140' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-499' is-artificial='yes'/>
          <return type-id='type-id-173'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='6'>
        <function-decl name='GetEventCategory' mangled-name='_ZNK7wxEvent16GetEventCategoryEv' filepath='include/wx/event.h' line='1010' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-499' is-artificial='yes'/>
          <return type-id='type-id-107'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEventFunctor' visibility='default' is-declaration-only='yes' id='type-id-101'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD4Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-111' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK14wxEventFunctor13GetEvtHandlerEv' filepath='include/wx/event.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-879' is-artificial='yes'/>
          <return type-id='type-id-102'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK14wxEventFunctor12GetEvtMethodEv' filepath='include/wx/event.h' line='250' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-879' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEvtHandler' visibility='default' is-declaration-only='yes' id='type-id-520'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEvtHandler' mangled-name='_ZN12wxEvtHandlerD2Ev' filepath='include/wx/event.h' line='3639' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-102' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEvtHandler' mangled-name='_ZN12wxEvtHandlerD4Ev' filepath='include/wx/event.h' line='3639' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-102' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK12wxEvtHandler12GetClassInfoEv' filepath='include/wx/event.h' line='4096' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-522' is-artificial='yes'/>
          <return type-id='type-id-173'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='SetNextHandler' mangled-name='_ZN12wxEvtHandler14SetNextHandlerEPS_' filepath='include/wx/event.h' line='3647' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-102' is-artificial='yes'/>
          <parameter type-id='type-id-102'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='SetPreviousHandler' mangled-name='_ZN12wxEvtHandler18SetPreviousHandlerEPS_' filepath='include/wx/event.h' line='3648' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-102' is-artificial='yes'/>
          <parameter type-id='type-id-102'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='ProcessEvent' mangled-name='_ZN12wxEvtHandler12ProcessEventER7wxEvent' filepath='include/wx/event.h' line='3677' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-102' is-artificial='yes'/>
          <parameter type-id='type-id-104'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='QueueEvent' mangled-name='_ZN12wxEvtHandler10QueueEventEP7wxEvent' filepath='include/wx/event.h' line='3705' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-102' is-artificial='yes'/>
          <parameter type-id='type-id-768'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='AddPendingEvent' mangled-name='_ZN12wxEvtHandler15AddPendingEventERK7wxEvent' filepath='include/wx/event.h' line='3709' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-102' is-artificial='yes'/>
          <parameter type-id='type-id-498'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='SearchEventTable' mangled-name='_ZN12wxEvtHandler16SearchEventTableER12wxEventTableR7wxEvent' filepath='include/wx/event.h' line='3964' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-102' is-artificial='yes'/>
          <parameter type-id='type-id-774'/>
          <parameter type-id='type-id-104'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='11'>
        <function-decl name='TryBefore' mangled-name='_ZN12wxEvtHandler9TryBeforeER7wxEvent' filepath='include/wx/event.h' line='3994' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-102' is-artificial='yes'/>
          <parameter type-id='type-id-104'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='12'>
        <function-decl name='TryAfter' mangled-name='_ZN12wxEvtHandler8TryAfterER7wxEvent' filepath='include/wx/event.h' line='4014' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-102' is-artificial='yes'/>
          <parameter type-id='type-id-104'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='13'>
        <function-decl name='OnDynamicBind' mangled-name='_ZN12wxEvtHandler13OnDynamicBindER24wxDynamicEventTableEntry' filepath='include/wx/event.h' line='4029' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-102' is-artificial='yes'/>
          <parameter type-id='type-id-766'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='14'>
        <function-decl name='GetEventTable' mangled-name='_ZNK12wxEvtHandler13GetEventTableEv' filepath='include/wx/event.h' line='4036' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-522' is-artificial='yes'/>
          <return type-id='type-id-117'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='15'>
        <function-decl name='GetEventHashTable' mangled-name='_ZNK12wxEvtHandler17GetEventHashTableEv' filepath='include/wx/event.h' line='4039' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-522' is-artificial='yes'/>
          <return type-id='type-id-773'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='16'>
        <function-decl name='DoSetClientObject' mangled-name='_ZN12wxEvtHandler17DoSetClientObjectEP12wxClientData' filepath='include/wx/event.h' line='4073' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-102' is-artificial='yes'/>
          <parameter type-id='type-id-60'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='17'>
        <function-decl name='DoGetClientObject' mangled-name='_ZNK12wxEvtHandler17DoGetClientObjectEv' filepath='include/wx/event.h' line='4074' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-522' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='18'>
        <function-decl name='DoSetClientData' mangled-name='_ZN12wxEvtHandler15DoSetClientDataEPv' filepath='include/wx/event.h' line='4076' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-102' is-artificial='yes'/>
          <parameter type-id='type-id-16'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='19'>
        <function-decl name='DoGetClientData' mangled-name='_ZNK12wxEvtHandler15DoGetClientDataEv' filepath='include/wx/event.h' line='4077' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-522' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='20'>
        <function-decl name='WXReservedEvtHandler1' mangled-name='_ZN12wxEvtHandler21WXReservedEvtHandler1EPv' filepath='include/wx/event.h' line='4083' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-102' is-artificial='yes'/>
          <parameter type-id='type-id-16'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='21'>
        <function-decl name='WXReservedEvtHandler2' mangled-name='_ZN12wxEvtHandler21WXReservedEvtHandler2EPv' filepath='include/wx/event.h' line='4084' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-102' is-artificial='yes'/>
          <parameter type-id='type-id-16'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxFont' visibility='default' is-declaration-only='yes' id='type-id-270'/>
    <class-decl name='wxHashTable' visibility='default' is-declaration-only='yes' id='type-id-787'/>
    <class-decl name='wxHelpEvent' visibility='default' is-declaration-only='yes' id='type-id-880'>
      <member-type access='public'>
        <enum-decl name='Origin' filepath='include/wx/event.h' line='3331' column='1' id='type-id-881'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Origin_Unknown' value='0'/>
          <enumerator name='Origin_Keyboard' value='1'/>
          <enumerator name='Origin_HelpButton' value='2'/>
        </enum-decl>
      </member-type>
    </class-decl>
    <class-decl name='wxIdleEvent' visibility='default' is-declaration-only='yes' id='type-id-792'/>
    <class-decl name='wxMBConv' visibility='default' is-declaration-only='yes' id='type-id-540'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMBConv' mangled-name='_ZN8wxMBConvD0Ev' filepath='include/wx/strconv.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-882' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMBConv' mangled-name='_ZN8wxMBConvD2Ev' filepath='include/wx/strconv.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-882' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMBConv' mangled-name='_ZN8wxMBConvD4Ev' filepath='include/wx/strconv.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-882' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='0'>
        <function-decl name='ToWChar' mangled-name='_ZNK8wxMBConv7ToWCharEPwmPKcm' filepath='include/wx/strconv.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-883' is-artificial='yes'/>
          <parameter type-id='type-id-733'/>
          <parameter type-id='type-id-125'/>
          <parameter type-id='type-id-239'/>
          <parameter type-id='type-id-125'/>
          <return type-id='type-id-125'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='1'>
        <function-decl name='FromWChar' mangled-name='_ZNK8wxMBConv9FromWCharEPcmPKwm' filepath='include/wx/strconv.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-883' is-artificial='yes'/>
          <parameter type-id='type-id-210'/>
          <parameter type-id='type-id-125'/>
          <parameter type-id='type-id-177'/>
          <parameter type-id='type-id-125'/>
          <return type-id='type-id-125'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetMaxCharLen' mangled-name='_ZNK8wxMBConv13GetMaxCharLenEv' filepath='include/wx/strconv.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-883' is-artificial='yes'/>
          <return type-id='type-id-125'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='GetMBNulLen' mangled-name='_ZNK8wxMBConv11GetMBNulLenEv' filepath='include/wx/strconv.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-883' is-artificial='yes'/>
          <return type-id='type-id-125'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='IsUTF8' mangled-name='_ZNK8wxMBConv6IsUTF8Ev' filepath='include/wx/strconv.h' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-883' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='MB2WC' mangled-name='_ZNK8wxMBConv5MB2WCEPwPKcm' filepath='include/wx/strconv.h' line='165' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-883' is-artificial='yes'/>
          <parameter type-id='type-id-733'/>
          <parameter type-id='type-id-239'/>
          <parameter type-id='type-id-125'/>
          <return type-id='type-id-125'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='6'>
        <function-decl name='WC2MB' mangled-name='_ZNK8wxMBConv5WC2MBEPcPKwm' filepath='include/wx/strconv.h' line='166' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-883' is-artificial='yes'/>
          <parameter type-id='type-id-210'/>
          <parameter type-id='type-id-177'/>
          <parameter type-id='type-id-125'/>
          <return type-id='type-id-125'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxMenu' visibility='default' is-declaration-only='yes' id='type-id-803'/>
    <class-decl name='wxMutexInternal' visibility='default' is-declaration-only='yes' id='type-id-807'/>
    <class-decl name='wxNotifyEvent' visibility='default' is-declaration-only='yes' id='type-id-555'>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK13wxNotifyEvent12GetClassInfoEv' filepath='include/wx/event.h' line='1691' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-558' is-artificial='yes'/>
          <return type-id='type-id-173'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='Clone' mangled-name='_ZNK13wxNotifyEvent5CloneEv' filepath='include/wx/event.h' line='1685' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-558' is-artificial='yes'/>
          <return type-id='type-id-768'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxObject' visibility='default' is-declaration-only='yes' id='type-id-145'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-112' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-112' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-112' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-112' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD4Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-112' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK8wxObject12GetClassInfoEv' filepath='include/wx/object.h' line='446' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-562' is-artificial='yes'/>
          <return type-id='type-id-173'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='3'>
        <function-decl name='CreateRefData' mangled-name='_ZNK8wxObject13CreateRefDataEv' filepath='include/wx/object.h' line='464' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-562' is-artificial='yes'/>
          <return type-id='type-id-813'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='4'>
        <function-decl name='CloneRefData' mangled-name='_ZNK8wxObject12CloneRefDataEPK12wxRefCounter' filepath='include/wx/object.h' line='467' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-562' is-artificial='yes'/>
          <parameter type-id='type-id-565'/>
          <return type-id='type-id-813'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxSizer' visibility='default' is-declaration-only='yes' id='type-id-831'/>
    <class-decl name='wxTextEntry' visibility='default' is-declaration-only='yes' id='type-id-621'/>
    <class-decl name='wxThread' visibility='default' is-declaration-only='yes' id='type-id-232'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-236' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-236' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD4Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-236' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='0'>
        <function-decl name='TestDestroy' mangled-name='_ZN8wxThread11TestDestroyEv' filepath='include/wx/thread.h' line='593' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-236' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='4'>
        <function-decl name='OnDelete' mangled-name='_ZN8wxThread8OnDeleteEv' filepath='include/wx/thread.h' line='622' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-236' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='5'>
        <function-decl name='OnKill' mangled-name='_ZN8wxThread6OnKillEv' filepath='include/wx/thread.h' line='626' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-236' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='6'>
        <function-decl name='OnExit' mangled-name='_ZN8wxThread6OnExitEv' filepath='include/wx/thread.h' line='631' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-236' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxToolTip' visibility='default' is-declaration-only='yes' id='type-id-850'/>
    <class-decl name='wxURI' visibility='default' is-declaration-only='yes' id='type-id-635'/>
    <class-decl name='wxUpdateUIEvent' visibility='default' is-declaration-only='yes' id='type-id-860'/>
    <class-decl name='wxValidator' visibility='default' is-declaration-only='yes' id='type-id-643'/>
    <class-decl name='wxWindow' visibility='default' is-declaration-only='yes' id='type-id-654'>
      <member-function access='public' vtable-offset='23'>
        <function-decl name='SetLabel' mangled-name='_ZN8wxWindow8SetLabelERK8wxString' filepath='include/wx/gtk/window.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-601'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='27'>
        <function-decl name='GetLayoutDirection' mangled-name='_ZNK8wxWindow18GetLayoutDirectionEv' filepath='include/wx/gtk/window.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <return type-id='type-id-149'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='28'>
        <function-decl name='SetLayoutDirection' mangled-name='_ZN8wxWindow18SetLayoutDirectionE17wxLayoutDirection' filepath='include/wx/gtk/window.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-149'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='29'>
        <function-decl name='AdjustForLayoutDirection' mangled-name='_ZNK8wxWindow24AdjustForLayoutDirectionEiii' filepath='include/wx/gtk/window.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-240'/>
          <parameter type-id='type-id-240'/>
          <parameter type-id='type-id-240'/>
          <return type-id='type-id-240'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='31'>
        <function-decl name='Raise' mangled-name='_ZN8wxWindow5RaiseEv' filepath='include/wx/gtk/window.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='32'>
        <function-decl name='Lower' mangled-name='_ZN8wxWindow5LowerEv' filepath='include/wx/gtk/window.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='51'>
        <function-decl name='GetContentScaleFactor' mangled-name='_ZNK8wxWindow21GetContentScaleFactorEv' filepath='include/wx/gtk/window.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='52'>
        <function-decl name='GetDPIScaleFactor' mangled-name='_ZNK8wxWindow17GetDPIScaleFactorEv' filepath='include/wx/gtk/window.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='53'>
        <function-decl name='GetWindowBorderSize' mangled-name='_ZNK8wxWindow19GetWindowBorderSizeEv' filepath='include/wx/gtk/window.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <return type-id='type-id-131'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='58'>
        <function-decl name='Show' mangled-name='_ZN8wxWindow4ShowEb' filepath='include/wx/gtk/window.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='62'>
        <function-decl name='IsShown' mangled-name='_ZNK8wxWindow7IsShownEv' filepath='include/wx/gtk/window.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='67'>
        <function-decl name='IsRetained' mangled-name='_ZNK8wxWindow10IsRetainedEv' filepath='include/wx/gtk/window.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='71'>
        <function-decl name='SetFocus' mangled-name='_ZN8wxWindow8SetFocusEv' filepath='include/wx/gtk/window.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='78'>
        <function-decl name='SetCanFocus' mangled-name='_ZN8wxWindow11SetCanFocusEb' filepath='include/wx/gtk/window.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='81'>
        <function-decl name='Reparent' mangled-name='_ZN8wxWindow8ReparentEP12wxWindowBase' filepath='include/wx/gtk/window.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-870'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='82'>
        <function-decl name='AddChild' mangled-name='_ZN8wxWindow8AddChildEP12wxWindowBase' filepath='include/wx/gtk/window.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-870'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='83'>
        <function-decl name='RemoveChild' mangled-name='_ZN8wxWindow11RemoveChildEP12wxWindowBase' filepath='include/wx/gtk/window.h' line='120' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-870'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='94'>
        <function-decl name='WarpPointer' mangled-name='_ZN8wxWindow11WarpPointerEii' filepath='include/wx/gtk/window.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='96'>
        <function-decl name='EnableTouchEvents' mangled-name='_ZN8wxWindow17EnableTouchEventsEi' filepath='include/wx/gtk/window.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='97'>
        <function-decl name='Refresh' mangled-name='_ZN8wxWindow7RefreshEbPK6wxRect' filepath='include/wx/gtk/window.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <parameter type-id='type-id-573'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='98'>
        <function-decl name='Update' mangled-name='_ZN8wxWindow6UpdateEv' filepath='include/wx/gtk/window.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='99'>
        <function-decl name='ClearBackground' mangled-name='_ZN8wxWindow15ClearBackgroundEv' filepath='include/wx/gtk/window.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='101'>
        <function-decl name='SetDoubleBuffered' mangled-name='_ZN8wxWindow17SetDoubleBufferedEb' filepath='include/wx/gtk/window.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='102'>
        <function-decl name='IsDoubleBuffered' mangled-name='_ZNK8wxWindow16IsDoubleBufferedEv' filepath='include/wx/gtk/window.h' line='132' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='103'>
        <function-decl name='DoIsExposed' mangled-name='_ZNK8wxWindow11DoIsExposedEii' filepath='include/wx/gtk/window.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='104'>
        <function-decl name='DoIsExposed' mangled-name='_ZNK8wxWindow11DoIsExposedEiiii' filepath='include/wx/gtk/window.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='106'>
        <function-decl name='SetBackgroundColour' mangled-name='_ZN8wxWindow19SetBackgroundColourERK8wxColour' filepath='include/wx/gtk/window.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-476'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='107'>
        <function-decl name='SetForegroundColour' mangled-name='_ZN8wxWindow19SetForegroundColourERK8wxColour' filepath='include/wx/gtk/window.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-476'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='108'>
        <function-decl name='SetBackgroundStyle' mangled-name='_ZN8wxWindow18SetBackgroundStyleE17wxBackgroundStyle' filepath='include/wx/gtk/window.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-62'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='110'>
        <function-decl name='IsTransparentBackgroundSupported' mangled-name='_ZNK8wxWindow32IsTransparentBackgroundSupportedEP8wxString' filepath='include/wx/gtk/window.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-139'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='112'>
        <function-decl name='SetCursor' mangled-name='_ZN8wxWindow9SetCursorERK8wxCursor' filepath='include/wx/gtk/window.h' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-493'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='113'>
        <function-decl name='GetCharHeight' mangled-name='_ZNK8wxWindow13GetCharHeightEv' filepath='include/wx/gtk/window.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='114'>
        <function-decl name='GetCharWidth' mangled-name='_ZNK8wxWindow12GetCharWidthEv' filepath='include/wx/gtk/window.h' line='100' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='119'>
        <function-decl name='SetScrollbar' mangled-name='_ZN8wxWindow12SetScrollbarEiiiib' filepath='include/wx/gtk/window.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='120'>
        <function-decl name='SetScrollPos' mangled-name='_ZN8wxWindow12SetScrollPosEiib' filepath='include/wx/gtk/window.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='121'>
        <function-decl name='GetScrollPos' mangled-name='_ZNK8wxWindow12GetScrollPosEi' filepath='include/wx/gtk/window.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='122'>
        <function-decl name='GetScrollThumb' mangled-name='_ZNK8wxWindow14GetScrollThumbEi' filepath='include/wx/gtk/window.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='123'>
        <function-decl name='GetScrollRange' mangled-name='_ZNK8wxWindow14GetScrollRangeEi' filepath='include/wx/gtk/window.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='124'>
        <function-decl name='ScrollWindow' mangled-name='_ZN8wxWindow12ScrollWindowEiiPK6wxRect' filepath='include/wx/gtk/window.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-573'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='125'>
        <function-decl name='ScrollLines' mangled-name='_ZN8wxWindow11ScrollLinesEi' filepath='include/wx/gtk/window.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='126'>
        <function-decl name='ScrollPages' mangled-name='_ZN8wxWindow11ScrollPagesEi' filepath='include/wx/gtk/window.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='130'>
        <function-decl name='SetDropTarget' mangled-name='_ZN8wxWindow13SetDropTargetEP12wxDropTarget' filepath='include/wx/gtk/window.h' line='116' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-765'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='145'>
        <function-decl name='OnInternalIdle' mangled-name='_ZN8wxWindow14OnInternalIdleEv' filepath='include/wx/gtk/window.h' line='145' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='148'>
        <function-decl name='GetHandle' mangled-name='_ZNK8wxWindow9GetHandleEv' filepath='include/wx/gtk/window.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <return type-id='type-id-73'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='158'>
        <function-decl name='DoMoveInTabOrder' mangled-name='_ZN8wxWindow16DoMoveInTabOrderEPS_N12wxWindowBase11WindowOrderE' filepath='include/wx/gtk/window.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-869'/>
          <parameter type-id='type-id-884'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='159'>
        <function-decl name='DoNavigateIn' mangled-name='_ZN8wxWindow12DoNavigateInEi' filepath='include/wx/gtk/window.h' line='420' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='160'>
        <function-decl name='DoEnable' mangled-name='_ZN8wxWindow8DoEnableEb' filepath='include/wx/gtk/window.h' line='390' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='163'>
        <function-decl name='DoGetTextExtent' mangled-name='_ZNK8wxWindow15DoGetTextExtentERK8wxStringPiS3_S3_S3_PK6wxFont' filepath='include/wx/gtk/window.h' line='375' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-601'/>
          <parameter type-id='type-id-678'/>
          <parameter type-id='type-id-678'/>
          <parameter type-id='type-id-678'/>
          <parameter type-id='type-id-678'/>
          <parameter type-id='type-id-525'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='164'>
        <function-decl name='DoClientToScreen' mangled-name='_ZNK8wxWindow16DoClientToScreenEPiS0_' filepath='include/wx/gtk/window.h' line='380' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-678'/>
          <parameter type-id='type-id-678'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='165'>
        <function-decl name='DoScreenToClient' mangled-name='_ZNK8wxWindow16DoScreenToClientEPiS0_' filepath='include/wx/gtk/window.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-678'/>
          <parameter type-id='type-id-678'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='167'>
        <function-decl name='DoCaptureMouse' mangled-name='_ZN8wxWindow14DoCaptureMouseEv' filepath='include/wx/gtk/window.h' line='396' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='168'>
        <function-decl name='DoReleaseMouse' mangled-name='_ZN8wxWindow14DoReleaseMouseEv' filepath='include/wx/gtk/window.h' line='397' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='169'>
        <function-decl name='DoGetPosition' mangled-name='_ZNK8wxWindow13DoGetPositionEPiS0_' filepath='include/wx/gtk/window.h' line='382' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-678'/>
          <parameter type-id='type-id-678'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='171'>
        <function-decl name='DoGetSize' mangled-name='_ZNK8wxWindow9DoGetSizeEPiS0_' filepath='include/wx/gtk/window.h' line='383' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-678'/>
          <parameter type-id='type-id-678'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='172'>
        <function-decl name='DoGetClientSize' mangled-name='_ZNK8wxWindow15DoGetClientSizeEPiS0_' filepath='include/wx/gtk/window.h' line='384' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-678'/>
          <parameter type-id='type-id-678'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='177'>
        <function-decl name='DoSetSize' mangled-name='_ZN8wxWindow9DoSetSizeEiiiii' filepath='include/wx/gtk/window.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='178'>
        <function-decl name='DoSetClientSize' mangled-name='_ZN8wxWindow15DoSetClientSizeEii' filepath='include/wx/gtk/window.h' line='388' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='180'>
        <function-decl name='DoMoveWindow' mangled-name='_ZN8wxWindow12DoMoveWindowEiiii' filepath='include/wx/gtk/window.h' line='389' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='183'>
        <function-decl name='DoSetToolTip' mangled-name='_ZN8wxWindow12DoSetToolTipEP9wxToolTip' filepath='include/wx/gtk/window.h' line='408' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-851'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='184'>
        <function-decl name='DoPopupMenu' mangled-name='_ZN8wxWindow11DoPopupMenuEP6wxMenuii' filepath='include/wx/gtk/window.h' line='393' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-804'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='187'>
        <function-decl name='DoFreeze' mangled-name='_ZN8wxWindow8DoFreezeEv' filepath='include/wx/gtk/window.h' line='399' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='188'>
        <function-decl name='DoThaw' mangled-name='_ZN8wxWindow6DoThawEv' filepath='include/wx/gtk/window.h' line='400' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='192'>
        <function-decl name='GetConnectWidget' mangled-name='_ZN8wxWindow16GetConnectWidgetEv' filepath='include/wx/gtk/window.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <return type-id='type-id-72'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='193'>
        <function-decl name='GTKProcessEvent' mangled-name='_ZNK8wxWindow15GTKProcessEventER7wxEvent' filepath='include/wx/gtk/window.h' line='189' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-104'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='194'>
        <function-decl name='GTKHandleFocusOut' mangled-name='_ZN8wxWindow17GTKHandleFocusOutEv' filepath='include/wx/gtk/window.h' line='203' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='195'>
        <function-decl name='GTKHandleRealized' mangled-name='_ZN8wxWindow17GTKHandleRealizedEv' filepath='include/wx/gtk/window.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='196'>
        <function-decl name='GTKNeedsToFilterSameWindowFocus' mangled-name='_ZNK8wxWindow31GTKNeedsToFilterSameWindowFocusEv' filepath='include/wx/gtk/window.h' line='225' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='197'>
        <function-decl name='GTKWidgetNeedsMnemonic' mangled-name='_ZNK8wxWindow22GTKWidgetNeedsMnemonicEv' filepath='include/wx/gtk/window.h' line='231' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='198'>
        <function-decl name='GTKWidgetDoSetMnemonic' mangled-name='_ZN8wxWindow22GTKWidgetDoSetMnemonicEP10_GtkWidget' filepath='include/wx/gtk/window.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-72'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='199'>
        <function-decl name='GTKGetWindow' mangled-name='_ZNK8wxWindow12GTKGetWindowER17wxArrayGdkWindows' filepath='include/wx/gtk/window.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-737'/>
          <return type-id='type-id-309'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='200'>
        <function-decl name='GTKApplyToolTip' mangled-name='_ZN8wxWindow15GTKApplyToolTipEPKc' filepath='include/wx/gtk/window.h' line='252' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-239'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='201'>
        <function-decl name='GTKIsTransparentForMouse' mangled-name='_ZNK8wxWindow24GTKIsTransparentForMouseEv' filepath='include/wx/gtk/window.h' line='263' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='202'>
        <function-decl name='GTKIMFilterKeypress' mangled-name='_ZNK8wxWindow19GTKIMFilterKeypressEP12_GdkEventKey' filepath='include/wx/gtk/window.h' line='315' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <parameter type-id='type-id-308'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='203'>
        <function-decl name='DoApplyWidgetStyle' mangled-name='_ZN8wxWindow18DoApplyWidgetStyleEP11_GtkRcStyle' filepath='include/wx/gtk/window.h' line='445' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-310'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes' vtable-offset='204'>
        <function-decl name='GTKNeedsParent' mangled-name='_ZNK8wxWindow14GTKNeedsParentEv' filepath='include/wx/gtk/window.h' line='473' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-656' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='private' vtable-offset='205'>
        <function-decl name='AddChildGTK' mangled-name='_ZN8wxWindow11AddChildGTKEPS_' filepath='include/wx/gtk/window.h' line='483' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-869' is-artificial='yes'/>
          <parameter type-id='type-id-869'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxWindowBase' visibility='default' is-declaration-only='yes' id='type-id-657'>
      <member-type access='public'>
        <enum-decl name='NavigationKind' filepath='include/wx/window.h' line='1678' column='1' id='type-id-885'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Navigation_Tab' value='0'/>
          <enumerator name='Navigation_Accel' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='protected'>
        <enum-decl name='WindowOrder' filepath='include/wx/window.h' line='1722' column='1' id='type-id-884'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='OrderBefore' value='0'/>
          <enumerator name='OrderAfter' value='1'/>
        </enum-decl>
      </member-type>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='SetNextHandler' mangled-name='_ZN12wxWindowBase14SetNextHandlerEP12wxEvtHandler' filepath='include/wx/window.h' line='902' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-102'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='SetPreviousHandler' mangled-name='_ZN12wxWindowBase18SetPreviousHandlerEP12wxEvtHandler' filepath='include/wx/window.h' line='903' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-102'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='11'>
        <function-decl name='TryBefore' mangled-name='_ZN12wxWindowBase9TryBeforeER7wxEvent' filepath='include/wx/window.h' line='1719' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-104'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='12'>
        <function-decl name='TryAfter' mangled-name='_ZN12wxWindowBase8TryAfterER7wxEvent' filepath='include/wx/window.h' line='1720' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-104'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='14'>
        <function-decl name='GetEventTable' mangled-name='_ZNK12wxWindowBase13GetEventTableEv' filepath='include/wx/window.h' line='2037' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-117'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='15'>
        <function-decl name='GetEventHashTable' mangled-name='_ZNK12wxWindowBase17GetEventHashTableEv' filepath='include/wx/window.h' line='2037' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-773'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <function-decl name='Destroy' mangled-name='_ZN12wxWindowBase7DestroyEv' filepath='include/wx/window.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='25'>
        <function-decl name='SetName' mangled-name='_ZN12wxWindowBase7SetNameERK8wxString' filepath='include/wx/window.h' line='217' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-601'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='26'>
        <function-decl name='GetName' mangled-name='_ZNK12wxWindowBase7GetNameEv' filepath='include/wx/window.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-109'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='30'>
        <function-decl name='SetId' mangled-name='_ZN12wxWindowBase5SetIdEi' filepath='include/wx/window.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-64'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='33'>
        <function-decl name='GetClientAreaOrigin' mangled-name='_ZNK12wxWindowBase19GetClientAreaOriginEv' filepath='include/wx/window.h' line='364' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-133'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='34'>
        <function-decl name='ClientToWindowSize' mangled-name='_ZNK12wxWindowBase18ClientToWindowSizeERK6wxSize' filepath='include/wx/window.h' line='373' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <parameter type-id='type-id-596'/>
          <return type-id='type-id-131'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='35'>
        <function-decl name='WindowToClientSize' mangled-name='_ZNK12wxWindowBase18WindowToClientSizeERK6wxSize' filepath='include/wx/window.h' line='374' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <parameter type-id='type-id-596'/>
          <return type-id='type-id-131'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='36'>
        <function-decl name='GetEffectiveMinSize' mangled-name='_ZNK12wxWindowBase19GetEffectiveMinSizeEv' filepath='include/wx/window.h' line='410' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-131'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='37'>
        <function-decl name='Fit' mangled-name='_ZN12wxWindowBase3FitEv' filepath='include/wx/window.h' line='438' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='38'>
        <function-decl name='FitInside' mangled-name='_ZN12wxWindowBase9FitInsideEv' filepath='include/wx/window.h' line='441' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='39'>
        <function-decl name='SetSizeHints' mangled-name='_ZN12wxWindowBase12SetSizeHintsEiiiiii' filepath='include/wx/window.h' line='450' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='40'>
        <function-decl name='SetMinSize' mangled-name='_ZN12wxWindowBase10SetMinSizeERK6wxSize' filepath='include/wx/window.h' line='473' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-596'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='41'>
        <function-decl name='SetMaxSize' mangled-name='_ZN12wxWindowBase10SetMaxSizeERK6wxSize' filepath='include/wx/window.h' line='474' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-596'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='42'>
        <function-decl name='SetMinClientSize' mangled-name='_ZN12wxWindowBase16SetMinClientSizeERK6wxSize' filepath='include/wx/window.h' line='477' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-596'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='43'>
        <function-decl name='SetMaxClientSize' mangled-name='_ZN12wxWindowBase16SetMaxClientSizeERK6wxSize' filepath='include/wx/window.h' line='479' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-596'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='44'>
        <function-decl name='GetMinSize' mangled-name='_ZNK12wxWindowBase10GetMinSizeEv' filepath='include/wx/window.h' line='485' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-131'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='45'>
        <function-decl name='GetMaxSize' mangled-name='_ZNK12wxWindowBase10GetMaxSizeEv' filepath='include/wx/window.h' line='486' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-131'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='46'>
        <function-decl name='GetMinClientSize' mangled-name='_ZNK12wxWindowBase16GetMinClientSizeEv' filepath='include/wx/window.h' line='489' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-131'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='47'>
        <function-decl name='GetMaxClientSize' mangled-name='_ZNK12wxWindowBase16GetMaxClientSizeEv' filepath='include/wx/window.h' line='491' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-131'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='48'>
        <function-decl name='DoSetVirtualSize' mangled-name='_ZN12wxWindowBase16DoSetVirtualSizeEii' filepath='include/wx/window.h' line='525' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='49'>
        <function-decl name='DoGetVirtualSize' mangled-name='_ZNK12wxWindowBase16DoGetVirtualSizeEv' filepath='include/wx/window.h' line='526' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-131'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='50'>
        <function-decl name='GetBestVirtualSize' mangled-name='_ZNK12wxWindowBase18GetBestVirtualSizeEv' filepath='include/wx/window.h' line='531' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-131'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='54'>
        <function-decl name='InformFirstDirection' mangled-name='_ZN12wxWindowBase20InformFirstDirectionEiii' filepath='include/wx/window.h' line='560' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='55'>
        <function-decl name='SendSizeEvent' mangled-name='_ZN12wxWindowBase13SendSizeEventEi' filepath='include/wx/window.h' line='568' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='56'>
        <function-decl name='BeginRepositioningChildren' mangled-name='_ZN12wxWindowBase26BeginRepositioningChildrenEv' filepath='include/wx/window.h' line='590' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='57'>
        <function-decl name='EndRepositioningChildren' mangled-name='_ZN12wxWindowBase24EndRepositioningChildrenEv' filepath='include/wx/window.h' line='591' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='59'>
        <function-decl name='ShowWithEffect' mangled-name='_ZN12wxWindowBase14ShowWithEffectE12wxShowEffectj' filepath='include/wx/window.h' line='634' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-273'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='60'>
        <function-decl name='HideWithEffect' mangled-name='_ZN12wxWindowBase14HideWithEffectE12wxShowEffectj' filepath='include/wx/window.h' line='640' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-273'/>
          <parameter type-id='type-id-15'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='61'>
        <function-decl name='Enable' mangled-name='_ZN12wxWindowBase6EnableEb' filepath='include/wx/window.h' line='647' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='63'>
        <function-decl name='IsThisEnabled' mangled-name='_ZNK12wxWindowBase13IsThisEnabledEv' filepath='include/wx/window.h' line='665' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='64'>
        <function-decl name='IsShownOnScreen' mangled-name='_ZNK12wxWindowBase15IsShownOnScreenEv' filepath='include/wx/window.h' line='669' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='65'>
        <function-decl name='SetWindowStyleFlag' mangled-name='_ZN12wxWindowBase18SetWindowStyleFlagEl' filepath='include/wx/window.h' line='673' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='66'>
        <function-decl name='GetWindowStyleFlag' mangled-name='_ZNK12wxWindowBase18GetWindowStyleFlagEv' filepath='include/wx/window.h' line='674' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-21'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='68'>
        <function-decl name='SetExtraStyle' mangled-name='_ZN12wxWindowBase13SetExtraStyleEl' filepath='include/wx/window.h' line='690' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='69'>
        <function-decl name='SetThemeEnabled' mangled-name='_ZN12wxWindowBase15SetThemeEnabledEb' filepath='include/wx/window.h' line='703' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='70'>
        <function-decl name='GetThemeEnabled' mangled-name='_ZNK12wxWindowBase15GetThemeEnabledEv' filepath='include/wx/window.h' line='704' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='72'>
        <function-decl name='SetFocusFromKbd' mangled-name='_ZN12wxWindowBase15SetFocusFromKbdEv' filepath='include/wx/window.h' line='714' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='73'>
        <function-decl name='HasFocus' mangled-name='_ZNK12wxWindowBase8HasFocusEv' filepath='include/wx/window.h' line='724' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='74'>
        <function-decl name='AcceptsFocus' mangled-name='_ZNK12wxWindowBase12AcceptsFocusEv' filepath='include/wx/window.h' line='733' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='75'>
        <function-decl name='AcceptsFocusRecursively' mangled-name='_ZNK12wxWindowBase23AcceptsFocusRecursivelyEv' filepath='include/wx/window.h' line='739' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='76'>
        <function-decl name='AcceptsFocusFromKeyboard' mangled-name='_ZNK12wxWindowBase24AcceptsFocusFromKeyboardEv' filepath='include/wx/window.h' line='744' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='77'>
        <function-decl name='CanBeFocused' mangled-name='_ZNK12wxWindowBase12CanBeFocusedEv' filepath='include/wx/window.h' line='757' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='79'>
        <function-decl name='EnableVisibleFocus' mangled-name='_ZN12wxWindowBase18EnableVisibleFocusEb' filepath='include/wx/window.h' line='778' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='80'>
        <function-decl name='IsTopLevel' mangled-name='_ZNK12wxWindowBase10IsTopLevelEv' filepath='include/wx/window.h' line='822' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='84'>
        <function-decl name='IsClientAreaChild' mangled-name='_ZNK12wxWindowBase17IsClientAreaChildEPK8wxWindow' filepath='include/wx/window.h' line='840' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <parameter type-id='type-id-656'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='85'>
        <function-decl name='SetValidator' mangled-name='_ZN12wxWindowBase12SetValidatorERK11wxValidator' filepath='include/wx/window.h' line='935' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-645'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='86'>
        <function-decl name='GetValidator' mangled-name='_ZN12wxWindowBase12GetValidatorEv' filepath='include/wx/window.h' line='936' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <return type-id='type-id-862'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='87'>
        <function-decl name='Validate' mangled-name='_ZN12wxWindowBase8ValidateEv' filepath='include/wx/window.h' line='944' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='88'>
        <function-decl name='TransferDataToWindow' mangled-name='_ZN12wxWindowBase20TransferDataToWindowEv' filepath='include/wx/window.h' line='947' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='89'>
        <function-decl name='TransferDataFromWindow' mangled-name='_ZN12wxWindowBase22TransferDataFromWindowEv' filepath='include/wx/window.h' line='948' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='90'>
        <function-decl name='InitDialog' mangled-name='_ZN12wxWindowBase10InitDialogEv' filepath='include/wx/window.h' line='950' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='91'>
        <function-decl name='SetAcceleratorTable' mangled-name='_ZN12wxWindowBase19SetAcceleratorTableERK18wxAcceleratorTable' filepath='include/wx/window.h' line='955' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-445'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='92'>
        <function-decl name='GetDPI' mangled-name='_ZNK12wxWindowBase6GetDPIEv' filepath='include/wx/window.h' line='975' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-131'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='93'>
        <function-decl name='WXAdjustFontToOwnPPI' mangled-name='_ZNK12wxWindowBase20WXAdjustFontToOwnPPIER6wxFont' filepath='include/wx/window.h' line='982' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <parameter type-id='type-id-782'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='95'>
        <function-decl name='HasCapture' mangled-name='_ZNK12wxWindowBase10HasCaptureEv' filepath='include/wx/window.h' line='1127' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='100'>
        <function-decl name='PrepareDC' mangled-name='_ZN12wxWindowBase9PrepareDCER4wxDC' filepath='include/wx/window.h' line='1167' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-763'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='109'>
        <function-decl name='HasTransparentBackground' mangled-name='_ZN12wxWindowBase24HasTransparentBackgroundEv' filepath='include/wx/window.h' line='1263' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='115'>
        <function-decl name='UpdateWindowUI' mangled-name='_ZN12wxWindowBase14UpdateWindowUIEl' filepath='include/wx/window.h' line='1361' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='117'>
        <function-decl name='HasMultiplePages' mangled-name='_ZNK12wxWindowBase16HasMultiplePagesEv' filepath='include/wx/window.h' line='1383' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='118'>
        <function-decl name='CanScroll' mangled-name='_ZNK12wxWindowBase9CanScrollEi' filepath='include/wx/window.h' line='1390' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='127'>
        <function-decl name='AlwaysShowScrollbars' mangled-name='_ZN12wxWindowBase20AlwaysShowScrollbarsEbb' filepath='include/wx/window.h' line='1424' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='128'>
        <function-decl name='IsScrollbarAlwaysShown' mangled-name='_ZNK12wxWindowBase22IsScrollbarAlwaysShownEi' filepath='include/wx/window.h' line='1431' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='129'>
        <function-decl name='GetHelpTextAtPoint' mangled-name='_ZNK12wxWindowBase18GetHelpTextAtPointERK7wxPointN11wxHelpEvent6OriginE' filepath='include/wx/window.h' line='1455' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <parameter type-id='type-id-567'/>
          <parameter type-id='type-id-881'/>
          <return type-id='type-id-109'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='131'>
        <function-decl name='GetDropTarget' mangled-name='_ZNK12wxWindowBase13GetDropTargetEv' filepath='include/wx/window.h' line='1505' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-765'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='132'>
        <function-decl name='DragAcceptFiles' mangled-name='_ZN12wxWindowBase15DragAcceptFilesEb' filepath='include/wx/window.h' line='1508' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='133'>
        <function-decl name='SetConstraintSizes' mangled-name='_ZN12wxWindowBase18SetConstraintSizesEb' filepath='include/wx/window.h' line='1535' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='134'>
        <function-decl name='LayoutPhase1' mangled-name='_ZN12wxWindowBase12LayoutPhase1EPi' filepath='include/wx/window.h' line='1536' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-678'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='135'>
        <function-decl name='LayoutPhase2' mangled-name='_ZN12wxWindowBase12LayoutPhase2EPi' filepath='include/wx/window.h' line='1537' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-678'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='136'>
        <function-decl name='DoPhase' mangled-name='_ZN12wxWindowBase7DoPhaseEi' filepath='include/wx/window.h' line='1538' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='137'>
        <function-decl name='SetSizeConstraint' mangled-name='_ZN12wxWindowBase17SetSizeConstraintEiiii' filepath='include/wx/window.h' line='1541' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='138'>
        <function-decl name='MoveConstraint' mangled-name='_ZN12wxWindowBase14MoveConstraintEii' filepath='include/wx/window.h' line='1542' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='139'>
        <function-decl name='GetSizeConstraint' mangled-name='_ZNK12wxWindowBase17GetSizeConstraintEPiS0_' filepath='include/wx/window.h' line='1543' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <parameter type-id='type-id-678'/>
          <parameter type-id='type-id-678'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='140'>
        <function-decl name='GetClientSizeConstraint' mangled-name='_ZNK12wxWindowBase23GetClientSizeConstraintEPiS0_' filepath='include/wx/window.h' line='1544' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <parameter type-id='type-id-678'/>
          <parameter type-id='type-id-678'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='141'>
        <function-decl name='GetPositionConstraint' mangled-name='_ZNK12wxWindowBase21GetPositionConstraintEPiS0_' filepath='include/wx/window.h' line='1545' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <parameter type-id='type-id-678'/>
          <parameter type-id='type-id-678'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='142'>
        <function-decl name='Layout' mangled-name='_ZN12wxWindowBase6LayoutEv' filepath='include/wx/window.h' line='1556' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='143'>
        <function-decl name='SetTransparent' mangled-name='_ZN12wxWindowBase14SetTransparentEh' filepath='include/wx/window.h' line='1587' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-242'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='144'>
        <function-decl name='CanSetTransparent' mangled-name='_ZN12wxWindowBase17CanSetTransparentEv' filepath='include/wx/window.h' line='1588' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='146'>
        <function-decl name='SendIdleEvents' mangled-name='_ZN12wxWindowBase14SendIdleEventsER11wxIdleEvent' filepath='include/wx/window.h' line='1608' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-793'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='147'>
        <function-decl name='WXSetInitialFittingClientSize' mangled-name='_ZN12wxWindowBase29WXSetInitialFittingClientSizeEiP7wxSizer' filepath='include/wx/window.h' line='1625' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-832'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='149'>
        <function-decl name='AssociateHandle' mangled-name='_ZN12wxWindowBase15AssociateHandleEP10_GtkWidget' filepath='include/wx/window.h' line='1632' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-73'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='150'>
        <function-decl name='DissociateHandle' mangled-name='_ZN12wxWindowBase16DissociateHandleEv' filepath='include/wx/window.h' line='1634' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='151'>
        <function-decl name='InheritAttributes' mangled-name='_ZN12wxWindowBase17InheritAttributesEv' filepath='include/wx/window.h' line='1655' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='153'>
        <function-decl name='CanBeOutsideClientArea' mangled-name='_ZNK12wxWindowBase22CanBeOutsideClientAreaEv' filepath='include/wx/window.h' line='1666' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='154'>
        <function-decl name='CanApplyThemeBorder' mangled-name='_ZNK12wxWindowBase19CanApplyThemeBorderEv' filepath='include/wx/window.h' line='1670' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='155'>
        <function-decl name='GetMainWindowOfCompositeControl' mangled-name='_ZN12wxWindowBase31GetMainWindowOfCompositeControlEv' filepath='include/wx/window.h' line='1675' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <return type-id='type-id-869'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='156'>
        <function-decl name='IsTopNavigationDomain' mangled-name='_ZNK12wxWindowBase21IsTopNavigationDomainENS_14NavigationKindE' filepath='include/wx/window.h' line='1691' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <parameter type-id='type-id-885'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='157'>
        <function-decl name='WXGetTextEntry' mangled-name='_ZNK12wxWindowBase14WXGetTextEntryEv' filepath='include/wx/window.h' line='1697' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-623'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='162'>
        <function-decl name='GetDefaultBorderForControl' mangled-name='_ZNK12wxWindowBase26GetDefaultBorderForControlEv' filepath='include/wx/window.h' line='1871' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='166'>
        <function-decl name='DoHitTest' mangled-name='_ZNK12wxWindowBase9DoHitTestEii' filepath='include/wx/window.h' line='1915' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <parameter type-id='type-id-240'/>
          <parameter type-id='type-id-240'/>
          <return type-id='type-id-65'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='170'>
        <function-decl name='DoGetScreenPosition' mangled-name='_ZNK12wxWindowBase19DoGetScreenPositionEPiS0_' filepath='include/wx/window.h' line='1923' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <parameter type-id='type-id-678'/>
          <parameter type-id='type-id-678'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='174'>
        <function-decl name='DoGetBestClientSize' mangled-name='_ZNK12wxWindowBase19DoGetBestClientSizeEv' filepath='include/wx/window.h' line='1935' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <return type-id='type-id-131'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='175'>
        <function-decl name='DoGetBestClientHeight' mangled-name='_ZNK12wxWindowBase21DoGetBestClientHeightEi' filepath='include/wx/window.h' line='1940' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='176'>
        <function-decl name='DoGetBestClientWidth' mangled-name='_ZNK12wxWindowBase20DoGetBestClientWidthEi' filepath='include/wx/window.h' line='1942' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='179'>
        <function-decl name='DoSetSizeHints' mangled-name='_ZN12wxWindowBase14DoSetSizeHintsEiiiiii' filepath='include/wx/window.h' line='1955' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='181'>
        <function-decl name='DoCentre' mangled-name='_ZN12wxWindowBase8DoCentreEi' filepath='include/wx/window.h' line='1972' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='182'>
        <function-decl name='DoSetToolTipText' mangled-name='_ZN12wxWindowBase16DoSetToolTipTextERK8wxString' filepath='include/wx/window.h' line='1975' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-601'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='185'>
        <function-decl name='AdjustForParentClientOrigin' mangled-name='_ZNK12wxWindowBase27AdjustForParentClientOriginERiS0_i' filepath='include/wx/window.h' line='1986' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-659' is-artificial='yes'/>
          <parameter type-id='type-id-677'/>
          <parameter type-id='type-id-677'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='186'>
        <function-decl name='DoSetWindowVariant' mangled-name='_ZN12wxWindowBase18DoSetWindowVariantE15wxWindowVariant' filepath='include/wx/window.h' line='1990' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-272'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='189'>
        <function-decl name='WXReservedWindow1' mangled-name='_ZN12wxWindowBase17WXReservedWindow1EPv' filepath='include/wx/window.h' line='2004' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-16'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='190'>
        <function-decl name='WXReservedWindow2' mangled-name='_ZN12wxWindowBase17WXReservedWindow2EPv' filepath='include/wx/window.h' line='2005' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-16'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='191'>
        <function-decl name='WXReservedWindow3' mangled-name='_ZN12wxWindowBase17WXReservedWindow3EPv' filepath='include/wx/window.h' line='2006' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-870' is-artificial='yes'/>
          <parameter type-id='type-id-16'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <namespace-decl name='wxPrivate'>
      <class-decl name='UntypedBufferData' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='30' column='1' id='type-id-36'>
        <member-type access='public'>
          <enum-decl name='Kind' filepath='include/wx/buffer.h' line='32' column='1' id='type-id-886'>
            <underlying-type type-id='type-id-26'/>
            <enumerator name='Owned' value='0'/>
            <enumerator name='NonOwned' value='1'/>
          </enum-decl>
        </member-type>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='m_str' type-id='type-id-16' visibility='default' filepath='include/wx/buffer.h' line='47' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='m_length' type-id='type-id-125' visibility='default' filepath='include/wx/buffer.h' line='48' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='m_ref' type-id='type-id-28' visibility='default' filepath='include/wx/buffer.h' line='51' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='144'>
          <var-decl name='m_owned' type-id='type-id-3' visibility='default' filepath='include/wx/buffer.h' line='53' column='1'/>
        </data-member>
      </class-decl>
    </namespace-decl>
    <class-decl name='wxMediaEvent' visibility='default' filepath='include/wx/mediactrl.h' line='84' column='1' is-declaration-only='yes' id='type-id-548'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-555'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-164' mangled-name='_ZN12wxMediaEvent12ms_classInfoE' visibility='default' filepath='src/common/mediactrlcmn.cpp' line='48' column='1' elf-symbol-id='_ZN12wxMediaEvent12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <member-function access='public' static='yes'>
        <function-decl name='wxCreateObject' mangled-name='_ZN12wxMediaEvent14wxCreateObjectEv' filepath='src/common/mediactrlcmn.cpp' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxMediaEvent14wxCreateObjectEv@@WXU_3.2'>
          <return type-id='type-id-112'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK12wxMediaEvent12GetClassInfoEv' filepath='src/common/mediactrlcmn.cpp' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxMediaEvent12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-551' is-artificial='yes'/>
          <return type-id='type-id-173'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='Clone' mangled-name='_ZNK12wxMediaEvent5CloneEv' filepath='include/wx/mediactrl.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-551' is-artificial='yes'/>
          <return type-id='type-id-768'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxMediaCtrl' visibility='default' filepath='include/wx/mediactrl.h' line='125' column='1' is-declaration-only='yes' id='type-id-545'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-481'/>
      <data-member access='protected' layout-offset-in-bits='5696'>
        <var-decl name='m_imp' type-id='type-id-797' visibility='default' filepath='include/wx/mediactrl.h' line='223' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='5760'>
        <var-decl name='m_bLoaded' type-id='type-id-3' visibility='default' filepath='include/wx/mediactrl.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-164' mangled-name='_ZN11wxMediaCtrl12ms_classInfoE' visibility='default' filepath='src/common/mediactrlcmn.cpp' line='43' column='1' elf-symbol-id='_ZN11wxMediaCtrl12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='GetDownloadTotal' mangled-name='_ZN11wxMediaCtrl16GetDownloadTotalEv' filepath='src/common/mediactrlcmn.cpp' line='438' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxMediaCtrl16GetDownloadTotalEv@@WXU_3.2'>
          <parameter type-id='type-id-799' name='this' is-artificial='yes'/>
          <return type-id='type-id-130'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='GetDownloadProgress' mangled-name='_ZN11wxMediaCtrl19GetDownloadProgressEv' filepath='src/common/mediactrlcmn.cpp' line='431' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxMediaCtrl19GetDownloadProgressEv@@WXU_3.2'>
          <parameter type-id='type-id-799' name='this' is-artificial='yes'/>
          <return type-id='type-id-130'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='ShowPlayerControls' mangled-name='_ZN11wxMediaCtrl18ShowPlayerControlsE25wxMediaCtrlPlayerControls' filepath='src/common/mediactrlcmn.cpp' line='424' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxMediaCtrl18ShowPlayerControlsE25wxMediaCtrlPlayerControls@@WXU_3.2'>
          <parameter type-id='type-id-799' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-154' name='flags' filepath='src/common/mediactrlcmn.cpp' line='424' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetVolume' mangled-name='_ZN11wxMediaCtrl9SetVolumeEd' filepath='src/common/mediactrlcmn.cpp' line='417' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxMediaCtrl9SetVolumeEd@@WXU_3.2'>
          <parameter type-id='type-id-799' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-17' name='dVolume' filepath='src/common/mediactrlcmn.cpp' line='417' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='GetVolume' mangled-name='_ZN11wxMediaCtrl9GetVolumeEv' filepath='src/common/mediactrlcmn.cpp' line='410' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxMediaCtrl9GetVolumeEv@@WXU_3.2'>
          <parameter type-id='type-id-799' name='this' is-artificial='yes'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='GetState' mangled-name='_ZN11wxMediaCtrl8GetStateEv' filepath='src/common/mediactrlcmn.cpp' line='396' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxMediaCtrl8GetStateEv@@WXU_3.2'>
          <parameter type-id='type-id-799' name='this' is-artificial='yes'/>
          <return type-id='type-id-153'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Length' mangled-name='_ZN11wxMediaCtrl6LengthEv' filepath='src/common/mediactrlcmn.cpp' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxMediaCtrl6LengthEv@@WXU_3.2'>
          <parameter type-id='type-id-799' name='this' is-artificial='yes'/>
          <return type-id='type-id-130'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Tell' mangled-name='_ZN11wxMediaCtrl4TellEv' filepath='src/common/mediactrlcmn.cpp' line='382' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxMediaCtrl4TellEv@@WXU_3.2'>
          <parameter type-id='type-id-799' name='this' is-artificial='yes'/>
          <return type-id='type-id-130'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Seek' mangled-name='_ZN11wxMediaCtrl4SeekEl10wxSeekMode' filepath='src/common/mediactrlcmn.cpp' line='359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxMediaCtrl4SeekEl10wxSeekMode@@WXU_3.2'>
          <parameter type-id='type-id-799' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-130' name='where' filepath='src/common/mediactrlcmn.cpp' line='359' column='1'/>
          <parameter type-id='type-id-128' name='mode' filepath='src/common/mediactrlcmn.cpp' line='359' column='1'/>
          <return type-id='type-id-130'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetPlaybackRate' mangled-name='_ZN11wxMediaCtrl15SetPlaybackRateEd' filepath='src/common/mediactrlcmn.cpp' line='352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxMediaCtrl15SetPlaybackRateEd@@WXU_3.2'>
          <parameter type-id='type-id-799' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-17' name='dVolume' filepath='src/common/mediactrlcmn.cpp' line='417' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='GetPlaybackRate' mangled-name='_ZN11wxMediaCtrl15GetPlaybackRateEv' filepath='src/common/mediactrlcmn.cpp' line='345' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxMediaCtrl15GetPlaybackRateEv@@WXU_3.2'>
          <parameter type-id='type-id-799' name='this' is-artificial='yes'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Stop' mangled-name='_ZN11wxMediaCtrl4StopEv' filepath='src/common/mediactrlcmn.cpp' line='338' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxMediaCtrl4StopEv@@WXU_3.2'>
          <parameter type-id='type-id-799' name='this' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Pause' mangled-name='_ZN11wxMediaCtrl5PauseEv' filepath='src/common/mediactrlcmn.cpp' line='331' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxMediaCtrl5PauseEv@@WXU_3.2'>
          <parameter type-id='type-id-799' name='this' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Play' mangled-name='_ZN11wxMediaCtrl4PlayEv' filepath='src/common/mediactrlcmn.cpp' line='324' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxMediaCtrl4PlayEv@@WXU_3.2'>
          <parameter type-id='type-id-799' name='this' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Load' mangled-name='_ZN11wxMediaCtrl4LoadERK5wxURIS2_' filepath='src/common/mediactrlcmn.cpp' line='296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxMediaCtrl4LoadERK5wxURIS2_@@WXU_3.2'>
          <parameter type-id='type-id-799' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-637' name='location' filepath='src/common/mediactrlcmn.cpp' line='296' column='1'/>
          <parameter type-id='type-id-637' name='proxy' filepath='src/common/mediactrlcmn.cpp' line='296' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Load' mangled-name='_ZN11wxMediaCtrl4LoadERK5wxURI' filepath='src/common/mediactrlcmn.cpp' line='289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxMediaCtrl4LoadERK5wxURI@@WXU_3.2'>
          <parameter type-id='type-id-799' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-637' name='location' filepath='src/common/mediactrlcmn.cpp' line='289' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Load' mangled-name='_ZN11wxMediaCtrl4LoadERK8wxString' filepath='src/common/mediactrlcmn.cpp' line='282' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxMediaCtrl4LoadERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-799' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-601' name='fileName' filepath='src/common/mediactrlcmn.cpp' line='282' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' static='yes'>
        <function-decl name='NextBackend' mangled-name='_ZN11wxMediaCtrl11NextBackendEPN11wxClassInfo14const_iteratorE' filepath='src/common/mediactrlcmn.cpp' line='241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxMediaCtrl11NextBackendEPN11wxClassInfo14const_iteratorE@@WXU_3.2'>
          <parameter type-id='type-id-751'/>
          <return type-id='type-id-169'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='DoCreate' mangled-name='_ZN11wxMediaCtrl8DoCreateEPK11wxClassInfoP8wxWindowiRK7wxPointRK6wxSizelRK11wxValidatorRK8wxString' filepath='src/common/mediactrlcmn.cpp' line='207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxMediaCtrl8DoCreateEPK11wxClassInfoP8wxWindowiRK7wxPointRK6wxSizelRK11wxValidatorRK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-799' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-169' name='classInfo' filepath='src/common/mediactrlcmn.cpp' line='207' column='1'/>
          <parameter type-id='type-id-869' name='parent' filepath='src/common/mediactrlcmn.cpp' line='208' column='1'/>
          <parameter type-id='type-id-64' name='id' filepath='src/common/mediactrlcmn.cpp' line='208' column='1'/>
          <parameter type-id='type-id-567' name='pos' filepath='src/common/mediactrlcmn.cpp' line='209' column='1'/>
          <parameter type-id='type-id-596' name='size' filepath='src/common/mediactrlcmn.cpp' line='210' column='1'/>
          <parameter type-id='type-id-21' name='style' filepath='src/common/mediactrlcmn.cpp' line='211' column='1'/>
          <parameter type-id='type-id-645' name='validator' filepath='src/common/mediactrlcmn.cpp' line='212' column='1'/>
          <parameter type-id='type-id-601' name='name' filepath='src/common/mediactrlcmn.cpp' line='213' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Create' mangled-name='_ZN11wxMediaCtrl6CreateEP8wxWindowiRK5wxURIRK7wxPointRK6wxSizelRK8wxStringRK11wxValidatorSD_' filepath='src/common/mediactrlcmn.cpp' line='148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxMediaCtrl6CreateEP8wxWindowiRK5wxURIRK7wxPointRK6wxSizelRK8wxStringRK11wxValidatorSD_@@WXU_3.2'>
          <parameter type-id='type-id-799' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-869' name='parent' filepath='src/common/mediactrlcmn.cpp' line='148' column='1'/>
          <parameter type-id='type-id-64' name='id' filepath='src/common/mediactrlcmn.cpp' line='148' column='1'/>
          <parameter type-id='type-id-637' name='location' filepath='src/common/mediactrlcmn.cpp' line='149' column='1'/>
          <parameter type-id='type-id-567' name='pos' filepath='src/common/mediactrlcmn.cpp' line='150' column='1'/>
          <parameter type-id='type-id-596' name='size' filepath='src/common/mediactrlcmn.cpp' line='151' column='1'/>
          <parameter type-id='type-id-21' name='style' filepath='src/common/mediactrlcmn.cpp' line='152' column='1'/>
          <parameter type-id='type-id-601' name='szBackend' filepath='src/common/mediactrlcmn.cpp' line='153' column='1'/>
          <parameter type-id='type-id-645' name='validator' filepath='src/common/mediactrlcmn.cpp' line='154' column='1'/>
          <parameter type-id='type-id-601' name='name' filepath='src/common/mediactrlcmn.cpp' line='155' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Create' mangled-name='_ZN11wxMediaCtrl6CreateEP8wxWindowiRK8wxStringRK7wxPointRK6wxSizelS4_RK11wxValidatorS4_' filepath='src/common/mediactrlcmn.cpp' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxMediaCtrl6CreateEP8wxWindowiRK8wxStringRK7wxPointRK6wxSizelS4_RK11wxValidatorS4_@@WXU_3.2'>
          <parameter type-id='type-id-799' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-869' name='parent' filepath='src/common/mediactrlcmn.cpp' line='82' column='1'/>
          <parameter type-id='type-id-64' name='id' filepath='src/common/mediactrlcmn.cpp' line='82' column='1'/>
          <parameter type-id='type-id-601' name='fileName' filepath='src/common/mediactrlcmn.cpp' line='83' column='1'/>
          <parameter type-id='type-id-567' name='pos' filepath='src/common/mediactrlcmn.cpp' line='84' column='1'/>
          <parameter type-id='type-id-596' name='size' filepath='src/common/mediactrlcmn.cpp' line='85' column='1'/>
          <parameter type-id='type-id-21' name='style' filepath='src/common/mediactrlcmn.cpp' line='86' column='1'/>
          <parameter type-id='type-id-601' name='szBackend' filepath='src/common/mediactrlcmn.cpp' line='87' column='1'/>
          <parameter type-id='type-id-645' name='validator' filepath='src/common/mediactrlcmn.cpp' line='88' column='1'/>
          <parameter type-id='type-id-601' name='name' filepath='src/common/mediactrlcmn.cpp' line='89' column='1'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMediaCtrl' mangled-name='_ZN11wxMediaCtrlD4Ev' filepath='src/common/mediactrlcmn.cpp' line='267' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-157' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMediaCtrl' mangled-name='_ZN11wxMediaCtrlD0Ev' filepath='src/common/mediactrlcmn.cpp' line='267' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxMediaCtrlD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-157' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMediaCtrl' mangled-name='_ZN11wxMediaCtrlD2Ev' filepath='src/common/mediactrlcmn.cpp' line='267' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxMediaCtrlD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-157' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK11wxMediaCtrl12GetClassInfoEv' filepath='src/common/mediactrlcmn.cpp' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK11wxMediaCtrl12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-547' is-artificial='yes'/>
          <return type-id='type-id-173'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='173'>
        <function-decl name='DoGetBestSize' mangled-name='_ZNK11wxMediaCtrl13DoGetBestSizeEv' filepath='src/common/mediactrlcmn.cpp' line='403' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK11wxMediaCtrl13DoGetBestSizeEv@@WXU_3.2'>
          <parameter type-id='type-id-547' is-artificial='yes'/>
          <return type-id='type-id-131'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='180'>
        <function-decl name='DoMoveWindow' mangled-name='_ZN11wxMediaCtrl12DoMoveWindowEiiii' filepath='src/common/mediactrlcmn.cpp' line='453' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxMediaCtrl12DoMoveWindowEiiii@@WXU_3.2'>
          <parameter type-id='type-id-157' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxMediaBackend' visibility='default' filepath='include/wx/mediactrl.h' line='243' column='1' is-declaration-only='yes' id='type-id-156'>
