<abi-corpus version='2.0' architecture='elf-amd-x86_64' soname='libwx_gtk3u_webview-3.2.so.0'>
  <elf-needed>
    <dependency name='libgtk-3.so.0'/>
    <dependency name='libgio-2.0.so.0'/>
    <dependency name='libgobject-2.0.so.0'/>
    <dependency name='libglib-2.0.so.0'/>
    <dependency name='libwx_gtk3u_core-3.2.so.0'/>
    <dependency name='libwx_baseu-3.2.so.0'/>
    <dependency name='libwebkit2gtk-4.0.so.37'/>
    <dependency name='libjavascriptcoregtk-4.0.so.18'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_ZN14wxWebViewEvent14wxCreateObjectEv' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN15wxWebViewWebKit11SetEditableEb' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN15wxWebViewWebKit11SetZoomTypeE17wxWebViewZoomType' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN15wxWebViewWebKit12ClearHistoryEv' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_ZTS23wxWebViewArchiveHandler' size='26' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS9wxWebView' size='11' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV14wxWebViewEvent' size='72' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV15wxWebViewWebKit' size='2200' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV16wxWebViewFactory' size='88' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV16wxWebViewHandler' size='64' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV18wxWebViewFSHandler' size='64' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV22wxWebViewFactoryWebKit' size='88' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV23wxWebViewArchiveHandler' size='64' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV9wxWebView' size='2192' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_WEBVIEW_ERROR' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_WEBVIEW_FULLSCREEN_CHANGED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_WEBVIEW_LOADED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_WEBVIEW_NAVIGATED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_WEBVIEW_NAVIGATING' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_WEBVIEW_NEWWINDOW' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_WEBVIEW_SCRIPT_MESSAGE_RECEIVED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_WEBVIEW_SCRIPT_RESULT' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_WEBVIEW_TITLE_CHANGED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxWebViewBackendDefault' size='16' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxWebViewBackendEdge' size='14' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxWebViewBackendIE' size='12' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxWebViewBackendWebKit' size='16' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxWebViewDefaultURLStr' size='12' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxWebViewNameStr' size='10' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/common/webview.cpp' language='LANG_C_plus_plus_14'>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='80' id='type-id-2'>
      <subrange length='10' type-id='type-id-3' id='type-id-4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='96' id='type-id-5'>
      <subrange length='12' type-id='type-id-3' id='type-id-6'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='112' id='type-id-7'>
      <subrange length='14' type-id='type-id-3' id='type-id-8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='128' id='type-id-9'>
      <subrange length='16' type-id='type-id-3' id='type-id-10'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='infinite' id='type-id-11'>
      <subrange length='infinite' id='type-id-12'/>
    </array-type-def>
    <class-decl name='_wxHashTable_NodeBase' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='68' column='1' id='type-id-13'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_next' type-id='type-id-14' visibility='default' filepath='include/wx/hashmap.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_wxHashTableBase2' size-in-bits='8' visibility='default' filepath='include/wx/hashmap.h' line='80' column='1' id='type-id-15'>
      <member-type access='public'>
        <typedef-decl name='NodeDtor' type-id='type-id-17' filepath='include/wx/hashmap.h' line='83' column='1' id='type-id-16'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='BucketFromNode' type-id='type-id-19' filepath='include/wx/hashmap.h' line='84' column='1' id='type-id-18'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='ProcessNode' type-id='type-id-21' filepath='include/wx/hashmap.h' line='85' column='1' id='type-id-20'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringHash' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='566' column='1' id='type-id-22'/>
    <class-decl name='wxStringEqual' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='589' column='1' id='type-id-23'/>
    <class-decl name='wxStringToStringHashMap' size-in-bits='256' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-24'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-25'/>
      <member-type access='public'>
        <class-decl name='Insert_Result' size-in-bits='192' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-26'>
          <member-type access='public'>
            <typedef-decl name='const_t1' type-id='type-id-28' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-27'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_t2' type-id='type-id-30' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-29'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t1' type-id='type-id-32' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-31'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t2' type-id='type-id-34' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-33'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='first' type-id='type-id-31' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='second' type-id='type-id-33' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='mapped_type' type-id='type-id-36' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-35'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringToStringHashMap_wxImplementation_HashTable' size-in-bits='256' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-25'>
      <base-class access='protected' layout-offset-in-bits='0' type-id='type-id-15'/>
      <member-type access='public'>
        <class-decl name='Iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-37'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-38' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_ht' type-id='type-id-39' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='Node' size-in-bits='832' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-40'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-13'/>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_value' type-id='type-id-41' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-42'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-37'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-32'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-37'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='Self' type-id='type-id-25' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-43'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_key_type' type-id='type-id-45' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-44'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_pointer' type-id='type-id-47' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-46'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-49' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-48'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='hasher' type-id='type-id-22' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-50'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_equal' type-id='type-id-23' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-51'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_extractor' type-id='type-id-53' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-52'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_type' type-id='type-id-36' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-54'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='pointer' type-id='type-id-56' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-55'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-58' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-57'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-60' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-59'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-61' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-41'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_table' type-id='type-id-62' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_tableBuckets' type-id='type-id-60' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_items' type-id='type-id-60' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_hasher' type-id='type-id-50' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='200'>
        <var-decl name='m_equals' type-id='type-id-51' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='208'>
        <var-decl name='m_getKey' type-id='type-id-52' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxStringToStringHashMap_wxImplementation_KeyEx' size-in-bits='8' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-53'>
      <member-type access='private'>
        <typedef-decl name='const_key_reference' type-id='type-id-64' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-63'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_key_type' type-id='type-id-66' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-65'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_reference' type-id='type-id-68' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-67'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_type' type-id='type-id-70' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-69'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='key_type' type-id='type-id-36' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-71'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='pair_type' type-id='type-id-61' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-72'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringToStringHashMap_wxImplementation_Pair' size-in-bits='768' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-61'>
      <member-type access='public'>
        <typedef-decl name='const_t1' type-id='type-id-45' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-73'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_t2' type-id='type-id-45' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-74'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t1' type-id='type-id-36' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-75'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t2' type-id='type-id-36' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-76'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='first' type-id='type-id-75' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='second' type-id='type-id-76' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxStringToNumHashMap' size-in-bits='256' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-77'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-78'/>
      <member-type access='public'>
        <class-decl name='Insert_Result' size-in-bits='192' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-79'>
          <member-type access='public'>
            <typedef-decl name='const_t1' type-id='type-id-81' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-80'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_t2' type-id='type-id-30' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-82'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t1' type-id='type-id-84' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-83'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t2' type-id='type-id-34' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-85'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='first' type-id='type-id-83' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='second' type-id='type-id-85' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='mapped_type' type-id='type-id-87' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-86'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringToNumHashMap_wxImplementation_HashTable' size-in-bits='256' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-78'>
      <base-class access='protected' layout-offset-in-bits='0' type-id='type-id-15'/>
      <member-type access='public'>
        <class-decl name='Iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-88'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-89' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_ht' type-id='type-id-90' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='Node' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-91'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-13'/>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_value' type-id='type-id-92' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-93'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-88'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-84'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-88'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='Self' type-id='type-id-78' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-94'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_key_type' type-id='type-id-45' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-95'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_pointer' type-id='type-id-97' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-96'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-99' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-98'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='hasher' type-id='type-id-22' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-100'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_equal' type-id='type-id-23' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-101'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_extractor' type-id='type-id-103' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-102'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_type' type-id='type-id-36' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-104'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='pointer' type-id='type-id-106' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-105'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-108' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-107'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-60' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-109'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-110' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-92'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_table' type-id='type-id-62' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_tableBuckets' type-id='type-id-60' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_items' type-id='type-id-60' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_hasher' type-id='type-id-100' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='200'>
        <var-decl name='m_equals' type-id='type-id-101' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='208'>
        <var-decl name='m_getKey' type-id='type-id-102' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxStringToNumHashMap_wxImplementation_KeyEx' size-in-bits='8' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-103'>
      <member-type access='private'>
        <typedef-decl name='const_key_reference' type-id='type-id-112' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-111'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_key_type' type-id='type-id-114' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-113'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_reference' type-id='type-id-116' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-115'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_type' type-id='type-id-118' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-117'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='key_type' type-id='type-id-36' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-119'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='pair_type' type-id='type-id-110' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-120'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringToNumHashMap_wxImplementation_Pair' size-in-bits='448' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-110'>
      <member-type access='public'>
        <typedef-decl name='const_t1' type-id='type-id-45' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-121'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_t2' type-id='type-id-123' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-122'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t1' type-id='type-id-36' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-124'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t2' type-id='type-id-87' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-125'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='first' type-id='type-id-124' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='second' type-id='type-id-125' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxLogLevel' type-id='type-id-3' filepath='include/wx/log.h' line='22' column='1' id='type-id-126'/>
    <class-decl name='wxLogRecordInfo' size-in-bits='512' visibility='default' filepath='include/wx/log.h' line='141' column='1' id='type-id-127'>
      <member-type access='private'>
        <class-decl name='ExtraData' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/wx/log.h' line='289' column='1' id='type-id-128'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='numValues' type-id='type-id-77' visibility='default' filepath='include/wx/log.h' line='291' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='strValues' type-id='type-id-24' visibility='default' filepath='include/wx/log.h' line='292' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='filename' type-id='type-id-129' visibility='default' filepath='include/wx/log.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='line' type-id='type-id-130' visibility='default' filepath='include/wx/log.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='func' type-id='type-id-129' visibility='default' filepath='include/wx/log.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='component' type-id='type-id-129' visibility='default' filepath='include/wx/log.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='timestampMS' type-id='type-id-131' visibility='default' filepath='include/wx/log.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='timestamp' type-id='type-id-132' visibility='default' filepath='include/wx/log.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='threadId' type-id='type-id-133' visibility='default' filepath='include/wx/log.h' line='224' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='m_data' type-id='type-id-134' visibility='default' filepath='include/wx/log.h' line='296' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxLogger' size-in-bits='960' visibility='default' filepath='include/wx/log.h' line='897' column='1' id='type-id-135'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_level' type-id='type-id-136' visibility='default' filepath='include/wx/log.h' line='1198' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_info' type-id='type-id-127' visibility='default' filepath='include/wx/log.h' line='1199' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='m_optKey' type-id='type-id-36' visibility='default' filepath='include/wx/log.h' line='1201' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSharedPtr&lt;wxWebViewFactory&gt;' size-in-bits='64' visibility='default' filepath='include/wx/sharedptr.h' line='21' column='1' id='type-id-137'>
      <member-type access='private'>
        <class-decl name='reftype' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/sharedptr.h' line='115' column='1' id='type-id-138'>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_ptr' type-id='type-id-139' visibility='default' filepath='include/wx/sharedptr.h' line='121' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='m_count' type-id='type-id-140' visibility='default' filepath='include/wx/sharedptr.h' line='122' column='1'/>
          </data-member>
          <member-function access='public' destructor='yes' vtable-offset='-1'>
            <function-decl name='~reftype' mangled-name='_ZN11wxSharedPtrI16wxWebViewFactoryE7reftypeD0Ev' filepath='include/wx/sharedptr.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-141' is-artificial='yes'/>
              <parameter type-id='type-id-130' is-artificial='yes'/>
              <return type-id='type-id-142'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes' vtable-offset='-1'>
            <function-decl name='~reftype' mangled-name='_ZN11wxSharedPtrI16wxWebViewFactoryE7reftypeD2Ev' filepath='include/wx/sharedptr.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-141' is-artificial='yes'/>
              <parameter type-id='type-id-130' is-artificial='yes'/>
              <return type-id='type-id-142'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes' vtable-offset='-1'>
            <function-decl name='~reftype' mangled-name='_ZN11wxSharedPtrI16wxWebViewFactoryE7reftypeD4Ev' filepath='include/wx/sharedptr.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-141' is-artificial='yes'/>
              <parameter type-id='type-id-130' is-artificial='yes'/>
              <return type-id='type-id-142'/>
            </function-decl>
          </member-function>
          <member-function access='public' vtable-offset='2'>
            <function-decl name='delete_ptr' mangled-name='_ZN11wxSharedPtrI16wxWebViewFactoryE7reftype10delete_ptrEv' filepath='include/wx/sharedptr.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-141' is-artificial='yes'/>
              <return type-id='type-id-142'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_ref' type-id='type-id-141' visibility='default' filepath='include/wx/sharedptr.h' line='134' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArgNormalizerWithBuffer&lt;wchar_t&gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='533' column='1' id='type-id-143'>
      <member-type access='public'>
        <typedef-decl name='CharBuffer' type-id='type-id-145' filepath='include/wx/strvararg.h' line='535' column='1' id='type-id-144'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_value' type-id='type-id-144' visibility='default' filepath='include/wx/strvararg.h' line='548' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArgNormalizerWchar&lt;char const*&gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='611' column='1' id='type-id-146'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-143'/>
    </class-decl>
    <typedef-decl name='wxThreadIdType' type-id='type-id-3' filepath='include/wx/thread.h' line='448' column='1' id='type-id-133'/>
    <typedef-decl name='wxUIntPtr' type-id='type-id-3' filepath='include/wx/types.h' line='365' column='1' id='type-id-87'/>
    <class-decl name='wxStringWebViewFactoryMap' size-in-bits='256' visibility='default' filepath='include/wx/webview.h' line='133' column='1' id='type-id-147'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-148'/>
      <member-type access='public'>
        <class-decl name='Insert_Result' size-in-bits='192' visibility='default' filepath='include/wx/webview.h' line='133' column='1' id='type-id-149'>
          <member-type access='public'>
            <typedef-decl name='const_t1' type-id='type-id-151' filepath='include/wx/webview.h' line='133' column='1' id='type-id-150'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_t2' type-id='type-id-30' filepath='include/wx/webview.h' line='133' column='1' id='type-id-152'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t1' type-id='type-id-154' filepath='include/wx/webview.h' line='133' column='1' id='type-id-153'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t2' type-id='type-id-34' filepath='include/wx/webview.h' line='133' column='1' id='type-id-155'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='first' type-id='type-id-153' visibility='default' filepath='include/wx/webview.h' line='133' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='second' type-id='type-id-155' visibility='default' filepath='include/wx/webview.h' line='133' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='mapped_type' type-id='type-id-137' filepath='include/wx/webview.h' line='133' column='1' id='type-id-156'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringWebViewFactoryMap_wxImplementation_HashTable' size-in-bits='256' visibility='default' filepath='include/wx/webview.h' line='133' column='1' id='type-id-148'>
      <base-class access='protected' layout-offset-in-bits='0' type-id='type-id-15'/>
      <member-type access='public'>
        <class-decl name='Iterator' size-in-bits='128' visibility='default' filepath='include/wx/webview.h' line='133' column='1' id='type-id-157'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-158' visibility='default' filepath='include/wx/webview.h' line='133' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_ht' type-id='type-id-159' visibility='default' filepath='include/wx/webview.h' line='133' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='Node' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/wx/webview.h' line='133' column='1' id='type-id-160'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-13'/>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_value' type-id='type-id-161' visibility='default' filepath='include/wx/webview.h' line='133' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/webview.h' line='133' column='1' id='type-id-162'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-157'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='128' visibility='default' filepath='include/wx/webview.h' line='133' column='1' id='type-id-154'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-157'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='Self' type-id='type-id-148' filepath='include/wx/webview.h' line='133' column='1' id='type-id-163'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_key_type' type-id='type-id-45' filepath='include/wx/webview.h' line='133' column='1' id='type-id-164'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_pointer' type-id='type-id-166' filepath='include/wx/webview.h' line='133' column='1' id='type-id-165'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-168' filepath='include/wx/webview.h' line='133' column='1' id='type-id-167'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='hasher' type-id='type-id-22' filepath='include/wx/webview.h' line='133' column='1' id='type-id-169'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_equal' type-id='type-id-23' filepath='include/wx/webview.h' line='133' column='1' id='type-id-170'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_extractor' type-id='type-id-172' filepath='include/wx/webview.h' line='133' column='1' id='type-id-171'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_type' type-id='type-id-36' filepath='include/wx/webview.h' line='133' column='1' id='type-id-173'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='pointer' type-id='type-id-175' filepath='include/wx/webview.h' line='133' column='1' id='type-id-174'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-177' filepath='include/wx/webview.h' line='133' column='1' id='type-id-176'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-60' filepath='include/wx/webview.h' line='133' column='1' id='type-id-178'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-179' filepath='include/wx/webview.h' line='133' column='1' id='type-id-161'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_table' type-id='type-id-62' visibility='default' filepath='include/wx/webview.h' line='133' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_tableBuckets' type-id='type-id-60' visibility='default' filepath='include/wx/webview.h' line='133' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_items' type-id='type-id-60' visibility='default' filepath='include/wx/webview.h' line='133' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_hasher' type-id='type-id-169' visibility='default' filepath='include/wx/webview.h' line='133' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='200'>
        <var-decl name='m_equals' type-id='type-id-170' visibility='default' filepath='include/wx/webview.h' line='133' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='208'>
        <var-decl name='m_getKey' type-id='type-id-171' visibility='default' filepath='include/wx/webview.h' line='133' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxStringWebViewFactoryMap_wxImplementation_KeyEx' size-in-bits='8' visibility='default' filepath='include/wx/webview.h' line='133' column='1' id='type-id-172'>
      <member-type access='private'>
        <typedef-decl name='const_key_reference' type-id='type-id-181' filepath='include/wx/webview.h' line='133' column='1' id='type-id-180'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_key_type' type-id='type-id-183' filepath='include/wx/webview.h' line='133' column='1' id='type-id-182'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_reference' type-id='type-id-185' filepath='include/wx/webview.h' line='133' column='1' id='type-id-184'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_type' type-id='type-id-187' filepath='include/wx/webview.h' line='133' column='1' id='type-id-186'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='key_type' type-id='type-id-36' filepath='include/wx/webview.h' line='133' column='1' id='type-id-188'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='pair_type' type-id='type-id-179' filepath='include/wx/webview.h' line='133' column='1' id='type-id-189'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringWebViewFactoryMap_wxImplementation_Pair' size-in-bits='448' visibility='default' filepath='include/wx/webview.h' line='133' column='1' id='type-id-179'>
      <member-type access='public'>
        <typedef-decl name='const_t1' type-id='type-id-45' filepath='include/wx/webview.h' line='133' column='1' id='type-id-190'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_t2' type-id='type-id-192' filepath='include/wx/webview.h' line='133' column='1' id='type-id-191'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t1' type-id='type-id-36' filepath='include/wx/webview.h' line='133' column='1' id='type-id-193'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t2' type-id='type-id-137' filepath='include/wx/webview.h' line='133' column='1' id='type-id-194'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='first' type-id='type-id-193' visibility='default' filepath='include/wx/webview.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='second' type-id='type-id-194' visibility='default' filepath='include/wx/webview.h' line='133' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxBuildOptionsChecker' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/common/webview.cpp' line='28' column='1' id='type-id-195'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-196'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-14'/>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' id='type-id-21'/>
    <qualified-type-def type-id='type-id-14' const='yes' id='type-id-198'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-62'/>
    <reference-type-def kind='lvalue' type-id='type-id-34' size-in-bits='64' id='type-id-199'/>
    <qualified-type-def type-id='type-id-34' const='yes' id='type-id-30'/>
    <qualified-type-def type-id='type-id-143' const='yes' id='type-id-200'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-201'/>
    <qualified-type-def type-id='type-id-201' const='yes' id='type-id-202'/>
    <qualified-type-def type-id='type-id-144' const='yes' id='type-id-203'/>
    <reference-type-def kind='lvalue' type-id='type-id-203' size-in-bits='64' id='type-id-204'/>
    <reference-type-def kind='lvalue' type-id='type-id-205' size-in-bits='64' id='type-id-206'/>
    <qualified-type-def type-id='type-id-126' const='yes' id='type-id-136'/>
    <qualified-type-def type-id='type-id-127' const='yes' id='type-id-207'/>
    <reference-type-def kind='lvalue' type-id='type-id-207' size-in-bits='64' id='type-id-208'/>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-209'/>
    <qualified-type-def type-id='type-id-135' const='yes' id='type-id-210'/>
    <reference-type-def kind='lvalue' type-id='type-id-210' size-in-bits='64' id='type-id-211'/>
    <qualified-type-def type-id='type-id-212' const='yes' id='type-id-213'/>
    <qualified-type-def type-id='type-id-214' const='yes' id='type-id-215'/>
    <reference-type-def kind='lvalue' type-id='type-id-216' size-in-bits='64' id='type-id-217'/>
    <qualified-type-def type-id='type-id-137' const='yes' id='type-id-192'/>
    <reference-type-def kind='lvalue' type-id='type-id-192' size-in-bits='64' id='type-id-218'/>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' id='type-id-219'/>
    <qualified-type-def type-id='type-id-219' const='yes' id='type-id-220'/>
    <qualified-type-def type-id='type-id-138' const='yes' id='type-id-221'/>
    <qualified-type-def type-id='type-id-23' const='yes' id='type-id-222'/>
    <pointer-type-def type-id='type-id-222' size-in-bits='64' id='type-id-223'/>
    <qualified-type-def type-id='type-id-223' const='yes' id='type-id-224'/>
    <qualified-type-def type-id='type-id-22' const='yes' id='type-id-225'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-226'/>
    <qualified-type-def type-id='type-id-226' const='yes' id='type-id-227'/>
    <qualified-type-def type-id='type-id-77' const='yes' id='type-id-228'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-229'/>
    <qualified-type-def type-id='type-id-78' const='yes' id='type-id-230'/>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' id='type-id-231'/>
    <qualified-type-def type-id='type-id-88' const='yes' id='type-id-232'/>
    <reference-type-def kind='lvalue' type-id='type-id-232' size-in-bits='64' id='type-id-233'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' id='type-id-234'/>
    <qualified-type-def type-id='type-id-94' const='yes' id='type-id-235'/>
    <reference-type-def kind='lvalue' type-id='type-id-235' size-in-bits='64' id='type-id-236'/>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-237'/>
    <qualified-type-def type-id='type-id-93' const='yes' id='type-id-238'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-239'/>
    <qualified-type-def type-id='type-id-100' const='yes' id='type-id-240'/>
    <reference-type-def kind='lvalue' type-id='type-id-240' size-in-bits='64' id='type-id-241'/>
    <qualified-type-def type-id='type-id-84' const='yes' id='type-id-81'/>
    <reference-type-def kind='lvalue' type-id='type-id-81' size-in-bits='64' id='type-id-242'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-243'/>
    <qualified-type-def type-id='type-id-101' const='yes' id='type-id-244'/>
    <reference-type-def kind='lvalue' type-id='type-id-244' size-in-bits='64' id='type-id-245'/>
    <qualified-type-def type-id='type-id-102' const='yes' id='type-id-246'/>
    <reference-type-def kind='lvalue' type-id='type-id-246' size-in-bits='64' id='type-id-247'/>
    <qualified-type-def type-id='type-id-104' const='yes' id='type-id-248'/>
    <reference-type-def kind='lvalue' type-id='type-id-248' size-in-bits='64' id='type-id-249'/>
    <qualified-type-def type-id='type-id-92' const='yes' id='type-id-250'/>
    <reference-type-def kind='lvalue' type-id='type-id-250' size-in-bits='64' id='type-id-99'/>
    <pointer-type-def type-id='type-id-250' size-in-bits='64' id='type-id-97'/>
    <qualified-type-def type-id='type-id-103' const='yes' id='type-id-251'/>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-252'/>
    <qualified-type-def type-id='type-id-119' const='yes' id='type-id-114'/>
    <qualified-type-def type-id='type-id-120' const='yes' id='type-id-118'/>
    <qualified-type-def type-id='type-id-24' const='yes' id='type-id-253'/>
    <pointer-type-def type-id='type-id-253' size-in-bits='64' id='type-id-254'/>
    <qualified-type-def type-id='type-id-25' const='yes' id='type-id-255'/>
    <pointer-type-def type-id='type-id-255' size-in-bits='64' id='type-id-256'/>
    <qualified-type-def type-id='type-id-37' const='yes' id='type-id-257'/>
    <reference-type-def kind='lvalue' type-id='type-id-257' size-in-bits='64' id='type-id-258'/>
    <pointer-type-def type-id='type-id-257' size-in-bits='64' id='type-id-259'/>
    <qualified-type-def type-id='type-id-43' const='yes' id='type-id-260'/>
    <reference-type-def kind='lvalue' type-id='type-id-260' size-in-bits='64' id='type-id-261'/>
    <pointer-type-def type-id='type-id-260' size-in-bits='64' id='type-id-262'/>
    <qualified-type-def type-id='type-id-42' const='yes' id='type-id-263'/>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' id='type-id-264'/>
    <qualified-type-def type-id='type-id-50' const='yes' id='type-id-265'/>
    <reference-type-def kind='lvalue' type-id='type-id-265' size-in-bits='64' id='type-id-266'/>
    <qualified-type-def type-id='type-id-32' const='yes' id='type-id-28'/>
    <reference-type-def kind='lvalue' type-id='type-id-28' size-in-bits='64' id='type-id-267'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-268'/>
    <qualified-type-def type-id='type-id-51' const='yes' id='type-id-269'/>
    <reference-type-def kind='lvalue' type-id='type-id-269' size-in-bits='64' id='type-id-270'/>
    <qualified-type-def type-id='type-id-52' const='yes' id='type-id-271'/>
    <reference-type-def kind='lvalue' type-id='type-id-271' size-in-bits='64' id='type-id-272'/>
    <qualified-type-def type-id='type-id-54' const='yes' id='type-id-273'/>
    <reference-type-def kind='lvalue' type-id='type-id-273' size-in-bits='64' id='type-id-274'/>
    <qualified-type-def type-id='type-id-41' const='yes' id='type-id-275'/>
    <reference-type-def kind='lvalue' type-id='type-id-275' size-in-bits='64' id='type-id-49'/>
    <pointer-type-def type-id='type-id-275' size-in-bits='64' id='type-id-47'/>
    <qualified-type-def type-id='type-id-53' const='yes' id='type-id-276'/>
    <pointer-type-def type-id='type-id-276' size-in-bits='64' id='type-id-277'/>
    <qualified-type-def type-id='type-id-71' const='yes' id='type-id-66'/>
    <qualified-type-def type-id='type-id-72' const='yes' id='type-id-70'/>
    <qualified-type-def type-id='type-id-147' const='yes' id='type-id-278'/>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-279'/>
    <qualified-type-def type-id='type-id-148' const='yes' id='type-id-280'/>
    <pointer-type-def type-id='type-id-280' size-in-bits='64' id='type-id-281'/>
    <qualified-type-def type-id='type-id-281' const='yes' id='type-id-282'/>
    <qualified-type-def type-id='type-id-157' const='yes' id='type-id-283'/>
    <reference-type-def kind='lvalue' type-id='type-id-283' size-in-bits='64' id='type-id-284'/>
    <pointer-type-def type-id='type-id-283' size-in-bits='64' id='type-id-285'/>
    <qualified-type-def type-id='type-id-285' const='yes' id='type-id-286'/>
    <qualified-type-def type-id='type-id-163' const='yes' id='type-id-287'/>
    <reference-type-def kind='lvalue' type-id='type-id-287' size-in-bits='64' id='type-id-288'/>
    <pointer-type-def type-id='type-id-287' size-in-bits='64' id='type-id-289'/>
    <qualified-type-def type-id='type-id-162' const='yes' id='type-id-290'/>
    <pointer-type-def type-id='type-id-290' size-in-bits='64' id='type-id-291'/>
    <qualified-type-def type-id='type-id-169' const='yes' id='type-id-292'/>
    <reference-type-def kind='lvalue' type-id='type-id-292' size-in-bits='64' id='type-id-293'/>
    <qualified-type-def type-id='type-id-154' const='yes' id='type-id-151'/>
    <reference-type-def kind='lvalue' type-id='type-id-151' size-in-bits='64' id='type-id-294'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-295'/>
    <qualified-type-def type-id='type-id-295' const='yes' id='type-id-296'/>
    <qualified-type-def type-id='type-id-170' const='yes' id='type-id-297'/>
    <reference-type-def kind='lvalue' type-id='type-id-297' size-in-bits='64' id='type-id-298'/>
    <qualified-type-def type-id='type-id-171' const='yes' id='type-id-299'/>
    <reference-type-def kind='lvalue' type-id='type-id-299' size-in-bits='64' id='type-id-300'/>
    <qualified-type-def type-id='type-id-173' const='yes' id='type-id-301'/>
    <reference-type-def kind='lvalue' type-id='type-id-301' size-in-bits='64' id='type-id-302'/>
    <qualified-type-def type-id='type-id-161' const='yes' id='type-id-303'/>
    <reference-type-def kind='lvalue' type-id='type-id-303' size-in-bits='64' id='type-id-168'/>
    <pointer-type-def type-id='type-id-303' size-in-bits='64' id='type-id-166'/>
    <qualified-type-def type-id='type-id-172' const='yes' id='type-id-304'/>
    <pointer-type-def type-id='type-id-304' size-in-bits='64' id='type-id-305'/>
    <qualified-type-def type-id='type-id-305' const='yes' id='type-id-306'/>
    <qualified-type-def type-id='type-id-188' const='yes' id='type-id-183'/>
    <qualified-type-def type-id='type-id-189' const='yes' id='type-id-187'/>
    <qualified-type-def type-id='type-id-87' const='yes' id='type-id-123'/>
    <qualified-type-def type-id='type-id-307' const='yes' id='type-id-308'/>
    <reference-type-def kind='lvalue' type-id='type-id-309' size-in-bits='64' id='type-id-310'/>
    <pointer-type-def type-id='type-id-311' size-in-bits='64' id='type-id-19'/>
    <pointer-type-def type-id='type-id-312' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-146' size-in-bits='64' id='type-id-313'/>
    <qualified-type-def type-id='type-id-313' const='yes' id='type-id-314'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-315'/>
    <qualified-type-def type-id='type-id-315' const='yes' id='type-id-316'/>
    <pointer-type-def type-id='type-id-195' size-in-bits='64' id='type-id-317'/>
    <qualified-type-def type-id='type-id-317' const='yes' id='type-id-318'/>
    <qualified-type-def type-id='type-id-319' const='yes' id='type-id-320'/>
    <reference-type-def kind='lvalue' type-id='type-id-321' size-in-bits='64' id='type-id-322'/>
    <reference-type-def kind='lvalue' type-id='type-id-127' size-in-bits='64' id='type-id-323'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-324'/>
    <qualified-type-def type-id='type-id-324' const='yes' id='type-id-325'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-134'/>
    <reference-type-def kind='lvalue' type-id='type-id-135' size-in-bits='64' id='type-id-326'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-327'/>
    <qualified-type-def type-id='type-id-327' const='yes' id='type-id-328'/>
    <reference-type-def kind='lvalue' type-id='type-id-137' size-in-bits='64' id='type-id-329'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-330'/>
    <qualified-type-def type-id='type-id-330' const='yes' id='type-id-331'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-141'/>
    <qualified-type-def type-id='type-id-141' const='yes' id='type-id-332'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-333'/>
    <qualified-type-def type-id='type-id-333' const='yes' id='type-id-334'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-335'/>
    <qualified-type-def type-id='type-id-335' const='yes' id='type-id-336'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-337'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-338'/>
    <reference-type-def kind='lvalue' type-id='type-id-80' size-in-bits='64' id='type-id-339'/>
    <reference-type-def kind='lvalue' type-id='type-id-82' size-in-bits='64' id='type-id-340'/>
    <reference-type-def kind='lvalue' type-id='type-id-86' size-in-bits='64' id='type-id-341'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-342'/>
    <qualified-type-def type-id='type-id-342' const='yes' id='type-id-343'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' id='type-id-344'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-89'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-90'/>
    <reference-type-def kind='lvalue' type-id='type-id-93' size-in-bits='64' id='type-id-345'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-346'/>
    <reference-type-def kind='lvalue' type-id='type-id-95' size-in-bits='64' id='type-id-347'/>
    <reference-type-def kind='lvalue' type-id='type-id-84' size-in-bits='64' id='type-id-348'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' id='type-id-349'/>
    <reference-type-def kind='lvalue' type-id='type-id-92' size-in-bits='64' id='type-id-108'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-106'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-350'/>
    <reference-type-def kind='lvalue' type-id='type-id-113' size-in-bits='64' id='type-id-112'/>
    <reference-type-def kind='lvalue' type-id='type-id-117' size-in-bits='64' id='type-id-116'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-351'/>
    <reference-type-def kind='lvalue' type-id='type-id-121' size-in-bits='64' id='type-id-352'/>
    <reference-type-def kind='lvalue' type-id='type-id-122' size-in-bits='64' id='type-id-353'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-354'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-355'/>
    <reference-type-def kind='lvalue' type-id='type-id-27' size-in-bits='64' id='type-id-356'/>
    <reference-type-def kind='lvalue' type-id='type-id-29' size-in-bits='64' id='type-id-357'/>
    <reference-type-def kind='lvalue' type-id='type-id-35' size-in-bits='64' id='type-id-358'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-359'/>
    <qualified-type-def type-id='type-id-359' const='yes' id='type-id-360'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-361'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-38'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-39'/>
    <reference-type-def kind='lvalue' type-id='type-id-42' size-in-bits='64' id='type-id-362'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-363'/>
    <reference-type-def kind='lvalue' type-id='type-id-44' size-in-bits='64' id='type-id-364'/>
    <reference-type-def kind='lvalue' type-id='type-id-32' size-in-bits='64' id='type-id-365'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-366'/>
    <reference-type-def kind='lvalue' type-id='type-id-41' size-in-bits='64' id='type-id-58'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-56'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-367'/>
    <reference-type-def kind='lvalue' type-id='type-id-65' size-in-bits='64' id='type-id-64'/>
    <reference-type-def kind='lvalue' type-id='type-id-69' size-in-bits='64' id='type-id-68'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-368'/>
    <reference-type-def kind='lvalue' type-id='type-id-73' size-in-bits='64' id='type-id-369'/>
    <reference-type-def kind='lvalue' type-id='type-id-74' size-in-bits='64' id='type-id-370'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-371'/>
    <qualified-type-def type-id='type-id-371' const='yes' id='type-id-372'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-373'/>
    <reference-type-def kind='lvalue' type-id='type-id-150' size-in-bits='64' id='type-id-374'/>
    <reference-type-def kind='lvalue' type-id='type-id-152' size-in-bits='64' id='type-id-375'/>
    <reference-type-def kind='lvalue' type-id='type-id-156' size-in-bits='64' id='type-id-376'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-377'/>
    <qualified-type-def type-id='type-id-377' const='yes' id='type-id-378'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-379'/>
    <qualified-type-def type-id='type-id-379' const='yes' id='type-id-380'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-158'/>
    <qualified-type-def type-id='type-id-158' const='yes' id='type-id-381'/>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-159'/>
    <reference-type-def kind='lvalue' type-id='type-id-162' size-in-bits='64' id='type-id-382'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-383'/>
    <reference-type-def kind='lvalue' type-id='type-id-164' size-in-bits='64' id='type-id-384'/>
    <reference-type-def kind='lvalue' type-id='type-id-154' size-in-bits='64' id='type-id-385'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-386'/>
    <qualified-type-def type-id='type-id-386' const='yes' id='type-id-387'/>
    <reference-type-def kind='lvalue' type-id='type-id-161' size-in-bits='64' id='type-id-177'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-175'/>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-388'/>
    <qualified-type-def type-id='type-id-388' const='yes' id='type-id-389'/>
    <reference-type-def kind='lvalue' type-id='type-id-182' size-in-bits='64' id='type-id-181'/>
    <reference-type-def kind='lvalue' type-id='type-id-186' size-in-bits='64' id='type-id-185'/>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-390'/>
    <qualified-type-def type-id='type-id-390' const='yes' id='type-id-391'/>
    <reference-type-def kind='lvalue' type-id='type-id-190' size-in-bits='64' id='type-id-392'/>
    <reference-type-def kind='lvalue' type-id='type-id-191' size-in-bits='64' id='type-id-393'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-394'/>
    <qualified-type-def type-id='type-id-395' const='yes' id='type-id-396'/>
    <reference-type-def kind='lvalue' type-id='type-id-397' size-in-bits='64' id='type-id-398'/>
    <reference-type-def kind='lvalue' type-id='type-id-399' size-in-bits='64' id='type-id-400'/>
    <class-decl name='wxLog' visibility='default' is-declaration-only='yes' id='type-id-401'/>
    <var-decl name='wxWebViewNameStr' type-id='type-id-11' mangled-name='wxWebViewNameStr' visibility='default' filepath='include/wx/webview.h' line='111' column='1' elf-symbol-id='wxWebViewNameStr@@WXU_3.2'/>
    <var-decl name='wxWebViewDefaultURLStr' type-id='type-id-11' mangled-name='wxWebViewDefaultURLStr' visibility='default' filepath='include/wx/webview.h' line='112' column='1' elf-symbol-id='wxWebViewDefaultURLStr@@WXU_3.2'/>
    <var-decl name='wxWebViewBackendDefault' type-id='type-id-11' mangled-name='wxWebViewBackendDefault' visibility='default' filepath='include/wx/webview.h' line='113' column='1' elf-symbol-id='wxWebViewBackendDefault@@WXU_3.2'/>
    <var-decl name='wxWebViewBackendIE' type-id='type-id-11' mangled-name='wxWebViewBackendIE' visibility='default' filepath='include/wx/webview.h' line='114' column='1' elf-symbol-id='wxWebViewBackendIE@@WXU_3.2'/>
    <var-decl name='wxWebViewBackendEdge' type-id='type-id-11' mangled-name='wxWebViewBackendEdge' visibility='default' filepath='include/wx/webview.h' line='115' column='1' elf-symbol-id='wxWebViewBackendEdge@@WXU_3.2'/>
    <var-decl name='wxWebViewBackendWebKit' type-id='type-id-11' mangled-name='wxWebViewBackendWebKit' visibility='default' filepath='include/wx/webview.h' line='116' column='1' elf-symbol-id='wxWebViewBackendWebKit@@WXU_3.2'/>
    <var-decl name='wxEVT_WEBVIEW_NAVIGATING' type-id='type-id-402' mangled-name='wxEVT_WEBVIEW_NAVIGATING' visibility='default' filepath='include/wx/webview.h' line='317' column='1' elf-symbol-id='wxEVT_WEBVIEW_NAVIGATING@@WXU_3.2'/>
    <var-decl name='wxEVT_WEBVIEW_NAVIGATED' type-id='type-id-402' mangled-name='wxEVT_WEBVIEW_NAVIGATED' visibility='default' filepath='include/wx/webview.h' line='318' column='1' elf-symbol-id='wxEVT_WEBVIEW_NAVIGATED@@WXU_3.2'/>
    <var-decl name='wxEVT_WEBVIEW_LOADED' type-id='type-id-402' mangled-name='wxEVT_WEBVIEW_LOADED' visibility='default' filepath='include/wx/webview.h' line='319' column='1' elf-symbol-id='wxEVT_WEBVIEW_LOADED@@WXU_3.2'/>
    <var-decl name='wxEVT_WEBVIEW_ERROR' type-id='type-id-402' mangled-name='wxEVT_WEBVIEW_ERROR' visibility='default' filepath='include/wx/webview.h' line='320' column='1' elf-symbol-id='wxEVT_WEBVIEW_ERROR@@WXU_3.2'/>
    <var-decl name='wxEVT_WEBVIEW_NEWWINDOW' type-id='type-id-402' mangled-name='wxEVT_WEBVIEW_NEWWINDOW' visibility='default' filepath='include/wx/webview.h' line='321' column='1' elf-symbol-id='wxEVT_WEBVIEW_NEWWINDOW@@WXU_3.2'/>
    <var-decl name='wxEVT_WEBVIEW_TITLE_CHANGED' type-id='type-id-402' mangled-name='wxEVT_WEBVIEW_TITLE_CHANGED' visibility='default' filepath='include/wx/webview.h' line='322' column='1' elf-symbol-id='wxEVT_WEBVIEW_TITLE_CHANGED@@WXU_3.2'/>
    <var-decl name='wxEVT_WEBVIEW_FULLSCREEN_CHANGED' type-id='type-id-402' mangled-name='wxEVT_WEBVIEW_FULLSCREEN_CHANGED' visibility='default' filepath='include/wx/webview.h' line='323' column='1' elf-symbol-id='wxEVT_WEBVIEW_FULLSCREEN_CHANGED@@WXU_3.2'/>
    <var-decl name='wxEVT_WEBVIEW_SCRIPT_MESSAGE_RECEIVED' type-id='type-id-402' mangled-name='wxEVT_WEBVIEW_SCRIPT_MESSAGE_RECEIVED' visibility='default' filepath='include/wx/webview.h' line='324' column='1' elf-symbol-id='wxEVT_WEBVIEW_SCRIPT_MESSAGE_RECEIVED@@WXU_3.2'/>
    <var-decl name='wxEVT_WEBVIEW_SCRIPT_RESULT' type-id='type-id-402' mangled-name='wxEVT_WEBVIEW_SCRIPT_RESULT' visibility='default' filepath='include/wx/webview.h' line='325' column='1' elf-symbol-id='wxEVT_WEBVIEW_SCRIPT_RESULT@@WXU_3.2'/>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='543' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-403'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-197'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-14'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-311'>
      <parameter type-id='type-id-196'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-60'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-312'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-142'/>
    </function-type>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-3'/>
  </abi-instr>
  <abi-instr address-size='64' path='src/common/webviewarchivehandler.cpp' language='LANG_C_plus_plus_14'>
    <class-decl name='wxFSHandlerHash' size-in-bits='256' visibility='default' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-404'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-405'/>
      <member-type access='public'>
        <class-decl name='Insert_Result' size-in-bits='192' visibility='default' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-406'>
          <member-type access='public'>
            <typedef-decl name='const_t1' type-id='type-id-408' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-407'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_t2' type-id='type-id-30' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-409'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t1' type-id='type-id-411' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-410'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t2' type-id='type-id-34' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-412'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='first' type-id='type-id-410' visibility='default' filepath='include/wx/filesys.h' line='168' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='second' type-id='type-id-412' visibility='default' filepath='include/wx/filesys.h' line='168' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='mapped_type' type-id='type-id-414' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-413'/>
      </member-type>
    </class-decl>
    <class-decl name='wxFSHandlerHash_wxImplementation_HashTable' size-in-bits='256' visibility='default' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-405'>
      <base-class access='protected' layout-offset-in-bits='0' type-id='type-id-15'/>
      <member-type access='public'>
        <class-decl name='Iterator' size-in-bits='128' visibility='default' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-415'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-416' visibility='default' filepath='include/wx/filesys.h' line='168' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_ht' type-id='type-id-417' visibility='default' filepath='include/wx/filesys.h' line='168' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='Node' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-418'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-13'/>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_value' type-id='type-id-419' visibility='default' filepath='include/wx/filesys.h' line='168' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-420'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-415'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='128' visibility='default' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-411'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-415'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='Self' type-id='type-id-405' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-421'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_key_type' type-id='type-id-403' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-422'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_pointer' type-id='type-id-424' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-423'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-426' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-425'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='hasher' type-id='type-id-428' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-427'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_equal' type-id='type-id-430' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-429'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_extractor' type-id='type-id-432' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-431'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_type' type-id='type-id-403' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-433'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='pointer' type-id='type-id-435' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-434'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-437' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-436'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-60' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-438'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-439' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-419'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_table' type-id='type-id-62' visibility='default' filepath='include/wx/filesys.h' line='168' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_tableBuckets' type-id='type-id-60' visibility='default' filepath='include/wx/filesys.h' line='168' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_items' type-id='type-id-60' visibility='default' filepath='include/wx/filesys.h' line='168' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_hasher' type-id='type-id-427' visibility='default' filepath='include/wx/filesys.h' line='168' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='200'>
        <var-decl name='m_equals' type-id='type-id-429' visibility='default' filepath='include/wx/filesys.h' line='168' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='208'>
        <var-decl name='m_getKey' type-id='type-id-431' visibility='default' filepath='include/wx/filesys.h' line='168' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxFSHandlerHash_wxImplementation_KeyEx' size-in-bits='8' visibility='default' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-432'>
      <member-type access='private'>
        <typedef-decl name='const_key_reference' type-id='type-id-441' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-440'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_key_type' type-id='type-id-443' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-442'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_reference' type-id='type-id-445' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-444'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_type' type-id='type-id-447' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-446'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='key_type' type-id='type-id-403' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-448'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='pair_type' type-id='type-id-439' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-449'/>
      </member-type>
    </class-decl>
    <class-decl name='wxFSHandlerHash_wxImplementation_Pair' size-in-bits='128' visibility='default' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-439'>
      <member-type access='public'>
        <typedef-decl name='const_t1' type-id='type-id-403' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-450'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_t2' type-id='type-id-452' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-451'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t1' type-id='type-id-403' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-453'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t2' type-id='type-id-414' filepath='include/wx/filesys.h' line='168' column='1' id='type-id-454'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='first' type-id='type-id-453' visibility='default' filepath='include/wx/filesys.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='second' type-id='type-id-454' visibility='default' filepath='include/wx/filesys.h' line='168' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxPointerHash' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='548' column='1' id='type-id-428'/>
    <class-decl name='wxPointerEqual' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='559' column='1' id='type-id-430'/>
    <class-decl name='wxArgNormalizerWchar&lt;unsigned char&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='500' column='1' id='type-id-455'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-456'/>
    </class-decl>
    <class-decl name='wxArgNormalizerNarrowChar&lt;unsigned char&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='892' column='1' id='type-id-457'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_value' type-id='type-id-458' visibility='default' filepath='include/wx/strvararg.h' line='910' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArgNormalizer&lt;unsigned char&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='922' column='1' id='type-id-456'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-457'/>
    </class-decl>
    <class-decl name='wxWebViewArchiveHandler' size-in-bits='896' visibility='default' filepath='include/wx/webviewarchivehandler.h' line='24' column='1' id='type-id-459'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-460'/>
      <data-member access='private' layout-offset-in-bits='832'>
        <var-decl name='m_fileSystem' type-id='type-id-461' visibility='default' filepath='include/wx/webviewarchivehandler.h' line='31' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxWebViewArchiveHandler' mangled-name='_ZN23wxWebViewArchiveHandlerC2ERK8wxString' filepath='src/common/webviewarchivehandler.cpp' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN23wxWebViewArchiveHandlerC2ERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-462' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-463' name='scheme' filepath='src/common/webviewarchivehandler.cpp' line='43' column='1'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWebViewArchiveHandler' mangled-name='_ZN23wxWebViewArchiveHandlerD4Ev' filepath='src/common/webviewarchivehandler.cpp' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-464' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWebViewArchiveHandler' mangled-name='_ZN23wxWebViewArchiveHandlerD0Ev' filepath='src/common/webviewarchivehandler.cpp' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN23wxWebViewArchiveHandlerD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-464' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWebViewArchiveHandler' mangled-name='_ZN23wxWebViewArchiveHandlerD2Ev' filepath='src/common/webviewarchivehandler.cpp' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN23wxWebViewArchiveHandlerD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-464' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <function-decl name='GetFile' mangled-name='_ZN23wxWebViewArchiveHandler7GetFileERK8wxString' filepath='src/common/webviewarchivehandler.cpp' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN23wxWebViewArchiveHandler7GetFileERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-464' is-artificial='yes'/>
          <parameter type-id='type-id-463'/>
          <return type-id='type-id-465'/>
        </function-decl>
      </member-function>
    </class-decl>
    <qualified-type-def type-id='type-id-457' const='yes' id='type-id-466'/>
    <pointer-type-def type-id='type-id-466' size-in-bits='64' id='type-id-467'/>
    <qualified-type-def type-id='type-id-467' const='yes' id='type-id-468'/>
    <qualified-type-def type-id='type-id-404' const='yes' id='type-id-469'/>
    <pointer-type-def type-id='type-id-469' size-in-bits='64' id='type-id-470'/>
    <qualified-type-def type-id='type-id-405' const='yes' id='type-id-471'/>
    <pointer-type-def type-id='type-id-471' size-in-bits='64' id='type-id-472'/>
    <qualified-type-def type-id='type-id-415' const='yes' id='type-id-473'/>
    <reference-type-def kind='lvalue' type-id='type-id-473' size-in-bits='64' id='type-id-474'/>
    <pointer-type-def type-id='type-id-473' size-in-bits='64' id='type-id-475'/>
    <qualified-type-def type-id='type-id-421' const='yes' id='type-id-476'/>
    <reference-type-def kind='lvalue' type-id='type-id-476' size-in-bits='64' id='type-id-477'/>
    <pointer-type-def type-id='type-id-476' size-in-bits='64' id='type-id-478'/>
    <qualified-type-def type-id='type-id-420' const='yes' id='type-id-479'/>
    <pointer-type-def type-id='type-id-479' size-in-bits='64' id='type-id-480'/>
    <qualified-type-def type-id='type-id-422' const='yes' id='type-id-481'/>
    <reference-type-def kind='lvalue' type-id='type-id-481' size-in-bits='64' id='type-id-482'/>
    <qualified-type-def type-id='type-id-427' const='yes' id='type-id-483'/>
    <reference-type-def kind='lvalue' type-id='type-id-483' size-in-bits='64' id='type-id-484'/>
    <qualified-type-def type-id='type-id-411' const='yes' id='type-id-408'/>
    <reference-type-def kind='lvalue' type-id='type-id-408' size-in-bits='64' id='type-id-485'/>
    <pointer-type-def type-id='type-id-408' size-in-bits='64' id='type-id-486'/>
    <qualified-type-def type-id='type-id-429' const='yes' id='type-id-487'/>
    <reference-type-def kind='lvalue' type-id='type-id-487' size-in-bits='64' id='type-id-488'/>
    <qualified-type-def type-id='type-id-431' const='yes' id='type-id-489'/>
    <reference-type-def kind='lvalue' type-id='type-id-489' size-in-bits='64' id='type-id-490'/>
    <qualified-type-def type-id='type-id-433' const='yes' id='type-id-491'/>
    <reference-type-def kind='lvalue' type-id='type-id-491' size-in-bits='64' id='type-id-492'/>
    <qualified-type-def type-id='type-id-419' const='yes' id='type-id-493'/>
    <reference-type-def kind='lvalue' type-id='type-id-493' size-in-bits='64' id='type-id-426'/>
    <pointer-type-def type-id='type-id-493' size-in-bits='64' id='type-id-424'/>
    <qualified-type-def type-id='type-id-432' const='yes' id='type-id-494'/>
    <pointer-type-def type-id='type-id-494' size-in-bits='64' id='type-id-495'/>
    <qualified-type-def type-id='type-id-448' const='yes' id='type-id-443'/>
    <qualified-type-def type-id='type-id-449' const='yes' id='type-id-447'/>
    <qualified-type-def type-id='type-id-450' const='yes' id='type-id-496'/>
    <reference-type-def kind='lvalue' type-id='type-id-496' size-in-bits='64' id='type-id-497'/>
    <qualified-type-def type-id='type-id-451' const='yes' id='type-id-498'/>
    <reference-type-def kind='lvalue' type-id='type-id-498' size-in-bits='64' id='type-id-499'/>
    <qualified-type-def type-id='type-id-500' const='yes' id='type-id-501'/>
    <pointer-type-def type-id='type-id-501' size-in-bits='64' id='type-id-502'/>
    <qualified-type-def type-id='type-id-503' const='yes' id='type-id-504'/>
    <pointer-type-def type-id='type-id-504' size-in-bits='64' id='type-id-452'/>
    <qualified-type-def type-id='type-id-430' const='yes' id='type-id-505'/>
    <pointer-type-def type-id='type-id-505' size-in-bits='64' id='type-id-506'/>
    <qualified-type-def type-id='type-id-428' const='yes' id='type-id-507'/>
    <pointer-type-def type-id='type-id-507' size-in-bits='64' id='type-id-508'/>
    <qualified-type-def type-id='type-id-509' const='yes' id='type-id-510'/>
    <pointer-type-def type-id='type-id-456' size-in-bits='64' id='type-id-511'/>
    <qualified-type-def type-id='type-id-511' const='yes' id='type-id-512'/>
    <pointer-type-def type-id='type-id-457' size-in-bits='64' id='type-id-513'/>
    <qualified-type-def type-id='type-id-513' const='yes' id='type-id-514'/>
    <pointer-type-def type-id='type-id-455' size-in-bits='64' id='type-id-515'/>
    <qualified-type-def type-id='type-id-515' const='yes' id='type-id-516'/>
    <pointer-type-def type-id='type-id-404' size-in-bits='64' id='type-id-517'/>
    <qualified-type-def type-id='type-id-517' const='yes' id='type-id-518'/>
    <pointer-type-def type-id='type-id-406' size-in-bits='64' id='type-id-519'/>
    <reference-type-def kind='lvalue' type-id='type-id-407' size-in-bits='64' id='type-id-520'/>
    <reference-type-def kind='lvalue' type-id='type-id-409' size-in-bits='64' id='type-id-521'/>
    <reference-type-def kind='lvalue' type-id='type-id-413' size-in-bits='64' id='type-id-522'/>
    <pointer-type-def type-id='type-id-405' size-in-bits='64' id='type-id-523'/>
    <qualified-type-def type-id='type-id-523' const='yes' id='type-id-524'/>
    <pointer-type-def type-id='type-id-415' size-in-bits='64' id='type-id-525'/>
    <pointer-type-def type-id='type-id-418' size-in-bits='64' id='type-id-416'/>
    <pointer-type-def type-id='type-id-421' size-in-bits='64' id='type-id-417'/>
    <reference-type-def kind='lvalue' type-id='type-id-420' size-in-bits='64' id='type-id-526'/>
    <pointer-type-def type-id='type-id-420' size-in-bits='64' id='type-id-527'/>
    <reference-type-def kind='lvalue' type-id='type-id-411' size-in-bits='64' id='type-id-528'/>
    <pointer-type-def type-id='type-id-411' size-in-bits='64' id='type-id-529'/>
    <reference-type-def kind='lvalue' type-id='type-id-419' size-in-bits='64' id='type-id-437'/>
    <pointer-type-def type-id='type-id-419' size-in-bits='64' id='type-id-435'/>
    <pointer-type-def type-id='type-id-432' size-in-bits='64' id='type-id-530'/>
    <qualified-type-def type-id='type-id-530' const='yes' id='type-id-531'/>
    <reference-type-def kind='lvalue' type-id='type-id-442' size-in-bits='64' id='type-id-441'/>
    <reference-type-def kind='lvalue' type-id='type-id-446' size-in-bits='64' id='type-id-445'/>
    <pointer-type-def type-id='type-id-439' size-in-bits='64' id='type-id-532'/>
    <pointer-type-def type-id='type-id-500' size-in-bits='64' id='type-id-461'/>
    <pointer-type-def type-id='type-id-503' size-in-bits='64' id='type-id-414'/>
    <pointer-type-def type-id='type-id-430' size-in-bits='64' id='type-id-533'/>
    <qualified-type-def type-id='type-id-533' const='yes' id='type-id-534'/>
    <pointer-type-def type-id='type-id-428' size-in-bits='64' id='type-id-535'/>
    <qualified-type-def type-id='type-id-535' const='yes' id='type-id-536'/>
    <pointer-type-def type-id='type-id-459' size-in-bits='64' id='type-id-464'/>
    <qualified-type-def type-id='type-id-464' const='yes' id='type-id-462'/>
    <qualified-type-def type-id='type-id-537' const='yes' id='type-id-538'/>
    <class-decl name='wxFileSystem' visibility='default' is-declaration-only='yes' id='type-id-500'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFileSystem' mangled-name='_ZN12wxFileSystemD0Ev' filepath='include/wx/filesys.h' line='174' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-461' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFileSystem' mangled-name='_ZN12wxFileSystemD0Ev' filepath='include/wx/filesys.h' line='174' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-461' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFileSystem' mangled-name='_ZN12wxFileSystemD1Ev' filepath='include/wx/filesys.h' line='174' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-461' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFileSystem' mangled-name='_ZN12wxFileSystemD1Ev' filepath='include/wx/filesys.h' line='174' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-461' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxFileSystem' mangled-name='_ZN12wxFileSystemD4Ev' filepath='include/wx/filesys.h' line='174' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-461' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK12wxFileSystem12GetClassInfoEv' filepath='include/wx/filesys.h' line='240' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-502' is-artificial='yes'/>
          <return type-id='type-id-539'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxFileSystemHandler' visibility='default' is-declaration-only='yes' id='type-id-503'/>
  </abi-instr>
  <abi-instr address-size='64' path='src/common/webviewfshandler.cpp' language='LANG_C_plus_plus_14'>
    <class-decl name='wxWebViewFSHandler' size-in-bits='896' visibility='default' filepath='include/wx/webviewfshandler.h' line='25' column='1' id='type-id-540'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-460'/>
      <data-member access='private' layout-offset-in-bits='832'>
        <var-decl name='m_fileSystem' type-id='type-id-461' visibility='default' filepath='include/wx/webviewfshandler.h' line='32' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxWebViewFSHandler' mangled-name='_ZN18wxWebViewFSHandlerC2ERK8wxString' filepath='src/common/webviewfshandler.cpp' line='18' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN18wxWebViewFSHandlerC2ERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-541' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-463' name='scheme' filepath='src/common/webviewfshandler.cpp' line='18' column='1'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWebViewFSHandler' mangled-name='_ZN18wxWebViewFSHandlerD4Ev' filepath='src/common/webviewfshandler.cpp' line='24' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-542' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWebViewFSHandler' mangled-name='_ZN18wxWebViewFSHandlerD0Ev' filepath='src/common/webviewfshandler.cpp' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN18wxWebViewFSHandlerD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-542' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWebViewFSHandler' mangled-name='_ZN18wxWebViewFSHandlerD2Ev' filepath='src/common/webviewfshandler.cpp' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN18wxWebViewFSHandlerD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-542' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <function-decl name='GetFile' mangled-name='_ZN18wxWebViewFSHandler7GetFileERK8wxString' filepath='src/common/webviewfshandler.cpp' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN18wxWebViewFSHandler7GetFileERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-542' is-artificial='yes'/>
          <parameter type-id='type-id-463'/>
          <return type-id='type-id-465'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='type-id-540' size-in-bits='64' id='type-id-542'/>
    <qualified-type-def type-id='type-id-542' const='yes' id='type-id-541'/>
  </abi-instr>
  <abi-instr address-size='64' path='src/gtk/webview_webkit2.cpp' language='LANG_C_plus_plus_14'>
    <array-type-def dimensions='1' type-id='type-id-543' size-in-bits='480' id='type-id-544'>
      <subrange length='5' type-id='type-id-3' id='type-id-545'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-546' size-in-bits='160' alignment-in-bits='32' id='type-id-547'>
      <subrange length='5' type-id='type-id-3' id='type-id-545'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-548' size-in-bits='128' id='type-id-549'>
      <subrange length='2' type-id='type-id-3' id='type-id-550'/>
    </array-type-def>
    <type-decl name='__float128' size-in-bits='128' id='type-id-551'/>
    <type-decl name='__int128' size-in-bits='128' id='type-id-552'/>
    <type-decl name='bool' size-in-bits='8' id='type-id-34'/>
    <type-decl name='char' size-in-bits='8' id='type-id-553'/>
    <array-type-def dimensions='1' type-id='type-id-553' size-in-bits='128' id='type-id-554'>
      <subrange length='16' type-id='type-id-3' id='type-id-10'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-553' size-in-bits='8' id='type-id-555'>
      <subrange length='1' type-id='type-id-3' id='type-id-556'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-553' size-in-bits='160' id='type-id-557'>
      <subrange length='20' type-id='type-id-3' id='type-id-558'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-553' size-in-bits='32' id='type-id-559'>
      <subrange length='4' type-id='type-id-3' id='type-id-560'/>
    </array-type-def>
    <class-decl name='typedef __va_list_tag __va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-561'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-562' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-562' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-403' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-403' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='type-id-563'/>
    <type-decl name='float' size-in-bits='32' id='type-id-564'/>
    <array-type-def dimensions='1' type-id='type-id-565' size-in-bits='320' id='type-id-566'>
      <subrange length='5' type-id='type-id-3' id='type-id-545'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='type-id-130'/>
    <type-decl name='long double' size-in-bits='128' id='type-id-567'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-568'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-131'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-569'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-570'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-571'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-572'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-458'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-562'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-3'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-573'/>
    <type-decl name='variadic parameter type' id='type-id-574'/>
    <type-decl name='void' id='type-id-142'/>
    <type-decl name='wchar_t' size-in-bits='32' id='type-id-575'/>
    <array-type-def dimensions='1' type-id='type-id-575' size-in-bits='128' id='type-id-576'>
      <subrange length='4' type-id='type-id-3' id='type-id-560'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-577' size-in-bits='64' id='type-id-578'>
      <subrange length='2' type-id='type-id-3' id='type-id-550'/>
    </array-type-def>
    <class-decl name='wxAnyStrPtr' size-in-bits='128' visibility='default' filepath='include/wx/anystr.h' line='29' column='1' id='type-id-579'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_str' type-id='type-id-580' visibility='default' filepath='include/wx/anystr.h' line='134' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_iter' type-id='type-id-581' visibility='default' filepath='include/wx/anystr.h' line='135' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArrayString' size-in-bits='320' visibility='default' filepath='include/wx/arrstr.h' line='157' column='1' id='type-id-582'>
      <member-type access='public'>
        <typedef-decl name='CompareFunction' type-id='type-id-584' filepath='include/wx/arrstr.h' line='161' column='1' id='type-id-583'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CompareFunction2' type-id='type-id-586' filepath='include/wx/arrstr.h' line='165' column='1' id='type-id-585'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-36' filepath='include/wx/arrstr.h' line='267' column='1' id='type-id-587'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-589' filepath='include/wx/arrstr.h' line='270' column='1' id='type-id-588'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-591' filepath='include/wx/arrstr.h' line='271' column='1' id='type-id-590'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-593' filepath='include/wx/arrstr.h' line='272' column='1' id='type-id-592'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-595' filepath='include/wx/arrstr.h' line='273' column='1' id='type-id-594'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-60' filepath='include/wx/arrstr.h' line='275' column='1' id='type-id-596'/>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator' size-in-bits='64' visibility='default' filepath='include/wx/arrstr.h' line='278' column='1' id='type-id-597'>
          <member-type access='private'>
            <typedef-decl name='value_type' type-id='type-id-36' filepath='include/wx/arrstr.h' line='280' column='1' id='type-id-598'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='type-id-600' filepath='include/wx/arrstr.h' line='281' column='1' id='type-id-599'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reference' type-id='type-id-602' filepath='include/wx/arrstr.h' line='282' column='1' id='type-id-601'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='itor' type-id='type-id-597' filepath='include/wx/arrstr.h' line='283' column='1' id='type-id-603'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_ptr' type-id='type-id-599' visibility='default' filepath='include/wx/arrstr.h' line='289' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_reverse_iterator' size-in-bits='64' visibility='default' filepath='include/wx/arrstr.h' line='304' column='1' id='type-id-604'>
          <member-type access='private'>
            <typedef-decl name='value_type' type-id='type-id-36' filepath='include/wx/arrstr.h' line='306' column='1' id='type-id-605'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='pointer' type-id='type-id-607' filepath='include/wx/arrstr.h' line='307' column='1' id='type-id-606'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='reference' type-id='type-id-609' filepath='include/wx/arrstr.h' line='308' column='1' id='type-id-608'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='itor' type-id='type-id-604' filepath='include/wx/arrstr.h' line='309' column='1' id='type-id-610'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_ptr' type-id='type-id-606' visibility='default' filepath='include/wx/arrstr.h' line='315' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_compareFunction' type-id='type-id-583' visibility='default' filepath='include/wx/arrstr.h' line='393' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_nSize' type-id='type-id-60' visibility='default' filepath='include/wx/arrstr.h' line='406' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_nCount' type-id='type-id-60' visibility='default' filepath='include/wx/arrstr.h' line='407' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_pItems' type-id='type-id-611' visibility='default' filepath='include/wx/arrstr.h' line='409' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_autoSort' type-id='type-id-34' visibility='default' filepath='include/wx/arrstr.h' line='411' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxAtomicInt32' type-id='type-id-612' filepath='include/wx/atomic.h' line='147' column='1' id='type-id-613'/>
    <typedef-decl name='wxAtomicInt' type-id='type-id-613' filepath='include/wx/atomic.h' line='154' column='1' id='type-id-140'/>
    <class-decl name='wxScopedCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='66' column='1' id='type-id-614'>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-553' filepath='include/wx/buffer.h' line='69' column='1' id='type-id-615'/>
      </member-type>
      <member-type access='protected'>
        <class-decl name='Data' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='164' column='1' id='type-id-616'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-617'/>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-618' visibility='default' filepath='include/wx/buffer.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxScopedCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='66' column='1' id='type-id-145'>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-575' filepath='include/wx/buffer.h' line='69' column='1' id='type-id-619'/>
      </member-type>
      <member-type access='protected'>
        <class-decl name='Data' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='164' column='1' id='type-id-620'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-617'/>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-621' visibility='default' filepath='include/wx/buffer.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxScopedCharBuffer' type-id='type-id-614' filepath='include/wx/buffer.h' line='241' column='1' id='type-id-622'/>
    <typedef-decl name='wxScopedWCharBuffer' type-id='type-id-145' filepath='include/wx/buffer.h' line='242' column='1' id='type-id-623'/>
    <class-decl name='wxCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='247' column='1' id='type-id-624'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-614'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-553' filepath='include/wx/buffer.h' line='253' column='1' id='type-id-625'/>
      </member-type>
    </class-decl>
    <class-decl name='wxCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='247' column='1' id='type-id-626'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-145'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-575' filepath='include/wx/buffer.h' line='253' column='1' id='type-id-627'/>
      </member-type>
    </class-decl>
    <class-decl name='wxCharBuffer' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='357' column='1' id='type-id-628'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-624'/>
      <member-type access='public'>
        <typedef-decl name='wxCharTypeBufferBase' type-id='type-id-624' filepath='include/wx/buffer.h' line='360' column='1' id='type-id-629'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='wxScopedCharTypeBufferBase' type-id='type-id-614' filepath='include/wx/buffer.h' line='361' column='1' id='type-id-630'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWCharBuffer' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='374' column='1' id='type-id-631'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-626'/>
      <member-type access='public'>
        <typedef-decl name='wxCharTypeBufferBase' type-id='type-id-626' filepath='include/wx/buffer.h' line='377' column='1' id='type-id-632'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='wxScopedCharTypeBufferBase' type-id='type-id-145' filepath='include/wx/buffer.h' line='378' column='1' id='type-id-633'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWritableCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='393' column='1' id='type-id-634'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-624'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-615' filepath='include/wx/buffer.h' line='396' column='1' id='type-id-635'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWritableCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='393' column='1' id='type-id-636'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-626'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-619' filepath='include/wx/buffer.h' line='396' column='1' id='type-id-637'/>
      </member-type>
    </class-decl>
    <typedef-decl name='wxWritableCharBuffer' type-id='type-id-634' filepath='include/wx/buffer.h' line='410' column='1' id='type-id-638'/>
    <typedef-decl name='wxWritableWCharBuffer' type-id='type-id-636' filepath='include/wx/buffer.h' line='411' column='1' id='type-id-639'/>
    <typedef-decl name='wxChar' type-id='type-id-575' filepath='include/wx/chartype.h' line='123' column='1' id='type-id-577'/>
    <typedef-decl name='wxStringCharType' type-id='type-id-575' filepath='include/wx/chartype.h' line='170' column='1' id='type-id-640'/>
    <class-decl name='wxClientData' size-in-bits='64' visibility='default' filepath='include/wx/clntdata.h' line='98' column='1' id='type-id-641'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxClientData' mangled-name='_ZN12wxClientDataD4Ev' filepath='include/wx/clntdata.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-642' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxDateTime' size-in-bits='64' visibility='default' filepath='include/wx/datetime.h' line='128' column='1' id='type-id-643'>
      <member-type access='public'>
        <typedef-decl name='wxDateTime_t' type-id='type-id-573' filepath='include/wx/datetime.h' line='139' column='1' id='type-id-644'/>
      </member-type>
      <member-type access='public'>
        <enum-decl name='TZ' filepath='include/wx/datetime.h' line='145' column='1' id='type-id-645'>
          <underlying-type type-id='type-id-572'/>
          <enumerator name='Local' value='0'/>
          <enumerator name='GMT_12' value='1'/>
          <enumerator name='GMT_11' value='2'/>
          <enumerator name='GMT_10' value='3'/>
          <enumerator name='GMT_9' value='4'/>
          <enumerator name='GMT_8' value='5'/>
          <enumerator name='GMT_7' value='6'/>
          <enumerator name='GMT_6' value='7'/>
          <enumerator name='GMT_5' value='8'/>
          <enumerator name='GMT_4' value='9'/>
          <enumerator name='GMT_3' value='10'/>
          <enumerator name='GMT_2' value='11'/>
          <enumerator name='GMT_1' value='12'/>
          <enumerator name='GMT0' value='13'/>
          <enumerator name='GMT1' value='14'/>
          <enumerator name='GMT2' value='15'/>
          <enumerator name='GMT3' value='16'/>
          <enumerator name='GMT4' value='17'/>
          <enumerator name='GMT5' value='18'/>
          <enumerator name='GMT6' value='19'/>
          <enumerator name='GMT7' value='20'/>
          <enumerator name='GMT8' value='21'/>
          <enumerator name='GMT9' value='22'/>
          <enumerator name='GMT10' value='23'/>
          <enumerator name='GMT11' value='24'/>
          <enumerator name='GMT12' value='25'/>
          <enumerator name='GMT13' value='26'/>
          <enumerator name='WET' value='13'/>
          <enumerator name='WEST' value='14'/>
          <enumerator name='CET' value='14'/>
          <enumerator name='CEST' value='15'/>
          <enumerator name='EET' value='15'/>
          <enumerator name='EEST' value='16'/>
          <enumerator name='MSK' value='16'/>
          <enumerator name='MSD' value='17'/>
          <enumerator name='AST' value='9'/>
          <enumerator name='ADT' value='10'/>
          <enumerator name='EST' value='8'/>
          <enumerator name='EDT' value='9'/>
          <enumerator name='CST' value='7'/>
          <enumerator name='CDT' value='8'/>
          <enumerator name='MST' value='6'/>
          <enumerator name='MDT' value='7'/>
          <enumerator name='PST' value='5'/>
          <enumerator name='PDT' value='6'/>
          <enumerator name='HST' value='3'/>
          <enumerator name='AKST' value='4'/>
          <enumerator name='AKDT' value='5'/>
          <enumerator name='A_WST' value='21'/>
          <enumerator name='A_CST' value='27'/>
          <enumerator name='A_EST' value='23'/>
          <enumerator name='A_ESST' value='24'/>
          <enumerator name='NZST' value='25'/>
          <enumerator name='NZDT' value='26'/>
          <enumerator name='UTC' value='13'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='Calendar' filepath='include/wx/datetime.h' line='212' column='1' id='type-id-646'>
          <underlying-type type-id='type-id-572'/>
          <enumerator name='Gregorian' value='0'/>
          <enumerator name='Julian' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='Country' filepath='include/wx/datetime.h' line='226' column='1' id='type-id-647'>
          <underlying-type type-id='type-id-572'/>
          <enumerator name='Country_Unknown' value='0'/>
          <enumerator name='Country_Default' value='1'/>
          <enumerator name='Country_WesternEurope_Start' value='2'/>
          <enumerator name='Country_EEC' value='2'/>
          <enumerator name='France' value='3'/>
          <enumerator name='Germany' value='4'/>
          <enumerator name='UK' value='5'/>
          <enumerator name='Country_WesternEurope_End' value='5'/>
          <enumerator name='Russia' value='6'/>
          <enumerator name='USA' value='7'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='Month' filepath='include/wx/datetime.h' line='248' column='1' id='type-id-648'>
          <underlying-type type-id='type-id-572'/>
          <enumerator name='Jan' value='0'/>
          <enumerator name='Feb' value='1'/>
          <enumerator name='Mar' value='2'/>
          <enumerator name='Apr' value='3'/>
          <enumerator name='May' value='4'/>
          <enumerator name='Jun' value='5'/>
          <enumerator name='Jul' value='6'/>
          <enumerator name='Aug' value='7'/>
          <enumerator name='Sep' value='8'/>
          <enumerator name='Oct' value='9'/>
          <enumerator name='Nov' value='10'/>
          <enumerator name='Dec' value='11'/>
          <enumerator name='Inv_Month' value='12'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='WeekDay' filepath='include/wx/datetime.h' line='254' column='1' id='type-id-649'>
          <underlying-type type-id='type-id-572'/>
          <enumerator name='Sun' value='0'/>
          <enumerator name='Mon' value='1'/>
          <enumerator name='Tue' value='2'/>
          <enumerator name='Wed' value='3'/>
          <enumerator name='Thu' value='4'/>
          <enumerator name='Fri' value='5'/>
          <enumerator name='Sat' value='6'/>
          <enumerator name='Inv_WeekDay' value='7'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='NameFlags' filepath='include/wx/datetime.h' line='266' column='1' id='type-id-650'>
          <underlying-type type-id='type-id-572'/>
          <enumerator name='Name_Full' value='1'/>
          <enumerator name='Name_Abbr' value='2'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='WeekFlags' filepath='include/wx/datetime.h' line='273' column='1' id='type-id-651'>
          <underlying-type type-id='type-id-572'/>
          <enumerator name='Default_First' value='0'/>
          <enumerator name='Monday_First' value='1'/>
          <enumerator name='Sunday_First' value='2'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='TimeZone' size-in-bits='64' visibility='default' filepath='include/wx/datetime.h' line='294' column='1' id='type-id-652'>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_offset' type-id='type-id-568' visibility='default' filepath='include/wx/datetime.h' line='315' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='Tm' size-in-bits='320' is-struct='yes' visibility='default' filepath='include/wx/datetime.h' line='325' column='1' id='type-id-653'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='msec' type-id='type-id-644' visibility='default' filepath='include/wx/datetime.h' line='327' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='16'>
            <var-decl name='sec' type-id='type-id-644' visibility='default' filepath='include/wx/datetime.h' line='327' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='32'>
            <var-decl name='min' type-id='type-id-644' visibility='default' filepath='include/wx/datetime.h' line='327' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='48'>
            <var-decl name='hour' type-id='type-id-644' visibility='default' filepath='include/wx/datetime.h' line='327' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='mday' type-id='type-id-644' visibility='default' filepath='include/wx/datetime.h' line='328' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='80'>
            <var-decl name='yday' type-id='type-id-644' visibility='default' filepath='include/wx/datetime.h' line='329' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='96'>
            <var-decl name='mon' type-id='type-id-648' visibility='default' filepath='include/wx/datetime.h' line='330' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='year' type-id='type-id-130' visibility='default' filepath='include/wx/datetime.h' line='331' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='192'>
            <var-decl name='m_tz' type-id='type-id-652' visibility='default' filepath='include/wx/datetime.h' line='362' column='1'/>
          </data-member>
          <data-member access='private' layout-offset-in-bits='256'>
            <var-decl name='wday' type-id='type-id-644' visibility='default' filepath='include/wx/datetime.h' line='367' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_time' type-id='type-id-654' visibility='default' filepath='include/wx/datetime.h' line='1160' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxTimeSpan' size-in-bits='64' visibility='default' filepath='include/wx/datetime.h' line='1169' column='1' id='type-id-655'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_diff' type-id='type-id-654' visibility='default' filepath='include/wx/datetime.h' line='1357' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxDateSpan' size-in-bits='128' visibility='default' filepath='include/wx/datetime.h' line='1395' column='1' id='type-id-656'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_years' type-id='type-id-130' visibility='default' filepath='include/wx/datetime.h' line='1518' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='m_months' type-id='type-id-130' visibility='default' filepath='include/wx/datetime.h' line='1519' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_weeks' type-id='type-id-130' visibility='default' filepath='include/wx/datetime.h' line='1520' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='96'>
        <var-decl name='m_days' type-id='type-id-130' visibility='default' filepath='include/wx/datetime.h' line='1521' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxBorder' filepath='include/wx/defs.h' line='1443' column='1' id='type-id-657'>
      <underlying-type type-id='type-id-572'/>
      <enumerator name='wxBORDER_DEFAULT' value='0'/>
      <enumerator name='wxBORDER_NONE' value='2097152'/>
      <enumerator name='wxBORDER_STATIC' value='16777216'/>
      <enumerator name='wxBORDER_SIMPLE' value='33554432'/>
      <enumerator name='wxBORDER_RAISED' value='67108864'/>
      <enumerator name='wxBORDER_SUNKEN' value='134217728'/>
      <enumerator name='wxBORDER_DOUBLE' value='268435456'/>
      <enumerator name='wxBORDER_THEME' value='268435456'/>
      <enumerator name='wxBORDER_MASK' value='522190848'/>
    </enum-decl>
    <enum-decl name='wxBackgroundStyle' filepath='include/wx/defs.h' line='1816' column='1' id='type-id-658'>
      <underlying-type type-id='type-id-572'/>
      <enumerator name='wxBG_STYLE_ERASE' value='0'/>
      <enumerator name='wxBG_STYLE_SYSTEM' value='1'/>
      <enumerator name='wxBG_STYLE_PAINT' value='2'/>
      <enumerator name='wxBG_STYLE_TRANSPARENT' value='3'/>
      <enumerator name='wxBG_STYLE_COLOUR' value='4'/>
      <enumerator name='wxBG_STYLE_CUSTOM' value='2'/>
    </enum-decl>
    <typedef-decl name='wxWindowID' type-id='type-id-130' filepath='include/wx/defs.h' line='2069' column='1' id='type-id-659'/>
    <enum-decl name='wxHitTest' filepath='include/wx/defs.h' line='2099' column='1' id='type-id-660'>
      <underlying-type type-id='type-id-572'/>
      <enumerator name='wxHT_NOWHERE' value='0'/>
      <enumerator name='wxHT_SCROLLBAR_FIRST' value='0'/>
      <enumerator name='wxHT_SCROLLBAR_ARROW_LINE_1' value='1'/>
      <enumerator name='wxHT_SCROLLBAR_ARROW_LINE_2' value='2'/>
      <enumerator name='wxHT_SCROLLBAR_ARROW_PAGE_1' value='3'/>
      <enumerator name='wxHT_SCROLLBAR_ARROW_PAGE_2' value='4'/>
      <enumerator name='wxHT_SCROLLBAR_THUMB' value='5'/>
      <enumerator name='wxHT_SCROLLBAR_BAR_1' value='6'/>
      <enumerator name='wxHT_SCROLLBAR_BAR_2' value='7'/>
      <enumerator name='wxHT_SCROLLBAR_LAST' value='8'/>
      <enumerator name='wxHT_WINDOW_OUTSIDE' value='9'/>
      <enumerator name='wxHT_WINDOW_INSIDE' value='10'/>
      <enumerator name='wxHT_WINDOW_VERT_SCROLLBAR' value='11'/>
      <enumerator name='wxHT_WINDOW_HORZ_SCROLLBAR' value='12'/>
      <enumerator name='wxHT_WINDOW_CORNER' value='13'/>
      <enumerator name='wxHT_MAX' value='14'/>
    </enum-decl>
    <typedef-decl name='GSList' type-id='type-id-661' filepath='include/wx/defs.h' line='3070' column='1' id='type-id-662'/>
    <typedef-decl name='GdkColor' type-id='type-id-663' filepath='include/wx/defs.h' line='3073' column='1' id='type-id-543'/>
    <typedef-decl name='GdkWindow' type-id='type-id-664' filepath='include/wx/defs.h' line='3091' column='1' id='type-id-665'/>
    <typedef-decl name='GtkWidget' type-id='type-id-666' filepath='include/wx/defs.h' line='3103' column='1' id='type-id-667'/>
    <typedef-decl name='GtkRcStyle' type-id='type-id-668' filepath='include/wx/defs.h' line='3104' column='1' id='type-id-669'/>
    <typedef-decl name='WXWidget' type-id='type-id-670' filepath='include/wx/defs.h' line='3115' column='1' id='type-id-671'/>
    <typedef-decl name='PangoFontDescription' type-id='type-id-672' filepath='include/wx/defs.h' line='3134' column='1' id='type-id-673'/>
    <class-decl name='wxDir' size-in-bits='64' visibility='default' filepath='include/wx/dir.h' line='91' column='1' id='type-id-674'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-675' visibility='default' filepath='include/wx/dir.h' line='185' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArray_SortFunction&lt;_GdkWindow*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-676'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-678' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-677'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-677' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArray_SortFunction&lt;const wxEventTableEntry*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-679'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-681' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-680'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-680' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArray_SortFunction&lt;wxDynamicLibraryDetails*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-682'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-684' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-683'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-683' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;_GdkWindow*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-685'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-687' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-686'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-686' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;const wxEventTableEntry*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-688'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-690' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-689'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-689' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;wxDynamicLibraryDetails*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-691'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-693' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-692'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-692' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxBaseArray&lt;_GdkWindow*, wxSortedArray_SortFunction&lt;_GdkWindow*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-694'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-695'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-686' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-696'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-677' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-697'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-699' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-698'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseArray&lt;const wxEventTableEntry*, wxSortedArray_SortFunction&lt;const wxEventTableEntry*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-700'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-701'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-689' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-702'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-680' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-703'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-705' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-704'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseArray&lt;wxDynamicLibraryDetails*, wxSortedArray_SortFunction&lt;wxDynamicLibraryDetails*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-706'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-707'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-692' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-708'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-683' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-709'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-711' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-710'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseObjectArray&lt;wxDynamicLibraryDetails, wxObjectArrayTraitsForwxDynamicLibraryDetailsArray&gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='276' column='1' id='type-id-712'>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-706'/>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-684' filepath='include/wx/dynarray.h' line='283' column='1' id='type-id-713'/>
      </member-type>
    </class-decl>
    <typedef-decl name='wxDllType' type-id='type-id-403' filepath='include/wx/dynlib.h' line='31' column='1' id='type-id-714'/>
    <enum-decl name='wxDynamicLibraryCategory' filepath='include/wx/dynlib.h' line='72' column='1' id='type-id-715'>
      <underlying-type type-id='type-id-572'/>
      <enumerator name='wxDL_LIBRARY' value='0'/>
      <enumerator name='wxDL_MODULE' value='1'/>
    </enum-decl>
    <enum-decl name='wxPluginCategory' filepath='include/wx/dynlib.h' line='78' column='1' id='type-id-716'>
      <underlying-type type-id='type-id-572'/>
      <enumerator name='wxDL_PLUGIN_GUI' value='0'/>
      <enumerator name='wxDL_PLUGIN_BASE' value='1'/>
    </enum-decl>
    <class-decl name='wxDynamicLibraryDetails' size-in-bits='1280' visibility='default' filepath='include/wx/dynlib.h' line='160' column='1' id='type-id-717'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_name' type-id='type-id-36' visibility='default' filepath='include/wx/dynlib.h' line='195' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_path' type-id='type-id-36' visibility='default' filepath='include/wx/dynlib.h' line='196' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='m_version' type-id='type-id-36' visibility='default' filepath='include/wx/dynlib.h' line='197' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1152'>
        <var-decl name='m_address' type-id='type-id-403' visibility='default' filepath='include/wx/dynlib.h' line='199' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1216'>
        <var-decl name='m_length' type-id='type-id-60' visibility='default' filepath='include/wx/dynlib.h' line='200' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxDynamicLibraryDetailsArray' size-in-bits='192' visibility='default' filepath='include/wx/dynlib.h' line='205' column='1' id='type-id-718'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-712'/>
    </class-decl>
    <class-decl name='wxDynamicLibrary' size-in-bits='64' visibility='default' filepath='include/wx/dynlib.h' line='213' column='1' id='type-id-719'>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_handle' type-id='type-id-714' visibility='default' filepath='include/wx/dynlib.h' line='365' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxEventType' type-id='type-id-130' filepath='include/wx/event.h' line='77' column='1' id='type-id-720'/>
    <class-decl name='wxEventTypeTag&lt;wxWebViewEvent&gt;' size-in-bits='32' visibility='default' filepath='include/wx/event.h' line='202' column='1' id='type-id-721'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_type' type-id='type-id-720' visibility='default' filepath='include/wx/event.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxObjectEventFunctor' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='258' column='1' id='type-id-722'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-723'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-724' visibility='default' filepath='include/wx/event.h' line='288' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxObjectEventFunctorclEP12wxEvtHandlerR7wxEvent' filepath='include/wx/event.h' line='4105' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-725' is-artificial='yes'/>
          <parameter type-id='type-id-724'/>
          <parameter type-id='type-id-726'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxObjectEventFunctor10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-727' is-artificial='yes'/>
          <parameter type-id='type-id-728'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxObjectEventFunctor13GetEvtHandlerEv' filepath='include/wx/event.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-727' is-artificial='yes'/>
          <return type-id='type-id-724'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxObjectEventFunctor12GetEvtMethodEv' filepath='include/wx/event.h' line='284' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-727' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='wxEventCategory' filepath='include/wx/event.h' line='911' column='1' id='type-id-729'>
      <underlying-type type-id='type-id-572'/>
      <enumerator name='wxEVT_CATEGORY_UI' value='1'/>
      <enumerator name='wxEVT_CATEGORY_USER_INPUT' value='2'/>
      <enumerator name='wxEVT_CATEGORY_SOCKET' value='4'/>
      <enumerator name='wxEVT_CATEGORY_TIMER' value='8'/>
      <enumerator name='wxEVT_CATEGORY_THREAD' value='16'/>
      <enumerator name='wxEVT_CATEGORY_UNKNOWN' value='32'/>
      <enumerator name='wxEVT_CATEGORY_CLIPBOARD' value='64'/>
      <enumerator name='wxEVT_CATEGORY_NATIVE_EVENTS' value='3'/>
      <enumerator name='wxEVT_CATEGORY_ALL' value='127'/>
    </enum-decl>
    <class-decl name='wxEventBasicPayloadMixin' size-in-bits='512' visibility='default' filepath='include/wx/event.h' line='1254' column='1' id='type-id-730'>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_cmdString' type-id='type-id-36' visibility='default' filepath='include/wx/event.h' line='1275' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='384'>
        <var-decl name='m_commandInt' type-id='type-id-130' visibility='default' filepath='include/wx/event.h' line='1276' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='448'>
        <var-decl name='m_extraLong' type-id='type-id-568' visibility='default' filepath='include/wx/event.h' line='1277' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTableEntryBase' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3469' column='1' id='type-id-731'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_id' type-id='type-id-130' visibility='default' filepath='include/wx/event.h' line='3504' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='m_lastId' type-id='type-id-130' visibility='default' filepath='include/wx/event.h' line='3505' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='m_fn' type-id='type-id-732' visibility='default' filepath='include/wx/event.h' line='3508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='m_callbackUserData' type-id='type-id-733' visibility='default' filepath='include/wx/event.h' line='3511' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTableEntry' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3518' column='1' id='type-id-734'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-731'/>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_eventType' type-id='type-id-735' visibility='default' filepath='include/wx/event.h' line='3532' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxDynamicEventTableEntry' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3539' column='1' id='type-id-736'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-731'/>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_eventType' type-id='type-id-130' visibility='default' filepath='include/wx/event.h' line='3550' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTable' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3560' column='1' id='type-id-737'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='baseTable' type-id='type-id-738' visibility='default' filepath='include/wx/event.h' line='3562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='entries' type-id='type-id-739' visibility='default' filepath='include/wx/event.h' line='3563' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTableEntryPointerArray' size-in-bits='192' visibility='default' filepath='include/wx/event.h' line='3570' column='1' id='type-id-740'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-700'/>
    </class-decl>
    <class-decl name='wxEventHashTable' size-in-bits='384' visibility='default' filepath='include/wx/event.h' line='3572' column='1' id='type-id-741'>
      <member-type access='private'>
        <class-decl name='EventTypeTable' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3576' column='1' id='type-id-742'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='eventType' type-id='type-id-720' visibility='default' filepath='include/wx/event.h' line='3578' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='eventEntryTable' type-id='type-id-740' visibility='default' filepath='include/wx/event.h' line='3579' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='EventTypeTablePointer' type-id='type-id-744' filepath='include/wx/event.h' line='3581' column='1' id='type-id-743'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_table' type-id='type-id-745' visibility='default' filepath='include/wx/event.h' line='3617' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_rebuildHash' type-id='type-id-34' visibility='default' filepath='include/wx/event.h' line='3618' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_size' type-id='type-id-60' visibility='default' filepath='include/wx/event.h' line='3620' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_eventTypeTable' type-id='type-id-746' visibility='default' filepath='include/wx/event.h' line='3621' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='256'>
        <var-decl name='m_previous' type-id='type-id-747' visibility='default' filepath='include/wx/event.h' line='3624' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='320'>
        <var-decl name='m_next' type-id='type-id-747' visibility='default' filepath='include/wx/event.h' line='3625' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxFile' size-in-bits='64' visibility='default' filepath='include/wx/file.h' line='30' column='1' id='type-id-748'>
      <member-type access='public'>
        <enum-decl name='OpenMode' filepath='include/wx/file.h' line='39' column='1' id='type-id-749'>
          <underlying-type type-id='type-id-572'/>
          <enumerator name='read' value='0'/>
          <enumerator name='write' value='1'/>
          <enumerator name='read_write' value='2'/>
          <enumerator name='write_append' value='3'/>
          <enumerator name='write_excl' value='4'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_fd' type-id='type-id-130' visibility='default' filepath='include/wx/file.h' line='131' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='32'>
        <var-decl name='m_lasterror' type-id='type-id-130' visibility='default' filepath='include/wx/file.h' line='132' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxSeekMode' filepath='include/wx/filefn.h' line='55' column='1' id='type-id-750'>
      <underlying-type type-id='type-id-572'/>
      <enumerator name='wxFromStart' value='0'/>
      <enumerator name='wxFromCurrent' value='1'/>
      <enumerator name='wxFromEnd' value='2'/>
    </enum-decl>
    <enum-decl name='wxFileKind' filepath='include/wx/filefn.h' line='62' column='1' id='type-id-751'>
      <underlying-type type-id='type-id-572'/>
      <enumerator name='wxFILE_KIND_UNKNOWN' value='0'/>
      <enumerator name='wxFILE_KIND_DISK' value='1'/>
      <enumerator name='wxFILE_KIND_TERMINAL' value='2'/>
      <enumerator name='wxFILE_KIND_PIPE' value='3'/>
    </enum-decl>
    <typedef-decl name='wxFileOffset' type-id='type-id-752' filepath='include/wx/filefn.h' line='343' column='1' id='type-id-753'/>
    <enum-decl name='wxPathFormat' filepath='include/wx/filename.h' line='42' column='1' id='type-id-754'>
      <underlying-type type-id='type-id-572'/>
      <enumerator name='wxPATH_NATIVE' value='0'/>
      <enumerator name='wxPATH_UNIX' value='1'/>
      <enumerator name='wxPATH_BEOS' value='1'/>
      <enumerator name='wxPATH_MAC' value='2'/>
      <enumerator name='wxPATH_DOS' value='3'/>
      <enumerator name='wxPATH_WIN' value='3'/>
      <enumerator name='wxPATH_OS2' value='3'/>
      <enumerator name='wxPATH_VMS' value='4'/>
      <enumerator name='wxPATH_MAX' value='5'/>
    </enum-decl>
    <enum-decl name='wxSizeConvention' filepath='include/wx/filename.h' line='57' column='1' id='type-id-755'>
      <underlying-type type-id='type-id-572'/>
      <enumerator name='wxSIZE_CONV_TRADITIONAL' value='0'/>
      <enumerator name='wxSIZE_CONV_IEC' value='1'/>
      <enumerator name='wxSIZE_CONV_SI' value='2'/>
    </enum-decl>
    <class-decl name='wxFileName' size-in-bits='1536' visibility='default' filepath='include/wx/filename.h' line='136' column='1' id='type-id-756'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_volume' type-id='type-id-36' visibility='default' filepath='include/wx/filename.h' line='644' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_dirs' type-id='type-id-582' visibility='default' filepath='include/wx/filename.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='704'>
        <var-decl name='m_name' type-id='type-id-36' visibility='default' filepath='include/wx/filename.h' line='650' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1088'>
        <var-decl name='m_ext' type-id='type-id-36' visibility='default' filepath='include/wx/filename.h' line='651' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1472'>
        <var-decl name='m_relative' type-id='type-id-34' visibility='default' filepath='include/wx/filename.h' line='661' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1480'>
        <var-decl name='m_hasExt' type-id='type-id-34' visibility='default' filepath='include/wx/filename.h' line='668' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1488'>
        <var-decl name='m_dontFollowLinks' type-id='type-id-34' visibility='default' filepath='include/wx/filename.h' line='673' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSize' size-in-bits='64' visibility='default' filepath='include/wx/gdicmn.h' line='282' column='1' id='type-id-757'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-130' visibility='default' filepath='include/wx/gdicmn.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-130' visibility='default' filepath='include/wx/gdicmn.h' line='286' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRealPoint' size-in-bits='128' visibility='default' filepath='include/wx/gdicmn.h' line='459' column='1' id='type-id-758'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-563' visibility='default' filepath='include/wx/gdicmn.h' line='462' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='y' type-id='type-id-563' visibility='default' filepath='include/wx/gdicmn.h' line='463' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxPoint' size-in-bits='64' visibility='default' filepath='include/wx/gdicmn.h' line='577' column='1' id='type-id-759'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-130' visibility='default' filepath='include/wx/gdicmn.h' line='580' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-130' visibility='default' filepath='include/wx/gdicmn.h' line='580' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRect' size-in-bits='128' visibility='default' filepath='include/wx/gdicmn.h' line='733' column='1' id='type-id-760'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-130' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-130' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='width' type-id='type-id-130' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='height' type-id='type-id-130' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxGtkError' size-in-bits='64' visibility='default' filepath='include/wx/gtk/private/error.h' line='20' column='1' id='type-id-761'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_error' type-id='type-id-762' visibility='default' filepath='include/wx/gtk/private/error.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxWebKitJavascriptResult' size-in-bits='64' visibility='default' filepath='include/wx/gtk/private/webkit.h' line='22' column='1' id='type-id-763'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_jsresult' type-id='type-id-764' visibility='default' filepath='include/wx/gtk/private/webkit.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxJSStringRef' size-in-bits='64' visibility='default' filepath='include/wx/gtk/private/webkit.h' line='48' column='1' id='type-id-765'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_jssref' type-id='type-id-766' visibility='default' filepath='include/wx/gtk/private/webkit.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='WebKitWebView' type-id='type-id-767' filepath='include/wx/gtk/webview_webkit.h' line='24' column='1' id='type-id-768'/>
    <class-decl name='wxWebViewWebKit' size-in-bits='8384' visibility='default' filepath='include/wx/gtk/webview_webkit.h' line='32' column='1' id='type-id-769'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-770'/>
      <data-member access='public' layout-offset-in-bits='6528'>
        <var-decl name='m_busy' type-id='type-id-34' visibility='default' filepath='include/wx/gtk/webview_webkit.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='m_vfsurl' type-id='type-id-36' visibility='default' filepath='include/wx/gtk/webview_webkit.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6976'>
        <var-decl name='m_guard' type-id='type-id-34' visibility='default' filepath='include/wx/gtk/webview_webkit.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6984'>
        <var-decl name='m_creating' type-id='type-id-34' visibility='default' filepath='include/wx/gtk/webview_webkit.h' line='156' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='7040'>
        <var-decl name='m_web_view' type-id='type-id-771' visibility='default' filepath='include/wx/gtk/webview_webkit.h' line='187' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='7104'>
        <var-decl name='m_customUserAgent' type-id='type-id-36' visibility='default' filepath='include/wx/gtk/webview_webkit.h' line='188' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='7488'>
        <var-decl name='m_historyLimit' type-id='type-id-130' visibility='default' filepath='include/wx/gtk/webview_webkit.h' line='189' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='7552'>
        <var-decl name='m_handlerList' type-id='type-id-772' visibility='default' filepath='include/wx/gtk/webview_webkit.h' line='191' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='7744'>
        <var-decl name='m_findFlags' type-id='type-id-130' visibility='default' filepath='include/wx/gtk/webview_webkit.h' line='194' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='7808'>
        <var-decl name='m_findText' type-id='type-id-36' visibility='default' filepath='include/wx/gtk/webview_webkit.h' line='195' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='8192'>
        <var-decl name='m_findPosition' type-id='type-id-130' visibility='default' filepath='include/wx/gtk/webview_webkit.h' line='196' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='8224'>
        <var-decl name='m_findCount' type-id='type-id-130' visibility='default' filepath='include/wx/gtk/webview_webkit.h' line='197' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='8256'>
        <var-decl name='m_dbusServer' type-id='type-id-773' visibility='default' filepath='include/wx/gtk/webview_webkit.h' line='201' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='8320'>
        <var-decl name='m_extension' type-id='type-id-774' visibility='default' filepath='include/wx/gtk/webview_webkit.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-775' mangled-name='_ZN15wxWebViewWebKit12ms_classInfoE' visibility='default' filepath='src/gtk/webview_webkit2.cpp' line='608' column='1' elf-symbol-id='_ZN15wxWebViewWebKit12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <member-function access='private' const='yes'>
        <function-decl name='GetExtensionProxy' mangled-name='_ZNK15wxWebViewWebKit17GetExtensionProxyEv' filepath='src/gtk/webview_webkit2.cpp' line='1510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit17GetExtensionProxyEv@@WXU_3.2'>
          <parameter type-id='type-id-776' name='this' is-artificial='yes'/>
          <return type-id='type-id-774'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='SetupWebExtensionServer' mangled-name='_ZN15wxWebViewWebKit23SetupWebExtensionServerEv' filepath='src/gtk/webview_webkit2.cpp' line='1476' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit23SetupWebExtensionServerEv@@WXU_3.2'>
          <parameter type-id='type-id-777' name='this' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='GetClassDefaultAttributes' mangled-name='_ZN15wxWebViewWebKit25GetClassDefaultAttributesE15wxWindowVariant' filepath='src/gtk/webview_webkit2.cpp' line='1471' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit25GetClassDefaultAttributesE15wxWindowVariant@@WXU_3.2'>
          <parameter type-id='type-id-778'/>
          <return type-id='type-id-779'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='FindClear' mangled-name='_ZN15wxWebViewWebKit9FindClearEv' filepath='src/gtk/webview_webkit2.cpp' line='1461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit9FindClearEv@@WXU_3.2'>
          <parameter type-id='type-id-777' name='this' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='ProcessJavaScriptResult' mangled-name='_ZNK15wxWebViewWebKit23ProcessJavaScriptResultEP13_GAsyncResultP23wxWebKitRunScriptParams' filepath='src/gtk/webview_webkit2.cpp' line='1254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit23ProcessJavaScriptResultEP13_GAsyncResultP23wxWebKitRunScriptParams@@WXU_3.2'>
          <parameter type-id='type-id-776' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-780' name='res' filepath='src/gtk/webview_webkit2.cpp' line='1254' column='1'/>
          <parameter type-id='type-id-781' name='params' filepath='src/gtk/webview_webkit2.cpp' line='1254' column='1'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='CanExecuteEditingCommand' mangled-name='_ZNK15wxWebViewWebKit24CanExecuteEditingCommandEPKc' filepath='src/gtk/webview_webkit2.cpp' line='889' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit24CanExecuteEditingCommandEPKc@@WXU_3.2'>
          <parameter type-id='type-id-776' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-782' name='command' filepath='src/gtk/webview_webkit2.cpp' line='889' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='private' const='yes'>
        <function-decl name='GetWebkitZoom' mangled-name='_ZNK15wxWebViewWebKit13GetWebkitZoomEv' filepath='src/gtk/webview_webkit2.cpp' line='745' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit13GetWebkitZoomEv@@WXU_3.2'>
          <parameter type-id='type-id-776' name='this' is-artificial='yes'/>
          <return type-id='type-id-564'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='SetWebkitZoom' mangled-name='_ZN15wxWebViewWebKit13SetWebkitZoomEf' filepath='src/gtk/webview_webkit2.cpp' line='740' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit13SetWebkitZoomEf@@WXU_3.2'>
          <parameter type-id='type-id-777' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-564' name='level' filepath='src/gtk/webview_webkit2.cpp' line='740' column='1'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='ZoomOut' mangled-name='_ZN15wxWebViewWebKit7ZoomOutEv' filepath='src/gtk/webview_webkit2.cpp' line='735' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit7ZoomOutEv@@WXU_3.2'>
          <parameter type-id='type-id-777' name='this' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='ZoomIn' mangled-name='_ZN15wxWebViewWebKit6ZoomInEv' filepath='src/gtk/webview_webkit2.cpp' line='730' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit6ZoomInEv@@WXU_3.2'>
          <parameter type-id='type-id-777' name='this' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxWebViewWebKit' mangled-name='_ZN15wxWebViewWebKitC2Ev' filepath='src/gtk/webview_webkit2.cpp' line='610' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKitC2Ev@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='wxCreateObject' mangled-name='_ZN15wxWebViewWebKit14wxCreateObjectEv' filepath='src/gtk/webview_webkit2.cpp' line='608' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit14wxCreateObjectEv@@WXU_3.2'>
          <return type-id='type-id-733'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWebViewWebKit' mangled-name='_ZN15wxWebViewWebKitD4Ev' filepath='src/gtk/webview_webkit2.cpp' line='699' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWebViewWebKit' mangled-name='_ZN15wxWebViewWebKitD0Ev' filepath='src/gtk/webview_webkit2.cpp' line='699' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKitD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWebViewWebKit' mangled-name='_ZN15wxWebViewWebKitD2Ev' filepath='src/gtk/webview_webkit2.cpp' line='699' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKitD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK15wxWebViewWebKit12GetClassInfoEv' filepath='src/gtk/webview_webkit2.cpp' line='608' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-784' is-artificial='yes'/>
          <return type-id='type-id-539'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='61'>
        <function-decl name='Enable' mangled-name='_ZN15wxWebViewWebKit6EnableEb' filepath='src/gtk/webview_webkit2.cpp' line='713' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit6EnableEb@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='199'>
        <function-decl name='GTKGetWindow' mangled-name='_ZNK15wxWebViewWebKit12GTKGetWindowER17wxArrayGdkWindows' filepath='src/gtk/webview_webkit2.cpp' line='724' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit12GTKGetWindowER17wxArrayGdkWindows@@WXU_3.2'>
          <parameter type-id='type-id-784' is-artificial='yes'/>
          <parameter type-id='type-id-785'/>
          <return type-id='type-id-786'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='212'>
        <function-decl name='Create' mangled-name='_ZN15wxWebViewWebKit6CreateEP8wxWindowiRK8wxStringRK7wxPointRK6wxSizelS4_' filepath='src/gtk/webview_webkit2.cpp' line='617' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit6CreateEP8wxWindowiRK8wxStringRK7wxPointRK6wxSizelS4_@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <parameter type-id='type-id-787'/>
          <parameter type-id='type-id-659'/>
          <parameter type-id='type-id-463'/>
          <parameter type-id='type-id-788'/>
          <parameter type-id='type-id-789'/>
          <parameter type-id='type-id-568'/>
          <parameter type-id='type-id-463'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='213'>
        <function-decl name='EnableContextMenu' mangled-name='_ZN15wxWebViewWebKit17EnableContextMenuEb' filepath='src/gtk/webview_webkit2.cpp' line='1359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit17EnableContextMenuEb@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='214'>
        <function-decl name='EnableAccessToDevTools' mangled-name='_ZN15wxWebViewWebKit22EnableAccessToDevToolsEb' filepath='src/gtk/webview_webkit2.cpp' line='750' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit22EnableAccessToDevToolsEb@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='215'>
        <function-decl name='GetCurrentTitle' mangled-name='_ZNK15wxWebViewWebKit15GetCurrentTitleEv' filepath='src/gtk/webview_webkit2.cpp' line='975' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit15GetCurrentTitleEv@@WXU_3.2'>
          <parameter type-id='type-id-784' is-artificial='yes'/>
          <return type-id='type-id-36'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='216'>
        <function-decl name='GetCurrentURL' mangled-name='_ZNK15wxWebViewWebKit13GetCurrentURLEv' filepath='src/gtk/webview_webkit2.cpp' line='967' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit13GetCurrentURLEv@@WXU_3.2'>
          <parameter type-id='type-id-784' is-artificial='yes'/>
          <return type-id='type-id-36'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='217'>
        <function-decl name='GetPageSource' mangled-name='_ZNK15wxWebViewWebKit13GetPageSourceEv' filepath='src/gtk/webview_webkit2.cpp' line='992' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit13GetPageSourceEv@@WXU_3.2'>
          <parameter type-id='type-id-784' is-artificial='yes'/>
          <return type-id='type-id-36'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='218'>
        <function-decl name='GetPageText' mangled-name='_ZNK15wxWebViewWebKit11GetPageTextEv' filepath='src/gtk/webview_webkit2.cpp' line='1212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit11GetPageTextEv@@WXU_3.2'>
          <parameter type-id='type-id-784' is-artificial='yes'/>
          <return type-id='type-id-36'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='219'>
        <function-decl name='IsBusy' mangled-name='_ZNK15wxWebViewWebKit6IsBusyEv' filepath='src/gtk/webview_webkit2.cpp' line='1078' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit6IsBusyEv@@WXU_3.2'>
          <parameter type-id='type-id-784' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='221'>
        <function-decl name='IsAccessToDevToolsEnabled' mangled-name='_ZNK15wxWebViewWebKit25IsAccessToDevToolsEnabledEv' filepath='src/gtk/webview_webkit2.cpp' line='756' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit25IsAccessToDevToolsEnabledEv@@WXU_3.2'>
          <parameter type-id='type-id-784' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='222'>
        <function-decl name='IsEditable' mangled-name='_ZNK15wxWebViewWebKit10IsEditableEv' filepath='src/gtk/webview_webkit2.cpp' line='1093' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit10IsEditableEv@@WXU_3.2'>
          <parameter type-id='type-id-784' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='223'>
        <function-decl name='LoadURL' mangled-name='_ZN15wxWebViewWebKit7LoadURLERK8wxString' filepath='src/gtk/webview_webkit2.cpp' line='791' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit7LoadURLERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <parameter type-id='type-id-463'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='224'>
        <function-decl name='Print' mangled-name='_ZN15wxWebViewWebKit5PrintEv' filepath='src/gtk/webview_webkit2.cpp' line='1070' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit5PrintEv@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='225'>
        <function-decl name='RegisterHandler' mangled-name='_ZN15wxWebViewWebKit15RegisterHandlerE11wxSharedPtrI16wxWebViewHandlerE' filepath='src/gtk/webview_webkit2.cpp' line='1350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit15RegisterHandlerE11wxSharedPtrI16wxWebViewHandlerE@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <parameter type-id='type-id-790'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='226'>
        <function-decl name='Reload' mangled-name='_ZN15wxWebViewWebKit6ReloadE20wxWebViewReloadFlags' filepath='src/gtk/webview_webkit2.cpp' line='779' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit6ReloadE20wxWebViewReloadFlags@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <parameter type-id='type-id-791'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='227'>
        <function-decl name='SetUserAgent' mangled-name='_ZN15wxWebViewWebKit12SetUserAgentERK8wxString' filepath='src/gtk/webview_webkit2.cpp' line='762' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit12SetUserAgentERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <parameter type-id='type-id-463'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='230'>
        <function-decl name='RunScriptAsync' mangled-name='_ZNK15wxWebViewWebKit14RunScriptAsyncERK8wxStringPv' filepath='src/gtk/webview_webkit2.cpp' line='1283' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit14RunScriptAsyncERK8wxStringPv@@WXU_3.2'>
          <parameter type-id='type-id-784' is-artificial='yes'/>
          <parameter type-id='type-id-463'/>
          <parameter type-id='type-id-403'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='231'>
        <function-decl name='AddScriptMessageHandler' mangled-name='_ZN15wxWebViewWebKit23AddScriptMessageHandlerERK8wxString' filepath='src/gtk/webview_webkit2.cpp' line='1299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit23AddScriptMessageHandlerERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <parameter type-id='type-id-463'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='232'>
        <function-decl name='RemoveScriptMessageHandler' mangled-name='_ZN15wxWebViewWebKit26RemoveScriptMessageHandlerERK8wxString' filepath='src/gtk/webview_webkit2.cpp' line='1320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit26RemoveScriptMessageHandlerERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <parameter type-id='type-id-463'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='233'>
        <function-decl name='AddUserScript' mangled-name='_ZN15wxWebViewWebKit13AddUserScriptERK8wxString32wxWebViewUserScriptInjectionTime' filepath='src/gtk/webview_webkit2.cpp' line='1327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit13AddUserScriptERK8wxString32wxWebViewUserScriptInjectionTime@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <parameter type-id='type-id-463'/>
          <parameter type-id='type-id-792'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='234'>
        <function-decl name='RemoveAllUserScripts' mangled-name='_ZN15wxWebViewWebKit20RemoveAllUserScriptsEv' filepath='src/gtk/webview_webkit2.cpp' line='1344' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit20RemoveAllUserScriptsEv@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='235'>
        <function-decl name='SetEditable' mangled-name='_ZN15wxWebViewWebKit11SetEditableEb' filepath='src/gtk/webview_webkit2.cpp' line='1083' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit11SetEditableEb@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='236'>
        <function-decl name='Stop' mangled-name='_ZN15wxWebViewWebKit4StopEv' filepath='src/gtk/webview_webkit2.cpp' line='774' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit4StopEv@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='237'>
        <function-decl name='CanGoBack' mangled-name='_ZNK15wxWebViewWebKit9CanGoBackEv' filepath='src/gtk/webview_webkit2.cpp' line='808' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit9CanGoBackEv@@WXU_3.2'>
          <parameter type-id='type-id-784' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='238'>
        <function-decl name='CanGoForward' mangled-name='_ZNK15wxWebViewWebKit12CanGoForwardEv' filepath='src/gtk/webview_webkit2.cpp' line='814' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit12CanGoForwardEv@@WXU_3.2'>
          <parameter type-id='type-id-784' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='239'>
        <function-decl name='GoBack' mangled-name='_ZN15wxWebViewWebKit6GoBackEv' filepath='src/gtk/webview_webkit2.cpp' line='797' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit6GoBackEv@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='240'>
        <function-decl name='GoForward' mangled-name='_ZN15wxWebViewWebKit9GoForwardEv' filepath='src/gtk/webview_webkit2.cpp' line='802' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit9GoForwardEv@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='241'>
        <function-decl name='ClearHistory' mangled-name='_ZN15wxWebViewWebKit12ClearHistoryEv' filepath='src/gtk/webview_webkit2.cpp' line='819' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit12ClearHistoryEv@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='242'>
        <function-decl name='EnableHistory' mangled-name='_ZN15wxWebViewWebKit13EnableHistoryEb' filepath='src/gtk/webview_webkit2.cpp' line='824' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit13EnableHistoryEb@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='243'>
        <function-decl name='GetBackwardHistory' mangled-name='_ZN15wxWebViewWebKit18GetBackwardHistoryEv' filepath='src/gtk/webview_webkit2.cpp' line='829' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit18GetBackwardHistoryEv@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <return type-id='type-id-793'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='244'>
        <function-decl name='GetForwardHistory' mangled-name='_ZN15wxWebViewWebKit17GetForwardHistoryEv' filepath='src/gtk/webview_webkit2.cpp' line='849' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit17GetForwardHistoryEv@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <return type-id='type-id-793'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='245'>
        <function-decl name='LoadHistoryItem' mangled-name='_ZN15wxWebViewWebKit15LoadHistoryItemE11wxSharedPtrI20wxWebViewHistoryItemE' filepath='src/gtk/webview_webkit2.cpp' line='868' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit15LoadHistoryItemE11wxSharedPtrI20wxWebViewHistoryItemE@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <parameter type-id='type-id-794'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='246'>
        <function-decl name='CanSetZoomType' mangled-name='_ZNK15wxWebViewWebKit14CanSetZoomTypeE17wxWebViewZoomType' filepath='src/gtk/webview_webkit2.cpp' line='1057' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit14CanSetZoomTypeE17wxWebViewZoomType@@WXU_3.2'>
          <parameter type-id='type-id-784' is-artificial='yes'/>
          <parameter type-id='type-id-795'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='248'>
        <function-decl name='GetZoomFactor' mangled-name='_ZNK15wxWebViewWebKit13GetZoomFactorEv' filepath='src/gtk/webview_webkit2.cpp' line='1029' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit13GetZoomFactorEv@@WXU_3.2'>
          <parameter type-id='type-id-784' is-artificial='yes'/>
          <return type-id='type-id-564'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='249'>
        <function-decl name='GetZoomType' mangled-name='_ZNK15wxWebViewWebKit11GetZoomTypeEv' filepath='src/gtk/webview_webkit2.cpp' line='1046' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit11GetZoomTypeEv@@WXU_3.2'>
          <parameter type-id='type-id-784' is-artificial='yes'/>
          <return type-id='type-id-795'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='251'>
        <function-decl name='SetZoomFactor' mangled-name='_ZN15wxWebViewWebKit13SetZoomFactorEf' filepath='src/gtk/webview_webkit2.cpp' line='1034' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit13SetZoomFactorEf@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <parameter type-id='type-id-564'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='252'>
        <function-decl name='SetZoomType' mangled-name='_ZN15wxWebViewWebKit11SetZoomTypeE17wxWebViewZoomType' filepath='src/gtk/webview_webkit2.cpp' line='1039' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit11SetZoomTypeE17wxWebViewZoomType@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <parameter type-id='type-id-795'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='253'>
        <function-decl name='SelectAll' mangled-name='_ZN15wxWebViewWebKit9SelectAllEv' filepath='src/gtk/webview_webkit2.cpp' line='1144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit9SelectAllEv@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='254'>
        <function-decl name='HasSelection' mangled-name='_ZNK15wxWebViewWebKit12HasSelectionEv' filepath='src/gtk/webview_webkit2.cpp' line='1122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit12HasSelectionEv@@WXU_3.2'>
          <parameter type-id='type-id-784' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='255'>
        <function-decl name='DeleteSelection' mangled-name='_ZN15wxWebViewWebKit15DeleteSelectionEv' filepath='src/gtk/webview_webkit2.cpp' line='1104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit15DeleteSelectionEv@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='256'>
        <function-decl name='GetSelectedText' mangled-name='_ZNK15wxWebViewWebKit15GetSelectedTextEv' filepath='src/gtk/webview_webkit2.cpp' line='1150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit15GetSelectedTextEv@@WXU_3.2'>
          <parameter type-id='type-id-784' is-artificial='yes'/>
          <return type-id='type-id-36'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='257'>
        <function-decl name='GetSelectedSource' mangled-name='_ZNK15wxWebViewWebKit17GetSelectedSourceEv' filepath='src/gtk/webview_webkit2.cpp' line='1172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit17GetSelectedSourceEv@@WXU_3.2'>
          <parameter type-id='type-id-784' is-artificial='yes'/>
          <return type-id='type-id-36'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='258'>
        <function-decl name='ClearSelection' mangled-name='_ZN15wxWebViewWebKit14ClearSelectionEv' filepath='src/gtk/webview_webkit2.cpp' line='1194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit14ClearSelectionEv@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='259'>
        <function-decl name='CanCut' mangled-name='_ZNK15wxWebViewWebKit6CanCutEv' filepath='src/gtk/webview_webkit2.cpp' line='912' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit6CanCutEv@@WXU_3.2'>
          <parameter type-id='type-id-784' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='260'>
        <function-decl name='CanCopy' mangled-name='_ZNK15wxWebViewWebKit7CanCopyEv' filepath='src/gtk/webview_webkit2.cpp' line='917' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit7CanCopyEv@@WXU_3.2'>
          <parameter type-id='type-id-784' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='261'>
        <function-decl name='CanPaste' mangled-name='_ZNK15wxWebViewWebKit8CanPasteEv' filepath='src/gtk/webview_webkit2.cpp' line='922' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit8CanPasteEv@@WXU_3.2'>
          <parameter type-id='type-id-784' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='262'>
        <function-decl name='Cut' mangled-name='_ZN15wxWebViewWebKit3CutEv' filepath='src/gtk/webview_webkit2.cpp' line='927' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit3CutEv@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='263'>
        <function-decl name='Copy' mangled-name='_ZN15wxWebViewWebKit4CopyEv' filepath='src/gtk/webview_webkit2.cpp' line='933' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit4CopyEv@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='264'>
        <function-decl name='Paste' mangled-name='_ZN15wxWebViewWebKit5PasteEv' filepath='src/gtk/webview_webkit2.cpp' line='939' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit5PasteEv@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='265'>
        <function-decl name='CanUndo' mangled-name='_ZNK15wxWebViewWebKit7CanUndoEv' filepath='src/gtk/webview_webkit2.cpp' line='945' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit7CanUndoEv@@WXU_3.2'>
          <parameter type-id='type-id-784' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='266'>
        <function-decl name='CanRedo' mangled-name='_ZNK15wxWebViewWebKit7CanRedoEv' filepath='src/gtk/webview_webkit2.cpp' line='950' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK15wxWebViewWebKit7CanRedoEv@@WXU_3.2'>
          <parameter type-id='type-id-784' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='267'>
        <function-decl name='Undo' mangled-name='_ZN15wxWebViewWebKit4UndoEv' filepath='src/gtk/webview_webkit2.cpp' line='955' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit4UndoEv@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='268'>
        <function-decl name='Redo' mangled-name='_ZN15wxWebViewWebKit4RedoEv' filepath='src/gtk/webview_webkit2.cpp' line='961' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit4RedoEv@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='269'>
        <function-decl name='GetNativeBackend' mangled-name='_ZNK15wxWebViewWebKit16GetNativeBackendEv' filepath='include/wx/gtk/webview_webkit.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-784' is-artificial='yes'/>
          <return type-id='type-id-403'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='270'>
        <function-decl name='Find' mangled-name='_ZN15wxWebViewWebKit4FindERK8wxStringi' filepath='src/gtk/webview_webkit2.cpp' line='1364' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit4FindERK8wxStringi@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <parameter type-id='type-id-463'/>
          <parameter type-id='type-id-130'/>
          <return type-id='type-id-568'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='271'>
        <function-decl name='DoSetPage' mangled-name='_ZN15wxWebViewWebKit9DoSetPageERK8wxStringS2_' filepath='src/gtk/webview_webkit2.cpp' line='1063' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxWebViewWebKit9DoSetPageERK8wxStringS2_@@WXU_3.2'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <parameter type-id='type-id-463'/>
          <parameter type-id='type-id-463'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='272'>
        <function-decl name='GetHandlers' mangled-name='_ZN15wxWebViewWebKit11GetHandlersEv' filepath='include/wx/gtk/webview_webkit.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-783' is-artificial='yes'/>
          <return type-id='type-id-772'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxWebViewHistoryItem' size-in-bits='832' visibility='default' filepath='include/wx/gtk/webviewhistoryitem_webkit.h' line='16' column='1' id='type-id-796'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_url' type-id='type-id-36' visibility='default' filepath='include/wx/gtk/webviewhistoryitem_webkit.h' line='27' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_title' type-id='type-id-36' visibility='default' filepath='include/wx/gtk/webviewhistoryitem_webkit.h' line='27' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='m_histItem' type-id='type-id-403' visibility='default' filepath='include/wx/gtk/webviewhistoryitem_webkit.h' line='28' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GdkEventKey' type-id='type-id-797' filepath='include/wx/gtk/window.h' line='25' column='1' id='type-id-798'/>
    <class-decl name='wxArrayGdkWindows' size-in-bits='192' visibility='default' filepath='include/wx/gtk/window.h' line='28' column='1' id='type-id-799'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-694'/>
    </class-decl>
    <enum-decl name='wxLayoutDirection' filepath='include/wx/localedefs.h' line='20' column='1' id='type-id-800'>
      <underlying-type type-id='type-id-572'/>
      <enumerator name='wxLayout_Default' value='0'/>
      <enumerator name='wxLayout_LeftToRight' value='1'/>
      <enumerator name='wxLayout_RightToLeft' value='2'/>
    </enum-decl>
    <typedef-decl name='wxLongLong' type-id='type-id-801' filepath='include/wx/longlong.h' line='90' column='1' id='type-id-654'/>
    <typedef-decl name='wxULongLong' type-id='type-id-802' filepath='include/wx/longlong.h' line='91' column='1' id='type-id-803'/>
    <class-decl name='wxLongLongNative' size-in-bits='64' visibility='default' filepath='include/wx/longlong.h' line='106' column='1' id='type-id-801'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_ll' type-id='type-id-131' visibility='default' filepath='include/wx/longlong.h' line='343' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxULongLongNative' size-in-bits='64' visibility='default' filepath='include/wx/longlong.h' line='347' column='1' id='type-id-802'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_ll' type-id='type-id-569' visibility='default' filepath='include/wx/longlong.h' line='562' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRefCounter' size-in-bits='128' visibility='default' filepath='include/wx/object.h' line='228' column='1' id='type-id-804'>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_count' type-id='type-id-130' visibility='default' filepath='include/wx/object.h' line='245' column='1'/>
      </data-member>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRefCounter' mangled-name='_ZN12wxRefCounterD4Ev' filepath='include/wx/object.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-805' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='wxObjectRefData' type-id='type-id-804' filepath='include/wx/object.h' line='258' column='1' id='type-id-806'/>
    <class-decl name='wxJSScriptWrapper' size-in-bits='448' visibility='default' filepath='include/wx/private/jsscriptwrapper.h' line='24' column='1' id='type-id-807'>
      <member-type access='public'>
        <enum-decl name='OutputType' filepath='include/wx/private/jsscriptwrapper.h' line='27' column='1' id='type-id-808'>
          <underlying-type type-id='type-id-572'/>
          <enumerator name='JS_OUTPUT_STRING' value='0'/>
          <enumerator name='JS_OUTPUT_WEBKIT' value='1'/>
          <enumerator name='JS_OUTPUT_IE' value='2'/>
          <enumerator name='JS_OUTPUT_RAW' value='3'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_escapedCode' type-id='type-id-36' visibility='default' filepath='include/wx/private/jsscriptwrapper.h' line='202' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_outputType' type-id='type-id-808' visibility='default' filepath='include/wx/private/jsscriptwrapper.h' line='203' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxObjectConstructorFn' type-id='type-id-809' filepath='include/wx/rtti.h' line='39' column='1' id='type-id-810'/>
    <class-decl name='wxClassInfo' size-in-bits='384' visibility='default' filepath='include/wx/rtti.h' line='41' column='1' id='type-id-775'>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-811'>
          <member-type access='private'>
            <typedef-decl name='Node' type-id='type-id-813' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-812'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-811' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-814'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-816' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-815'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-817' visibility='default' filepath='include/wx/rtti.h' line='106' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_table' type-id='type-id-818' visibility='default' filepath='include/wx/rtti.h' line='106' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_className' type-id='type-id-819' visibility='default' filepath='include/wx/rtti.h' line='109' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_objectSize' type-id='type-id-130' visibility='default' filepath='include/wx/rtti.h' line='110' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_objectConstructor' type-id='type-id-810' visibility='default' filepath='include/wx/rtti.h' line='111' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_baseInfo1' type-id='type-id-816' visibility='default' filepath='include/wx/rtti.h' line='115' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_baseInfo2' type-id='type-id-816' visibility='default' filepath='include/wx/rtti.h' line='116' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='sm_first' type-id='type-id-539' mangled-name='_ZN11wxClassInfo8sm_firstE' visibility='default' filepath='include/wx/rtti.h' line='121' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='m_next' type-id='type-id-539' visibility='default' filepath='include/wx/rtti.h' line='122' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSharedPtr&lt;wxWebViewHandler&gt;' size-in-bits='64' visibility='default' filepath='include/wx/sharedptr.h' line='21' column='1' id='type-id-790'>
      <member-type access='private'>
        <class-decl name='reftype' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/sharedptr.h' line='115' column='1' id='type-id-820'>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_ptr' type-id='type-id-537' visibility='default' filepath='include/wx/sharedptr.h' line='121' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='m_count' type-id='type-id-140' visibility='default' filepath='include/wx/sharedptr.h' line='122' column='1'/>
          </data-member>
          <member-function access='public' destructor='yes' vtable-offset='-1'>
            <function-decl name='~reftype' mangled-name='_ZN11wxSharedPtrI16wxWebViewHandlerE7reftypeD0Ev' filepath='include/wx/sharedptr.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-821' is-artificial='yes'/>
              <parameter type-id='type-id-130' is-artificial='yes'/>
              <return type-id='type-id-142'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes' vtable-offset='-1'>
            <function-decl name='~reftype' mangled-name='_ZN11wxSharedPtrI16wxWebViewHandlerE7reftypeD2Ev' filepath='include/wx/sharedptr.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-821' is-artificial='yes'/>
              <parameter type-id='type-id-130' is-artificial='yes'/>
              <return type-id='type-id-142'/>
            </function-decl>
          </member-function>
          <member-function access='public' destructor='yes' vtable-offset='-1'>
            <function-decl name='~reftype' mangled-name='_ZN11wxSharedPtrI16wxWebViewHandlerE7reftypeD4Ev' filepath='include/wx/sharedptr.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-821' is-artificial='yes'/>
              <parameter type-id='type-id-130' is-artificial='yes'/>
              <return type-id='type-id-142'/>
            </function-decl>
          </member-function>
          <member-function access='public' vtable-offset='2'>
            <function-decl name='delete_ptr' mangled-name='_ZN11wxSharedPtrI16wxWebViewHandlerE7reftype10delete_ptrEv' filepath='include/wx/sharedptr.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64'>
              <parameter type-id='type-id-821' is-artificial='yes'/>
              <return type-id='type-id-142'/>
            </function-decl>
          </member-function>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_ref' type-id='type-id-821' visibility='default' filepath='include/wx/sharedptr.h' line='134' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxCStrData' size-in-bits='192' visibility='default' filepath='include/wx/string.h' line='152' column='1' id='type-id-822'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_str' type-id='type-id-823' visibility='default' filepath='include/wx/string.h' line='245' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_offset' type-id='type-id-60' visibility='default' filepath='include/wx/string.h' line='252' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_owned' type-id='type-id-34' visibility='default' filepath='include/wx/string.h' line='254' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxString' size-in-bits='384' visibility='default' filepath='include/wx/string.h' line='301' column='1' id='type-id-36'>
      <member-type access='private'>
        <class-decl name='SubstrBufFromType&lt;wchar_t const*&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='337' column='1' id='type-id-824'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='data' type-id='type-id-825' visibility='default' filepath='include/wx/string.h' line='339' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='len' type-id='type-id-60' visibility='default' filepath='include/wx/string.h' line='340' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='SubstrBufFromType&lt;wxScopedCharTypeBuffer&lt;wchar_t&gt; &gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='337' column='1' id='type-id-826'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='data' type-id='type-id-145' visibility='default' filepath='include/wx/string.h' line='339' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='len' type-id='type-id-60' visibility='default' filepath='include/wx/string.h' line='340' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='SubstrBufFromWC' type-id='type-id-824' filepath='include/wx/string.h' line='354' column='1' id='type-id-827'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='SubstrBufFromMB' type-id='type-id-826' filepath='include/wx/string.h' line='355' column='1' id='type-id-828'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-60' filepath='include/wx/string.h' line='752' column='1' id='type-id-829'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-831' filepath='include/wx/string.h' line='753' column='1' id='type-id-830'/>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='963' column='1' id='type-id-832'>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-834' filepath='include/wx/string.h' line='965' column='1' id='type-id-833'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-836' filepath='include/wx/string.h' line='965' column='1' id='type-id-835'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='underlying_iterator' type-id='type-id-838' filepath='include/wx/string.h' line='965' column='1' id='type-id-837'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-837' visibility='default' filepath='include/wx/string.h' line='965' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='994' column='1' id='type-id-839'>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-834' filepath='include/wx/string.h' line='998' column='1' id='type-id-840'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-842' filepath='include/wx/string.h' line='998' column='1' id='type-id-841'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='underlying_iterator' type-id='type-id-844' filepath='include/wx/string.h' line='998' column='1' id='type-id-843'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-843' visibility='default' filepath='include/wx/string.h' line='998' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator_impl&lt;wxString::const_iterator&gt;' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='1060' column='1' id='type-id-845'>
          <member-type access='public'>
            <typedef-decl name='iterator_type' type-id='type-id-839' filepath='include/wx/string.h' line='1063' column='1' id='type-id-846'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-840' filepath='include/wx/string.h' line='1067' column='1' id='type-id-847'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-841' filepath='include/wx/string.h' line='1068' column='1' id='type-id-848'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-846' visibility='default' filepath='include/wx/string.h' line='1115' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator_impl&lt;wxString::iterator&gt;' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='1060' column='1' id='type-id-849'>
          <member-type access='public'>
            <typedef-decl name='iterator_type' type-id='type-id-832' filepath='include/wx/string.h' line='1063' column='1' id='type-id-850'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-833' filepath='include/wx/string.h' line='1067' column='1' id='type-id-851'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-835' filepath='include/wx/string.h' line='1068' column='1' id='type-id-852'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-850' visibility='default' filepath='include/wx/string.h' line='1115' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reverse_iterator' type-id='type-id-849' filepath='include/wx/string.h' line='1118' column='1' id='type-id-853'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reverse_iterator' type-id='type-id-845' filepath='include/wx/string.h' line='1119' column='1' id='type-id-854'/>
      </member-type>
      <member-type access='public'>
        <enum-decl name='caseCompare' filepath='include/wx/string.h' line='2386' column='1' id='type-id-855'>
          <underlying-type type-id='type-id-572'/>
          <enumerator name='exact' value='0'/>
          <enumerator name='ignoreCase' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='stripType' filepath='include/wx/string.h' line='2388' column='1' id='type-id-856'>
          <underlying-type type-id='type-id-572'/>
          <enumerator name='leading' value='1'/>
          <enumerator name='trailing' value='2'/>
          <enumerator name='both' value='3'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='ConvertedBuffer&lt;char&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='3599' column='1' id='type-id-857'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_str' type-id='type-id-858' visibility='default' filepath='include/wx/string.h' line='3625' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_len' type-id='type-id-60' visibility='default' filepath='include/wx/string.h' line='3626' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' static='yes'>
        <var-decl name='npos' type-id='type-id-859' mangled-name='_ZN8wxString4nposE' visibility='default' filepath='include/wx/string.h' line='308' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_impl' type-id='type-id-860' visibility='default' filepath='include/wx/string.h' line='3589' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_convertedToChar' type-id='type-id-857' visibility='default' filepath='include/wx/string.h' line='3677' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxStdWideString' type-id='type-id-861' filepath='include/wx/stringimpl.h' line='70' column='1' id='type-id-862'/>
    <typedef-decl name='wxStdString' type-id='type-id-862' filepath='include/wx/stringimpl.h' line='76' column='1' id='type-id-863'/>
    <typedef-decl name='wxStringImpl' type-id='type-id-863' filepath='include/wx/stringimpl.h' line='90' column='1' id='type-id-860'/>
    <class-decl name='wxStringOperationsWchar' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/stringops.h' line='27' column='1' id='type-id-864'>
      <member-type access='public'>
        <class-decl name='SingleCharBuffer' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/stringops.h' line='64' column='1' id='type-id-865'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='data' type-id='type-id-578' visibility='default' filepath='include/wx/stringops.h' line='66' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
    </class-decl>
    <class-decl name='wxFormatString' size-in-bits='320' visibility='default' filepath='include/wx/strvararg.h' line='137' column='1' id='type-id-866'>
      <member-type access='public'>
        <enum-decl name='ArgumentType' filepath='include/wx/strvararg.h' line='161' column='1' id='type-id-867'>
          <underlying-type type-id='type-id-572'/>
          <enumerator name='Arg_Unused' value='0'/>
          <enumerator name='Arg_Char' value='1'/>
          <enumerator name='Arg_Pointer' value='2'/>
          <enumerator name='Arg_String' value='6'/>
          <enumerator name='Arg_Int' value='9'/>
          <enumerator name='Arg_LongInt' value='16'/>
          <enumerator name='Arg_LongLongInt' value='16'/>
          <enumerator name='Arg_Double' value='64'/>
          <enumerator name='Arg_LongDouble' value='128'/>
          <enumerator name='Arg_Size_t' value='16'/>
          <enumerator name='Arg_IntPtr' value='512'/>
          <enumerator name='Arg_ShortIntPtr' value='1024'/>
          <enumerator name='Arg_LongIntPtr' value='2048'/>
          <enumerator name='Arg_Unknown' value='32768'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_convertedWChar' type-id='type-id-623' visibility='default' filepath='include/wx/strvararg.h' line='232' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_char' type-id='type-id-622' visibility='default' filepath='include/wx/strvararg.h' line='236' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_wchar' type-id='type-id-623' visibility='default' filepath='include/wx/strvararg.h' line='237' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_str' type-id='type-id-580' visibility='default' filepath='include/wx/strvararg.h' line='242' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_cstr' type-id='type-id-868' visibility='default' filepath='include/wx/strvararg.h' line='243' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxFormatStringArgument' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='250' column='1' id='type-id-869'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_str' type-id='type-id-870' visibility='default' filepath='include/wx/strvararg.h' line='253' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxFormatStringArgumentFinder&lt;const wxFormatString&amp;&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='277' column='1' id='type-id-871'/>
    <class-decl name='wxArgNormalizerWchar&lt;const wxString&amp;&gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='553' column='1' id='type-id-872'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_value' type-id='type-id-463' visibility='default' filepath='include/wx/strvararg.h' line='565' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArgNormalizerWchar&lt;wxString&gt;' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/strvararg.h' line='755' column='1' id='type-id-873'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-872'/>
    </class-decl>
    <enum-decl name='wxMutexError' filepath='include/wx/thread.h' line='28' column='1' id='type-id-874'>
      <underlying-type type-id='type-id-572'/>
      <enumerator name='wxMUTEX_NO_ERROR' value='0'/>
      <enumerator name='wxMUTEX_INVALID' value='1'/>
      <enumerator name='wxMUTEX_DEAD_LOCK' value='2'/>
      <enumerator name='wxMUTEX_BUSY' value='3'/>
      <enumerator name='wxMUTEX_UNLOCKED' value='4'/>
      <enumerator name='wxMUTEX_TIMEOUT' value='5'/>
      <enumerator name='wxMUTEX_MISC_ERROR' value='6'/>
    </enum-decl>
    <enum-decl name='wxThreadError' filepath='include/wx/thread.h' line='57' column='1' id='type-id-875'>
      <underlying-type type-id='type-id-572'/>
      <enumerator name='wxTHREAD_NO_ERROR' value='0'/>
      <enumerator name='wxTHREAD_NO_RESOURCE' value='1'/>
      <enumerator name='wxTHREAD_RUNNING' value='2'/>
      <enumerator name='wxTHREAD_NOT_RUNNING' value='3'/>
      <enumerator name='wxTHREAD_KILLED' value='4'/>
      <enumerator name='wxTHREAD_MISC_ERROR' value='5'/>
    </enum-decl>
    <enum-decl name='wxThreadKind' filepath='include/wx/thread.h' line='67' column='1' id='type-id-876'>
      <underlying-type type-id='type-id-572'/>
      <enumerator name='wxTHREAD_DETACHED' value='0'/>
      <enumerator name='wxTHREAD_JOINABLE' value='1'/>
    </enum-decl>
    <enum-decl name='wxMutexType' filepath='include/wx/thread.h' line='112' column='1' id='type-id-877'>
      <underlying-type type-id='type-id-572'/>
      <enumerator name='wxMUTEX_DEFAULT' value='0'/>
      <enumerator name='wxMUTEX_RECURSIVE' value='1'/>
    </enum-decl>
    <class-decl name='wxMutex' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='137' column='1' id='type-id-878'>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_internal' type-id='type-id-879' visibility='default' filepath='include/wx/thread.h' line='174' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxCriticalSectionType' filepath='include/wx/thread.h' line='231' column='1' id='type-id-880'>
      <underlying-type type-id='type-id-572'/>
      <enumerator name='wxCRITSEC_DEFAULT' value='0'/>
      <enumerator name='wxCRITSEC_NON_RECURSIVE' value='1'/>
    </enum-decl>
    <class-decl name='wxCriticalSection' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='242' column='1' id='type-id-881'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_mutex' type-id='type-id-878' visibility='default' filepath='include/wx/thread.h' line='259' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='Leave' mangled-name='_ZN17wxCriticalSection5LeaveEv' filepath='include/wx/thread.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxCriticalSection5LeaveEv@@WXU_3.2'>
          <parameter type-id='type-id-882' name='this' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Enter' mangled-name='_ZN17wxCriticalSection5EnterEv' filepath='include/wx/thread.h' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxCriticalSection5EnterEv@@WXU_3.2'>
          <parameter type-id='type-id-882' name='this' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxCriticalSectionLocker' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='301' column='1' id='type-id-883'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_critsect' type-id='type-id-884' visibility='default' filepath='include/wx/thread.h' line='316' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxThreadHelperThread' size-in-bits='320' visibility='default' filepath='include/wx/thread.h' line='658' column='1' id='type-id-885'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-886'/>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_owner' type-id='type-id-887' visibility='default' filepath='include/wx/thread.h' line='673' column='1'/>
      </data-member>
      <member-function access='protected' vtable-offset='3'>
        <function-decl name='Entry' mangled-name='_ZN20wxThreadHelperThread5EntryEv' filepath='include/wx/thread.h' line='761' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-888' is-artificial='yes'/>
          <return type-id='type-id-403'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxThreadHelper' size-in-bits='256' visibility='default' filepath='include/wx/thread.h' line='686' column='1' id='type-id-889'>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_thread' type-id='type-id-890' visibility='default' filepath='include/wx/thread.h' line='748' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_kind' type-id='type-id-876' visibility='default' filepath='include/wx/thread.h' line='749' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_critSection' type-id='type-id-881' visibility='default' filepath='include/wx/thread.h' line='750' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThreadHelper' mangled-name='_ZN14wxThreadHelperD4Ev' filepath='include/wx/thread.h' line='714' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-891' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='Entry' mangled-name='_ZN14wxThreadHelper5EntryEv' filepath='include/wx/thread.h' line='735' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-891' is-artificial='yes'/>
          <return type-id='type-id-403'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxTypeIdentifier' size-in-bits='64' visibility='default' filepath='include/wx/typeinfo.h' line='63' column='1' id='type-id-892'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_className' type-id='type-id-129' visibility='default' filepath='include/wx/typeinfo.h' line='81' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxCoord' type-id='type-id-130' filepath='include/wx/types.h' line='26' column='1' id='type-id-893'/>
    <typedef-decl name='wxUint8' type-id='type-id-458' filepath='include/wx/types.h' line='43' column='1' id='type-id-894'/>
    <typedef-decl name='wxByte' type-id='type-id-894' filepath='include/wx/types.h' line='44' column='1' id='type-id-895'/>
    <typedef-decl name='wxUint16' type-id='type-id-573' filepath='include/wx/types.h' line='57' column='1' id='type-id-896'/>
    <typedef-decl name='wxInt32' type-id='type-id-130' filepath='include/wx/types.h' line='145' column='1' id='type-id-612'/>
    <typedef-decl name='wxUint32' type-id='type-id-562' filepath='include/wx/types.h' line='146' column='1' id='type-id-897'/>
    <class-decl name='wxUniChar' size-in-bits='32' visibility='default' filepath='include/wx/unichar.h' line='29' column='1' id='type-id-842'>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-897' filepath='include/wx/unichar.h' line='35' column='1' id='type-id-898'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_value' type-id='type-id-898' visibility='default' filepath='include/wx/unichar.h' line='212' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxUniCharRef' size-in-bits='64' visibility='default' filepath='include/wx/unichar.h' line='220' column='1' id='type-id-836'>
      <member-type access='private'>
        <typedef-decl name='iterator' type-id='type-id-838' filepath='include/wx/unichar.h' line='223' column='1' id='type-id-899'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_pos' type-id='type-id-899' visibility='default' filepath='include/wx/unichar.h' line='325' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVector&lt;_GdkWindow*&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-695'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-60' filepath='include/wx/vector.h' line='179' column='1' id='type-id-900'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-902' filepath='include/wx/vector.h' line='181' column='1' id='type-id-901'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-904' filepath='include/wx/vector.h' line='184' column='1' id='type-id-903'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-906' filepath='include/wx/vector.h' line='185' column='1' id='type-id-905'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-907' filepath='include/wx/vector.h' line='187' column='1' id='type-id-699'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-908'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-909'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_INITIAL_SIZE' type-id='type-id-910' mangled-name='_ZN8wxVectorIP10_GdkWindowE18ALLOC_INITIAL_SIZEE' visibility='default' filepath='include/wx/vector.h' line='592' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-900' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-900' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-904' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVector&lt;const wxEventTableEntry*&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-701'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-60' filepath='include/wx/vector.h' line='179' column='1' id='type-id-911'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-739' filepath='include/wx/vector.h' line='181' column='1' id='type-id-912'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-914' filepath='include/wx/vector.h' line='184' column='1' id='type-id-913'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-916' filepath='include/wx/vector.h' line='185' column='1' id='type-id-915'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-917' filepath='include/wx/vector.h' line='187' column='1' id='type-id-705'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-918'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-919'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_INITIAL_SIZE' type-id='type-id-920' mangled-name='_ZN8wxVectorIPK17wxEventTableEntryE18ALLOC_INITIAL_SIZEE' visibility='default' filepath='include/wx/vector.h' line='592' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-911' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-911' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-914' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVector&lt;wxDynamicLibraryDetails*&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-707'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-60' filepath='include/wx/vector.h' line='179' column='1' id='type-id-921'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-923' filepath='include/wx/vector.h' line='181' column='1' id='type-id-922'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-925' filepath='include/wx/vector.h' line='184' column='1' id='type-id-924'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-927' filepath='include/wx/vector.h' line='185' column='1' id='type-id-926'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-928' filepath='include/wx/vector.h' line='187' column='1' id='type-id-711'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-929'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-930'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-921' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-921' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-925' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVector&lt;wxSharedPtr&lt;wxWebViewHandler&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-772'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-60' filepath='include/wx/vector.h' line='179' column='1' id='type-id-931'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-790' filepath='include/wx/vector.h' line='181' column='1' id='type-id-932'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-934' filepath='include/wx/vector.h' line='184' column='1' id='type-id-933'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-936' filepath='include/wx/vector.h' line='185' column='1' id='type-id-935'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-937'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-938'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_INITIAL_SIZE' type-id='type-id-939' mangled-name='_ZN8wxVectorI11wxSharedPtrI16wxWebViewHandlerEE18ALLOC_INITIAL_SIZEE' visibility='default' filepath='include/wx/vector.h' line='592' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-931' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-931' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-934' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVersionInfo' size-in-bits='1280' visibility='default' filepath='include/wx/versioninfo.h' line='19' column='1' id='type-id-940'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_name' type-id='type-id-36' visibility='default' filepath='include/wx/versioninfo.h' line='93' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='384'>
        <var-decl name='m_description' type-id='type-id-36' visibility='default' filepath='include/wx/versioninfo.h' line='94' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='768'>
        <var-decl name='m_copyright' type-id='type-id-36' visibility='default' filepath='include/wx/versioninfo.h' line='95' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1152'>
        <var-decl name='m_major' type-id='type-id-130' visibility='default' filepath='include/wx/versioninfo.h' line='97' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1184'>
        <var-decl name='m_minor' type-id='type-id-130' visibility='default' filepath='include/wx/versioninfo.h' line='98' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1216'>
        <var-decl name='m_micro' type-id='type-id-130' visibility='default' filepath='include/wx/versioninfo.h' line='99' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1248'>
        <var-decl name='m_revision' type-id='type-id-130' visibility='default' filepath='include/wx/versioninfo.h' line='100' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxWebViewZoom' filepath='include/wx/webview.h' line='37' column='1' id='type-id-941'>
      <underlying-type type-id='type-id-572'/>
      <enumerator name='wxWEBVIEW_ZOOM_TINY' value='0'/>
      <enumerator name='wxWEBVIEW_ZOOM_SMALL' value='1'/>
      <enumerator name='wxWEBVIEW_ZOOM_MEDIUM' value='2'/>
      <enumerator name='wxWEBVIEW_ZOOM_LARGE' value='3'/>
      <enumerator name='wxWEBVIEW_ZOOM_LARGEST' value='4'/>
    </enum-decl>
    <enum-decl name='wxWebViewZoomType' filepath='include/wx/webview.h' line='46' column='1' id='type-id-795'>
      <underlying-type type-id='type-id-572'/>
      <enumerator name='wxWEBVIEW_ZOOM_TYPE_LAYOUT' value='0'/>
      <enumerator name='wxWEBVIEW_ZOOM_TYPE_TEXT' value='1'/>
    </enum-decl>
    <enum-decl name='wxWebViewReloadFlags' filepath='include/wx/webview.h' line='65' column='1' id='type-id-791'>
      <underlying-type type-id='type-id-572'/>
      <enumerator name='wxWEBVIEW_RELOAD_DEFAULT' value='0'/>
      <enumerator name='wxWEBVIEW_RELOAD_NO_CACHE' value='1'/>
    </enum-decl>
    <enum-decl name='wxWebViewNavigationActionFlags' filepath='include/wx/webview.h' line='82' column='1' id='type-id-942'>
      <underlying-type type-id='type-id-572'/>
      <enumerator name='wxWEBVIEW_NAV_ACTION_NONE' value='0'/>
      <enumerator name='wxWEBVIEW_NAV_ACTION_USER' value='1'/>
      <enumerator name='wxWEBVIEW_NAV_ACTION_OTHER' value='2'/>
    </enum-decl>
    <enum-decl name='wxWebViewUserScriptInjectionTime' filepath='include/wx/webview.h' line='89' column='1' id='type-id-792'>
      <underlying-type type-id='type-id-572'/>
      <enumerator name='wxWEBVIEW_INJECT_AT_DOCUMENT_START' value='0'/>
      <enumerator name='wxWEBVIEW_INJECT_AT_DOCUMENT_END' value='1'/>
    </enum-decl>
    <class-decl name='wxWebViewHandler' size-in-bits='832' visibility='default' filepath='include/wx/webview.h' line='96' column='1' id='type-id-460'>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_scheme' type-id='type-id-36' visibility='default' filepath='include/wx/webview.h' line='107' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='m_securityURL' type-id='type-id-36' visibility='default' filepath='include/wx/webview.h' line='108' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWebViewHandler' mangled-name='_ZN16wxWebViewHandlerD0Ev' filepath='include/wx/webview.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-537' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWebViewHandler' mangled-name='_ZN16wxWebViewHandlerD0Ev' filepath='include/wx/webview.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-537' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWebViewHandler' mangled-name='_ZN16wxWebViewHandlerD2Ev' filepath='include/wx/webview.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-537' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWebViewHandler' mangled-name='_ZN16wxWebViewHandlerD2Ev' filepath='include/wx/webview.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-537' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWebViewHandler' mangled-name='_ZN16wxWebViewHandlerD4Ev' filepath='include/wx/webview.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-537' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetName' mangled-name='_ZNK16wxWebViewHandler7GetNameEv' filepath='include/wx/webview.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-943' is-artificial='yes'/>
          <return type-id='type-id-36'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <function-decl name='GetFile' mangled-name='_ZN16wxWebViewHandler7GetFileERK8wxString' filepath='include/wx/webview.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-537' is-artificial='yes'/>
          <parameter type-id='type-id-463'/>
          <return type-id='type-id-465'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='4'>
        <function-decl name='SetSecurityURL' mangled-name='_ZN16wxWebViewHandler14SetSecurityURLERK8wxString' filepath='include/wx/webview.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-537' is-artificial='yes'/>
          <parameter type-id='type-id-463'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetSecurityURL' mangled-name='_ZNK16wxWebViewHandler14GetSecurityURLEv' filepath='include/wx/webview.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-943' is-artificial='yes'/>
          <return type-id='type-id-36'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxWebViewFactory' size-in-bits='128' visibility='default' filepath='include/wx/webview.h' line='118' column='1' id='type-id-399'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-944'/>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='Create' mangled-name='_ZN16wxWebViewFactory6CreateEv' filepath='include/wx/webview.h' line='121' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-139' is-artificial='yes'/>
          <return type-id='type-id-395'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='Create' mangled-name='_ZN16wxWebViewFactory6CreateEP8wxWindowiRK8wxStringRK7wxPointRK6wxSizelS4_' filepath='include/wx/webview.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-139' is-artificial='yes'/>
          <parameter type-id='type-id-787'/>
          <parameter type-id='type-id-659'/>
          <parameter type-id='type-id-463'/>
          <parameter type-id='type-id-788'/>
          <parameter type-id='type-id-789'/>
          <parameter type-id='type-id-568'/>
          <parameter type-id='type-id-463'/>
          <return type-id='type-id-395'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='IsAvailable' mangled-name='_ZN16wxWebViewFactory11IsAvailableEv' filepath='include/wx/webview.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-139' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='GetVersionInfo' mangled-name='_ZN16wxWebViewFactory14GetVersionInfoEv' filepath='include/wx/webview.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-139' is-artificial='yes'/>
          <return type-id='type-id-940'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxWebView' size-in-bits='6528' visibility='default' filepath='include/wx/webview.h' line='135' column='1' id='type-id-770'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-945'/>
      <data-member access='private' layout-offset-in-bits='5696'>
        <var-decl name='m_showMenu' type-id='type-id-34' visibility='default' filepath='include/wx/webview.h' line='278' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5728'>
        <var-decl name='m_syncScriptResult' type-id='type-id-130' visibility='default' filepath='include/wx/webview.h' line='279' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='5760'>
        <var-decl name='m_syncScriptOutput' type-id='type-id-36' visibility='default' filepath='include/wx/webview.h' line='280' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='6144'>
        <var-decl name='m_findText' type-id='type-id-36' visibility='default' filepath='include/wx/webview.h' line='281' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='m_factoryMap' type-id='type-id-147' mangled-name='_ZN9wxWebView12m_factoryMapE' visibility='default' filepath='src/common/webview.cpp' line='55' column='1' elf-symbol-id='_ZN9wxWebView12m_factoryMapE@@WXU_3.2'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-775' mangled-name='_ZN9wxWebView12ms_classInfoE' visibility='default' filepath='src/common/webview.cpp' line='42' column='1' elf-symbol-id='_ZN9wxWebView12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <member-function access='private' static='yes'>
        <function-decl name='InitFactoryMap' mangled-name='_ZN9wxWebView14InitFactoryMapEv' filepath='src/common/webview.cpp' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxWebView14InitFactoryMapEv@@WXU_3.2'>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='private' static='yes'>
        <function-decl name='FindFactory' mangled-name='_ZN9wxWebView11FindFactoryERK8wxString' filepath='src/common/webview.cpp' line='326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxWebView11FindFactoryERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-463'/>
          <return type-id='type-id-154'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='GetBackendVersionInfo' mangled-name='_ZN9wxWebView21GetBackendVersionInfoERK8wxString' filepath='src/common/webview.cpp' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxWebView21GetBackendVersionInfoERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-463'/>
          <return type-id='type-id-940'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='IsBackendAvailable' mangled-name='_ZN9wxWebView18IsBackendAvailableERK8wxString' filepath='src/common/webview.cpp' line='307' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxWebView18IsBackendAvailableERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-463'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='RegisterFactory' mangled-name='_ZN9wxWebView15RegisterFactoryERK8wxString11wxSharedPtrI16wxWebViewFactoryE' filepath='src/common/webview.cpp' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxWebView15RegisterFactoryERK8wxString11wxSharedPtrI16wxWebViewFactoryE@@WXU_3.2'>
          <parameter type-id='type-id-463'/>
          <parameter type-id='type-id-137'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='New' mangled-name='_ZN9wxWebView3NewEP8wxWindowiRK8wxStringRK7wxPointRK6wxSizeS4_lS4_' filepath='src/common/webview.cpp' line='285' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxWebView3NewEP8wxWindowiRK8wxStringRK7wxPointRK6wxSizeS4_lS4_@@WXU_3.2'>
          <parameter type-id='type-id-787'/>
          <parameter type-id='type-id-659'/>
          <parameter type-id='type-id-463'/>
          <parameter type-id='type-id-788'/>
          <parameter type-id='type-id-789'/>
          <parameter type-id='type-id-463'/>
          <parameter type-id='type-id-568'/>
          <parameter type-id='type-id-463'/>
          <return type-id='type-id-395'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='New' mangled-name='_ZN9wxWebView3NewERK8wxString' filepath='src/common/webview.cpp' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxWebView3NewERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-463'/>
          <return type-id='type-id-395'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes'>
        <function-decl name='SendScriptResult' mangled-name='_ZNK9wxWebView16SendScriptResultEPvbRK8wxString' filepath='src/common/webview.cpp' line='249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9wxWebView16SendScriptResultEPvbRK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-308' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-403' name='clientData' filepath='src/common/webview.cpp' line='249' column='1'/>
          <parameter type-id='type-id-34' name='success' filepath='src/common/webview.cpp' line='249' column='1'/>
          <parameter type-id='type-id-463' name='output' filepath='src/common/webview.cpp' line='250' column='1'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='ExecCommand' mangled-name='_ZN9wxWebView11ExecCommandERK8wxString' filepath='src/common/webview.cpp' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxWebView11ExecCommandERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-396' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-463' name='command' filepath='src/common/webview.cpp' line='117' column='1'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes'>
        <function-decl name='QueryCommandEnabled' mangled-name='_ZNK9wxWebView19QueryCommandEnabledERK8wxString' filepath='src/common/webview.cpp' line='109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9wxWebView19QueryCommandEnabledERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-308' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-463' name='command' filepath='src/common/webview.cpp' line='109' column='1'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWebView' mangled-name='_ZN9wxWebViewD0Ev' filepath='include/wx/webview.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWebView' mangled-name='_ZN9wxWebViewD2Ev' filepath='include/wx/webview.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWebView' mangled-name='_ZN9wxWebViewD4Ev' filepath='include/wx/webview.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <parameter type-id='type-id-130' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK9wxWebView12GetClassInfoEv' filepath='include/wx/webview.h' line='284' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9wxWebView12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <return type-id='type-id-539'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='212'>
        <function-decl name='Create' mangled-name='_ZN9wxWebView6CreateEP8wxWindowiRK8wxStringRK7wxPointRK6wxSizelS4_' filepath='include/wx/webview.h' line='146' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <parameter type-id='type-id-787'/>
          <parameter type-id='type-id-659'/>
          <parameter type-id='type-id-463'/>
          <parameter type-id='type-id-788'/>
          <parameter type-id='type-id-789'/>
          <parameter type-id='type-id-568'/>
          <parameter type-id='type-id-463'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='213'>
        <function-decl name='EnableContextMenu' mangled-name='_ZN9wxWebView17EnableContextMenuEb' filepath='include/wx/webview.h' line='172' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='214'>
        <function-decl name='EnableAccessToDevTools' mangled-name='_ZN9wxWebView22EnableAccessToDevToolsEb' filepath='include/wx/webview.h' line='176' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='215'>
        <function-decl name='GetCurrentTitle' mangled-name='_ZNK9wxWebView15GetCurrentTitleEv' filepath='include/wx/webview.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <return type-id='type-id-36'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='216'>
        <function-decl name='GetCurrentURL' mangled-name='_ZNK9wxWebView13GetCurrentURLEv' filepath='include/wx/webview.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <return type-id='type-id-36'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='217'>
        <function-decl name='GetPageSource' mangled-name='_ZNK9wxWebView13GetPageSourceEv' filepath='include/wx/webview.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9wxWebView13GetPageSourceEv@@WXU_3.2'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <return type-id='type-id-36'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='218'>
        <function-decl name='GetPageText' mangled-name='_ZNK9wxWebView11GetPageTextEv' filepath='include/wx/webview.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9wxWebView11GetPageTextEv@@WXU_3.2'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <return type-id='type-id-36'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='219'>
        <function-decl name='IsBusy' mangled-name='_ZNK9wxWebView6IsBusyEv' filepath='include/wx/webview.h' line='182' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='220'>
        <function-decl name='IsContextMenuEnabled' mangled-name='_ZNK9wxWebView20IsContextMenuEnabledEv' filepath='include/wx/webview.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='221'>
        <function-decl name='IsAccessToDevToolsEnabled' mangled-name='_ZNK9wxWebView25IsAccessToDevToolsEnabledEv' filepath='include/wx/webview.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='222'>
        <function-decl name='IsEditable' mangled-name='_ZNK9wxWebView10IsEditableEv' filepath='include/wx/webview.h' line='185' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='223'>
        <function-decl name='LoadURL' mangled-name='_ZN9wxWebView7LoadURLERK8wxString' filepath='include/wx/webview.h' line='186' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <parameter type-id='type-id-463'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='224'>
        <function-decl name='Print' mangled-name='_ZN9wxWebView5PrintEv' filepath='include/wx/webview.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='225'>
        <function-decl name='RegisterHandler' mangled-name='_ZN9wxWebView15RegisterHandlerE11wxSharedPtrI16wxWebViewHandlerE' filepath='include/wx/webview.h' line='188' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <parameter type-id='type-id-790'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='226'>
        <function-decl name='Reload' mangled-name='_ZN9wxWebView6ReloadE20wxWebViewReloadFlags' filepath='include/wx/webview.h' line='189' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <parameter type-id='type-id-791'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='227'>
        <function-decl name='SetUserAgent' mangled-name='_ZN9wxWebView12SetUserAgentERK8wxString' filepath='include/wx/webview.h' line='190' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <parameter type-id='type-id-463'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='228'>
        <function-decl name='GetUserAgent' mangled-name='_ZNK9wxWebView12GetUserAgentEv' filepath='include/wx/webview.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9wxWebView12GetUserAgentEv@@WXU_3.2'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <return type-id='type-id-36'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='229'>
        <function-decl name='RunScript' mangled-name='_ZNK9wxWebView9RunScriptERK8wxStringPS0_' filepath='include/wx/webview.h' line='194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9wxWebView9RunScriptERK8wxStringPS0_@@WXU_3.2'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <parameter type-id='type-id-463'/>
          <parameter type-id='type-id-611'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='230'>
        <function-decl name='RunScriptAsync' mangled-name='_ZNK9wxWebView14RunScriptAsyncERK8wxStringPv' filepath='include/wx/webview.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9wxWebView14RunScriptAsyncERK8wxStringPv@@WXU_3.2'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <parameter type-id='type-id-463'/>
          <parameter type-id='type-id-403'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='231'>
        <function-decl name='AddScriptMessageHandler' mangled-name='_ZN9wxWebView23AddScriptMessageHandlerERK8wxString' filepath='include/wx/webview.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <parameter type-id='type-id-463'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='232'>
        <function-decl name='RemoveScriptMessageHandler' mangled-name='_ZN9wxWebView26RemoveScriptMessageHandlerERK8wxString' filepath='include/wx/webview.h' line='198' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <parameter type-id='type-id-463'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='233'>
        <function-decl name='AddUserScript' mangled-name='_ZN9wxWebView13AddUserScriptERK8wxString32wxWebViewUserScriptInjectionTime' filepath='include/wx/webview.h' line='200' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <parameter type-id='type-id-463'/>
          <parameter type-id='type-id-792'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='234'>
        <function-decl name='RemoveAllUserScripts' mangled-name='_ZN9wxWebView20RemoveAllUserScriptsEv' filepath='include/wx/webview.h' line='203' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='235'>
        <function-decl name='SetEditable' mangled-name='_ZN9wxWebView11SetEditableEb' filepath='include/wx/webview.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='236'>
        <function-decl name='Stop' mangled-name='_ZN9wxWebView4StopEv' filepath='include/wx/webview.h' line='216' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='237'>
        <function-decl name='CanGoBack' mangled-name='_ZNK9wxWebView9CanGoBackEv' filepath='include/wx/webview.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='238'>
        <function-decl name='CanGoForward' mangled-name='_ZNK9wxWebView12CanGoForwardEv' filepath='include/wx/webview.h' line='220' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='239'>
        <function-decl name='GoBack' mangled-name='_ZN9wxWebView6GoBackEv' filepath='include/wx/webview.h' line='221' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='240'>
        <function-decl name='GoForward' mangled-name='_ZN9wxWebView9GoForwardEv' filepath='include/wx/webview.h' line='222' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='241'>
        <function-decl name='ClearHistory' mangled-name='_ZN9wxWebView12ClearHistoryEv' filepath='include/wx/webview.h' line='223' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='242'>
        <function-decl name='EnableHistory' mangled-name='_ZN9wxWebView13EnableHistoryEb' filepath='include/wx/webview.h' line='224' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <parameter type-id='type-id-34'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='243'>
        <function-decl name='GetBackwardHistory' mangled-name='_ZN9wxWebView18GetBackwardHistoryEv' filepath='include/wx/webview.h' line='225' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <return type-id='type-id-793'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='244'>
        <function-decl name='GetForwardHistory' mangled-name='_ZN9wxWebView17GetForwardHistoryEv' filepath='include/wx/webview.h' line='226' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <return type-id='type-id-793'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='245'>
        <function-decl name='LoadHistoryItem' mangled-name='_ZN9wxWebView15LoadHistoryItemE11wxSharedPtrI20wxWebViewHistoryItemE' filepath='include/wx/webview.h' line='227' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <parameter type-id='type-id-794'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='246'>
        <function-decl name='CanSetZoomType' mangled-name='_ZNK9wxWebView14CanSetZoomTypeE17wxWebViewZoomType' filepath='include/wx/webview.h' line='230' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <parameter type-id='type-id-795'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='247'>
        <function-decl name='GetZoom' mangled-name='_ZNK9wxWebView7GetZoomEv' filepath='include/wx/webview.h' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9wxWebView7GetZoomEv@@WXU_3.2'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <return type-id='type-id-941'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='248'>
        <function-decl name='GetZoomFactor' mangled-name='_ZNK9wxWebView13GetZoomFactorEv' filepath='include/wx/webview.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <return type-id='type-id-564'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='249'>
        <function-decl name='GetZoomType' mangled-name='_ZNK9wxWebView11GetZoomTypeEv' filepath='include/wx/webview.h' line='233' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <return type-id='type-id-795'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='250'>
        <function-decl name='SetZoom' mangled-name='_ZN9wxWebView7SetZoomE13wxWebViewZoom' filepath='include/wx/webview.h' line='234' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxWebView7SetZoomE13wxWebViewZoom@@WXU_3.2'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <parameter type-id='type-id-941'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='251'>
        <function-decl name='SetZoomFactor' mangled-name='_ZN9wxWebView13SetZoomFactorEf' filepath='include/wx/webview.h' line='235' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <parameter type-id='type-id-564'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='252'>
        <function-decl name='SetZoomType' mangled-name='_ZN9wxWebView11SetZoomTypeE17wxWebViewZoomType' filepath='include/wx/webview.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <parameter type-id='type-id-795'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='253'>
        <function-decl name='SelectAll' mangled-name='_ZN9wxWebView9SelectAllEv' filepath='include/wx/webview.h' line='239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxWebView9SelectAllEv@@WXU_3.2'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='254'>
        <function-decl name='HasSelection' mangled-name='_ZNK9wxWebView12HasSelectionEv' filepath='include/wx/webview.h' line='240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9wxWebView12HasSelectionEv@@WXU_3.2'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='255'>
        <function-decl name='DeleteSelection' mangled-name='_ZN9wxWebView15DeleteSelectionEv' filepath='include/wx/webview.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxWebView15DeleteSelectionEv@@WXU_3.2'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='256'>
        <function-decl name='GetSelectedText' mangled-name='_ZNK9wxWebView15GetSelectedTextEv' filepath='include/wx/webview.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9wxWebView15GetSelectedTextEv@@WXU_3.2'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <return type-id='type-id-36'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='257'>
        <function-decl name='GetSelectedSource' mangled-name='_ZNK9wxWebView17GetSelectedSourceEv' filepath='include/wx/webview.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9wxWebView17GetSelectedSourceEv@@WXU_3.2'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <return type-id='type-id-36'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='258'>
        <function-decl name='ClearSelection' mangled-name='_ZN9wxWebView14ClearSelectionEv' filepath='include/wx/webview.h' line='244' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxWebView14ClearSelectionEv@@WXU_3.2'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='259'>
        <function-decl name='CanCut' mangled-name='_ZNK9wxWebView6CanCutEv' filepath='include/wx/webview.h' line='247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9wxWebView6CanCutEv@@WXU_3.2'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='260'>
        <function-decl name='CanCopy' mangled-name='_ZNK9wxWebView7CanCopyEv' filepath='include/wx/webview.h' line='248' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9wxWebView7CanCopyEv@@WXU_3.2'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='261'>
        <function-decl name='CanPaste' mangled-name='_ZNK9wxWebView8CanPasteEv' filepath='include/wx/webview.h' line='249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK9wxWebView8CanPasteEv@@WXU_3.2'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='262'>
        <function-decl name='Cut' mangled-name='_ZN9wxWebView3CutEv' filepath='include/wx/webview.h' line='250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxWebView3CutEv@@WXU_3.2'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='263'>
        <function-decl name='Copy' mangled-name='_ZN9wxWebView4CopyEv' filepath='include/wx/webview.h' line='251' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxWebView4CopyEv@@WXU_3.2'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='264'>
        <function-decl name='Paste' mangled-name='_ZN9wxWebView5PasteEv' filepath='include/wx/webview.h' line='252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxWebView5PasteEv@@WXU_3.2'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='265'>
        <function-decl name='CanUndo' mangled-name='_ZNK9wxWebView7CanUndoEv' filepath='include/wx/webview.h' line='255' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='266'>
        <function-decl name='CanRedo' mangled-name='_ZNK9wxWebView7CanRedoEv' filepath='include/wx/webview.h' line='256' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <return type-id='type-id-34'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='267'>
        <function-decl name='Undo' mangled-name='_ZN9wxWebView4UndoEv' filepath='include/wx/webview.h' line='257' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='268'>
        <function-decl name='Redo' mangled-name='_ZN9wxWebView4RedoEv' filepath='include/wx/webview.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='269'>
        <function-decl name='GetNativeBackend' mangled-name='_ZNK9wxWebView16GetNativeBackendEv' filepath='include/wx/webview.h' line='261' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-307' is-artificial='yes'/>
          <return type-id='type-id-403'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='270'>
        <function-decl name='Find' mangled-name='_ZN9wxWebView4FindERK8wxStringi' filepath='include/wx/webview.h' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN9wxWebView4FindERK8wxStringi@@WXU_3.2'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <parameter type-id='type-id-463'/>
          <parameter type-id='type-id-130'/>
          <return type-id='type-id-568'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='271'>
        <function-decl name='DoSetPage' mangled-name='_ZN9wxWebView9DoSetPageERK8wxStringS2_' filepath='include/wx/webview.h' line='266' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-395' is-artificial='yes'/>
          <parameter type-id='type-id-463'/>
          <parameter type-id='type-id-463'/>
          <return type-id='type-id-142'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxWebViewEvent' size-in-bits='2624' visibility='default' filepath='include/wx/webview.h' line='287' column='1' id='type-id-397'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-946'/>
      <data-member access='private' layout-offset-in-bits='1408'>
        <var-decl name='m_url' type-id='type-id-36' visibility='default' filepath='include/wx/webview.h' line='309' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1792'>
        <var-decl name='m_target' type-id='type-id-36' visibility='default' filepath='include/wx/webview.h' line='310' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2176'>
        <var-decl name='m_actionFlags' type-id='type-id-942' visibility='default' filepath='include/wx/webview.h' line='311' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='2240'>
        <var-decl name='m_messageHandler' type-id='type-id-36' visibility='default' filepath='include/wx/webview.h' line='312' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-775' mangled-name='_ZN14wxWebViewEvent12ms_classInfoE' visibility='default' filepath='src/common/webview.cpp' line='43' column='1' elf-symbol-id='_ZN14wxWebViewEvent12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <member-function access='public' static='yes'>
        <function-decl name='wxCreateObject' mangled-name='_ZN14wxWebViewEvent14wxCreateObjectEv' filepath='src/common/webview.cpp' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxWebViewEvent14wxCreateObjectEv@@WXU_3.2'>
          <return type-id='type-id-733'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK14wxWebViewEvent12GetClassInfoEv' filepath='include/wx/webview.h' line='314' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK14wxWebViewEvent12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-947' is-artificial='yes'/>
          <return type-id='type-id-539'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='Clone' mangled-name='_ZNK14wxWebViewEvent5CloneEv' filepath='include/wx/webview.h' line='307' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-947' is-artificial='yes'/>
          <return type-id='type-id-948'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxVisualAttributes' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/wx/window.h' line='77' column='1' id='type-id-779'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='font' type-id='type-id-949' visibility='default' filepath='include/wx/window.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='colFg' type-id='type-id-950' visibility='default' filepath='include/wx/window.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='colBg' type-id='type-id-950' visibility='default' filepath='include/wx/window.h' line='87' column='1'/>
      </data-member>
    </class-decl>
