<abi-corpus version='2.0' architecture='elf-amd-x86_64' soname='libwx_gtk3u_gl-3.2.so.0'>
  <elf-needed>
    <dependency name='libgtk-3.so.0'/>
    <dependency name='libgdk-3.so.0'/>
    <dependency name='libgobject-2.0.so.0'/>
    <dependency name='libwx_gtk3u_core-3.2.so.0'/>
    <dependency name='libwx_baseu-3.2.so.0'/>
    <dependency name='libGL.so.1'/>
    <dependency name='libEGL.so.1'/>
    <dependency name='libwayland-egl.so.1'/>
    <dependency name='libwayland-client.so.0'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_ZN10wxGLCanvas17GTKHandleRealizedEv' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN10wxGLCanvas18SetBackgroundStyleE17wxBackgroundStyle' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN10wxGLCanvas6CreateEP8wxWindowRK14wxGLAttributesiRK7wxPointRK6wxSizelRK8wxStringRK9wxPalette' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_ZTI11wxGLAppBase' size='24' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTI11wxGLContext' size='24' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTI13wxGLCanvasEGL' size='24' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTI13wxPaletteBase' size='24' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTI14wxGLCanvasBase' size='24' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTI15wxGLContextBase' size='24' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTI7wxGLAPI' size='24' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTI7wxGLApp' size='24' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS10wxGLCanvas' size='13' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS11wxGLAppBase' size='14' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS11wxGLContext' size='14' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS13wxGLCanvasEGL' size='16' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS13wxPaletteBase' size='16' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS14wxGLCanvasBase' size='17' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS15wxGLContextBase' size='18' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS7wxGLAPI' size='9' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTS7wxGLApp' size='9' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV10wxGLCanvas' size='1696' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV11wxGLAppBase' size='632' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV11wxGLContext' size='64' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV13wxGLCanvasEGL' size='1696' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV13wxPaletteBase' size='88' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV14wxGLCanvasBase' size='1688' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV15wxGLContextBase' size='64' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV7wxGLAPI' size='56' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZTV7wxGLApp' size='632' version='WXU_3.2' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/common/glcmn.cpp' language='LANG_C_plus_plus_14'>
    <type-decl name='__float128' size-in-bits='128' id='type-id-1'/>
    <type-decl name='__int128' size-in-bits='128' id='type-id-2'/>
    <type-decl name='bool' size-in-bits='8' id='type-id-3'/>
    <type-decl name='char' size-in-bits='8' id='type-id-4'/>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='128' id='type-id-5'>
      <subrange length='16' type-id='type-id-6' id='type-id-7'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='8' id='type-id-8'>
      <subrange length='1' type-id='type-id-6' id='type-id-9'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='160' id='type-id-10'>
      <subrange length='20' type-id='type-id-6' id='type-id-11'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='32' id='type-id-12'>
      <subrange length='4' type-id='type-id-6' id='type-id-13'/>
    </array-type-def>
    <class-decl name='typedef __va_list_tag __va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-15' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-16' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='type-id-17'/>
    <type-decl name='float' size-in-bits='32' id='type-id-18'/>
    <type-decl name='int' size-in-bits='32' id='type-id-19'/>
    <type-decl name='long double' size-in-bits='128' id='type-id-20'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-21'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-22'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-23'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-24'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-25'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-26'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-27'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-15'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-6'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-28'/>
    <type-decl name='variadic parameter type' id='type-id-29'/>
    <type-decl name='void' id='type-id-30'/>
    <type-decl name='wchar_t' size-in-bits='32' id='type-id-31'/>
    <array-type-def dimensions='1' type-id='type-id-31' size-in-bits='128' id='type-id-32'>
      <subrange length='4' type-id='type-id-6' id='type-id-13'/>
    </array-type-def>
    <class-decl name='wxScopedCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='66' column='1' id='type-id-33'>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-4' filepath='include/wx/buffer.h' line='69' column='1' id='type-id-34'/>
      </member-type>
      <member-type access='protected'>
        <class-decl name='Data' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='164' column='1' id='type-id-35'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-36'/>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-37' visibility='default' filepath='include/wx/buffer.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxScopedCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='66' column='1' id='type-id-38'>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-31' filepath='include/wx/buffer.h' line='69' column='1' id='type-id-39'/>
      </member-type>
      <member-type access='protected'>
        <class-decl name='Data' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/buffer.h' line='164' column='1' id='type-id-40'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-36'/>
        </class-decl>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_data' type-id='type-id-41' visibility='default' filepath='include/wx/buffer.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxScopedCharBuffer' type-id='type-id-33' filepath='include/wx/buffer.h' line='241' column='1' id='type-id-42'/>
    <typedef-decl name='wxScopedWCharBuffer' type-id='type-id-38' filepath='include/wx/buffer.h' line='242' column='1' id='type-id-43'/>
    <class-decl name='wxCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='247' column='1' id='type-id-44'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-33'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-4' filepath='include/wx/buffer.h' line='253' column='1' id='type-id-45'/>
      </member-type>
    </class-decl>
    <class-decl name='wxCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='247' column='1' id='type-id-46'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-38'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-31' filepath='include/wx/buffer.h' line='253' column='1' id='type-id-47'/>
      </member-type>
    </class-decl>
    <class-decl name='wxCharBuffer' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='357' column='1' id='type-id-48'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-44'/>
      <member-type access='public'>
        <typedef-decl name='wxCharTypeBufferBase' type-id='type-id-44' filepath='include/wx/buffer.h' line='360' column='1' id='type-id-49'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='wxScopedCharTypeBufferBase' type-id='type-id-33' filepath='include/wx/buffer.h' line='361' column='1' id='type-id-50'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWritableCharTypeBuffer&lt;char&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='393' column='1' id='type-id-51'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-44'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-34' filepath='include/wx/buffer.h' line='396' column='1' id='type-id-52'/>
      </member-type>
    </class-decl>
    <class-decl name='wxWritableCharTypeBuffer&lt;wchar_t&gt;' size-in-bits='64' visibility='default' filepath='include/wx/buffer.h' line='393' column='1' id='type-id-53'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-46'/>
      <member-type access='public'>
        <typedef-decl name='CharType' type-id='type-id-39' filepath='include/wx/buffer.h' line='396' column='1' id='type-id-54'/>
      </member-type>
    </class-decl>
    <typedef-decl name='wxWritableCharBuffer' type-id='type-id-51' filepath='include/wx/buffer.h' line='410' column='1' id='type-id-55'/>
    <typedef-decl name='wxWritableWCharBuffer' type-id='type-id-53' filepath='include/wx/buffer.h' line='411' column='1' id='type-id-56'/>
    <typedef-decl name='wxChar' type-id='type-id-31' filepath='include/wx/chartype.h' line='123' column='1' id='type-id-57'/>
    <typedef-decl name='wxStringCharType' type-id='type-id-31' filepath='include/wx/chartype.h' line='170' column='1' id='type-id-58'/>
    <class-decl name='wxClientData' size-in-bits='64' visibility='default' filepath='include/wx/clntdata.h' line='98' column='1' id='type-id-59'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxClientData' mangled-name='_ZN12wxClientDataD4Ev' filepath='include/wx/clntdata.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-60' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='wxBorder' filepath='include/wx/defs.h' line='1443' column='1' id='type-id-61'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxBORDER_DEFAULT' value='0'/>
      <enumerator name='wxBORDER_NONE' value='2097152'/>
      <enumerator name='wxBORDER_STATIC' value='16777216'/>
      <enumerator name='wxBORDER_SIMPLE' value='33554432'/>
      <enumerator name='wxBORDER_RAISED' value='67108864'/>
      <enumerator name='wxBORDER_SUNKEN' value='134217728'/>
      <enumerator name='wxBORDER_DOUBLE' value='268435456'/>
      <enumerator name='wxBORDER_THEME' value='268435456'/>
      <enumerator name='wxBORDER_MASK' value='522190848'/>
    </enum-decl>
    <enum-decl name='wxBackgroundStyle' filepath='include/wx/defs.h' line='1816' column='1' id='type-id-62'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxBG_STYLE_ERASE' value='0'/>
      <enumerator name='wxBG_STYLE_SYSTEM' value='1'/>
      <enumerator name='wxBG_STYLE_PAINT' value='2'/>
      <enumerator name='wxBG_STYLE_TRANSPARENT' value='3'/>
      <enumerator name='wxBG_STYLE_COLOUR' value='4'/>
      <enumerator name='wxBG_STYLE_CUSTOM' value='2'/>
    </enum-decl>
    <typedef-decl name='wxWindowID' type-id='type-id-19' filepath='include/wx/defs.h' line='2069' column='1' id='type-id-63'/>
    <enum-decl name='wxHitTest' filepath='include/wx/defs.h' line='2099' column='1' id='type-id-64'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxHT_NOWHERE' value='0'/>
      <enumerator name='wxHT_SCROLLBAR_FIRST' value='0'/>
      <enumerator name='wxHT_SCROLLBAR_ARROW_LINE_1' value='1'/>
      <enumerator name='wxHT_SCROLLBAR_ARROW_LINE_2' value='2'/>
      <enumerator name='wxHT_SCROLLBAR_ARROW_PAGE_1' value='3'/>
      <enumerator name='wxHT_SCROLLBAR_ARROW_PAGE_2' value='4'/>
      <enumerator name='wxHT_SCROLLBAR_THUMB' value='5'/>
      <enumerator name='wxHT_SCROLLBAR_BAR_1' value='6'/>
      <enumerator name='wxHT_SCROLLBAR_BAR_2' value='7'/>
      <enumerator name='wxHT_SCROLLBAR_LAST' value='8'/>
      <enumerator name='wxHT_WINDOW_OUTSIDE' value='9'/>
      <enumerator name='wxHT_WINDOW_INSIDE' value='10'/>
      <enumerator name='wxHT_WINDOW_VERT_SCROLLBAR' value='11'/>
      <enumerator name='wxHT_WINDOW_HORZ_SCROLLBAR' value='12'/>
      <enumerator name='wxHT_WINDOW_CORNER' value='13'/>
      <enumerator name='wxHT_MAX' value='14'/>
    </enum-decl>
    <typedef-decl name='GdkWindow' type-id='type-id-65' filepath='include/wx/defs.h' line='3091' column='1' id='type-id-66'/>
    <typedef-decl name='GtkWidget' type-id='type-id-67' filepath='include/wx/defs.h' line='3103' column='1' id='type-id-68'/>
    <typedef-decl name='GtkRcStyle' type-id='type-id-69' filepath='include/wx/defs.h' line='3104' column='1' id='type-id-70'/>
    <typedef-decl name='WXWidget' type-id='type-id-71' filepath='include/wx/defs.h' line='3115' column='1' id='type-id-72'/>
    <class-decl name='wxArray_SortFunction&lt;_GdkWindow*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-73'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-75' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-74'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-74' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArray_SortFunction&lt;const wxEventTableEntry*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-76'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-78' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-77'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-77' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;_GdkWindow*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-79'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-81' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-80'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-80' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;const wxEventTableEntry*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-82'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-84' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-83'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-83' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxBaseArray&lt;_GdkWindow*, wxSortedArray_SortFunction&lt;_GdkWindow*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-85'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-86'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-80' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-87'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-74' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-88'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-90' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-89'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseArray&lt;const wxEventTableEntry*, wxSortedArray_SortFunction&lt;const wxEventTableEntry*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-91'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-92'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-83' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-93'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-77' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-94'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-96' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-95'/>
      </member-type>
    </class-decl>
    <typedef-decl name='wxEventType' type-id='type-id-19' filepath='include/wx/event.h' line='77' column='1' id='type-id-97'/>
    <class-decl name='wxObjectEventFunctor' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='258' column='1' id='type-id-98'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-99'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-100' visibility='default' filepath='include/wx/event.h' line='288' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxObjectEventFunctorclEP12wxEvtHandlerR7wxEvent' filepath='include/wx/event.h' line='4105' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-101' is-artificial='yes'/>
          <parameter type-id='type-id-100'/>
          <parameter type-id='type-id-102'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxObjectEventFunctor10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <parameter type-id='type-id-104'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxObjectEventFunctor13GetEvtHandlerEv' filepath='include/wx/event.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <return type-id='type-id-100'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxObjectEventFunctor12GetEvtMethodEv' filepath='include/wx/event.h' line='284' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-103' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEventTableEntryBase' size-in-bits='192' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3469' column='1' id='type-id-105'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_id' type-id='type-id-19' visibility='default' filepath='include/wx/event.h' line='3504' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='m_lastId' type-id='type-id-19' visibility='default' filepath='include/wx/event.h' line='3505' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='m_fn' type-id='type-id-106' visibility='default' filepath='include/wx/event.h' line='3508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='m_callbackUserData' type-id='type-id-107' visibility='default' filepath='include/wx/event.h' line='3511' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTableEntry' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3518' column='1' id='type-id-108'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-105'/>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_eventType' type-id='type-id-109' visibility='default' filepath='include/wx/event.h' line='3532' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxDynamicEventTableEntry' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3539' column='1' id='type-id-110'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-105'/>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_eventType' type-id='type-id-19' visibility='default' filepath='include/wx/event.h' line='3550' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTable' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3560' column='1' id='type-id-111'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='baseTable' type-id='type-id-112' visibility='default' filepath='include/wx/event.h' line='3562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='entries' type-id='type-id-113' visibility='default' filepath='include/wx/event.h' line='3563' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTableEntryPointerArray' size-in-bits='192' visibility='default' filepath='include/wx/event.h' line='3570' column='1' id='type-id-114'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-91'/>
    </class-decl>
    <class-decl name='wxEventHashTable' size-in-bits='384' visibility='default' filepath='include/wx/event.h' line='3572' column='1' id='type-id-115'>
      <member-type access='private'>
        <class-decl name='EventTypeTable' size-in-bits='256' is-struct='yes' visibility='default' filepath='include/wx/event.h' line='3576' column='1' id='type-id-116'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='eventType' type-id='type-id-97' visibility='default' filepath='include/wx/event.h' line='3578' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='eventEntryTable' type-id='type-id-114' visibility='default' filepath='include/wx/event.h' line='3579' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='EventTypeTablePointer' type-id='type-id-118' filepath='include/wx/event.h' line='3581' column='1' id='type-id-117'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_table' type-id='type-id-119' visibility='default' filepath='include/wx/event.h' line='3617' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_rebuildHash' type-id='type-id-3' visibility='default' filepath='include/wx/event.h' line='3618' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_size' type-id='type-id-120' visibility='default' filepath='include/wx/event.h' line='3620' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_eventTypeTable' type-id='type-id-121' visibility='default' filepath='include/wx/event.h' line='3621' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='256'>
        <var-decl name='m_previous' type-id='type-id-122' visibility='default' filepath='include/wx/event.h' line='3624' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='320'>
        <var-decl name='m_next' type-id='type-id-122' visibility='default' filepath='include/wx/event.h' line='3625' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSize' size-in-bits='64' visibility='default' filepath='include/wx/gdicmn.h' line='282' column='1' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='286' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRealPoint' size-in-bits='128' visibility='default' filepath='include/wx/gdicmn.h' line='459' column='1' id='type-id-124'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-17' visibility='default' filepath='include/wx/gdicmn.h' line='462' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='y' type-id='type-id-17' visibility='default' filepath='include/wx/gdicmn.h' line='463' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxPoint' size-in-bits='64' visibility='default' filepath='include/wx/gdicmn.h' line='577' column='1' id='type-id-125'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='580' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='580' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRect' size-in-bits='128' visibility='default' filepath='include/wx/gdicmn.h' line='733' column='1' id='type-id-126'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='y' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='width' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='height' type-id='type-id-19' visibility='default' filepath='include/wx/gdicmn.h' line='872' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxGDIRefData' size-in-bits='128' visibility='default' filepath='include/wx/gdiobj.h' line='22' column='1' id='type-id-127'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-128'/>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='IsOk' mangled-name='_ZNK12wxGDIRefData4IsOkEv' filepath='include/wx/gdiobj.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-129' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxGLAttribsBase' size-in-bits='256' visibility='default' filepath='include/wx/glcanvas.h' line='75' column='1' id='type-id-130'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_GLValues' type-id='type-id-131' visibility='default' filepath='include/wx/glcanvas.h' line='106' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_needsARB' type-id='type-id-3' visibility='default' filepath='include/wx/glcanvas.h' line='107' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='AddAttribBits' mangled-name='_ZN15wxGLAttribsBase13AddAttribBitsEii' filepath='src/common/glcmn.cpp' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN15wxGLAttribsBase13AddAttribBitsEii@@WXU_3.2'>
          <parameter type-id='type-id-132' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-19' name='searchVal' filepath='src/common/glcmn.cpp' line='40' column='1'/>
          <parameter type-id='type-id-19' name='combineVal' filepath='src/common/glcmn.cpp' line='40' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxGLContextAttrs' size-in-bits='256' visibility='default' filepath='include/wx/glcanvas.h' line='114' column='1' id='type-id-133'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-130'/>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='x11Direct' type-id='type-id-3' visibility='default' filepath='include/wx/glcanvas.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='renderTypeRGBA' type-id='type-id-3' visibility='default' filepath='include/wx/glcanvas.h' line='137' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='EndList' mangled-name='_ZN16wxGLContextAttrs7EndListEv' filepath='src/unix/glegl.cpp' line='140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxGLContextAttrs7EndListEv@@WXU_3.2'>
          <parameter type-id='type-id-134' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='PlatformDefaults' mangled-name='_ZN16wxGLContextAttrs16PlatformDefaultsEv' filepath='src/unix/glegl.cpp' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxGLContextAttrs16PlatformDefaultsEv@@WXU_3.2'>
          <parameter type-id='type-id-134' name='this' is-artificial='yes'/>
          <return type-id='type-id-135'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='ReleaseFlush' mangled-name='_ZN16wxGLContextAttrs12ReleaseFlushEi' filepath='src/unix/glegl.cpp' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxGLContextAttrs12ReleaseFlushEi@@WXU_3.2'>
          <parameter type-id='type-id-134' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-135'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='ResetIsolation' mangled-name='_ZN16wxGLContextAttrs14ResetIsolationEv' filepath='src/unix/glegl.cpp' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxGLContextAttrs14ResetIsolationEv@@WXU_3.2'>
          <parameter type-id='type-id-134' name='this' is-artificial='yes'/>
          <return type-id='type-id-135'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='LoseOnReset' mangled-name='_ZN16wxGLContextAttrs11LoseOnResetEv' filepath='src/unix/glegl.cpp' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxGLContextAttrs11LoseOnResetEv@@WXU_3.2'>
          <parameter type-id='type-id-134' name='this' is-artificial='yes'/>
          <return type-id='type-id-135'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='NoResetNotify' mangled-name='_ZN16wxGLContextAttrs13NoResetNotifyEv' filepath='src/unix/glegl.cpp' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxGLContextAttrs13NoResetNotifyEv@@WXU_3.2'>
          <parameter type-id='type-id-134' name='this' is-artificial='yes'/>
          <return type-id='type-id-135'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Robust' mangled-name='_ZN16wxGLContextAttrs6RobustEv' filepath='src/unix/glegl.cpp' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxGLContextAttrs6RobustEv@@WXU_3.2'>
          <parameter type-id='type-id-134' name='this' is-artificial='yes'/>
          <return type-id='type-id-135'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='DebugCtx' mangled-name='_ZN16wxGLContextAttrs8DebugCtxEv' filepath='src/unix/glegl.cpp' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxGLContextAttrs8DebugCtxEv@@WXU_3.2'>
          <parameter type-id='type-id-134' name='this' is-artificial='yes'/>
          <return type-id='type-id-135'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='ES2' mangled-name='_ZN16wxGLContextAttrs3ES2Ev' filepath='src/unix/glegl.cpp' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxGLContextAttrs3ES2Ev@@WXU_3.2'>
          <parameter type-id='type-id-134' name='this' is-artificial='yes'/>
          <return type-id='type-id-135'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='ForwardCompatible' mangled-name='_ZN16wxGLContextAttrs17ForwardCompatibleEv' filepath='src/unix/glegl.cpp' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxGLContextAttrs17ForwardCompatibleEv@@WXU_3.2'>
          <parameter type-id='type-id-134' name='this' is-artificial='yes'/>
          <return type-id='type-id-135'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='CompatibilityProfile' mangled-name='_ZN16wxGLContextAttrs20CompatibilityProfileEv' filepath='src/unix/glegl.cpp' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxGLContextAttrs20CompatibilityProfileEv@@WXU_3.2'>
          <parameter type-id='type-id-134' name='this' is-artificial='yes'/>
          <return type-id='type-id-135'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='MinorVersion' mangled-name='_ZN16wxGLContextAttrs12MinorVersionEi' filepath='src/unix/glegl.cpp' line='66' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxGLContextAttrs12MinorVersionEi@@WXU_3.2'>
          <parameter type-id='type-id-134' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-135'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='MajorVersion' mangled-name='_ZN16wxGLContextAttrs12MajorVersionEi' filepath='src/unix/glegl.cpp' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxGLContextAttrs12MajorVersionEi@@WXU_3.2'>
          <parameter type-id='type-id-134' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-135'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='CoreProfile' mangled-name='_ZN16wxGLContextAttrs11CoreProfileEv' filepath='src/unix/glegl.cpp' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN16wxGLContextAttrs11CoreProfileEv@@WXU_3.2'>
          <parameter type-id='type-id-134' name='this' is-artificial='yes'/>
          <return type-id='type-id-135'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxGLAttributes' size-in-bits='256' visibility='default' filepath='include/wx/glcanvas.h' line='144' column='1' id='type-id-136'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-130'/>
      <member-function access='public'>
        <function-decl name='AddDefaultsForWXBefore31' mangled-name='_ZN14wxGLAttributes24AddDefaultsForWXBefore31Ev' filepath='src/unix/glegl.cpp' line='278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxGLAttributes24AddDefaultsForWXBefore31Ev@@WXU_3.2'>
          <parameter type-id='type-id-137' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Defaults' mangled-name='_ZN14wxGLAttributes8DefaultsEv' filepath='src/unix/glegl.cpp' line='272' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxGLAttributes8DefaultsEv@@WXU_3.2'>
          <parameter type-id='type-id-137' name='this' is-artificial='yes'/>
          <return type-id='type-id-138'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='PlatformDefaults' mangled-name='_ZN14wxGLAttributes16PlatformDefaultsEv' filepath='src/unix/glegl.cpp' line='266' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxGLAttributes16PlatformDefaultsEv@@WXU_3.2'>
          <parameter type-id='type-id-137' name='this' is-artificial='yes'/>
          <return type-id='type-id-138'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='EndList' mangled-name='_ZN14wxGLAttributes7EndListEv' filepath='src/unix/glegl.cpp' line='261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxGLAttributes7EndListEv@@WXU_3.2'>
          <parameter type-id='type-id-137' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='FrameBuffersRGB' mangled-name='_ZN14wxGLAttributes15FrameBuffersRGBEv' filepath='src/unix/glegl.cpp' line='256' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxGLAttributes15FrameBuffersRGBEv@@WXU_3.2'>
          <parameter type-id='type-id-137' name='this' is-artificial='yes'/>
          <return type-id='type-id-138'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Samplers' mangled-name='_ZN14wxGLAttributes8SamplersEi' filepath='src/unix/glegl.cpp' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxGLAttributes8SamplersEi@@WXU_3.2'>
          <parameter type-id='type-id-137' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-19' name='val' filepath='src/unix/glegl.cpp' line='246' column='1'/>
          <return type-id='type-id-138'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SampleBuffers' mangled-name='_ZN14wxGLAttributes13SampleBuffersEi' filepath='src/unix/glegl.cpp' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxGLAttributes13SampleBuffersEi@@WXU_3.2'>
          <parameter type-id='type-id-137' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-19' name='val' filepath='src/unix/glegl.cpp' line='246' column='1'/>
          <return type-id='type-id-138'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='MinAcumRGBA' mangled-name='_ZN14wxGLAttributes11MinAcumRGBAEiiii' filepath='src/unix/glegl.cpp' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxGLAttributes11MinAcumRGBAEiiii@@WXU_3.2'>
          <parameter type-id='type-id-137' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-138'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Stencil' mangled-name='_ZN14wxGLAttributes7StencilEi' filepath='src/unix/glegl.cpp' line='221' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxGLAttributes7StencilEi@@WXU_3.2'>
          <parameter type-id='type-id-137' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-19' name='val' filepath='src/unix/glegl.cpp' line='246' column='1'/>
          <return type-id='type-id-138'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Depth' mangled-name='_ZN14wxGLAttributes5DepthEi' filepath='src/unix/glegl.cpp' line='211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxGLAttributes5DepthEi@@WXU_3.2'>
          <parameter type-id='type-id-137' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-19' name='val' filepath='src/unix/glegl.cpp' line='246' column='1'/>
          <return type-id='type-id-138'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='MinRGBA' mangled-name='_ZN14wxGLAttributes7MinRGBAEiiii' filepath='src/unix/glegl.cpp' line='186' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxGLAttributes7MinRGBAEiiii@@WXU_3.2'>
          <parameter type-id='type-id-137' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-138'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='AuxBuffers' mangled-name='_ZN14wxGLAttributes10AuxBuffersEi' filepath='src/unix/glegl.cpp' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxGLAttributes10AuxBuffersEi@@WXU_3.2'>
          <parameter type-id='type-id-137' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-19' name='val' filepath='src/unix/glegl.cpp' line='246' column='1'/>
          <return type-id='type-id-138'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Stereo' mangled-name='_ZN14wxGLAttributes6StereoEv' filepath='src/unix/glegl.cpp' line='176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxGLAttributes6StereoEv@@WXU_3.2'>
          <parameter type-id='type-id-137' name='this' is-artificial='yes'/>
          <return type-id='type-id-138'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='DoubleBuffer' mangled-name='_ZN14wxGLAttributes12DoubleBufferEv' filepath='src/unix/glegl.cpp' line='171' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxGLAttributes12DoubleBufferEv@@WXU_3.2'>
          <parameter type-id='type-id-137' name='this' is-artificial='yes'/>
          <return type-id='type-id-138'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Level' mangled-name='_ZN14wxGLAttributes5LevelEi' filepath='src/unix/glegl.cpp' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxGLAttributes5LevelEi@@WXU_3.2'>
          <parameter type-id='type-id-137' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-19' name='val' filepath='src/unix/glegl.cpp' line='246' column='1'/>
          <return type-id='type-id-138'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='BufferSize' mangled-name='_ZN14wxGLAttributes10BufferSizeEi' filepath='src/unix/glegl.cpp' line='154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxGLAttributes10BufferSizeEi@@WXU_3.2'>
          <parameter type-id='type-id-137' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-19' name='val' filepath='src/unix/glegl.cpp' line='246' column='1'/>
          <return type-id='type-id-138'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='RGBA' mangled-name='_ZN14wxGLAttributes4RGBAEv' filepath='src/unix/glegl.cpp' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN14wxGLAttributes4RGBAEv@@WXU_3.2'>
          <parameter type-id='type-id-137' name='this' is-artificial='yes'/>
          <return type-id='type-id-138'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxGLAppBase' size-in-bits='5504' visibility='default' filepath='include/wx/glcanvas.h' line='312' column='1' id='type-id-139'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-140'/>
      <member-function access='public' vtable-offset='71'>
        <function-decl name='InitGLVisual' mangled-name='_ZN11wxGLAppBase12InitGLVisualEPKi' filepath='include/wx/glcanvas.h' line='320' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-141' is-artificial='yes'/>
          <parameter type-id='type-id-142'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxGLAPI' size-in-bits='128' visibility='default' filepath='include/wx/glcanvas.h' line='365' column='1' id='type-id-143'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-144'/>
      <member-function access='public' static='yes'>
        <function-decl name='glEnd' mangled-name='_ZN7wxGLAPI5glEndEv' filepath='src/common/glcmn.cpp' line='563' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7wxGLAPI5glEndEv@@WXU_3.2'>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='glColor3f' mangled-name='_ZN7wxGLAPI9glColor3fEfff' filepath='src/common/glcmn.cpp' line='554' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7wxGLAPI9glColor3fEfff@@WXU_3.2'>
          <parameter type-id='type-id-145'/>
          <parameter type-id='type-id-145'/>
          <parameter type-id='type-id-145'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='glColor4f' mangled-name='_ZN7wxGLAPI9glColor4fEffff' filepath='src/common/glcmn.cpp' line='536' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7wxGLAPI9glColor4fEffff@@WXU_3.2'>
          <parameter type-id='type-id-145'/>
          <parameter type-id='type-id-145'/>
          <parameter type-id='type-id-145'/>
          <parameter type-id='type-id-145'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='glNormal3f' mangled-name='_ZN7wxGLAPI10glNormal3fEfff' filepath='src/common/glcmn.cpp' line='519' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7wxGLAPI10glNormal3fEfff@@WXU_3.2'>
          <parameter type-id='type-id-145'/>
          <parameter type-id='type-id-145'/>
          <parameter type-id='type-id-145'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='glVertex3f' mangled-name='_ZN7wxGLAPI10glVertex3fEfff' filepath='src/common/glcmn.cpp' line='489' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7wxGLAPI10glVertex3fEfff@@WXU_3.2'>
          <parameter type-id='type-id-145'/>
          <parameter type-id='type-id-145'/>
          <parameter type-id='type-id-145'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='glTexCoord2f' mangled-name='_ZN7wxGLAPI12glTexCoord2fEff' filepath='src/common/glcmn.cpp' line='470' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7wxGLAPI12glTexCoord2fEff@@WXU_3.2'>
          <parameter type-id='type-id-145'/>
          <parameter type-id='type-id-145'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='glBegin' mangled-name='_ZN7wxGLAPI7glBeginEj' filepath='src/common/glcmn.cpp' line='448' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7wxGLAPI7glBeginEj@@WXU_3.2'>
          <parameter type-id='type-id-146'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='glFrustum' mangled-name='_ZN7wxGLAPI9glFrustumEffffff' filepath='src/common/glcmn.cpp' line='437' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7wxGLAPI9glFrustumEffffff@@WXU_3.2'>
          <parameter type-id='type-id-145'/>
          <parameter type-id='type-id-145'/>
          <parameter type-id='type-id-145'/>
          <parameter type-id='type-id-145'/>
          <parameter type-id='type-id-145'/>
          <parameter type-id='type-id-145'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxGLAPI' mangled-name='_ZN7wxGLAPIC2Ev' filepath='src/common/glcmn.cpp' line='426' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7wxGLAPIC2Ev@@WXU_3.2'>
          <parameter type-id='type-id-147' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxGLAPI' mangled-name='_ZN7wxGLAPID4Ev' filepath='src/common/glcmn.cpp' line='433' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-147' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxGLAPI' mangled-name='_ZN7wxGLAPID0Ev' filepath='src/common/glcmn.cpp' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7wxGLAPID0Ev@@WXU_3.2'>
          <parameter type-id='type-id-147' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxGLAPI' mangled-name='_ZN7wxGLAPID2Ev' filepath='src/common/glcmn.cpp' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN7wxGLAPID2Ev@@WXU_3.2'>
          <parameter type-id='type-id-147' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='GdkEventKey' type-id='type-id-148' filepath='include/wx/gtk/window.h' line='25' column='1' id='type-id-149'/>
    <class-decl name='wxArrayGdkWindows' size-in-bits='192' visibility='default' filepath='include/wx/gtk/window.h' line='28' column='1' id='type-id-150'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-85'/>
    </class-decl>
    <class-decl name='_wxHashTable_NodeBase' size-in-bits='64' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='68' column='1' id='type-id-151'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_next' type-id='type-id-152' visibility='default' filepath='include/wx/hashmap.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_wxHashTableBase2' size-in-bits='8' visibility='default' filepath='include/wx/hashmap.h' line='80' column='1' id='type-id-153'>
      <member-type access='public'>
        <typedef-decl name='NodeDtor' type-id='type-id-155' filepath='include/wx/hashmap.h' line='83' column='1' id='type-id-154'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='BucketFromNode' type-id='type-id-157' filepath='include/wx/hashmap.h' line='84' column='1' id='type-id-156'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='ProcessNode' type-id='type-id-159' filepath='include/wx/hashmap.h' line='85' column='1' id='type-id-158'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringHash' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='566' column='1' id='type-id-160'/>
    <class-decl name='wxStringEqual' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='589' column='1' id='type-id-161'/>
    <class-decl name='wxStringToStringHashMap' size-in-bits='256' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-162'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-163'/>
      <member-type access='public'>
        <class-decl name='Insert_Result' size-in-bits='192' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-164'>
          <member-type access='public'>
            <typedef-decl name='const_t1' type-id='type-id-166' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-165'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_t2' type-id='type-id-168' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-167'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t1' type-id='type-id-170' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-169'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t2' type-id='type-id-3' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-171'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='first' type-id='type-id-169' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='second' type-id='type-id-171' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='mapped_type' type-id='type-id-173' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-172'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringToStringHashMap_wxImplementation_HashTable' size-in-bits='256' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-163'>
      <base-class access='protected' layout-offset-in-bits='0' type-id='type-id-153'/>
      <member-type access='public'>
        <class-decl name='Iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-174'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-175' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_ht' type-id='type-id-176' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='Node' size-in-bits='832' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-177'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-151'/>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_value' type-id='type-id-178' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-179'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-174'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-170'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-174'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='Self' type-id='type-id-163' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-180'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_key_type' type-id='type-id-182' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-181'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_pointer' type-id='type-id-184' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-183'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-186' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-185'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='hasher' type-id='type-id-160' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-187'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_equal' type-id='type-id-161' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-188'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_extractor' type-id='type-id-190' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-189'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_type' type-id='type-id-173' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-191'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='pointer' type-id='type-id-193' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-192'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-195' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-194'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-120' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-196'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-197' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-178'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_table' type-id='type-id-198' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_tableBuckets' type-id='type-id-120' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_items' type-id='type-id-120' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_hasher' type-id='type-id-187' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='200'>
        <var-decl name='m_equals' type-id='type-id-188' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='208'>
        <var-decl name='m_getKey' type-id='type-id-189' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxStringToStringHashMap_wxImplementation_KeyEx' size-in-bits='8' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-190'>
      <member-type access='private'>
        <typedef-decl name='const_key_reference' type-id='type-id-200' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-199'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_key_type' type-id='type-id-202' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-201'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_reference' type-id='type-id-204' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-203'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_type' type-id='type-id-206' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-205'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='key_type' type-id='type-id-173' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-207'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='pair_type' type-id='type-id-197' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-208'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringToStringHashMap_wxImplementation_Pair' size-in-bits='768' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-197'>
      <member-type access='public'>
        <typedef-decl name='const_t1' type-id='type-id-182' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-209'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_t2' type-id='type-id-182' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-210'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t1' type-id='type-id-173' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-211'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t2' type-id='type-id-173' filepath='include/wx/hashmap.h' line='725' column='1' id='type-id-212'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='first' type-id='type-id-211' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='second' type-id='type-id-212' visibility='default' filepath='include/wx/hashmap.h' line='725' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxStringToNumHashMap' size-in-bits='256' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-213'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-214'/>
      <member-type access='public'>
        <class-decl name='Insert_Result' size-in-bits='192' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-215'>
          <member-type access='public'>
            <typedef-decl name='const_t1' type-id='type-id-217' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-216'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='const_t2' type-id='type-id-168' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-218'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t1' type-id='type-id-220' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-219'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='t2' type-id='type-id-3' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-221'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='first' type-id='type-id-219' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='128'>
            <var-decl name='second' type-id='type-id-221' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='mapped_type' type-id='type-id-223' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-222'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringToNumHashMap_wxImplementation_HashTable' size-in-bits='256' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-214'>
      <base-class access='protected' layout-offset-in-bits='0' type-id='type-id-153'/>
      <member-type access='public'>
        <class-decl name='Iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-224'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-225' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_ht' type-id='type-id-226' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='Node' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-227'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-151'/>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_value' type-id='type-id-228' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-229'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-224'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='128' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-220'>
          <base-class access='public' layout-offset-in-bits='0' type-id='type-id-224'/>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='Self' type-id='type-id-214' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-230'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_key_type' type-id='type-id-182' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-231'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_pointer' type-id='type-id-233' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-232'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-235' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-234'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='hasher' type-id='type-id-160' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-236'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_equal' type-id='type-id-161' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-237'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_extractor' type-id='type-id-239' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-238'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='key_type' type-id='type-id-173' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-240'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='pointer' type-id='type-id-242' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-241'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-244' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-243'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-120' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-245'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-246' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-228'/>
      </member-type>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_table' type-id='type-id-198' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_tableBuckets' type-id='type-id-120' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_items' type-id='type-id-120' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_hasher' type-id='type-id-236' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='200'>
        <var-decl name='m_equals' type-id='type-id-237' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='208'>
        <var-decl name='m_getKey' type-id='type-id-238' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxStringToNumHashMap_wxImplementation_KeyEx' size-in-bits='8' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-239'>
      <member-type access='private'>
        <typedef-decl name='const_key_reference' type-id='type-id-248' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-247'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_key_type' type-id='type-id-250' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-249'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_reference' type-id='type-id-252' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-251'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='const_pair_type' type-id='type-id-254' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-253'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='key_type' type-id='type-id-173' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-255'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='pair_type' type-id='type-id-246' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-256'/>
      </member-type>
    </class-decl>
    <class-decl name='wxStringToNumHashMap_wxImplementation_Pair' size-in-bits='448' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-246'>
      <member-type access='public'>
        <typedef-decl name='const_t1' type-id='type-id-182' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-257'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_t2' type-id='type-id-259' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-258'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t1' type-id='type-id-173' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-260'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='t2' type-id='type-id-223' filepath='include/wx/hashmap.h' line='728' column='1' id='type-id-261'/>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='first' type-id='type-id-260' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='second' type-id='type-id-261' visibility='default' filepath='include/wx/hashmap.h' line='728' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxLayoutDirection' filepath='include/wx/localedefs.h' line='20' column='1' id='type-id-262'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxLayout_Default' value='0'/>
      <enumerator name='wxLayout_LeftToRight' value='1'/>
      <enumerator name='wxLayout_RightToLeft' value='2'/>
    </enum-decl>
    <typedef-decl name='wxLogLevel' type-id='type-id-6' filepath='include/wx/log.h' line='22' column='1' id='type-id-263'/>
    <class-decl name='wxLogRecordInfo' size-in-bits='512' visibility='default' filepath='include/wx/log.h' line='141' column='1' id='type-id-264'>
      <member-type access='private'>
        <class-decl name='ExtraData' size-in-bits='512' is-struct='yes' visibility='default' filepath='include/wx/log.h' line='289' column='1' id='type-id-265'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='numValues' type-id='type-id-213' visibility='default' filepath='include/wx/log.h' line='291' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='256'>
            <var-decl name='strValues' type-id='type-id-162' visibility='default' filepath='include/wx/log.h' line='292' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='filename' type-id='type-id-266' visibility='default' filepath='include/wx/log.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='line' type-id='type-id-19' visibility='default' filepath='include/wx/log.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='func' type-id='type-id-266' visibility='default' filepath='include/wx/log.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='component' type-id='type-id-266' visibility='default' filepath='include/wx/log.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='timestampMS' type-id='type-id-22' visibility='default' filepath='include/wx/log.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='timestamp' type-id='type-id-267' visibility='default' filepath='include/wx/log.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='threadId' type-id='type-id-268' visibility='default' filepath='include/wx/log.h' line='224' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='m_data' type-id='type-id-269' visibility='default' filepath='include/wx/log.h' line='296' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxLogger' size-in-bits='960' visibility='default' filepath='include/wx/log.h' line='897' column='1' id='type-id-270'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_level' type-id='type-id-271' visibility='default' filepath='include/wx/log.h' line='1198' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_info' type-id='type-id-264' visibility='default' filepath='include/wx/log.h' line='1199' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='m_optKey' type-id='type-id-173' visibility='default' filepath='include/wx/log.h' line='1201' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxLongLong' type-id='type-id-272' filepath='include/wx/longlong.h' line='90' column='1' id='type-id-273'/>
    <class-decl name='wxLongLongNative' size-in-bits='64' visibility='default' filepath='include/wx/longlong.h' line='106' column='1' id='type-id-272'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_ll' type-id='type-id-22' visibility='default' filepath='include/wx/longlong.h' line='343' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxULongLongNative' size-in-bits='64' visibility='default' filepath='include/wx/longlong.h' line='347' column='1' id='type-id-274'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_ll' type-id='type-id-23' visibility='default' filepath='include/wx/longlong.h' line='562' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxRefCounter' size-in-bits='128' visibility='default' filepath='include/wx/object.h' line='228' column='1' id='type-id-128'>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_count' type-id='type-id-19' visibility='default' filepath='include/wx/object.h' line='245' column='1'/>
      </data-member>
      <member-function access='protected' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxRefCounter' mangled-name='_ZN12wxRefCounterD4Ev' filepath='include/wx/object.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-275' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='wxObjectRefData' type-id='type-id-128' filepath='include/wx/object.h' line='258' column='1' id='type-id-276'/>
    <class-decl name='wxPaletteBase' size-in-bits='128' visibility='default' filepath='include/wx/palette.h' line='22' column='1' id='type-id-277'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-278'/>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPaletteBase' mangled-name='_ZN13wxPaletteBaseD4Ev' filepath='include/wx/palette.h' line='25' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-279' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='8'>
        <function-decl name='GetColoursCount' mangled-name='_ZNK13wxPaletteBase15GetColoursCountEv' filepath='include/wx/palette.h' line='27' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-280' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='wxObjectConstructorFn' type-id='type-id-281' filepath='include/wx/rtti.h' line='39' column='1' id='type-id-282'/>
    <class-decl name='wxClassInfo' size-in-bits='384' visibility='default' filepath='include/wx/rtti.h' line='41' column='1' id='type-id-283'>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-284'>
          <member-type access='private'>
            <typedef-decl name='Node' type-id='type-id-286' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-285'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-284' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-287'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-289' filepath='include/wx/rtti.h' line='106' column='1' id='type-id-288'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-290' visibility='default' filepath='include/wx/rtti.h' line='106' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_table' type-id='type-id-291' visibility='default' filepath='include/wx/rtti.h' line='106' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_className' type-id='type-id-292' visibility='default' filepath='include/wx/rtti.h' line='109' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_objectSize' type-id='type-id-19' visibility='default' filepath='include/wx/rtti.h' line='110' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_objectConstructor' type-id='type-id-282' visibility='default' filepath='include/wx/rtti.h' line='111' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_baseInfo1' type-id='type-id-289' visibility='default' filepath='include/wx/rtti.h' line='115' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_baseInfo2' type-id='type-id-289' visibility='default' filepath='include/wx/rtti.h' line='116' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='sm_first' type-id='type-id-293' mangled-name='_ZN11wxClassInfo8sm_firstE' visibility='default' filepath='include/wx/rtti.h' line='121' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='m_next' type-id='type-id-293' visibility='default' filepath='include/wx/rtti.h' line='122' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxCStrData' size-in-bits='192' visibility='default' filepath='include/wx/string.h' line='152' column='1' id='type-id-294'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_str' type-id='type-id-295' visibility='default' filepath='include/wx/string.h' line='245' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_offset' type-id='type-id-120' visibility='default' filepath='include/wx/string.h' line='252' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_owned' type-id='type-id-3' visibility='default' filepath='include/wx/string.h' line='254' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxString' size-in-bits='384' visibility='default' filepath='include/wx/string.h' line='301' column='1' id='type-id-173'>
      <member-type access='private'>
        <class-decl name='SubstrBufFromType&lt;wchar_t const*&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='337' column='1' id='type-id-296'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='data' type-id='type-id-297' visibility='default' filepath='include/wx/string.h' line='339' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='len' type-id='type-id-120' visibility='default' filepath='include/wx/string.h' line='340' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='SubstrBufFromType&lt;wxScopedCharTypeBuffer&lt;wchar_t&gt; &gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='337' column='1' id='type-id-298'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='data' type-id='type-id-38' visibility='default' filepath='include/wx/string.h' line='339' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='len' type-id='type-id-120' visibility='default' filepath='include/wx/string.h' line='340' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='SubstrBufFromWC' type-id='type-id-296' filepath='include/wx/string.h' line='354' column='1' id='type-id-299'/>
      </member-type>
      <member-type access='private'>
        <typedef-decl name='SubstrBufFromMB' type-id='type-id-298' filepath='include/wx/string.h' line='355' column='1' id='type-id-300'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-120' filepath='include/wx/string.h' line='752' column='1' id='type-id-301'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-303' filepath='include/wx/string.h' line='753' column='1' id='type-id-302'/>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='963' column='1' id='type-id-304'>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-306' filepath='include/wx/string.h' line='965' column='1' id='type-id-305'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-308' filepath='include/wx/string.h' line='965' column='1' id='type-id-307'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='underlying_iterator' type-id='type-id-310' filepath='include/wx/string.h' line='965' column='1' id='type-id-309'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-309' visibility='default' filepath='include/wx/string.h' line='965' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='994' column='1' id='type-id-311'>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-306' filepath='include/wx/string.h' line='998' column='1' id='type-id-312'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-314' filepath='include/wx/string.h' line='998' column='1' id='type-id-313'/>
          </member-type>
          <member-type access='private'>
            <typedef-decl name='underlying_iterator' type-id='type-id-316' filepath='include/wx/string.h' line='998' column='1' id='type-id-315'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-315' visibility='default' filepath='include/wx/string.h' line='998' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator_impl&lt;wxString::const_iterator&gt;' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='1060' column='1' id='type-id-317'>
          <member-type access='public'>
            <typedef-decl name='iterator_type' type-id='type-id-311' filepath='include/wx/string.h' line='1063' column='1' id='type-id-318'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-312' filepath='include/wx/string.h' line='1067' column='1' id='type-id-319'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-313' filepath='include/wx/string.h' line='1068' column='1' id='type-id-320'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-318' visibility='default' filepath='include/wx/string.h' line='1115' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator_impl&lt;wxString::iterator&gt;' size-in-bits='64' visibility='default' filepath='include/wx/string.h' line='1060' column='1' id='type-id-321'>
          <member-type access='public'>
            <typedef-decl name='iterator_type' type-id='type-id-304' filepath='include/wx/string.h' line='1063' column='1' id='type-id-322'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='difference_type' type-id='type-id-305' filepath='include/wx/string.h' line='1067' column='1' id='type-id-323'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-307' filepath='include/wx/string.h' line='1068' column='1' id='type-id-324'/>
          </member-type>
          <data-member access='private' layout-offset-in-bits='0'>
            <var-decl name='m_cur' type-id='type-id-322' visibility='default' filepath='include/wx/string.h' line='1115' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reverse_iterator' type-id='type-id-321' filepath='include/wx/string.h' line='1118' column='1' id='type-id-325'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reverse_iterator' type-id='type-id-317' filepath='include/wx/string.h' line='1119' column='1' id='type-id-326'/>
      </member-type>
      <member-type access='public'>
        <enum-decl name='caseCompare' filepath='include/wx/string.h' line='2386' column='1' id='type-id-327'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='exact' value='0'/>
          <enumerator name='ignoreCase' value='1'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <enum-decl name='stripType' filepath='include/wx/string.h' line='2388' column='1' id='type-id-328'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='leading' value='1'/>
          <enumerator name='trailing' value='2'/>
          <enumerator name='both' value='3'/>
        </enum-decl>
      </member-type>
      <member-type access='private'>
        <class-decl name='ConvertedBuffer&lt;char&gt;' size-in-bits='128' is-struct='yes' visibility='default' filepath='include/wx/string.h' line='3599' column='1' id='type-id-329'>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_str' type-id='type-id-330' visibility='default' filepath='include/wx/string.h' line='3625' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_len' type-id='type-id-120' visibility='default' filepath='include/wx/string.h' line='3626' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <data-member access='public' static='yes'>
        <var-decl name='npos' type-id='type-id-331' mangled-name='_ZN8wxString4nposE' visibility='default' filepath='include/wx/string.h' line='308' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_impl' type-id='type-id-332' visibility='default' filepath='include/wx/string.h' line='3589' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_convertedToChar' type-id='type-id-329' visibility='default' filepath='include/wx/string.h' line='3677' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxStdWideString' type-id='type-id-333' filepath='include/wx/stringimpl.h' line='70' column='1' id='type-id-334'/>
    <typedef-decl name='wxStdString' type-id='type-id-334' filepath='include/wx/stringimpl.h' line='76' column='1' id='type-id-335'/>
    <typedef-decl name='wxStringImpl' type-id='type-id-335' filepath='include/wx/stringimpl.h' line='90' column='1' id='type-id-332'/>
    <class-decl name='wxFormatString' size-in-bits='320' visibility='default' filepath='include/wx/strvararg.h' line='137' column='1' id='type-id-336'>
      <member-type access='public'>
        <enum-decl name='ArgumentType' filepath='include/wx/strvararg.h' line='161' column='1' id='type-id-337'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Arg_Unused' value='0'/>
          <enumerator name='Arg_Char' value='1'/>
          <enumerator name='Arg_Pointer' value='2'/>
          <enumerator name='Arg_String' value='6'/>
          <enumerator name='Arg_Int' value='9'/>
          <enumerator name='Arg_LongInt' value='16'/>
          <enumerator name='Arg_LongLongInt' value='16'/>
          <enumerator name='Arg_Double' value='64'/>
          <enumerator name='Arg_LongDouble' value='128'/>
          <enumerator name='Arg_Size_t' value='16'/>
          <enumerator name='Arg_IntPtr' value='512'/>
          <enumerator name='Arg_ShortIntPtr' value='1024'/>
          <enumerator name='Arg_LongIntPtr' value='2048'/>
          <enumerator name='Arg_Unknown' value='32768'/>
        </enum-decl>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_convertedWChar' type-id='type-id-43' visibility='default' filepath='include/wx/strvararg.h' line='232' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_char' type-id='type-id-42' visibility='default' filepath='include/wx/strvararg.h' line='236' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_wchar' type-id='type-id-43' visibility='default' filepath='include/wx/strvararg.h' line='237' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_str' type-id='type-id-338' visibility='default' filepath='include/wx/strvararg.h' line='242' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_cstr' type-id='type-id-339' visibility='default' filepath='include/wx/strvararg.h' line='243' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxMutexError' filepath='include/wx/thread.h' line='28' column='1' id='type-id-340'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxMUTEX_NO_ERROR' value='0'/>
      <enumerator name='wxMUTEX_INVALID' value='1'/>
      <enumerator name='wxMUTEX_DEAD_LOCK' value='2'/>
      <enumerator name='wxMUTEX_BUSY' value='3'/>
      <enumerator name='wxMUTEX_UNLOCKED' value='4'/>
      <enumerator name='wxMUTEX_TIMEOUT' value='5'/>
      <enumerator name='wxMUTEX_MISC_ERROR' value='6'/>
    </enum-decl>
    <enum-decl name='wxThreadError' filepath='include/wx/thread.h' line='57' column='1' id='type-id-341'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxTHREAD_NO_ERROR' value='0'/>
      <enumerator name='wxTHREAD_NO_RESOURCE' value='1'/>
      <enumerator name='wxTHREAD_RUNNING' value='2'/>
      <enumerator name='wxTHREAD_NOT_RUNNING' value='3'/>
      <enumerator name='wxTHREAD_KILLED' value='4'/>
      <enumerator name='wxTHREAD_MISC_ERROR' value='5'/>
    </enum-decl>
    <enum-decl name='wxThreadKind' filepath='include/wx/thread.h' line='67' column='1' id='type-id-342'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxTHREAD_DETACHED' value='0'/>
      <enumerator name='wxTHREAD_JOINABLE' value='1'/>
    </enum-decl>
    <enum-decl name='wxMutexType' filepath='include/wx/thread.h' line='112' column='1' id='type-id-343'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxMUTEX_DEFAULT' value='0'/>
      <enumerator name='wxMUTEX_RECURSIVE' value='1'/>
    </enum-decl>
    <class-decl name='wxMutex' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='137' column='1' id='type-id-344'>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_internal' type-id='type-id-345' visibility='default' filepath='include/wx/thread.h' line='174' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxCriticalSectionType' filepath='include/wx/thread.h' line='231' column='1' id='type-id-346'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxCRITSEC_DEFAULT' value='0'/>
      <enumerator name='wxCRITSEC_NON_RECURSIVE' value='1'/>
    </enum-decl>
    <class-decl name='wxCriticalSection' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='242' column='1' id='type-id-347'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_mutex' type-id='type-id-344' visibility='default' filepath='include/wx/thread.h' line='259' column='1'/>
      </data-member>
      <member-function access='public'>
        <function-decl name='Leave' mangled-name='_ZN17wxCriticalSection5LeaveEv' filepath='include/wx/thread.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxCriticalSection5LeaveEv@@WXU_3.2'>
          <parameter type-id='type-id-348' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Enter' mangled-name='_ZN17wxCriticalSection5EnterEv' filepath='include/wx/thread.h' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxCriticalSection5EnterEv@@WXU_3.2'>
          <parameter type-id='type-id-348' name='this' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxCriticalSectionLocker' size-in-bits='64' visibility='default' filepath='include/wx/thread.h' line='301' column='1' id='type-id-349'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_critsect' type-id='type-id-350' visibility='default' filepath='include/wx/thread.h' line='316' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxThreadIdType' type-id='type-id-6' filepath='include/wx/thread.h' line='448' column='1' id='type-id-268'/>
    <class-decl name='wxThreadHelperThread' size-in-bits='320' visibility='default' filepath='include/wx/thread.h' line='658' column='1' id='type-id-351'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-352'/>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_owner' type-id='type-id-353' visibility='default' filepath='include/wx/thread.h' line='673' column='1'/>
      </data-member>
      <member-function access='protected' vtable-offset='3'>
        <function-decl name='Entry' mangled-name='_ZN20wxThreadHelperThread5EntryEv' filepath='include/wx/thread.h' line='761' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-354' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxThreadHelper' size-in-bits='256' visibility='default' filepath='include/wx/thread.h' line='686' column='1' id='type-id-355'>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_thread' type-id='type-id-356' visibility='default' filepath='include/wx/thread.h' line='748' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_kind' type-id='type-id-342' visibility='default' filepath='include/wx/thread.h' line='749' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_critSection' type-id='type-id-347' visibility='default' filepath='include/wx/thread.h' line='750' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThreadHelper' mangled-name='_ZN14wxThreadHelperD4Ev' filepath='include/wx/thread.h' line='714' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-357' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='Entry' mangled-name='_ZN14wxThreadHelper5EntryEv' filepath='include/wx/thread.h' line='735' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-357' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxTypeIdentifier' size-in-bits='64' visibility='default' filepath='include/wx/typeinfo.h' line='63' column='1' id='type-id-358'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_className' type-id='type-id-266' visibility='default' filepath='include/wx/typeinfo.h' line='81' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxCoord' type-id='type-id-19' filepath='include/wx/types.h' line='26' column='1' id='type-id-359'/>
    <typedef-decl name='wxUint8' type-id='type-id-27' filepath='include/wx/types.h' line='43' column='1' id='type-id-360'/>
    <typedef-decl name='wxByte' type-id='type-id-360' filepath='include/wx/types.h' line='44' column='1' id='type-id-361'/>
    <typedef-decl name='wxUint16' type-id='type-id-28' filepath='include/wx/types.h' line='57' column='1' id='type-id-362'/>
    <typedef-decl name='wxInt32' type-id='type-id-19' filepath='include/wx/types.h' line='145' column='1' id='type-id-363'/>
    <typedef-decl name='wxUint32' type-id='type-id-15' filepath='include/wx/types.h' line='146' column='1' id='type-id-364'/>
    <typedef-decl name='wxUIntPtr' type-id='type-id-6' filepath='include/wx/types.h' line='365' column='1' id='type-id-223'/>
    <class-decl name='wxUniChar' size-in-bits='32' visibility='default' filepath='include/wx/unichar.h' line='29' column='1' id='type-id-314'>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-364' filepath='include/wx/unichar.h' line='35' column='1' id='type-id-365'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_value' type-id='type-id-365' visibility='default' filepath='include/wx/unichar.h' line='212' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxUniCharRef' size-in-bits='64' visibility='default' filepath='include/wx/unichar.h' line='220' column='1' id='type-id-308'>
      <member-type access='private'>
        <typedef-decl name='iterator' type-id='type-id-310' filepath='include/wx/unichar.h' line='223' column='1' id='type-id-366'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_pos' type-id='type-id-366' visibility='default' filepath='include/wx/unichar.h' line='325' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='EGLConfig' type-id='type-id-16' filepath='include/wx/unix/glegl.h' line='24' column='1' id='type-id-367'/>
    <class-decl name='wxGLContext' size-in-bits='256' visibility='default' filepath='include/wx/unix/glegl.h' line='35' column='1' id='type-id-368'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-369'/>
      <data-member access='private' layout-offset-in-bits='192'>
        <var-decl name='m_glContext' type-id='type-id-370' visibility='default' filepath='include/wx/unix/glegl.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-283' mangled-name='_ZN11wxGLContext12ms_classInfoE' visibility='default' filepath='src/unix/glegl.cpp' line='289' column='1' elf-symbol-id='_ZN11wxGLContext12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxGLContext' mangled-name='_ZN11wxGLContextC2EP10wxGLCanvasPKS_PK16wxGLContextAttrs' filepath='src/unix/glegl.cpp' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxGLContextC2EP10wxGLCanvasPKS_PK16wxGLContextAttrs@@WXU_3.2'>
          <parameter type-id='type-id-371' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-372' name='win' filepath='src/unix/glegl.cpp' line='291' column='1'/>
          <parameter type-id='type-id-373' name='other' filepath='src/unix/glegl.cpp' line='292' column='1'/>
          <parameter type-id='type-id-374' name='ctxAttrs' filepath='src/unix/glegl.cpp' line='293' column='1'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxGLContext' mangled-name='_ZN11wxGLContextD4Ev' filepath='src/unix/glegl.cpp' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-375' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxGLContext' mangled-name='_ZN11wxGLContextD0Ev' filepath='src/unix/glegl.cpp' line='323' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxGLContextD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-375' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxGLContext' mangled-name='_ZN11wxGLContextD2Ev' filepath='src/unix/glegl.cpp' line='323' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN11wxGLContextD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-375' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK11wxGLContext12GetClassInfoEv' filepath='src/unix/glegl.cpp' line='289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK11wxGLContext12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-373' is-artificial='yes'/>
          <return type-id='type-id-293'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='SetCurrent' mangled-name='_ZNK11wxGLContext10SetCurrentERK10wxGLCanvas' filepath='src/unix/glegl.cpp' line='335' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK11wxGLContext10SetCurrentERK10wxGLCanvas@@WXU_3.2'>
          <parameter type-id='type-id-373' is-artificial='yes'/>
          <parameter type-id='type-id-376'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxGLApp' size-in-bits='5504' visibility='default' filepath='include/wx/unix/glegl.h' line='148' column='1' id='type-id-377'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-139'/>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-283' mangled-name='_ZN7wxGLApp12ms_classInfoE' visibility='default' filepath='src/common/glcmn.cpp' line='34' column='1' elf-symbol-id='_ZN7wxGLApp12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK7wxGLApp12GetClassInfoEv' filepath='src/common/glcmn.cpp' line='34' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK7wxGLApp12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-378' is-artificial='yes'/>
          <return type-id='type-id-293'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='28'>
        <function-decl name='OnExit' mangled-name='_ZN7wxGLApp6OnExitEv' filepath='include/wx/unix/glegl.h' line='168' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-379' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='70'>
        <function-decl name='GetXVisualInfo' mangled-name='_ZN7wxGLApp14GetXVisualInfoEv' filepath='include/wx/unix/glegl.h' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-379' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='71'>
        <function-decl name='InitGLVisual' mangled-name='_ZN7wxGLApp12InitGLVisualEPKi' filepath='include/wx/unix/glegl.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-379' is-artificial='yes'/>
          <parameter type-id='type-id-142'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxVector&lt;_GdkWindow*&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-86'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-120' filepath='include/wx/vector.h' line='179' column='1' id='type-id-380'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-382' filepath='include/wx/vector.h' line='181' column='1' id='type-id-381'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-384' filepath='include/wx/vector.h' line='184' column='1' id='type-id-383'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-386' filepath='include/wx/vector.h' line='185' column='1' id='type-id-385'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-387' filepath='include/wx/vector.h' line='187' column='1' id='type-id-90'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-388'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-389'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_INITIAL_SIZE' type-id='type-id-390' mangled-name='_ZN8wxVectorIP10_GdkWindowE18ALLOC_INITIAL_SIZEE' visibility='default' filepath='include/wx/vector.h' line='592' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-380' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-380' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-384' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVector&lt;const wxEventTableEntry*&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-92'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-120' filepath='include/wx/vector.h' line='179' column='1' id='type-id-391'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-113' filepath='include/wx/vector.h' line='181' column='1' id='type-id-392'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-394' filepath='include/wx/vector.h' line='184' column='1' id='type-id-393'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-396' filepath='include/wx/vector.h' line='185' column='1' id='type-id-395'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-397' filepath='include/wx/vector.h' line='187' column='1' id='type-id-96'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-398'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-399'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_INITIAL_SIZE' type-id='type-id-400' mangled-name='_ZN8wxVectorIPK17wxEventTableEntryE18ALLOC_INITIAL_SIZEE' visibility='default' filepath='include/wx/vector.h' line='592' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-391' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-391' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-394' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVector&lt;int&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-131'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-120' filepath='include/wx/vector.h' line='179' column='1' id='type-id-401'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-19' filepath='include/wx/vector.h' line='181' column='1' id='type-id-402'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-404' filepath='include/wx/vector.h' line='184' column='1' id='type-id-403'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-406' filepath='include/wx/vector.h' line='185' column='1' id='type-id-405'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-407'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-408'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_INITIAL_SIZE' type-id='type-id-409' mangled-name='_ZN8wxVectorIiE18ALLOC_INITIAL_SIZEE' visibility='default' filepath='include/wx/vector.h' line='592' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-401' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-401' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-404' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVisualAttributes' size-in-bits='384' is-struct='yes' visibility='default' filepath='include/wx/window.h' line='77' column='1' id='type-id-410'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='font' type-id='type-id-411' visibility='default' filepath='include/wx/window.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='colFg' type-id='type-id-412' visibility='default' filepath='include/wx/window.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='colBg' type-id='type-id-412' visibility='default' filepath='include/wx/window.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='wxWindowVariant' filepath='include/wx/window.h' line='92' column='1' id='type-id-413'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxWINDOW_VARIANT_NORMAL' value='0'/>
      <enumerator name='wxWINDOW_VARIANT_SMALL' value='1'/>
      <enumerator name='wxWINDOW_VARIANT_MINI' value='2'/>
      <enumerator name='wxWINDOW_VARIANT_LARGE' value='3'/>
      <enumerator name='wxWINDOW_VARIANT_MAX' value='4'/>
    </enum-decl>
    <enum-decl name='wxShowEffect' filepath='include/wx/window.h' line='106' column='1' id='type-id-414'>
      <underlying-type type-id='type-id-26'/>
      <enumerator name='wxSHOW_EFFECT_NONE' value='0'/>
      <enumerator name='wxSHOW_EFFECT_ROLL_TO_LEFT' value='1'/>
      <enumerator name='wxSHOW_EFFECT_ROLL_TO_RIGHT' value='2'/>
      <enumerator name='wxSHOW_EFFECT_ROLL_TO_TOP' value='3'/>
      <enumerator name='wxSHOW_EFFECT_ROLL_TO_BOTTOM' value='4'/>
      <enumerator name='wxSHOW_EFFECT_SLIDE_TO_LEFT' value='5'/>
      <enumerator name='wxSHOW_EFFECT_SLIDE_TO_RIGHT' value='6'/>
      <enumerator name='wxSHOW_EFFECT_SLIDE_TO_TOP' value='7'/>
      <enumerator name='wxSHOW_EFFECT_SLIDE_TO_BOTTOM' value='8'/>
      <enumerator name='wxSHOW_EFFECT_BLEND' value='9'/>
      <enumerator name='wxSHOW_EFFECT_EXPAND' value='10'/>
      <enumerator name='wxSHOW_EFFECT_MAX' value='11'/>
    </enum-decl>
    <class-decl name='wxWindowIDRef' size-in-bits='32' visibility='default' filepath='include/wx/windowid.h' line='26' column='1' id='type-id-415'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_id' type-id='type-id-63' visibility='default' filepath='include/wx/windowid.h' line='114' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxBuildOptionsChecker' size-in-bits='8' is-struct='yes' visibility='default' filepath='src/common/glcmn.cpp' line='32' column='1' id='type-id-416'/>
    <typedef-decl name='GLenum' type-id='type-id-15' filepath='/usr/include/GL/gl.h' line='116' column='1' id='type-id-146'/>
    <typedef-decl name='GLboolean' type-id='type-id-27' filepath='/usr/include/GL/gl.h' line='117' column='1' id='type-id-417'/>
    <typedef-decl name='GLint' type-id='type-id-19' filepath='/usr/include/GL/gl.h' line='122' column='1' id='type-id-418'/>
    <typedef-decl name='GLfloat' type-id='type-id-18' filepath='/usr/include/GL/gl.h' line='127' column='1' id='type-id-145'/>
    <typedef-decl name='GLdouble' type-id='type-id-17' filepath='/usr/include/GL/gl.h' line='129' column='1' id='type-id-419'/>
    <class-decl name='_GtkWidget' size-in-bits='256' is-struct='yes' visibility='default' filepath='/usr/include/gtk-3.0/gtk/gtkwidget.h' line='133' column='1' id='type-id-67'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-420' visibility='default' filepath='/usr/include/gtk-3.0/gtk/gtkwidget.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-421' visibility='default' filepath='/usr/include/gtk-3.0/gtk/gtkwidget.h' line='139' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='lconv' size-in-bits='768' is-struct='yes' visibility='default' filepath='/usr/include/locale.h' line='51' column='1' id='type-id-422'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='decimal_point' type-id='type-id-330' visibility='default' filepath='/usr/include/locale.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thousands_sep' type-id='type-id-330' visibility='default' filepath='/usr/include/locale.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='grouping' type-id='type-id-330' visibility='default' filepath='/usr/include/locale.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='int_curr_symbol' type-id='type-id-330' visibility='default' filepath='/usr/include/locale.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='currency_symbol' type-id='type-id-330' visibility='default' filepath='/usr/include/locale.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mon_decimal_point' type-id='type-id-330' visibility='default' filepath='/usr/include/locale.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mon_thousands_sep' type-id='type-id-330' visibility='default' filepath='/usr/include/locale.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='mon_grouping' type-id='type-id-330' visibility='default' filepath='/usr/include/locale.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='positive_sign' type-id='type-id-330' visibility='default' filepath='/usr/include/locale.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='negative_sign' type-id='type-id-330' visibility='default' filepath='/usr/include/locale.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='int_frac_digits' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <var-decl name='frac_digits' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='p_cs_precedes' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='664'>
        <var-decl name='p_sep_by_space' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='n_cs_precedes' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='680'>
        <var-decl name='n_sep_by_space' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='688'>
        <var-decl name='p_sign_posn' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='696'>
        <var-decl name='n_sign_posn' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='int_p_cs_precedes' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='712'>
        <var-decl name='int_p_sep_by_space' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='720'>
        <var-decl name='int_n_cs_precedes' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='728'>
        <var-decl name='int_n_sep_by_space' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='int_p_sign_posn' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='744'>
        <var-decl name='int_n_sign_posn' type-id='type-id-4' visibility='default' filepath='/usr/include/locale.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='fpos_t' type-id='type-id-423' filepath='/usr/include/stdio.h' line='86' column='1' id='type-id-424'/>
    <class-decl name='div_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-425' visibility='default' filepath='/usr/include/stdlib.h' line='60' column='1' id='type-id-426'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-19' visibility='default' filepath='/usr/include/stdlib.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rem' type-id='type-id-19' visibility='default' filepath='/usr/include/stdlib.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='div_t' type-id='type-id-426' filepath='/usr/include/stdlib.h' line='63' column='1' id='type-id-425'/>
    <class-decl name='ldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-427' visibility='default' filepath='/usr/include/stdlib.h' line='68' column='1' id='type-id-428'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-21' visibility='default' filepath='/usr/include/stdlib.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-21' visibility='default' filepath='/usr/include/stdlib.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ldiv_t' type-id='type-id-428' filepath='/usr/include/stdlib.h' line='71' column='1' id='type-id-427'/>
    <class-decl name='lldiv_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-429' visibility='default' filepath='/usr/include/stdlib.h' line='78' column='1' id='type-id-430'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quot' type-id='type-id-22' visibility='default' filepath='/usr/include/stdlib.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rem' type-id='type-id-22' visibility='default' filepath='/usr/include/stdlib.h' line='80' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='lldiv_t' type-id='type-id-430' filepath='/usr/include/stdlib.h' line='81' column='1' id='type-id-429'/>
    <typedef-decl name='__compar_fn_t' type-id='type-id-431' filepath='/usr/include/stdlib.h' line='816' column='1' id='type-id-432'/>
    <typedef-decl name='__off_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-433'/>
    <typedef-decl name='__off64_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1' id='type-id-434'/>
    <typedef-decl name='__time_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='160' column='1' id='type-id-435'/>
    <typedef-decl name='FILE' type-id='type-id-436' filepath='/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-437'/>
    <typedef-decl name='__FILE' type-id='type-id-436' filepath='/usr/include/x86_64-linux-gnu/bits/types/__FILE.h' line='5' column='1' id='type-id-438'/>
    <class-decl name='_G_fpos64_t' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='10' column='1' id='type-id-439'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__pos' type-id='type-id-434' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__state' type-id='type-id-440' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='13' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__fpos64_t' type-id='type-id-439' filepath='/usr/include/x86_64-linux-gnu/bits/types/__fpos64_t.h' line='14' column='1' id='type-id-423'/>
    <class-decl name='__mbstate_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-440' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='14' column='1' id='type-id-441'>
      <member-type access='public'>
        <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='17' column='1' id='type-id-442'>
          <data-member access='public'>
            <var-decl name='__wch' type-id='type-id-15' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='18' column='1'/>
          </data-member>
          <data-member access='public'>
            <var-decl name='__wchb' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='19' column='1'/>
          </data-member>
        </union-decl>
      </member-type>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__count' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__value' type-id='type-id-442' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='20' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__mbstate_t' type-id='type-id-441' filepath='/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h' line='21' column='1' id='type-id-440'/>
    <typedef-decl name='mbstate_t' type-id='type-id-440' filepath='/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h' line='6' column='1' id='type-id-443'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-30' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='43' column='1' id='type-id-444'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='49' column='1' id='type-id-436'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-330' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-330' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-330' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-330' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-330' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-330' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-330' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-330' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-330' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-330' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-330' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-445' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-446' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-433' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-28' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-25' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-8' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-447' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-434' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-448' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-449' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-446' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-16' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-120' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-10' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='7' column='1' id='type-id-450'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-266' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='time_t' type-id='type-id-435' filepath='/usr/include/x86_64-linux-gnu/bits/types/time_t.h' line='10' column='1' id='type-id-267'/>
    <typedef-decl name='wint_t' type-id='type-id-15' filepath='/usr/include/x86_64-linux-gnu/bits/types/wint_t.h' line='20' column='1' id='type-id-451'/>
    <typedef-decl name='ptrdiff_t' type-id='type-id-21' filepath='/usr/lib/gcc/x86_64-linux-gnu/11/include/stddef.h' line='143' column='1' id='type-id-306'/>
    <typedef-decl name='size_t' type-id='type-id-6' filepath='/usr/lib/gcc/x86_64-linux-gnu/11/include/stddef.h' line='209' column='1' id='type-id-120'/>
    <pointer-type-def type-id='type-id-367' size-in-bits='64' id='type-id-452'/>
    <pointer-type-def type-id='type-id-437' size-in-bits='64' id='type-id-453'/>
    <pointer-type-def type-id='type-id-417' size-in-bits='64' id='type-id-454'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-455'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-456'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-457'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-71'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-382'/>
    <qualified-type-def type-id='type-id-382' const='yes' id='type-id-458'/>
    <reference-type-def kind='lvalue' type-id='type-id-458' size-in-bits='64' id='type-id-459'/>
    <reference-type-def kind='lvalue' type-id='type-id-382' size-in-bits='64' id='type-id-460'/>
    <pointer-type-def type-id='type-id-382' size-in-bits='64' id='type-id-461'/>
    <pointer-type-def type-id='type-id-436' size-in-bits='64' id='type-id-446'/>
    <pointer-type-def type-id='type-id-462' size-in-bits='64' id='type-id-448'/>
    <pointer-type-def type-id='type-id-444' size-in-bits='64' id='type-id-447'/>
    <pointer-type-def type-id='type-id-463' size-in-bits='64' id='type-id-445'/>
    <pointer-type-def type-id='type-id-464' size-in-bits='64' id='type-id-449'/>
    <pointer-type-def type-id='type-id-438' size-in-bits='64' id='type-id-465'/>
    <reference-type-def kind='lvalue' type-id='type-id-466' size-in-bits='64' id='type-id-467'/>
    <reference-type-def kind='lvalue' type-id='type-id-468' size-in-bits='64' id='type-id-469'/>
    <reference-type-def kind='lvalue' type-id='type-id-470' size-in-bits='64' id='type-id-471'/>
    <pointer-type-def type-id='type-id-470' size-in-bits='64' id='type-id-472'/>
    <reference-type-def kind='lvalue' type-id='type-id-473' size-in-bits='64' id='type-id-474'/>
    <pointer-type-def type-id='type-id-473' size-in-bits='64' id='type-id-475'/>
    <reference-type-def kind='lvalue' type-id='type-id-476' size-in-bits='64' id='type-id-477'/>
    <pointer-type-def type-id='type-id-476' size-in-bits='64' id='type-id-478'/>
    <reference-type-def kind='lvalue' type-id='type-id-479' size-in-bits='64' id='type-id-480'/>
    <pointer-type-def type-id='type-id-479' size-in-bits='64' id='type-id-481'/>
    <reference-type-def kind='lvalue' type-id='type-id-482' size-in-bits='64' id='type-id-483'/>
    <pointer-type-def type-id='type-id-482' size-in-bits='64' id='type-id-484'/>
    <pointer-type-def type-id='type-id-485' size-in-bits='64' id='type-id-486'/>
    <pointer-type-def type-id='type-id-487' size-in-bits='64' id='type-id-488'/>
    <qualified-type-def type-id='type-id-488' const='yes' id='type-id-489'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-490'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-152'/>
    <pointer-type-def type-id='type-id-491' size-in-bits='64' id='type-id-159'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-198'/>
    <reference-type-def kind='lvalue' type-id='type-id-3' size-in-bits='64' id='type-id-492'/>
    <reference-type-def kind='lvalue' type-id='type-id-4' size-in-bits='64' id='type-id-493'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-330'/>
    <qualified-type-def type-id='type-id-330' const='yes' id='type-id-494'/>
    <reference-type-def kind='lvalue' type-id='type-id-494' size-in-bits='64' id='type-id-495'/>
    <pointer-type-def type-id='type-id-330' size-in-bits='64' id='type-id-496'/>
    <qualified-type-def type-id='type-id-466' const='yes' id='type-id-497'/>
    <reference-type-def kind='lvalue' type-id='type-id-497' size-in-bits='64' id='type-id-498'/>
    <qualified-type-def type-id='type-id-468' const='yes' id='type-id-499'/>
    <reference-type-def kind='lvalue' type-id='type-id-499' size-in-bits='64' id='type-id-500'/>
    <qualified-type-def type-id='type-id-470' const='yes' id='type-id-501'/>
    <pointer-type-def type-id='type-id-501' size-in-bits='64' id='type-id-502'/>
    <qualified-type-def type-id='type-id-473' const='yes' id='type-id-503'/>
    <pointer-type-def type-id='type-id-503' size-in-bits='64' id='type-id-504'/>
    <qualified-type-def type-id='type-id-476' const='yes' id='type-id-505'/>
    <pointer-type-def type-id='type-id-505' size-in-bits='64' id='type-id-506'/>
    <qualified-type-def type-id='type-id-479' const='yes' id='type-id-507'/>
    <pointer-type-def type-id='type-id-507' size-in-bits='64' id='type-id-508'/>
    <qualified-type-def type-id='type-id-482' const='yes' id='type-id-509'/>
    <reference-type-def kind='lvalue' type-id='type-id-509' size-in-bits='64' id='type-id-510'/>
    <pointer-type-def type-id='type-id-509' size-in-bits='64' id='type-id-511'/>
    <qualified-type-def type-id='type-id-512' const='yes' id='type-id-513'/>
    <reference-type-def kind='lvalue' type-id='type-id-513' size-in-bits='64' id='type-id-514'/>
    <qualified-type-def type-id='type-id-485' const='yes' id='type-id-515'/>
    <reference-type-def kind='lvalue' type-id='type-id-515' size-in-bits='64' id='type-id-516'/>
    <pointer-type-def type-id='type-id-515' size-in-bits='64' id='type-id-517'/>
    <qualified-type-def type-id='type-id-487' const='yes' id='type-id-518'/>
    <reference-type-def kind='lvalue' type-id='type-id-518' size-in-bits='64' id='type-id-519'/>
    <pointer-type-def type-id='type-id-518' size-in-bits='64' id='type-id-520'/>
    <qualified-type-def type-id='type-id-3' const='yes' id='type-id-168'/>
    <qualified-type-def type-id='type-id-4' const='yes' id='type-id-521'/>
    <reference-type-def kind='lvalue' type-id='type-id-521' size-in-bits='64' id='type-id-522'/>
    <pointer-type-def type-id='type-id-521' size-in-bits='64' id='type-id-266'/>
    <qualified-type-def type-id='type-id-266' const='yes' id='type-id-523'/>
    <reference-type-def kind='lvalue' type-id='type-id-523' size-in-bits='64' id='type-id-524'/>
    <pointer-type-def type-id='type-id-266' size-in-bits='64' id='type-id-525'/>
    <qualified-type-def type-id='type-id-424' const='yes' id='type-id-526'/>
    <pointer-type-def type-id='type-id-526' size-in-bits='64' id='type-id-527'/>
    <qualified-type-def type-id='type-id-19' const='yes' id='type-id-528'/>
    <reference-type-def kind='lvalue' type-id='type-id-528' size-in-bits='64' id='type-id-109'/>
    <pointer-type-def type-id='type-id-528' size-in-bits='64' id='type-id-142'/>
    <qualified-type-def type-id='type-id-443' const='yes' id='type-id-529'/>
    <pointer-type-def type-id='type-id-529' size-in-bits='64' id='type-id-530'/>
    <qualified-type-def type-id='type-id-120' const='yes' id='type-id-331'/>
    <qualified-type-def type-id='type-id-531' const='yes' id='type-id-532'/>
    <reference-type-def kind='lvalue' type-id='type-id-532' size-in-bits='64' id='type-id-533'/>
    <pointer-type-def type-id='type-id-532' size-in-bits='64' id='type-id-534'/>
    <qualified-type-def type-id='type-id-535' const='yes' id='type-id-536'/>
    <reference-type-def kind='lvalue' type-id='type-id-536' size-in-bits='64' id='type-id-537'/>
    <qualified-type-def type-id='type-id-538' const='yes' id='type-id-539'/>
    <reference-type-def kind='lvalue' type-id='type-id-539' size-in-bits='64' id='type-id-540'/>
    <pointer-type-def type-id='type-id-539' size-in-bits='64' id='type-id-541'/>
    <qualified-type-def type-id='type-id-541' const='yes' id='type-id-542'/>
    <qualified-type-def type-id='type-id-543' const='yes' id='type-id-544'/>
    <reference-type-def kind='lvalue' type-id='type-id-544' size-in-bits='64' id='type-id-545'/>
    <qualified-type-def type-id='type-id-546' const='yes' id='type-id-547'/>
    <qualified-type-def type-id='type-id-548' const='yes' id='type-id-549'/>
    <reference-type-def kind='lvalue' type-id='type-id-549' size-in-bits='64' id='type-id-550'/>
    <pointer-type-def type-id='type-id-549' size-in-bits='64' id='type-id-551'/>
    <qualified-type-def type-id='type-id-552' const='yes' id='type-id-553'/>
    <reference-type-def kind='lvalue' type-id='type-id-553' size-in-bits='64' id='type-id-554'/>
    <qualified-type-def type-id='type-id-555' const='yes' id='type-id-556'/>
    <reference-type-def kind='lvalue' type-id='type-id-556' size-in-bits='64' id='type-id-557'/>
    <qualified-type-def type-id='type-id-558' const='yes' id='type-id-559'/>
    <reference-type-def kind='lvalue' type-id='type-id-559' size-in-bits='64' id='type-id-560'/>
    <qualified-type-def type-id='type-id-561' const='yes' id='type-id-562'/>
    <reference-type-def kind='lvalue' type-id='type-id-562' size-in-bits='64' id='type-id-563'/>
    <qualified-type-def type-id='type-id-564' const='yes' id='type-id-565'/>
    <reference-type-def kind='lvalue' type-id='type-id-565' size-in-bits='64' id='type-id-566'/>
    <pointer-type-def type-id='type-id-565' size-in-bits='64' id='type-id-567'/>
    <qualified-type-def type-id='type-id-568' const='yes' id='type-id-569'/>
    <reference-type-def kind='lvalue' type-id='type-id-569' size-in-bits='64' id='type-id-570'/>
    <pointer-type-def type-id='type-id-569' size-in-bits='64' id='type-id-571'/>
    <qualified-type-def type-id='type-id-572' const='yes' id='type-id-573'/>
    <reference-type-def kind='lvalue' type-id='type-id-573' size-in-bits='64' id='type-id-574'/>
    <pointer-type-def type-id='type-id-573' size-in-bits='64' id='type-id-575'/>
    <qualified-type-def type-id='type-id-576' const='yes' id='type-id-577'/>
    <reference-type-def kind='lvalue' type-id='type-id-577' size-in-bits='64' id='type-id-578'/>
    <pointer-type-def type-id='type-id-577' size-in-bits='64' id='type-id-579'/>
    <qualified-type-def type-id='type-id-580' const='yes' id='type-id-581'/>
    <reference-type-def kind='lvalue' type-id='type-id-581' size-in-bits='64' id='type-id-582'/>
    <pointer-type-def type-id='type-id-581' size-in-bits='64' id='type-id-583'/>
    <qualified-type-def type-id='type-id-584' const='yes' id='type-id-585'/>
    <reference-type-def kind='lvalue' type-id='type-id-585' size-in-bits='64' id='type-id-586'/>
    <qualified-type-def type-id='type-id-587' const='yes' id='type-id-588'/>
    <pointer-type-def type-id='type-id-588' size-in-bits='64' id='type-id-589'/>
    <qualified-type-def type-id='type-id-590' const='yes' id='type-id-591'/>
    <pointer-type-def type-id='type-id-591' size-in-bits='64' id='type-id-592'/>
    <qualified-type-def type-id='type-id-593' const='yes' id='type-id-594'/>
    <reference-type-def kind='lvalue' type-id='type-id-594' size-in-bits='64' id='type-id-595'/>
    <qualified-type-def type-id='type-id-596' const='yes' id='type-id-597'/>
    <pointer-type-def type-id='type-id-597' size-in-bits='64' id='type-id-598'/>
    <qualified-type-def type-id='type-id-598' const='yes' id='type-id-599'/>
    <qualified-type-def type-id='type-id-450' const='yes' id='type-id-600'/>
    <pointer-type-def type-id='type-id-600' size-in-bits='64' id='type-id-601'/>
    <qualified-type-def type-id='type-id-27' const='yes' id='type-id-602'/>
    <pointer-type-def type-id='type-id-602' size-in-bits='64' id='type-id-603'/>
    <qualified-type-def type-id='type-id-31' const='yes' id='type-id-604'/>
    <reference-type-def kind='lvalue' type-id='type-id-604' size-in-bits='64' id='type-id-605'/>
    <pointer-type-def type-id='type-id-604' size-in-bits='64' id='type-id-297'/>
    <qualified-type-def type-id='type-id-297' const='yes' id='type-id-606'/>
    <reference-type-def kind='lvalue' type-id='type-id-606' size-in-bits='64' id='type-id-607'/>
    <pointer-type-def type-id='type-id-297' size-in-bits='64' id='type-id-608'/>
    <qualified-type-def type-id='type-id-609' const='yes' id='type-id-610'/>
    <reference-type-def kind='lvalue' type-id='type-id-610' size-in-bits='64' id='type-id-611'/>
    <qualified-type-def type-id='type-id-140' const='yes' id='type-id-612'/>
    <pointer-type-def type-id='type-id-612' size-in-bits='64' id='type-id-613'/>
    <qualified-type-def type-id='type-id-614' const='yes' id='type-id-615'/>
    <pointer-type-def type-id='type-id-615' size-in-bits='64' id='type-id-616'/>
    <qualified-type-def type-id='type-id-617' const='yes' id='type-id-618'/>
    <pointer-type-def type-id='type-id-618' size-in-bits='64' id='type-id-619'/>
    <qualified-type-def type-id='type-id-85' const='yes' id='type-id-620'/>
    <pointer-type-def type-id='type-id-620' size-in-bits='64' id='type-id-621'/>
    <qualified-type-def type-id='type-id-91' const='yes' id='type-id-622'/>
    <pointer-type-def type-id='type-id-622' size-in-bits='64' id='type-id-623'/>
    <qualified-type-def type-id='type-id-294' const='yes' id='type-id-624'/>
    <reference-type-def kind='lvalue' type-id='type-id-624' size-in-bits='64' id='type-id-625'/>
    <pointer-type-def type-id='type-id-624' size-in-bits='64' id='type-id-626'/>
    <qualified-type-def type-id='type-id-626' const='yes' id='type-id-339'/>
    <qualified-type-def type-id='type-id-57' const='yes' id='type-id-627'/>
    <pointer-type-def type-id='type-id-627' size-in-bits='64' id='type-id-292'/>
    <qualified-type-def type-id='type-id-48' const='yes' id='type-id-628'/>
    <qualified-type-def type-id='type-id-49' const='yes' id='type-id-629'/>
    <reference-type-def kind='lvalue' type-id='type-id-629' size-in-bits='64' id='type-id-630'/>
    <qualified-type-def type-id='type-id-50' const='yes' id='type-id-631'/>
    <reference-type-def kind='lvalue' type-id='type-id-631' size-in-bits='64' id='type-id-632'/>
    <qualified-type-def type-id='type-id-44' const='yes' id='type-id-633'/>
    <reference-type-def kind='lvalue' type-id='type-id-633' size-in-bits='64' id='type-id-634'/>
    <qualified-type-def type-id='type-id-45' const='yes' id='type-id-635'/>
    <pointer-type-def type-id='type-id-635' size-in-bits='64' id='type-id-636'/>
    <qualified-type-def type-id='type-id-46' const='yes' id='type-id-637'/>
    <reference-type-def kind='lvalue' type-id='type-id-637' size-in-bits='64' id='type-id-638'/>
    <qualified-type-def type-id='type-id-47' const='yes' id='type-id-639'/>
    <pointer-type-def type-id='type-id-639' size-in-bits='64' id='type-id-640'/>
    <qualified-type-def type-id='type-id-283' const='yes' id='type-id-641'/>
    <reference-type-def kind='lvalue' type-id='type-id-641' size-in-bits='64' id='type-id-642'/>
    <pointer-type-def type-id='type-id-641' size-in-bits='64' id='type-id-289'/>
    <qualified-type-def type-id='type-id-284' const='yes' id='type-id-643'/>
    <pointer-type-def type-id='type-id-643' size-in-bits='64' id='type-id-644'/>
    <qualified-type-def type-id='type-id-287' const='yes' id='type-id-645'/>
    <reference-type-def kind='lvalue' type-id='type-id-645' size-in-bits='64' id='type-id-646'/>
    <qualified-type-def type-id='type-id-412' const='yes' id='type-id-647'/>
    <reference-type-def kind='lvalue' type-id='type-id-647' size-in-bits='64' id='type-id-648'/>
    <pointer-type-def type-id='type-id-647' size-in-bits='64' id='type-id-649'/>
    <qualified-type-def type-id='type-id-347' const='yes' id='type-id-650'/>
    <reference-type-def kind='lvalue' type-id='type-id-650' size-in-bits='64' id='type-id-651'/>
    <qualified-type-def type-id='type-id-349' const='yes' id='type-id-652'/>
    <reference-type-def kind='lvalue' type-id='type-id-652' size-in-bits='64' id='type-id-653'/>
    <qualified-type-def type-id='type-id-654' const='yes' id='type-id-655'/>
    <reference-type-def kind='lvalue' type-id='type-id-655' size-in-bits='64' id='type-id-656'/>
    <qualified-type-def type-id='type-id-110' const='yes' id='type-id-657'/>
    <reference-type-def kind='lvalue' type-id='type-id-657' size-in-bits='64' id='type-id-658'/>
    <qualified-type-def type-id='type-id-659' const='yes' id='type-id-660'/>
    <reference-type-def kind='lvalue' type-id='type-id-660' size-in-bits='64' id='type-id-661'/>
    <qualified-type-def type-id='type-id-99' const='yes' id='type-id-662'/>
    <reference-type-def kind='lvalue' type-id='type-id-662' size-in-bits='64' id='type-id-104'/>
    <qualified-type-def type-id='type-id-115' const='yes' id='type-id-663'/>
    <reference-type-def kind='lvalue' type-id='type-id-663' size-in-bits='64' id='type-id-664'/>
    <qualified-type-def type-id='type-id-111' const='yes' id='type-id-665'/>
    <reference-type-def kind='lvalue' type-id='type-id-665' size-in-bits='64' id='type-id-119'/>
    <pointer-type-def type-id='type-id-665' size-in-bits='64' id='type-id-112'/>
    <qualified-type-def type-id='type-id-108' const='yes' id='type-id-666'/>
    <reference-type-def kind='lvalue' type-id='type-id-666' size-in-bits='64' id='type-id-667'/>
    <pointer-type-def type-id='type-id-666' size-in-bits='64' id='type-id-113'/>
    <qualified-type-def type-id='type-id-113' const='yes' id='type-id-668'/>
    <reference-type-def kind='lvalue' type-id='type-id-668' size-in-bits='64' id='type-id-669'/>
    <reference-type-def kind='lvalue' type-id='type-id-113' size-in-bits='64' id='type-id-670'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-671'/>
    <qualified-type-def type-id='type-id-105' const='yes' id='type-id-672'/>
    <reference-type-def kind='lvalue' type-id='type-id-672' size-in-bits='64' id='type-id-673'/>
    <qualified-type-def type-id='type-id-674' const='yes' id='type-id-675'/>
    <pointer-type-def type-id='type-id-675' size-in-bits='64' id='type-id-676'/>
    <qualified-type-def type-id='type-id-411' const='yes' id='type-id-677'/>
    <reference-type-def kind='lvalue' type-id='type-id-677' size-in-bits='64' id='type-id-678'/>
    <pointer-type-def type-id='type-id-677' size-in-bits='64' id='type-id-679'/>
    <qualified-type-def type-id='type-id-336' const='yes' id='type-id-680'/>
    <reference-type-def kind='lvalue' type-id='type-id-680' size-in-bits='64' id='type-id-681'/>
    <pointer-type-def type-id='type-id-680' size-in-bits='64' id='type-id-682'/>
    <qualified-type-def type-id='type-id-682' const='yes' id='type-id-683'/>
    <qualified-type-def type-id='type-id-278' const='yes' id='type-id-684'/>
    <pointer-type-def type-id='type-id-684' size-in-bits='64' id='type-id-685'/>
    <qualified-type-def type-id='type-id-127' const='yes' id='type-id-686'/>
    <reference-type-def kind='lvalue' type-id='type-id-686' size-in-bits='64' id='type-id-687'/>
    <pointer-type-def type-id='type-id-686' size-in-bits='64' id='type-id-129'/>
    <qualified-type-def type-id='type-id-377' const='yes' id='type-id-688'/>
    <pointer-type-def type-id='type-id-688' size-in-bits='64' id='type-id-378'/>
    <qualified-type-def type-id='type-id-130' const='yes' id='type-id-689'/>
    <pointer-type-def type-id='type-id-689' size-in-bits='64' id='type-id-690'/>
    <qualified-type-def type-id='type-id-136' const='yes' id='type-id-691'/>
    <reference-type-def kind='lvalue' type-id='type-id-691' size-in-bits='64' id='type-id-692'/>
    <qualified-type-def type-id='type-id-693' const='yes' id='type-id-694'/>
    <pointer-type-def type-id='type-id-694' size-in-bits='64' id='type-id-695'/>
    <qualified-type-def type-id='type-id-695' const='yes' id='type-id-696'/>
    <qualified-type-def type-id='type-id-368' const='yes' id='type-id-697'/>
    <reference-type-def kind='lvalue' type-id='type-id-697' size-in-bits='64' id='type-id-698'/>
    <qualified-type-def type-id='type-id-263' const='yes' id='type-id-271'/>
    <qualified-type-def type-id='type-id-264' const='yes' id='type-id-699'/>
    <reference-type-def kind='lvalue' type-id='type-id-699' size-in-bits='64' id='type-id-700'/>
    <pointer-type-def type-id='type-id-699' size-in-bits='64' id='type-id-701'/>
    <qualified-type-def type-id='type-id-270' const='yes' id='type-id-702'/>
    <reference-type-def kind='lvalue' type-id='type-id-702' size-in-bits='64' id='type-id-703'/>
    <qualified-type-def type-id='type-id-272' const='yes' id='type-id-704'/>
    <reference-type-def kind='lvalue' type-id='type-id-704' size-in-bits='64' id='type-id-705'/>
    <pointer-type-def type-id='type-id-704' size-in-bits='64' id='type-id-706'/>
    <qualified-type-def type-id='type-id-706' const='yes' id='type-id-707'/>
    <qualified-type-def type-id='type-id-708' const='yes' id='type-id-709'/>
    <reference-type-def kind='lvalue' type-id='type-id-709' size-in-bits='64' id='type-id-710'/>
    <qualified-type-def type-id='type-id-344' const='yes' id='type-id-711'/>
    <reference-type-def kind='lvalue' type-id='type-id-711' size-in-bits='64' id='type-id-712'/>
    <pointer-type-def type-id='type-id-711' size-in-bits='64' id='type-id-713'/>
    <qualified-type-def type-id='type-id-144' const='yes' id='type-id-714'/>
    <reference-type-def kind='lvalue' type-id='type-id-714' size-in-bits='64' id='type-id-715'/>
    <pointer-type-def type-id='type-id-714' size-in-bits='64' id='type-id-716'/>
    <qualified-type-def type-id='type-id-98' const='yes' id='type-id-717'/>
    <pointer-type-def type-id='type-id-717' size-in-bits='64' id='type-id-103'/>
    <qualified-type-def type-id='type-id-276' const='yes' id='type-id-718'/>
    <pointer-type-def type-id='type-id-718' size-in-bits='64' id='type-id-719'/>
    <qualified-type-def type-id='type-id-720' const='yes' id='type-id-721'/>
    <pointer-type-def type-id='type-id-721' size-in-bits='64' id='type-id-722'/>
    <qualified-type-def type-id='type-id-277' const='yes' id='type-id-723'/>
    <pointer-type-def type-id='type-id-723' size-in-bits='64' id='type-id-280'/>
    <qualified-type-def type-id='type-id-125' const='yes' id='type-id-724'/>
    <reference-type-def kind='lvalue' type-id='type-id-724' size-in-bits='64' id='type-id-725'/>
    <pointer-type-def type-id='type-id-724' size-in-bits='64' id='type-id-726'/>
    <qualified-type-def type-id='type-id-124' const='yes' id='type-id-727'/>
    <reference-type-def kind='lvalue' type-id='type-id-727' size-in-bits='64' id='type-id-728'/>
    <qualified-type-def type-id='type-id-126' const='yes' id='type-id-729'/>
    <reference-type-def kind='lvalue' type-id='type-id-729' size-in-bits='64' id='type-id-730'/>
    <pointer-type-def type-id='type-id-729' size-in-bits='64' id='type-id-731'/>
    <qualified-type-def type-id='type-id-128' const='yes' id='type-id-732'/>
    <reference-type-def kind='lvalue' type-id='type-id-732' size-in-bits='64' id='type-id-733'/>
    <pointer-type-def type-id='type-id-732' size-in-bits='64' id='type-id-734'/>
    <qualified-type-def type-id='type-id-42' const='yes' id='type-id-735'/>
    <reference-type-def kind='lvalue' type-id='type-id-735' size-in-bits='64' id='type-id-736'/>
    <qualified-type-def type-id='type-id-33' const='yes' id='type-id-737'/>
    <reference-type-def kind='lvalue' type-id='type-id-737' size-in-bits='64' id='type-id-738'/>
    <pointer-type-def type-id='type-id-737' size-in-bits='64' id='type-id-739'/>
    <qualified-type-def type-id='type-id-34' const='yes' id='type-id-740'/>
    <pointer-type-def type-id='type-id-740' size-in-bits='64' id='type-id-741'/>
    <qualified-type-def type-id='type-id-35' const='yes' id='type-id-742'/>
    <pointer-type-def type-id='type-id-742' size-in-bits='64' id='type-id-743'/>
    <qualified-type-def type-id='type-id-38' const='yes' id='type-id-744'/>
    <reference-type-def kind='lvalue' type-id='type-id-744' size-in-bits='64' id='type-id-745'/>
    <pointer-type-def type-id='type-id-744' size-in-bits='64' id='type-id-746'/>
    <qualified-type-def type-id='type-id-746' const='yes' id='type-id-747'/>
    <qualified-type-def type-id='type-id-39' const='yes' id='type-id-748'/>
    <pointer-type-def type-id='type-id-748' size-in-bits='64' id='type-id-749'/>
    <qualified-type-def type-id='type-id-40' const='yes' id='type-id-750'/>
    <pointer-type-def type-id='type-id-750' size-in-bits='64' id='type-id-751'/>
    <qualified-type-def type-id='type-id-751' const='yes' id='type-id-752'/>
    <qualified-type-def type-id='type-id-43' const='yes' id='type-id-753'/>
    <reference-type-def kind='lvalue' type-id='type-id-753' size-in-bits='64' id='type-id-754'/>
    <qualified-type-def type-id='type-id-123' const='yes' id='type-id-755'/>
    <reference-type-def kind='lvalue' type-id='type-id-755' size-in-bits='64' id='type-id-756'/>
    <pointer-type-def type-id='type-id-755' size-in-bits='64' id='type-id-757'/>
    <qualified-type-def type-id='type-id-334' const='yes' id='type-id-758'/>
    <reference-type-def kind='lvalue' type-id='type-id-758' size-in-bits='64' id='type-id-759'/>
    <qualified-type-def type-id='type-id-173' const='yes' id='type-id-182'/>
    <reference-type-def kind='lvalue' type-id='type-id-182' size-in-bits='64' id='type-id-760'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-295'/>
    <qualified-type-def type-id='type-id-295' const='yes' id='type-id-338'/>
    <qualified-type-def type-id='type-id-329' const='yes' id='type-id-761'/>
    <pointer-type-def type-id='type-id-761' size-in-bits='64' id='type-id-762'/>
    <qualified-type-def type-id='type-id-299' const='yes' id='type-id-763'/>
    <qualified-type-def type-id='type-id-311' const='yes' id='type-id-764'/>
    <reference-type-def kind='lvalue' type-id='type-id-764' size-in-bits='64' id='type-id-765'/>
    <pointer-type-def type-id='type-id-764' size-in-bits='64' id='type-id-766'/>
    <qualified-type-def type-id='type-id-304' const='yes' id='type-id-767'/>
    <reference-type-def kind='lvalue' type-id='type-id-767' size-in-bits='64' id='type-id-768'/>
    <pointer-type-def type-id='type-id-767' size-in-bits='64' id='type-id-769'/>
    <qualified-type-def type-id='type-id-317' const='yes' id='type-id-770'/>
    <reference-type-def kind='lvalue' type-id='type-id-770' size-in-bits='64' id='type-id-771'/>
    <pointer-type-def type-id='type-id-770' size-in-bits='64' id='type-id-772'/>
    <qualified-type-def type-id='type-id-321' const='yes' id='type-id-773'/>
    <reference-type-def kind='lvalue' type-id='type-id-773' size-in-bits='64' id='type-id-774'/>
    <pointer-type-def type-id='type-id-773' size-in-bits='64' id='type-id-775'/>
    <qualified-type-def type-id='type-id-58' const='yes' id='type-id-776'/>
    <pointer-type-def type-id='type-id-776' size-in-bits='64' id='type-id-777'/>
    <qualified-type-def type-id='type-id-161' const='yes' id='type-id-778'/>
    <pointer-type-def type-id='type-id-778' size-in-bits='64' id='type-id-779'/>
    <qualified-type-def type-id='type-id-160' const='yes' id='type-id-780'/>
    <pointer-type-def type-id='type-id-780' size-in-bits='64' id='type-id-781'/>
    <qualified-type-def type-id='type-id-332' const='yes' id='type-id-782'/>
    <reference-type-def kind='lvalue' type-id='type-id-782' size-in-bits='64' id='type-id-783'/>
    <qualified-type-def type-id='type-id-213' const='yes' id='type-id-784'/>
    <pointer-type-def type-id='type-id-784' size-in-bits='64' id='type-id-785'/>
    <qualified-type-def type-id='type-id-214' const='yes' id='type-id-786'/>
    <pointer-type-def type-id='type-id-786' size-in-bits='64' id='type-id-787'/>
    <qualified-type-def type-id='type-id-224' const='yes' id='type-id-788'/>
    <reference-type-def kind='lvalue' type-id='type-id-788' size-in-bits='64' id='type-id-789'/>
    <pointer-type-def type-id='type-id-788' size-in-bits='64' id='type-id-790'/>
    <qualified-type-def type-id='type-id-230' const='yes' id='type-id-791'/>
    <reference-type-def kind='lvalue' type-id='type-id-791' size-in-bits='64' id='type-id-792'/>
    <pointer-type-def type-id='type-id-791' size-in-bits='64' id='type-id-793'/>
    <qualified-type-def type-id='type-id-229' const='yes' id='type-id-794'/>
    <pointer-type-def type-id='type-id-794' size-in-bits='64' id='type-id-795'/>
    <qualified-type-def type-id='type-id-236' const='yes' id='type-id-796'/>
    <reference-type-def kind='lvalue' type-id='type-id-796' size-in-bits='64' id='type-id-797'/>
    <qualified-type-def type-id='type-id-220' const='yes' id='type-id-217'/>
    <reference-type-def kind='lvalue' type-id='type-id-217' size-in-bits='64' id='type-id-798'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-799'/>
    <qualified-type-def type-id='type-id-237' const='yes' id='type-id-800'/>
    <reference-type-def kind='lvalue' type-id='type-id-800' size-in-bits='64' id='type-id-801'/>
    <qualified-type-def type-id='type-id-238' const='yes' id='type-id-802'/>
    <reference-type-def kind='lvalue' type-id='type-id-802' size-in-bits='64' id='type-id-803'/>
    <qualified-type-def type-id='type-id-240' const='yes' id='type-id-804'/>
    <reference-type-def kind='lvalue' type-id='type-id-804' size-in-bits='64' id='type-id-805'/>
    <qualified-type-def type-id='type-id-228' const='yes' id='type-id-806'/>
    <reference-type-def kind='lvalue' type-id='type-id-806' size-in-bits='64' id='type-id-235'/>
    <pointer-type-def type-id='type-id-806' size-in-bits='64' id='type-id-233'/>
    <qualified-type-def type-id='type-id-239' const='yes' id='type-id-807'/>
    <pointer-type-def type-id='type-id-807' size-in-bits='64' id='type-id-808'/>
    <qualified-type-def type-id='type-id-255' const='yes' id='type-id-250'/>
    <qualified-type-def type-id='type-id-256' const='yes' id='type-id-254'/>
    <qualified-type-def type-id='type-id-162' const='yes' id='type-id-809'/>
    <pointer-type-def type-id='type-id-809' size-in-bits='64' id='type-id-810'/>
    <qualified-type-def type-id='type-id-163' const='yes' id='type-id-811'/>
    <pointer-type-def type-id='type-id-811' size-in-bits='64' id='type-id-812'/>
    <qualified-type-def type-id='type-id-174' const='yes' id='type-id-813'/>
    <reference-type-def kind='lvalue' type-id='type-id-813' size-in-bits='64' id='type-id-814'/>
    <pointer-type-def type-id='type-id-813' size-in-bits='64' id='type-id-815'/>
    <qualified-type-def type-id='type-id-180' const='yes' id='type-id-816'/>
    <reference-type-def kind='lvalue' type-id='type-id-816' size-in-bits='64' id='type-id-817'/>
    <pointer-type-def type-id='type-id-816' size-in-bits='64' id='type-id-818'/>
    <qualified-type-def type-id='type-id-179' const='yes' id='type-id-819'/>
    <pointer-type-def type-id='type-id-819' size-in-bits='64' id='type-id-820'/>
    <qualified-type-def type-id='type-id-187' const='yes' id='type-id-821'/>
    <reference-type-def kind='lvalue' type-id='type-id-821' size-in-bits='64' id='type-id-822'/>
    <qualified-type-def type-id='type-id-170' const='yes' id='type-id-166'/>
    <reference-type-def kind='lvalue' type-id='type-id-166' size-in-bits='64' id='type-id-823'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-824'/>
    <qualified-type-def type-id='type-id-188' const='yes' id='type-id-825'/>
    <reference-type-def kind='lvalue' type-id='type-id-825' size-in-bits='64' id='type-id-826'/>
    <qualified-type-def type-id='type-id-189' const='yes' id='type-id-827'/>
    <reference-type-def kind='lvalue' type-id='type-id-827' size-in-bits='64' id='type-id-828'/>
    <qualified-type-def type-id='type-id-191' const='yes' id='type-id-829'/>
    <reference-type-def kind='lvalue' type-id='type-id-829' size-in-bits='64' id='type-id-830'/>
    <qualified-type-def type-id='type-id-178' const='yes' id='type-id-831'/>
    <reference-type-def kind='lvalue' type-id='type-id-831' size-in-bits='64' id='type-id-186'/>
    <pointer-type-def type-id='type-id-831' size-in-bits='64' id='type-id-184'/>
    <qualified-type-def type-id='type-id-190' const='yes' id='type-id-832'/>
    <pointer-type-def type-id='type-id-832' size-in-bits='64' id='type-id-833'/>
    <qualified-type-def type-id='type-id-207' const='yes' id='type-id-202'/>
    <qualified-type-def type-id='type-id-208' const='yes' id='type-id-206'/>
    <qualified-type-def type-id='type-id-834' const='yes' id='type-id-835'/>
    <pointer-type-def type-id='type-id-835' size-in-bits='64' id='type-id-836'/>
    <qualified-type-def type-id='type-id-355' const='yes' id='type-id-837'/>
    <pointer-type-def type-id='type-id-837' size-in-bits='64' id='type-id-838'/>
    <qualified-type-def type-id='type-id-351' const='yes' id='type-id-839'/>
    <reference-type-def kind='lvalue' type-id='type-id-839' size-in-bits='64' id='type-id-840'/>
    <qualified-type-def type-id='type-id-358' const='yes' id='type-id-841'/>
    <reference-type-def kind='lvalue' type-id='type-id-841' size-in-bits='64' id='type-id-842'/>
    <pointer-type-def type-id='type-id-841' size-in-bits='64' id='type-id-843'/>
    <qualified-type-def type-id='type-id-843' const='yes' id='type-id-844'/>
    <qualified-type-def type-id='type-id-223' const='yes' id='type-id-259'/>
    <qualified-type-def type-id='type-id-274' const='yes' id='type-id-845'/>
    <reference-type-def kind='lvalue' type-id='type-id-845' size-in-bits='64' id='type-id-846'/>
    <pointer-type-def type-id='type-id-845' size-in-bits='64' id='type-id-847'/>
    <qualified-type-def type-id='type-id-314' const='yes' id='type-id-303'/>
    <reference-type-def kind='lvalue' type-id='type-id-303' size-in-bits='64' id='type-id-848'/>
    <pointer-type-def type-id='type-id-303' size-in-bits='64' id='type-id-849'/>
    <qualified-type-def type-id='type-id-308' const='yes' id='type-id-850'/>
    <reference-type-def kind='lvalue' type-id='type-id-850' size-in-bits='64' id='type-id-851'/>
    <pointer-type-def type-id='type-id-850' size-in-bits='64' id='type-id-852'/>
    <qualified-type-def type-id='type-id-853' const='yes' id='type-id-854'/>
    <reference-type-def kind='lvalue' type-id='type-id-854' size-in-bits='64' id='type-id-855'/>
    <qualified-type-def type-id='type-id-86' const='yes' id='type-id-856'/>
    <reference-type-def kind='lvalue' type-id='type-id-856' size-in-bits='64' id='type-id-857'/>
    <pointer-type-def type-id='type-id-856' size-in-bits='64' id='type-id-858'/>
    <qualified-type-def type-id='type-id-380' const='yes' id='type-id-390'/>
    <qualified-type-def type-id='type-id-381' const='yes' id='type-id-859'/>
    <reference-type-def kind='lvalue' type-id='type-id-859' size-in-bits='64' id='type-id-387'/>
    <pointer-type-def type-id='type-id-859' size-in-bits='64' id='type-id-386'/>
    <qualified-type-def type-id='type-id-92' const='yes' id='type-id-860'/>
    <reference-type-def kind='lvalue' type-id='type-id-860' size-in-bits='64' id='type-id-861'/>
    <pointer-type-def type-id='type-id-860' size-in-bits='64' id='type-id-862'/>
    <qualified-type-def type-id='type-id-391' const='yes' id='type-id-400'/>
    <qualified-type-def type-id='type-id-392' const='yes' id='type-id-863'/>
    <reference-type-def kind='lvalue' type-id='type-id-863' size-in-bits='64' id='type-id-397'/>
    <pointer-type-def type-id='type-id-863' size-in-bits='64' id='type-id-396'/>
    <qualified-type-def type-id='type-id-131' const='yes' id='type-id-864'/>
    <reference-type-def kind='lvalue' type-id='type-id-864' size-in-bits='64' id='type-id-865'/>
    <pointer-type-def type-id='type-id-864' size-in-bits='64' id='type-id-866'/>
    <qualified-type-def type-id='type-id-866' const='yes' id='type-id-867'/>
    <qualified-type-def type-id='type-id-401' const='yes' id='type-id-409'/>
    <qualified-type-def type-id='type-id-402' const='yes' id='type-id-868'/>
    <reference-type-def kind='lvalue' type-id='type-id-868' size-in-bits='64' id='type-id-869'/>
    <pointer-type-def type-id='type-id-868' size-in-bits='64' id='type-id-406'/>
    <qualified-type-def type-id='type-id-870' const='yes' id='type-id-871'/>
    <reference-type-def kind='lvalue' type-id='type-id-871' size-in-bits='64' id='type-id-872'/>
    <qualified-type-def type-id='type-id-873' const='yes' id='type-id-874'/>
    <pointer-type-def type-id='type-id-874' size-in-bits='64' id='type-id-875'/>
    <qualified-type-def type-id='type-id-876' const='yes' id='type-id-877'/>
    <pointer-type-def type-id='type-id-877' size-in-bits='64' id='type-id-878'/>
    <qualified-type-def type-id='type-id-878' const='yes' id='type-id-879'/>
    <qualified-type-def type-id='type-id-415' const='yes' id='type-id-880'/>
    <reference-type-def kind='lvalue' type-id='type-id-880' size-in-bits='64' id='type-id-881'/>
    <pointer-type-def type-id='type-id-880' size-in-bits='64' id='type-id-882'/>
    <qualified-type-def type-id='type-id-52' const='yes' id='type-id-883'/>
    <pointer-type-def type-id='type-id-883' size-in-bits='64' id='type-id-884'/>
    <qualified-type-def type-id='type-id-54' const='yes' id='type-id-885'/>
    <pointer-type-def type-id='type-id-885' size-in-bits='64' id='type-id-886'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-887'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-888'/>
    <pointer-type-def type-id='type-id-424' size-in-bits='64' id='type-id-889'/>
    <pointer-type-def type-id='type-id-890' size-in-bits='64' id='type-id-75'/>
    <pointer-type-def type-id='type-id-891' size-in-bits='64' id='type-id-81'/>
    <pointer-type-def type-id='type-id-892' size-in-bits='64' id='type-id-78'/>
    <pointer-type-def type-id='type-id-893' size-in-bits='64' id='type-id-84'/>
    <pointer-type-def type-id='type-id-894' size-in-bits='64' id='type-id-431'/>
    <reference-type-def kind='lvalue' type-id='type-id-19' size-in-bits='64' id='type-id-895'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-896'/>
    <pointer-type-def type-id='type-id-422' size-in-bits='64' id='type-id-897'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-898'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-899'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-900'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-901'/>
    <pointer-type-def type-id='type-id-443' size-in-bits='64' id='type-id-902'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-903'/>
    <reference-type-def kind='lvalue' type-id='type-id-531' size-in-bits='64' id='type-id-904'/>
    <reference-type-def kind='rvalue' type-id='type-id-531' size-in-bits='64' id='type-id-905'/>
    <pointer-type-def type-id='type-id-531' size-in-bits='64' id='type-id-906'/>
    <pointer-type-def type-id='type-id-907' size-in-bits='64' id='type-id-908'/>
    <pointer-type-def type-id='type-id-909' size-in-bits='64' id='type-id-910'/>
    <reference-type-def kind='lvalue' type-id='type-id-535' size-in-bits='64' id='type-id-911'/>
    <reference-type-def kind='lvalue' type-id='type-id-912' size-in-bits='64' id='type-id-913'/>
    <reference-type-def kind='lvalue' type-id='type-id-538' size-in-bits='64' id='type-id-914'/>
    <reference-type-def kind='rvalue' type-id='type-id-538' size-in-bits='64' id='type-id-915'/>
    <pointer-type-def type-id='type-id-538' size-in-bits='64' id='type-id-916'/>
    <qualified-type-def type-id='type-id-916' const='yes' id='type-id-917'/>
    <pointer-type-def type-id='type-id-918' size-in-bits='64' id='type-id-919'/>
    <qualified-type-def type-id='type-id-919' const='yes' id='type-id-920'/>
    <pointer-type-def type-id='type-id-921' size-in-bits='64' id='type-id-922'/>
    <reference-type-def kind='lvalue' type-id='type-id-543' size-in-bits='64' id='type-id-923'/>
    <reference-type-def kind='lvalue' type-id='type-id-546' size-in-bits='64' id='type-id-924'/>
    <reference-type-def kind='lvalue' type-id='type-id-548' size-in-bits='64' id='type-id-925'/>
    <reference-type-def kind='rvalue' type-id='type-id-548' size-in-bits='64' id='type-id-926'/>
    <pointer-type-def type-id='type-id-548' size-in-bits='64' id='type-id-927'/>
    <reference-type-def kind='lvalue' type-id='type-id-552' size-in-bits='64' id='type-id-928'/>
    <reference-type-def kind='rvalue' type-id='type-id-552' size-in-bits='64' id='type-id-929'/>
    <pointer-type-def type-id='type-id-552' size-in-bits='64' id='type-id-930'/>
    <reference-type-def kind='lvalue' type-id='type-id-555' size-in-bits='64' id='type-id-931'/>
    <reference-type-def kind='rvalue' type-id='type-id-555' size-in-bits='64' id='type-id-932'/>
    <pointer-type-def type-id='type-id-555' size-in-bits='64' id='type-id-933'/>
    <qualified-type-def type-id='type-id-933' const='yes' id='type-id-934'/>
    <reference-type-def kind='lvalue' type-id='type-id-558' size-in-bits='64' id='type-id-935'/>
    <reference-type-def kind='lvalue' type-id='type-id-561' size-in-bits='64' id='type-id-936'/>
    <reference-type-def kind='lvalue' type-id='type-id-564' size-in-bits='64' id='type-id-937'/>
    <pointer-type-def type-id='type-id-564' size-in-bits='64' id='type-id-938'/>
    <reference-type-def kind='lvalue' type-id='type-id-572' size-in-bits='64' id='type-id-939'/>
    <pointer-type-def type-id='type-id-572' size-in-bits='64' id='type-id-940'/>
    <reference-type-def kind='lvalue' type-id='type-id-580' size-in-bits='64' id='type-id-941'/>
    <pointer-type-def type-id='type-id-580' size-in-bits='64' id='type-id-942'/>
    <pointer-type-def type-id='type-id-587' size-in-bits='64' id='type-id-943'/>
    <pointer-type-def type-id='type-id-590' size-in-bits='64' id='type-id-944'/>
    <reference-type-def kind='rvalue' type-id='type-id-945' size-in-bits='64' id='type-id-946'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-947'/>
    <pointer-type-def type-id='type-id-948' size-in-bits='64' id='type-id-157'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-949'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-950'/>
    <pointer-type-def type-id='type-id-951' size-in-bits='64' id='type-id-952'/>
    <pointer-type-def type-id='type-id-953' size-in-bits='64' id='type-id-155'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-16'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-954'/>
    <reference-type-def kind='lvalue' type-id='type-id-31' size-in-bits='64' id='type-id-955'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-956'/>
    <qualified-type-def type-id='type-id-956' const='yes' id='type-id-957'/>
    <reference-type-def kind='lvalue' type-id='type-id-957' size-in-bits='64' id='type-id-958'/>
    <pointer-type-def type-id='type-id-956' size-in-bits='64' id='type-id-959'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-960'/>
    <pointer-type-def type-id='type-id-614' size-in-bits='64' id='type-id-961'/>
    <pointer-type-def type-id='type-id-617' size-in-bits='64' id='type-id-962'/>
    <pointer-type-def type-id='type-id-963' size-in-bits='64' id='type-id-964'/>
    <reference-type-def kind='lvalue' type-id='type-id-150' size-in-bits='64' id='type-id-965'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-966'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-967'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-968'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-969'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-970'/>
    <pointer-type-def type-id='type-id-416' size-in-bits='64' id='type-id-971'/>
    <qualified-type-def type-id='type-id-971' const='yes' id='type-id-972'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-973'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-974'/>
    <pointer-type-def type-id='type-id-974' size-in-bits='64' id='type-id-975'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-976'/>
    <reference-type-def kind='lvalue' type-id='type-id-44' size-in-bits='64' id='type-id-977'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-978'/>
    <reference-type-def kind='lvalue' type-id='type-id-46' size-in-bits='64' id='type-id-979'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-980'/>
    <reference-type-def kind='lvalue' type-id='type-id-283' size-in-bits='64' id='type-id-981'/>
    <pointer-type-def type-id='type-id-283' size-in-bits='64' id='type-id-293'/>
    <qualified-type-def type-id='type-id-293' const='yes' id='type-id-982'/>
    <pointer-type-def type-id='type-id-284' size-in-bits='64' id='type-id-983'/>
    <pointer-type-def type-id='type-id-285' size-in-bits='64' id='type-id-290'/>
    <reference-type-def kind='lvalue' type-id='type-id-287' size-in-bits='64' id='type-id-984'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-60'/>
    <reference-type-def kind='lvalue' type-id='type-id-985' size-in-bits='64' id='type-id-986'/>
    <pointer-type-def type-id='type-id-412' size-in-bits='64' id='type-id-987'/>
    <reference-type-def kind='lvalue' type-id='type-id-347' size-in-bits='64' id='type-id-350'/>
    <pointer-type-def type-id='type-id-347' size-in-bits='64' id='type-id-988'/>
    <qualified-type-def type-id='type-id-988' const='yes' id='type-id-348'/>
    <reference-type-def kind='lvalue' type-id='type-id-349' size-in-bits='64' id='type-id-989'/>
    <pointer-type-def type-id='type-id-349' size-in-bits='64' id='type-id-990'/>
    <qualified-type-def type-id='type-id-990' const='yes' id='type-id-991'/>
    <reference-type-def kind='lvalue' type-id='type-id-992' size-in-bits='64' id='type-id-993'/>
    <pointer-type-def type-id='type-id-994' size-in-bits='64' id='type-id-995'/>
    <reference-type-def kind='lvalue' type-id='type-id-110' size-in-bits='64' id='type-id-996'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-997'/>
    <reference-type-def kind='lvalue' type-id='type-id-659' size-in-bits='64' id='type-id-102'/>
    <pointer-type-def type-id='type-id-659' size-in-bits='64' id='type-id-998'/>
    <reference-type-def kind='lvalue' type-id='type-id-99' size-in-bits='64' id='type-id-999'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-106'/>
    <reference-type-def kind='lvalue' type-id='type-id-115' size-in-bits='64' id='type-id-1000'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-122'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-118'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-121'/>
    <pointer-type-def type-id='type-id-1001' size-in-bits='64' id='type-id-1002'/>
    <reference-type-def kind='lvalue' type-id='type-id-111' size-in-bits='64' id='type-id-1003'/>
    <reference-type-def kind='lvalue' type-id='type-id-108' size-in-bits='64' id='type-id-1004'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-1005'/>
    <reference-type-def kind='lvalue' type-id='type-id-105' size-in-bits='64' id='type-id-1006'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-1007'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-1008'/>
    <pointer-type-def type-id='type-id-674' size-in-bits='64' id='type-id-100'/>
    <reference-type-def kind='lvalue' type-id='type-id-411' size-in-bits='64' id='type-id-1009'/>
    <reference-type-def kind='lvalue' type-id='type-id-336' size-in-bits='64' id='type-id-1010'/>
    <pointer-type-def type-id='type-id-336' size-in-bits='64' id='type-id-1011'/>
    <qualified-type-def type-id='type-id-1011' const='yes' id='type-id-1012'/>
    <reference-type-def kind='lvalue' type-id='type-id-127' size-in-bits='64' id='type-id-1013'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-1014'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-147'/>
    <pointer-type-def type-id='type-id-377' size-in-bits='64' id='type-id-379'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-141'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-1015'/>
    <qualified-type-def type-id='type-id-1015' const='yes' id='type-id-132'/>
    <reference-type-def kind='lvalue' type-id='type-id-136' size-in-bits='64' id='type-id-138'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-1016'/>
    <pointer-type-def type-id='type-id-693' size-in-bits='64' id='type-id-1017'/>
    <qualified-type-def type-id='type-id-1017' const='yes' id='type-id-1018'/>
    <reference-type-def kind='lvalue' type-id='type-id-133' size-in-bits='64' id='type-id-135'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-1019'/>
    <pointer-type-def type-id='type-id-1020' size-in-bits='64' id='type-id-291'/>
    <reference-type-def kind='lvalue' type-id='type-id-1021' size-in-bits='64' id='type-id-1022'/>
    <reference-type-def kind='lvalue' type-id='type-id-264' size-in-bits='64' id='type-id-1023'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-1024'/>
    <qualified-type-def type-id='type-id-1024' const='yes' id='type-id-1025'/>
    <pointer-type-def type-id='type-id-265' size-in-bits='64' id='type-id-269'/>
    <reference-type-def kind='lvalue' type-id='type-id-270' size-in-bits='64' id='type-id-1026'/>
    <pointer-type-def type-id='type-id-270' size-in-bits='64' id='type-id-1027'/>
    <qualified-type-def type-id='type-id-1027' const='yes' id='type-id-1028'/>
    <reference-type-def kind='lvalue' type-id='type-id-272' size-in-bits='64' id='type-id-1029'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-1030'/>
    <pointer-type-def type-id='type-id-708' size-in-bits='64' id='type-id-1031'/>
    <pointer-type-def type-id='type-id-1032' size-in-bits='64' id='type-id-1033'/>
    <reference-type-def kind='lvalue' type-id='type-id-344' size-in-bits='64' id='type-id-1034'/>
    <pointer-type-def type-id='type-id-344' size-in-bits='64' id='type-id-1035'/>
    <pointer-type-def type-id='type-id-1036' size-in-bits='64' id='type-id-345'/>
    <reference-type-def kind='lvalue' type-id='type-id-144' size-in-bits='64' id='type-id-1037'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-107'/>
    <pointer-type-def type-id='type-id-1038' size-in-bits='64' id='type-id-281'/>
    <qualified-type-def type-id='type-id-107' const='yes' id='type-id-1039'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-101'/>
    <pointer-type-def type-id='type-id-276' size-in-bits='64' id='type-id-1040'/>
    <pointer-type-def type-id='type-id-720' size-in-bits='64' id='type-id-1041'/>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' id='type-id-279'/>
    <reference-type-def kind='lvalue' type-id='type-id-125' size-in-bits='64' id='type-id-1042'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-1043'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-1044'/>
    <qualified-type-def type-id='type-id-1044' const='yes' id='type-id-1045'/>
    <reference-type-def kind='lvalue' type-id='type-id-124' size-in-bits='64' id='type-id-1046'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-1047'/>
    <reference-type-def kind='lvalue' type-id='type-id-126' size-in-bits='64' id='type-id-1048'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-1049'/>
    <reference-type-def kind='lvalue' type-id='type-id-128' size-in-bits='64' id='type-id-1050'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-275'/>
    <qualified-type-def type-id='type-id-275' const='yes' id='type-id-1051'/>
    <reference-type-def kind='lvalue' type-id='type-id-33' size-in-bits='64' id='type-id-1052'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-1053'/>
    <qualified-type-def type-id='type-id-1053' const='yes' id='type-id-1054'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-1055'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-37'/>
    <reference-type-def kind='lvalue' type-id='type-id-38' size-in-bits='64' id='type-id-1056'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-1057'/>
    <qualified-type-def type-id='type-id-1057' const='yes' id='type-id-1058'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-1059'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-41'/>
    <reference-type-def kind='lvalue' type-id='type-id-123' size-in-bits='64' id='type-id-1060'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-1061'/>
    <qualified-type-def type-id='type-id-1061' const='yes' id='type-id-1062'/>
    <pointer-type-def type-id='type-id-1063' size-in-bits='64' id='type-id-1064'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-1065'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-1066'/>
    <reference-type-def kind='lvalue' type-id='type-id-173' size-in-bits='64' id='type-id-1067'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-1068'/>
    <qualified-type-def type-id='type-id-1068' const='yes' id='type-id-1069'/>
    <pointer-type-def type-id='type-id-329' size-in-bits='64' id='type-id-1070'/>
    <qualified-type-def type-id='type-id-1070' const='yes' id='type-id-1071'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' id='type-id-1072'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' id='type-id-1073'/>
    <reference-type-def kind='lvalue' type-id='type-id-311' size-in-bits='64' id='type-id-1074'/>
    <pointer-type-def type-id='type-id-311' size-in-bits='64' id='type-id-1075'/>
    <reference-type-def kind='lvalue' type-id='type-id-304' size-in-bits='64' id='type-id-1076'/>
    <pointer-type-def type-id='type-id-304' size-in-bits='64' id='type-id-1077'/>
    <reference-type-def kind='lvalue' type-id='type-id-317' size-in-bits='64' id='type-id-1078'/>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' id='type-id-1079'/>
    <reference-type-def kind='lvalue' type-id='type-id-321' size-in-bits='64' id='type-id-1080'/>
    <pointer-type-def type-id='type-id-321' size-in-bits='64' id='type-id-1081'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-1082'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-1083'/>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-1084'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-1085'/>
    <reference-type-def kind='lvalue' type-id='type-id-216' size-in-bits='64' id='type-id-1086'/>
    <reference-type-def kind='lvalue' type-id='type-id-218' size-in-bits='64' id='type-id-1087'/>
    <reference-type-def kind='lvalue' type-id='type-id-222' size-in-bits='64' id='type-id-1088'/>
    <pointer-type-def type-id='type-id-214' size-in-bits='64' id='type-id-1089'/>
    <qualified-type-def type-id='type-id-1089' const='yes' id='type-id-1090'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-1091'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' id='type-id-225'/>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' id='type-id-226'/>
    <reference-type-def kind='lvalue' type-id='type-id-229' size-in-bits='64' id='type-id-1092'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-1093'/>
    <reference-type-def kind='lvalue' type-id='type-id-231' size-in-bits='64' id='type-id-1094'/>
    <reference-type-def kind='lvalue' type-id='type-id-220' size-in-bits='64' id='type-id-1095'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-1096'/>
    <reference-type-def kind='lvalue' type-id='type-id-228' size-in-bits='64' id='type-id-244'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-242'/>
    <pointer-type-def type-id='type-id-239' size-in-bits='64' id='type-id-1097'/>
    <reference-type-def kind='lvalue' type-id='type-id-249' size-in-bits='64' id='type-id-248'/>
    <reference-type-def kind='lvalue' type-id='type-id-253' size-in-bits='64' id='type-id-252'/>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' id='type-id-1098'/>
    <reference-type-def kind='lvalue' type-id='type-id-257' size-in-bits='64' id='type-id-1099'/>
    <reference-type-def kind='lvalue' type-id='type-id-258' size-in-bits='64' id='type-id-1100'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-1101'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-1102'/>
    <reference-type-def kind='lvalue' type-id='type-id-165' size-in-bits='64' id='type-id-1103'/>
    <reference-type-def kind='lvalue' type-id='type-id-167' size-in-bits='64' id='type-id-1104'/>
    <reference-type-def kind='lvalue' type-id='type-id-172' size-in-bits='64' id='type-id-1105'/>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-1106'/>
    <qualified-type-def type-id='type-id-1106' const='yes' id='type-id-1107'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-1108'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-175'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-176'/>
    <reference-type-def kind='lvalue' type-id='type-id-179' size-in-bits='64' id='type-id-1109'/>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-1110'/>
    <reference-type-def kind='lvalue' type-id='type-id-181' size-in-bits='64' id='type-id-1111'/>
    <reference-type-def kind='lvalue' type-id='type-id-170' size-in-bits='64' id='type-id-1112'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-1113'/>
    <reference-type-def kind='lvalue' type-id='type-id-178' size-in-bits='64' id='type-id-195'/>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-193'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' id='type-id-1114'/>
    <reference-type-def kind='lvalue' type-id='type-id-201' size-in-bits='64' id='type-id-200'/>
    <reference-type-def kind='lvalue' type-id='type-id-205' size-in-bits='64' id='type-id-204'/>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' id='type-id-1115'/>
    <reference-type-def kind='lvalue' type-id='type-id-209' size-in-bits='64' id='type-id-1116'/>
    <reference-type-def kind='lvalue' type-id='type-id-210' size-in-bits='64' id='type-id-1117'/>
    <pointer-type-def type-id='type-id-352' size-in-bits='64' id='type-id-356'/>
    <reference-type-def kind='lvalue' type-id='type-id-355' size-in-bits='64' id='type-id-353'/>
    <pointer-type-def type-id='type-id-355' size-in-bits='64' id='type-id-357'/>
    <reference-type-def kind='lvalue' type-id='type-id-351' size-in-bits='64' id='type-id-1118'/>
    <pointer-type-def type-id='type-id-351' size-in-bits='64' id='type-id-354'/>
    <pointer-type-def type-id='type-id-1119' size-in-bits='64' id='type-id-1120'/>
    <pointer-type-def type-id='type-id-358' size-in-bits='64' id='type-id-1121'/>
    <qualified-type-def type-id='type-id-1121' const='yes' id='type-id-1122'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-1123'/>
    <reference-type-def kind='lvalue' type-id='type-id-274' size-in-bits='64' id='type-id-1124'/>
    <pointer-type-def type-id='type-id-274' size-in-bits='64' id='type-id-1125'/>
    <reference-type-def kind='lvalue' type-id='type-id-314' size-in-bits='64' id='type-id-1126'/>
    <pointer-type-def type-id='type-id-314' size-in-bits='64' id='type-id-1127'/>
    <reference-type-def kind='lvalue' type-id='type-id-308' size-in-bits='64' id='type-id-1128'/>
    <pointer-type-def type-id='type-id-308' size-in-bits='64' id='type-id-1129'/>
    <reference-type-def kind='lvalue' type-id='type-id-1130' size-in-bits='64' id='type-id-1131'/>
    <pointer-type-def type-id='type-id-853' size-in-bits='64' id='type-id-1132'/>
    <reference-type-def kind='lvalue' type-id='type-id-86' size-in-bits='64' id='type-id-1133'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-1134'/>
    <reference-type-def kind='lvalue' type-id='type-id-381' size-in-bits='64' id='type-id-1135'/>
    <pointer-type-def type-id='type-id-381' size-in-bits='64' id='type-id-384'/>
    <reference-type-def kind='lvalue' type-id='type-id-92' size-in-bits='64' id='type-id-1136'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-1137'/>
    <reference-type-def kind='lvalue' type-id='type-id-392' size-in-bits='64' id='type-id-1138'/>
    <pointer-type-def type-id='type-id-392' size-in-bits='64' id='type-id-394'/>
    <reference-type-def kind='lvalue' type-id='type-id-131' size-in-bits='64' id='type-id-1139'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-1140'/>
    <qualified-type-def type-id='type-id-1140' const='yes' id='type-id-1141'/>
    <reference-type-def kind='lvalue' type-id='type-id-402' size-in-bits='64' id='type-id-1142'/>
    <pointer-type-def type-id='type-id-402' size-in-bits='64' id='type-id-404'/>
    <pointer-type-def type-id='type-id-873' size-in-bits='64' id='type-id-1143'/>
    <pointer-type-def type-id='type-id-876' size-in-bits='64' id='type-id-1144'/>
    <qualified-type-def type-id='type-id-1144' const='yes' id='type-id-1145'/>
    <reference-type-def kind='lvalue' type-id='type-id-415' size-in-bits='64' id='type-id-1146'/>
    <pointer-type-def type-id='type-id-415' size-in-bits='64' id='type-id-1147'/>
    <qualified-type-def type-id='type-id-1147' const='yes' id='type-id-1148'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-1149'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-1150'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-1151'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-1152'/>
    <class-decl name='_GdkEventKey' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-148'/>
    <class-decl name='_GdkWindow' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-65'/>
    <class-decl name='_GtkRcStyle' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-69'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-462'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-463'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-464'/>
    <class-decl name='wxAcceleratorTable' visibility='default' is-declaration-only='yes' id='type-id-609'/>
    <class-decl name='wxApp' visibility='default' is-declaration-only='yes' id='type-id-140'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxApp' mangled-name='_ZN5wxAppD2Ev' filepath='include/wx/gtk/app.h' line='24' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-960' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxApp' mangled-name='_ZN5wxAppD4Ev' filepath='include/wx/gtk/app.h' line='24' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-960' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK5wxApp12GetClassInfoEv' filepath='include/wx/gtk/app.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-613' is-artificial='yes'/>
          <return type-id='type-id-293'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <function-decl name='Initialize' mangled-name='_ZN5wxApp10InitializeERiPPw' filepath='include/wx/gtk/app.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-960' is-artificial='yes'/>
          <parameter type-id='type-id-895'/>
          <parameter type-id='type-id-975'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='30'>
        <function-decl name='CleanUp' mangled-name='_ZN5wxApp7CleanUpEv' filepath='include/wx/gtk/app.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-960' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='50'>
        <function-decl name='WakeUpIdle' mangled-name='_ZN5wxApp10WakeUpIdleEv' filepath='include/wx/gtk/app.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-960' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='53'>
        <function-decl name='OnAssertFailure' mangled-name='_ZN5wxApp15OnAssertFailureEPKwiS1_S1_S1_' filepath='include/wx/gtk/app.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-960' is-artificial='yes'/>
          <parameter type-id='type-id-292'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-292'/>
          <parameter type-id='type-id-292'/>
          <parameter type-id='type-id-292'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='59'>
        <function-decl name='OnInitGui' mangled-name='_ZN5wxApp9OnInitGuiEv' filepath='include/wx/gtk/app.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-960' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='68'>
        <function-decl name='SetNativeTheme' mangled-name='_ZN5wxApp14SetNativeThemeERK8wxString' filepath='include/wx/gtk/app.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-960' is-artificial='yes'/>
          <parameter type-id='type-id-760'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='70'>
        <function-decl name='GetXVisualInfo' mangled-name='_ZN5wxApp14GetXVisualInfoEv' filepath='include/wx/gtk/app.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-960' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxAppBase' visibility='default' is-declaration-only='yes' id='type-id-614'>
      <member-function access='public' vtable-offset='25'>
        <function-decl name='OnRun' mangled-name='_ZN9wxAppBase5OnRunEv' filepath='include/wx/app.h' line='589' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-961' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='28'>
        <function-decl name='OnExit' mangled-name='_ZN9wxAppBase6OnExitEv' filepath='include/wx/app.h' line='592' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-961' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='33'>
        <function-decl name='OnInitCmdLine' mangled-name='_ZN9wxAppBase13OnInitCmdLineER15wxCmdLineParser' filepath='include/wx/app.h' line='683' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-961' is-artificial='yes'/>
          <parameter type-id='type-id-986'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='34'>
        <function-decl name='OnCmdLineParsed' mangled-name='_ZN9wxAppBase15OnCmdLineParsedER15wxCmdLineParser' filepath='include/wx/app.h' line='682' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-961' is-artificial='yes'/>
          <parameter type-id='type-id-986'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='51'>
        <function-decl name='ProcessIdle' mangled-name='_ZN9wxAppBase11ProcessIdleEv' filepath='include/wx/app.h' line='612' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-961' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='52'>
        <function-decl name='UsesEventLoop' mangled-name='_ZNK9wxAppBase13UsesEventLoopEv' filepath='include/wx/app.h' line='615' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-616' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='55'>
        <function-decl name='IsGUI' mangled-name='_ZNK9wxAppBase5IsGUIEv' filepath='include/wx/app.h' line='694' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-616' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='56'>
        <function-decl name='CreateTraits' mangled-name='_ZN9wxAppBase12CreateTraitsEv' filepath='include/wx/app.h' line='709' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-961' is-artificial='yes'/>
          <return type-id='type-id-964'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='60'>
        <function-decl name='SafeYield' mangled-name='_ZN9wxAppBase9SafeYieldEP8wxWindowb' filepath='include/wx/app.h' line='604' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-961' is-artificial='yes'/>
          <parameter type-id='type-id-1143'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='61'>
        <function-decl name='SafeYieldFor' mangled-name='_ZN9wxAppBase12SafeYieldForEP8wxWindowl' filepath='include/wx/app.h' line='605' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-961' is-artificial='yes'/>
          <parameter type-id='type-id-1143'/>
          <parameter type-id='type-id-21'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='62'>
        <function-decl name='IsActive' mangled-name='_ZNK9wxAppBase8IsActiveEv' filepath='include/wx/app.h' line='622' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-616' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='63'>
        <function-decl name='GetTopWindow' mangled-name='_ZNK9wxAppBase12GetTopWindowEv' filepath='include/wx/app.h' line='630' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-616' is-artificial='yes'/>
          <return type-id='type-id-1143'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='64'>
        <function-decl name='GetDisplayMode' mangled-name='_ZNK9wxAppBase14GetDisplayModeEv' filepath='include/wx/app.h' line='652' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-616' is-artificial='yes'/>
          <return type-id='type-id-870'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='65'>
        <function-decl name='SetDisplayMode' mangled-name='_ZN9wxAppBase14SetDisplayModeERK11wxVideoMode' filepath='include/wx/app.h' line='656' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-961' is-artificial='yes'/>
          <parameter type-id='type-id-872'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='66'>
        <function-decl name='SetPrintMode' mangled-name='_ZN9wxAppBase12SetPrintModeEi' filepath='include/wx/app.h' line='667' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-961' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='67'>
        <function-decl name='GetLayoutDirection' mangled-name='_ZNK9wxAppBase18GetLayoutDirectionEv' filepath='include/wx/app.h' line='672' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-616' is-artificial='yes'/>
          <return type-id='type-id-262'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='69'>
        <function-decl name='SetActive' mangled-name='_ZN9wxAppBase9SetActiveEbP8wxWindow' filepath='include/wx/app.h' line='692' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-961' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <parameter type-id='type-id-1143'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxAppConsoleBase' visibility='default' is-declaration-only='yes' id='type-id-617'>
      <member-function access='public' vtable-offset='23'>
        <function-decl name='CallOnInit' mangled-name='_ZN16wxAppConsoleBase10CallOnInitEv' filepath='include/wx/app.h' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-962' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='24'>
        <function-decl name='OnInit' mangled-name='_ZN16wxAppConsoleBase6OnInitEv' filepath='include/wx/app.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-962' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='26'>
        <function-decl name='OnLaunched' mangled-name='_ZN16wxAppConsoleBase10OnLaunchedEv' filepath='include/wx/app.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-962' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='27'>
        <function-decl name='OnEventLoopEnter' mangled-name='_ZN16wxAppConsoleBase16OnEventLoopEnterEP15wxEventLoopBase' filepath='include/wx/app.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-962' is-artificial='yes'/>
          <parameter type-id='type-id-1002'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='29'>
        <function-decl name='OnEventLoopExit' mangled-name='_ZN16wxAppConsoleBase15OnEventLoopExitEP15wxEventLoopBase' filepath='include/wx/app.h' line='121' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-962' is-artificial='yes'/>
          <parameter type-id='type-id-1002'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='31'>
        <function-decl name='OnFatalException' mangled-name='_ZN16wxAppConsoleBase16OnFatalExceptionEv' filepath='include/wx/app.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-962' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='32'>
        <function-decl name='Exit' mangled-name='_ZN16wxAppConsoleBase4ExitEv' filepath='include/wx/app.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-962' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='35'>
        <function-decl name='OnCmdLineHelp' mangled-name='_ZN16wxAppConsoleBase13OnCmdLineHelpER15wxCmdLineParser' filepath='include/wx/app.h' line='207' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-962' is-artificial='yes'/>
          <parameter type-id='type-id-986'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='36'>
        <function-decl name='OnCmdLineError' mangled-name='_ZN16wxAppConsoleBase14OnCmdLineErrorER15wxCmdLineParser' filepath='include/wx/app.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-962' is-artificial='yes'/>
          <parameter type-id='type-id-986'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='37'>
        <function-decl name='SetCLocale' mangled-name='_ZN16wxAppConsoleBase10SetCLocaleEv' filepath='include/wx/app.h' line='259' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-962' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='38'>
        <function-decl name='FilterEvent' mangled-name='_ZN16wxAppConsoleBase11FilterEventER7wxEvent' filepath='include/wx/app.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-962' is-artificial='yes'/>
          <parameter type-id='type-id-102'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='39'>
        <function-decl name='CallEventHandler' mangled-name='_ZNK16wxAppConsoleBase16CallEventHandlerEP12wxEvtHandlerR14wxEventFunctorR7wxEvent' filepath='include/wx/app.h' line='280' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-619' is-artificial='yes'/>
          <parameter type-id='type-id-100'/>
          <parameter type-id='type-id-999'/>
          <parameter type-id='type-id-102'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='40'>
        <function-decl name='HandleEvent' mangled-name='_ZNK16wxAppConsoleBase11HandleEventEP12wxEvtHandlerMS0_FvR7wxEventES3_' filepath='include/wx/app.h' line='289' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-619' is-artificial='yes'/>
          <parameter type-id='type-id-100'/>
          <parameter type-id='type-id-102'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='41'>
        <function-decl name='OnUnhandledException' mangled-name='_ZN16wxAppConsoleBase20OnUnhandledExceptionEv' filepath='include/wx/app.h' line='297' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-962' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='42'>
        <function-decl name='OnExceptionInMainLoop' mangled-name='_ZN16wxAppConsoleBase21OnExceptionInMainLoopEv' filepath='include/wx/app.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-962' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='43'>
        <function-decl name='StoreCurrentException' mangled-name='_ZN16wxAppConsoleBase21StoreCurrentExceptionEv' filepath='include/wx/app.h' line='319' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-962' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='44'>
        <function-decl name='RethrowStoredException' mangled-name='_ZN16wxAppConsoleBase22RethrowStoredExceptionEv' filepath='include/wx/app.h' line='327' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-962' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='45'>
        <function-decl name='ProcessPendingEvents' mangled-name='_ZN16wxAppConsoleBase20ProcessPendingEventsEv' filepath='include/wx/app.h' line='344' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-962' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='46'>
        <function-decl name='Pending' mangled-name='_ZN16wxAppConsoleBase7PendingEv' filepath='include/wx/app.h' line='395' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-962' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='47'>
        <function-decl name='Dispatch' mangled-name='_ZN16wxAppConsoleBase8DispatchEv' filepath='include/wx/app.h' line='396' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-962' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='48'>
        <function-decl name='MainLoop' mangled-name='_ZN16wxAppConsoleBase8MainLoopEv' filepath='include/wx/app.h' line='398' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-962' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='49'>
        <function-decl name='ExitMainLoop' mangled-name='_ZN16wxAppConsoleBase12ExitMainLoopEv' filepath='include/wx/app.h' line='399' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-962' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='54'>
        <function-decl name='OnAssert' mangled-name='_ZN16wxAppConsoleBase8OnAssertEPKwiS1_S1_' filepath='include/wx/app.h' line='438' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-962' is-artificial='yes'/>
          <parameter type-id='type-id-292'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-292'/>
          <parameter type-id='type-id-292'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='57'>
        <function-decl name='WXReservedApp1' mangled-name='_ZN16wxAppConsoleBase14WXReservedApp1EPv' filepath='include/wx/app.h' line='541' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-962' is-artificial='yes'/>
          <parameter type-id='type-id-16'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='58'>
        <function-decl name='WXReservedApp2' mangled-name='_ZN16wxAppConsoleBase14WXReservedApp2EPv' filepath='include/wx/app.h' line='542' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-962' is-artificial='yes'/>
          <parameter type-id='type-id-16'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxAppTraits' visibility='default' is-declaration-only='yes' id='type-id-963'/>
    <class-decl name='wxCmdLineParser' visibility='default' is-declaration-only='yes' id='type-id-985'/>
    <class-decl name='wxColour' visibility='default' is-declaration-only='yes' id='type-id-412'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD1Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-987' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxColour' mangled-name='_ZN8wxColourD4Ev' filepath='include/wx/gtk/colour.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-987' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='8'>
        <function-decl name='Red' mangled-name='_ZNK8wxColour3RedEv' filepath='include/wx/gtk/colour.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-649' is-artificial='yes'/>
          <return type-id='type-id-27'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='9'>
        <function-decl name='Green' mangled-name='_ZNK8wxColour5GreenEv' filepath='include/wx/gtk/colour.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-649' is-artificial='yes'/>
          <return type-id='type-id-27'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='10'>
        <function-decl name='Blue' mangled-name='_ZNK8wxColour4BlueEv' filepath='include/wx/gtk/colour.h' line='38' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-649' is-artificial='yes'/>
          <return type-id='type-id-27'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxCursor' visibility='default' is-declaration-only='yes' id='type-id-654'/>
    <class-decl name='wxDC' visibility='default' is-declaration-only='yes' id='type-id-992'/>
    <class-decl name='wxDropTarget' visibility='default' is-declaration-only='yes' id='type-id-994'/>
    <class-decl name='wxEvent' visibility='default' is-declaration-only='yes' id='type-id-659'/>
    <class-decl name='wxEventFunctor' visibility='default' is-declaration-only='yes' id='type-id-99'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-106' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-106' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD2Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-106' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxEventFunctor' mangled-name='_ZN14wxEventFunctorD4Ev' filepath='include/wx/event.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-106' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEventLoopBase' visibility='default' is-declaration-only='yes' id='type-id-1001'/>
    <class-decl name='wxEvtHandler' visibility='default' is-declaration-only='yes' id='type-id-674'>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='SetNextHandler' mangled-name='_ZN12wxEvtHandler14SetNextHandlerEPS_' filepath='include/wx/event.h' line='3647' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-100' is-artificial='yes'/>
          <parameter type-id='type-id-100'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='SetPreviousHandler' mangled-name='_ZN12wxEvtHandler18SetPreviousHandlerEPS_' filepath='include/wx/event.h' line='3648' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-100' is-artificial='yes'/>
          <parameter type-id='type-id-100'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='ProcessEvent' mangled-name='_ZN12wxEvtHandler12ProcessEventER7wxEvent' filepath='include/wx/event.h' line='3677' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-100' is-artificial='yes'/>
          <parameter type-id='type-id-102'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='QueueEvent' mangled-name='_ZN12wxEvtHandler10QueueEventEP7wxEvent' filepath='include/wx/event.h' line='3705' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-100' is-artificial='yes'/>
          <parameter type-id='type-id-998'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='AddPendingEvent' mangled-name='_ZN12wxEvtHandler15AddPendingEventERK7wxEvent' filepath='include/wx/event.h' line='3709' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-100' is-artificial='yes'/>
          <parameter type-id='type-id-661'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='SearchEventTable' mangled-name='_ZN12wxEvtHandler16SearchEventTableER12wxEventTableR7wxEvent' filepath='include/wx/event.h' line='3964' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-100' is-artificial='yes'/>
          <parameter type-id='type-id-1003'/>
          <parameter type-id='type-id-102'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='11'>
        <function-decl name='TryBefore' mangled-name='_ZN12wxEvtHandler9TryBeforeER7wxEvent' filepath='include/wx/event.h' line='3994' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-100' is-artificial='yes'/>
          <parameter type-id='type-id-102'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='12'>
        <function-decl name='TryAfter' mangled-name='_ZN12wxEvtHandler8TryAfterER7wxEvent' filepath='include/wx/event.h' line='4014' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-100' is-artificial='yes'/>
          <parameter type-id='type-id-102'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='13'>
        <function-decl name='OnDynamicBind' mangled-name='_ZN12wxEvtHandler13OnDynamicBindER24wxDynamicEventTableEntry' filepath='include/wx/event.h' line='4029' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-100' is-artificial='yes'/>
          <parameter type-id='type-id-996'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='14'>
        <function-decl name='GetEventTable' mangled-name='_ZNK12wxEvtHandler13GetEventTableEv' filepath='include/wx/event.h' line='4036' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-676' is-artificial='yes'/>
          <return type-id='type-id-112'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='15'>
        <function-decl name='GetEventHashTable' mangled-name='_ZNK12wxEvtHandler17GetEventHashTableEv' filepath='include/wx/event.h' line='4039' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-676' is-artificial='yes'/>
          <return type-id='type-id-1000'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='16'>
        <function-decl name='DoSetClientObject' mangled-name='_ZN12wxEvtHandler17DoSetClientObjectEP12wxClientData' filepath='include/wx/event.h' line='4073' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-100' is-artificial='yes'/>
          <parameter type-id='type-id-60'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='17'>
        <function-decl name='DoGetClientObject' mangled-name='_ZNK12wxEvtHandler17DoGetClientObjectEv' filepath='include/wx/event.h' line='4074' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-676' is-artificial='yes'/>
          <return type-id='type-id-60'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='18'>
        <function-decl name='DoSetClientData' mangled-name='_ZN12wxEvtHandler15DoSetClientDataEPv' filepath='include/wx/event.h' line='4076' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-100' is-artificial='yes'/>
          <parameter type-id='type-id-16'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='19'>
        <function-decl name='DoGetClientData' mangled-name='_ZNK12wxEvtHandler15DoGetClientDataEv' filepath='include/wx/event.h' line='4077' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-676' is-artificial='yes'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='20'>
        <function-decl name='WXReservedEvtHandler1' mangled-name='_ZN12wxEvtHandler21WXReservedEvtHandler1EPv' filepath='include/wx/event.h' line='4083' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-100' is-artificial='yes'/>
          <parameter type-id='type-id-16'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='21'>
        <function-decl name='WXReservedEvtHandler2' mangled-name='_ZN12wxEvtHandler21WXReservedEvtHandler2EPv' filepath='include/wx/event.h' line='4084' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-100' is-artificial='yes'/>
          <parameter type-id='type-id-16'/>
          <return type-id='type-id-16'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxFont' visibility='default' is-declaration-only='yes' id='type-id-411'/>
    <class-decl name='wxGDIObject' visibility='default' is-declaration-only='yes' id='type-id-278'>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK11wxGDIObject12GetClassInfoEv' filepath='include/wx/gdiobj.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-685' is-artificial='yes'/>
          <return type-id='type-id-293'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='3'>
        <function-decl name='CreateRefData' mangled-name='_ZNK11wxGDIObject13CreateRefDataEv' filepath='include/wx/gdiobj.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-685' is-artificial='yes'/>
          <return type-id='type-id-1040'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='4'>
        <function-decl name='CloneRefData' mangled-name='_ZNK11wxGDIObject12CloneRefDataEPK12wxRefCounter' filepath='include/wx/gdiobj.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-685' is-artificial='yes'/>
          <parameter type-id='type-id-719'/>
          <return type-id='type-id-1040'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='IsOk' mangled-name='_ZNK11wxGDIObject4IsOkEv' filepath='include/wx/gdiobj.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-685' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxHashTable' visibility='default' is-declaration-only='yes' id='type-id-1020'/>
    <class-decl name='wxHashTable_Node' visibility='default' is-declaration-only='yes' id='type-id-286'/>
    <class-decl name='wxHelpEvent' visibility='default' is-declaration-only='yes' id='type-id-1153'>
      <member-type access='public'>
        <enum-decl name='Origin' filepath='include/wx/event.h' line='3331' column='1' id='type-id-1154'>
          <underlying-type type-id='type-id-26'/>
          <enumerator name='Origin_Unknown' value='0'/>
          <enumerator name='Origin_Keyboard' value='1'/>
          <enumerator name='Origin_HelpButton' value='2'/>
        </enum-decl>
      </member-type>
    </class-decl>
    <class-decl name='wxIdleEvent' visibility='default' is-declaration-only='yes' id='type-id-1021'/>
    <class-decl name='wxLog' visibility='default' is-declaration-only='yes' id='type-id-1155'/>
    <class-decl name='wxMBConv' visibility='default' is-declaration-only='yes' id='type-id-708'/>
    <class-decl name='wxMenu' visibility='default' is-declaration-only='yes' id='type-id-1032'/>
    <class-decl name='wxMutexInternal' visibility='default' is-declaration-only='yes' id='type-id-1036'/>
    <class-decl name='wxObject' visibility='default' is-declaration-only='yes' id='type-id-144'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-107' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-107' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD0Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-107' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-107' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-107' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD2Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-107' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxObject' mangled-name='_ZN8wxObjectD4Ev' filepath='include/wx/object.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-107' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK8wxObject12GetClassInfoEv' filepath='include/wx/object.h' line='446' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-716' is-artificial='yes'/>
          <return type-id='type-id-293'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='3'>
        <function-decl name='CreateRefData' mangled-name='_ZNK8wxObject13CreateRefDataEv' filepath='include/wx/object.h' line='464' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-716' is-artificial='yes'/>
          <return type-id='type-id-1040'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='4'>
        <function-decl name='CloneRefData' mangled-name='_ZNK8wxObject12CloneRefDataEPK12wxRefCounter' filepath='include/wx/object.h' line='467' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-716' is-artificial='yes'/>
          <parameter type-id='type-id-719'/>
          <return type-id='type-id-1040'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxPalette' visibility='default' is-declaration-only='yes' id='type-id-720'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPalette' mangled-name='_ZN9wxPaletteD0Ev' filepath='include/wx/generic/paletteg.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1041' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPalette' mangled-name='_ZN9wxPaletteD0Ev' filepath='include/wx/generic/paletteg.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1041' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPalette' mangled-name='_ZN9wxPaletteD0Ev' filepath='include/wx/generic/paletteg.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1041' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPalette' mangled-name='_ZN9wxPaletteD1Ev' filepath='include/wx/generic/paletteg.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1041' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPalette' mangled-name='_ZN9wxPaletteD1Ev' filepath='include/wx/generic/paletteg.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1041' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPalette' mangled-name='_ZN9wxPaletteD1Ev' filepath='include/wx/generic/paletteg.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1041' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxPalette' mangled-name='_ZN9wxPaletteD4Ev' filepath='include/wx/generic/paletteg.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1041' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK9wxPalette12GetClassInfoEv' filepath='include/wx/generic/paletteg.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-722' is-artificial='yes'/>
          <return type-id='type-id-293'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='6'>
        <function-decl name='CreateGDIRefData' mangled-name='_ZNK9wxPalette16CreateGDIRefDataEv' filepath='include/wx/generic/paletteg.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-722' is-artificial='yes'/>
          <return type-id='type-id-1014'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='7'>
        <function-decl name='CloneGDIRefData' mangled-name='_ZNK9wxPalette15CloneGDIRefDataEPK12wxGDIRefData' filepath='include/wx/generic/paletteg.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-722' is-artificial='yes'/>
          <parameter type-id='type-id-129'/>
          <return type-id='type-id-1014'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='8'>
        <function-decl name='GetColoursCount' mangled-name='_ZNK9wxPalette15GetColoursCountEv' filepath='include/wx/generic/paletteg.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-722' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxSizer' visibility='default' is-declaration-only='yes' id='type-id-1063'/>
    <class-decl name='wxTextEntry' visibility='default' is-declaration-only='yes' id='type-id-834'/>
    <class-decl name='wxThread' visibility='default' is-declaration-only='yes' id='type-id-352'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-356' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-356' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD2Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-356' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxThread' mangled-name='_ZN8wxThreadD4Ev' filepath='include/wx/thread.h' line='597' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-356' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='0'>
        <function-decl name='TestDestroy' mangled-name='_ZN8wxThread11TestDestroyEv' filepath='include/wx/thread.h' line='593' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-356' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='4'>
        <function-decl name='OnDelete' mangled-name='_ZN8wxThread8OnDeleteEv' filepath='include/wx/thread.h' line='622' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-356' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='5'>
        <function-decl name='OnKill' mangled-name='_ZN8wxThread6OnKillEv' filepath='include/wx/thread.h' line='626' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-356' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='6'>
        <function-decl name='OnExit' mangled-name='_ZN8wxThread6OnExitEv' filepath='include/wx/thread.h' line='631' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-356' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxToolTip' visibility='default' is-declaration-only='yes' id='type-id-1119'/>
    <class-decl name='wxUpdateUIEvent' visibility='default' is-declaration-only='yes' id='type-id-1130'/>
    <class-decl name='wxValidator' visibility='default' is-declaration-only='yes' id='type-id-853'/>
    <class-decl name='wxVideoMode' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-870'/>
    <class-decl name='wxWindow' visibility='default' is-declaration-only='yes' id='type-id-873'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWindow' mangled-name='_ZN8wxWindowD2Ev' filepath='include/wx/gtk/window.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWindow' mangled-name='_ZN8wxWindowD4Ev' filepath='include/wx/gtk/window.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-19' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK8wxWindow12GetClassInfoEv' filepath='include/wx/gtk/window.h' line='500' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-875' is-artificial='yes'/>
          <return type-id='type-id-293'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='23'>
        <function-decl name='SetLabel' mangled-name='_ZN8wxWindow8SetLabelERK8wxString' filepath='include/wx/gtk/window.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-760'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='24'>
        <function-decl name='GetLabel' mangled-name='_ZNK8wxWindow8GetLabelEv' filepath='include/wx/gtk/window.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-875' is-artificial='yes'/>
          <return type-id='type-id-173'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='27'>
        <function-decl name='GetLayoutDirection' mangled-name='_ZNK8wxWindow18GetLayoutDirectionEv' filepath='include/wx/gtk/window.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-875' is-artificial='yes'/>
          <return type-id='type-id-262'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='28'>
        <function-decl name='SetLayoutDirection' mangled-name='_ZN8wxWindow18SetLayoutDirectionE17wxLayoutDirection' filepath='include/wx/gtk/window.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-262'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='29'>
        <function-decl name='AdjustForLayoutDirection' mangled-name='_ZNK8wxWindow24AdjustForLayoutDirectionEiii' filepath='include/wx/gtk/window.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-875' is-artificial='yes'/>
          <parameter type-id='type-id-359'/>
          <parameter type-id='type-id-359'/>
          <parameter type-id='type-id-359'/>
          <return type-id='type-id-359'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='31'>
        <function-decl name='Raise' mangled-name='_ZN8wxWindow5RaiseEv' filepath='include/wx/gtk/window.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='32'>
        <function-decl name='Lower' mangled-name='_ZN8wxWindow5LowerEv' filepath='include/wx/gtk/window.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='51'>
        <function-decl name='GetContentScaleFactor' mangled-name='_ZNK8wxWindow21GetContentScaleFactorEv' filepath='include/wx/gtk/window.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-875' is-artificial='yes'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='52'>
        <function-decl name='GetDPIScaleFactor' mangled-name='_ZNK8wxWindow17GetDPIScaleFactorEv' filepath='include/wx/gtk/window.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-875' is-artificial='yes'/>
          <return type-id='type-id-17'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='53'>
        <function-decl name='GetWindowBorderSize' mangled-name='_ZNK8wxWindow19GetWindowBorderSizeEv' filepath='include/wx/gtk/window.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-875' is-artificial='yes'/>
          <return type-id='type-id-123'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='58'>
        <function-decl name='Show' mangled-name='_ZN8wxWindow4ShowEb' filepath='include/wx/gtk/window.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='62'>
        <function-decl name='IsShown' mangled-name='_ZNK8wxWindow7IsShownEv' filepath='include/wx/gtk/window.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-875' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='67'>
        <function-decl name='IsRetained' mangled-name='_ZNK8wxWindow10IsRetainedEv' filepath='include/wx/gtk/window.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-875' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='71'>
        <function-decl name='SetFocus' mangled-name='_ZN8wxWindow8SetFocusEv' filepath='include/wx/gtk/window.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='78'>
        <function-decl name='SetCanFocus' mangled-name='_ZN8wxWindow11SetCanFocusEb' filepath='include/wx/gtk/window.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='81'>
        <function-decl name='Reparent' mangled-name='_ZN8wxWindow8ReparentEP12wxWindowBase' filepath='include/wx/gtk/window.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-1144'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='82'>
        <function-decl name='AddChild' mangled-name='_ZN8wxWindow8AddChildEP12wxWindowBase' filepath='include/wx/gtk/window.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-1144'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='83'>
        <function-decl name='RemoveChild' mangled-name='_ZN8wxWindow11RemoveChildEP12wxWindowBase' filepath='include/wx/gtk/window.h' line='120' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-1144'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='94'>
        <function-decl name='WarpPointer' mangled-name='_ZN8wxWindow11WarpPointerEii' filepath='include/wx/gtk/window.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='96'>
        <function-decl name='EnableTouchEvents' mangled-name='_ZN8wxWindow17EnableTouchEventsEi' filepath='include/wx/gtk/window.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='97'>
        <function-decl name='Refresh' mangled-name='_ZN8wxWindow7RefreshEbPK6wxRect' filepath='include/wx/gtk/window.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <parameter type-id='type-id-731'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='98'>
        <function-decl name='Update' mangled-name='_ZN8wxWindow6UpdateEv' filepath='include/wx/gtk/window.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='99'>
        <function-decl name='ClearBackground' mangled-name='_ZN8wxWindow15ClearBackgroundEv' filepath='include/wx/gtk/window.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='101'>
        <function-decl name='SetDoubleBuffered' mangled-name='_ZN8wxWindow17SetDoubleBufferedEb' filepath='include/wx/gtk/window.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='102'>
        <function-decl name='IsDoubleBuffered' mangled-name='_ZNK8wxWindow16IsDoubleBufferedEv' filepath='include/wx/gtk/window.h' line='132' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-875' is-artificial='yes'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='103'>
        <function-decl name='DoIsExposed' mangled-name='_ZNK8wxWindow11DoIsExposedEii' filepath='include/wx/gtk/window.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-875' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='104'>
        <function-decl name='DoIsExposed' mangled-name='_ZNK8wxWindow11DoIsExposedEiiii' filepath='include/wx/gtk/window.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-875' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='106'>
        <function-decl name='SetBackgroundColour' mangled-name='_ZN8wxWindow19SetBackgroundColourERK8wxColour' filepath='include/wx/gtk/window.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-648'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='107'>
        <function-decl name='SetForegroundColour' mangled-name='_ZN8wxWindow19SetForegroundColourERK8wxColour' filepath='include/wx/gtk/window.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-648'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='108'>
        <function-decl name='SetBackgroundStyle' mangled-name='_ZN8wxWindow18SetBackgroundStyleE17wxBackgroundStyle' filepath='include/wx/gtk/window.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-62'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='110'>
        <function-decl name='IsTransparentBackgroundSupported' mangled-name='_ZNK8wxWindow32IsTransparentBackgroundSupportedEP8wxString' filepath='include/wx/gtk/window.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-875' is-artificial='yes'/>
          <parameter type-id='type-id-1068'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='111'>
        <function-decl name='SetFont' mangled-name='_ZN8wxWindow7SetFontERK6wxFont' filepath='include/wx/gtk/window.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-678'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='112'>
        <function-decl name='SetCursor' mangled-name='_ZN8wxWindow9SetCursorERK8wxCursor' filepath='include/wx/gtk/window.h' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-656'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='113'>
        <function-decl name='GetCharHeight' mangled-name='_ZNK8wxWindow13GetCharHeightEv' filepath='include/wx/gtk/window.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-875' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='114'>
        <function-decl name='GetCharWidth' mangled-name='_ZNK8wxWindow12GetCharWidthEv' filepath='include/wx/gtk/window.h' line='100' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-875' is-artificial='yes'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='119'>
        <function-decl name='SetScrollbar' mangled-name='_ZN8wxWindow12SetScrollbarEiiiib' filepath='include/wx/gtk/window.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='120'>
        <function-decl name='SetScrollPos' mangled-name='_ZN8wxWindow12SetScrollPosEiib' filepath='include/wx/gtk/window.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='121'>
        <function-decl name='GetScrollPos' mangled-name='_ZNK8wxWindow12GetScrollPosEi' filepath='include/wx/gtk/window.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-875' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='122'>
        <function-decl name='GetScrollThumb' mangled-name='_ZNK8wxWindow14GetScrollThumbEi' filepath='include/wx/gtk/window.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-875' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='123'>
        <function-decl name='GetScrollRange' mangled-name='_ZNK8wxWindow14GetScrollRangeEi' filepath='include/wx/gtk/window.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-875' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-19'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='124'>
        <function-decl name='ScrollWindow' mangled-name='_ZN8wxWindow12ScrollWindowEiiPK6wxRect' filepath='include/wx/gtk/window.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-19'/>
          <parameter type-id='type-id-731'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='125'>
        <function-decl name='ScrollLines' mangled-name='_ZN8wxWindow11ScrollLinesEi' filepath='include/wx/gtk/window.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='126'>
        <function-decl name='ScrollPages' mangled-name='_ZN8wxWindow11ScrollPagesEi' filepath='include/wx/gtk/window.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='130'>
        <function-decl name='SetDropTarget' mangled-name='_ZN8wxWindow13SetDropTargetEP12wxDropTarget' filepath='include/wx/gtk/window.h' line='116' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-995'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='145'>
        <function-decl name='OnInternalIdle' mangled-name='_ZN8wxWindow14OnInternalIdleEv' filepath='include/wx/gtk/window.h' line='145' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='148'>
        <function-decl name='GetHandle' mangled-name='_ZNK8wxWindow9GetHandleEv' filepath='include/wx/gtk/window.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-875' is-artificial='yes'/>
          <return type-id='type-id-72'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='158'>
        <function-decl name='DoMoveInTabOrder' mangled-name='_ZN8wxWindow16DoMoveInTabOrderEPS_N12wxWindowBase11WindowOrderE' filepath='include/wx/gtk/window.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-1143'/>
          <parameter type-id='type-id-1156'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='159'>
        <function-decl name='DoNavigateIn' mangled-name='_ZN8wxWindow12DoNavigateInEi' filepath='include/wx/gtk/window.h' line='420' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-19'/>
          <return type-id='type-id-3'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='160'>
        <function-decl name='DoEnable' mangled-name='_ZN8wxWindow8DoEnableEb' filepath='include/wx/gtk/window.h' line='390' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <parameter type-id='type-id-3'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='163'>
        <function-decl name='DoGetTextExtent' mangled-name='_ZNK8wxWindow15DoGetTextExtentERK8wxStringPiS3_S3_S3_PK6wxFont' filepath='include/wx/gtk/window.h' line='375' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-875' is-artificial='yes'/>
          <parameter type-id='type-id-760'/>
          <parameter type-id='type-id-896'/>
          <parameter type-id='type-id-896'/>
          <parameter type-id='type-id-896'/>
          <parameter type-id='type-id-896'/>
          <parameter type-id='type-id-679'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='164'>
        <function-decl name='DoClientToScreen' mangled-name='_ZNK8wxWindow16DoClientToScreenEPiS0_' filepath='include/wx/gtk/window.h' line='380' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-875' is-artificial='yes'/>
          <parameter type-id='type-id-896'/>
          <parameter type-id='type-id-896'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='165'>
        <function-decl name='DoScreenToClient' mangled-name='_ZNK8wxWindow16DoScreenToClientEPiS0_' filepath='include/wx/gtk/window.h' line='381' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-875' is-artificial='yes'/>
          <parameter type-id='type-id-896'/>
          <parameter type-id='type-id-896'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='167'>
        <function-decl name='DoCaptureMouse' mangled-name='_ZN8wxWindow14DoCaptureMouseEv' filepath='include/wx/gtk/window.h' line='396' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='168'>
        <function-decl name='DoReleaseMouse' mangled-name='_ZN8wxWindow14DoReleaseMouseEv' filepath='include/wx/gtk/window.h' line='397' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-1143' is-artificial='yes'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='169'>
        <function-decl name='DoGetPosition' mangled-name='_ZNK8wxWindow13DoGetPositionEPiS0_' filepath='include/wx/gtk/window.h' line='382' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-875' is-artificial='yes'/>
          <parameter type-id='type-id-896'/>
          <parameter type-id='type-id-896'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='171'>
        <function-decl name='DoGetSize' mangled-name='_ZNK8wxWindow9DoGetSizeEPiS0_' filepath='include/wx/gtk/window.h' line='383' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-875' is-artificial='yes'/>
          <parameter type-id='type-id-896'/>
          <parameter type-id='type-id-896'/>
          <return type-id='type-id-30'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='172'>
        <function-decl name='DoGetClientSize' mangled-name='_ZNK8wxWindow15DoGetClientSizeEPiS0_' filepath='include/wx/gtk/window.h' line='384' column='1' visibility='default' binding='global' size-in-bits='64'>
