<abi-corpus version='2.0' architecture='elf-amd-x86_64' soname='libwx_gtk3u_aui-3.2.so.0'>
  <elf-needed>
    <dependency name='libgtk-3.so.0'/>
    <dependency name='libgdk-3.so.0'/>
    <dependency name='libgobject-2.0.so.0'/>
    <dependency name='libwx_gtk3u_core-3.2.so.0'/>
    <dependency name='libwx_baseu-3.2.so.0'/>
    <dependency name='libm.so.6'/>
    <dependency name='libstdc++.so.6'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_ZN12wxAuiManager10DetachPaneEP8wxWindow' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN12wxAuiManager10GetManagerEP8wxWindow' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN12wxAuiManager10InsertPaneEP8wxWindowRK13wxAuiPaneInfoi' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_ZN12wxAuiManager10OnLeftDownER12wxMouseEvent' version='WXU_3.2' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='wxAuiNullPaneInfo' size='200' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUINOTEBOOK_ALLOW_DND' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUINOTEBOOK_BEGIN_DRAG' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUINOTEBOOK_BG_DCLICK' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUINOTEBOOK_BUTTON' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUINOTEBOOK_DRAG_DONE' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUINOTEBOOK_DRAG_MOTION' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUINOTEBOOK_END_DRAG' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUINOTEBOOK_PAGE_CHANGED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUINOTEBOOK_PAGE_CHANGING' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUINOTEBOOK_PAGE_CLOSE' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUINOTEBOOK_PAGE_CLOSED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUINOTEBOOK_TAB_MIDDLE_DOWN' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUINOTEBOOK_TAB_MIDDLE_UP' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUINOTEBOOK_TAB_RIGHT_DOWN' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUINOTEBOOK_TAB_RIGHT_UP' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUITOOLBAR_BEGIN_DRAG' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUITOOLBAR_MIDDLE_CLICK' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUITOOLBAR_OVERFLOW_CLICK' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUITOOLBAR_RIGHT_CLICK' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUITOOLBAR_TOOL_DROPDOWN' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUI_FIND_MANAGER' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUI_PANE_ACTIVATED' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUI_PANE_BUTTON' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUI_PANE_CLOSE' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUI_PANE_MAXIMIZE' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUI_PANE_RESTORE' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wxEVT_AUI_RENDER' size='4' version='WXU_3.2' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='src/aui/auibar.cpp' language='LANG_C_plus_plus_14'>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='5120' id='type-id-2'>
      <subrange length='20' type-id='type-id-3' id='type-id-4'/>
    </array-type-def>
    <class-decl name='wxAuiToolBarItem' size-in-bits='1856' visibility='default' filepath='include/wx/aui/auibar.h' line='105' column='1' id='type-id-5'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_window' type-id='type-id-6' visibility='default' filepath='include/wx/aui/auibar.h' line='230' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_label' type-id='type-id-7' visibility='default' filepath='include/wx/aui/auibar.h' line='231' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='448'>
        <var-decl name='m_bitmap' type-id='type-id-8' visibility='default' filepath='include/wx/aui/auibar.h' line='232' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='512'>
        <var-decl name='m_disabledBitmap' type-id='type-id-8' visibility='default' filepath='include/wx/aui/auibar.h' line='233' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='576'>
        <var-decl name='m_hoverBitmap' type-id='type-id-8' visibility='default' filepath='include/wx/aui/auibar.h' line='234' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='640'>
        <var-decl name='m_shortHelp' type-id='type-id-7' visibility='default' filepath='include/wx/aui/auibar.h' line='235' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1024'>
        <var-decl name='m_longHelp' type-id='type-id-7' visibility='default' filepath='include/wx/aui/auibar.h' line='236' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1408'>
        <var-decl name='m_sizerItem' type-id='type-id-9' visibility='default' filepath='include/wx/aui/auibar.h' line='237' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1472'>
        <var-decl name='m_minSize' type-id='type-id-10' visibility='default' filepath='include/wx/aui/auibar.h' line='238' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1536'>
        <var-decl name='m_spacerPixels' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibar.h' line='239' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1568'>
        <var-decl name='m_toolId' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibar.h' line='240' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1600'>
        <var-decl name='m_kind' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibar.h' line='241' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1632'>
        <var-decl name='m_state' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibar.h' line='242' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1664'>
        <var-decl name='m_proportion' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibar.h' line='243' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1696'>
        <var-decl name='m_active' type-id='type-id-12' visibility='default' filepath='include/wx/aui/auibar.h' line='244' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1704'>
        <var-decl name='m_dropDown' type-id='type-id-12' visibility='default' filepath='include/wx/aui/auibar.h' line='245' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1712'>
        <var-decl name='m_sticky' type-id='type-id-12' visibility='default' filepath='include/wx/aui/auibar.h' line='246' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1728'>
        <var-decl name='m_userData' type-id='type-id-13' visibility='default' filepath='include/wx/aui/auibar.h' line='247' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1792'>
        <var-decl name='m_alignment' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibar.h' line='248' column='1'/>
      </data-member>
      <member-function access='public' const='yes'>
        <function-decl name='GetCurrentBitmapFor' mangled-name='_ZNK16wxAuiToolBarItem19GetCurrentBitmapForEP8wxWindow' filepath='src/aui/auibar.cpp' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK16wxAuiToolBarItem19GetCurrentBitmapForEP8wxWindow@@WXU_3.2'>
          <parameter type-id='type-id-14' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-6' name='wnd' filepath='src/aui/auibar.cpp' line='115' column='1'/>
          <return type-id='type-id-15'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxAuiToolBarItemArray' size-in-bits='192' visibility='default' filepath='include/wx/aui/auibar.h' line='252' column='1' id='type-id-16'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-17'/>
    </class-decl>
    <class-decl name='wxObjectArrayTraitsForwxAuiToolBarItemArray' size-in-bits='8' visibility='default' filepath='include/wx/aui/auibar.h' line='252' column='1' id='type-id-18'>
      <member-function access='public' static='yes'>
        <function-decl name='Free' mangled-name='_ZN43wxObjectArrayTraitsForwxAuiToolBarItemArray4FreeEP16wxAuiToolBarItem' filepath='src/aui/auibar.cpp' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN43wxObjectArrayTraitsForwxAuiToolBarItemArray4FreeEP16wxAuiToolBarItem@@WXU_3.2'>
          <parameter type-id='type-id-19' name='p' filepath='src/aui/auibar.cpp' line='40' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='Clone' mangled-name='_ZN43wxObjectArrayTraitsForwxAuiToolBarItemArray5CloneERK16wxAuiToolBarItem' filepath='src/aui/auibar.cpp' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN43wxObjectArrayTraitsForwxAuiToolBarItemArray5CloneERK16wxAuiToolBarItem@@WXU_3.2'>
          <parameter type-id='type-id-21' name='item' filepath='src/aui/auibar.cpp' line='40' column='1'/>
          <return type-id='type-id-22'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxAuiToolBarArt' size-in-bits='64' visibility='default' filepath='include/wx/aui/auibar.h' line='260' column='1' id='type-id-23'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAuiToolBarArt' mangled-name='_ZN15wxAuiToolBarArtD0Ev' filepath='include/wx/aui/auibar.h' line='265' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAuiToolBarArt' mangled-name='_ZN15wxAuiToolBarArtD2Ev' filepath='include/wx/aui/auibar.h' line='265' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAuiToolBarArt' mangled-name='_ZN15wxAuiToolBarArtD4Ev' filepath='include/wx/aui/auibar.h' line='265' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='Clone' mangled-name='_ZN15wxAuiToolBarArt5CloneEv' filepath='include/wx/aui/auibar.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <return type-id='type-id-24'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <function-decl name='SetFlags' mangled-name='_ZN15wxAuiToolBarArt8SetFlagsEj' filepath='include/wx/aui/auibar.h' line='268' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-25'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='4'>
        <function-decl name='GetFlags' mangled-name='_ZN15wxAuiToolBarArt8GetFlagsEv' filepath='include/wx/aui/auibar.h' line='269' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <return type-id='type-id-25'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='SetFont' mangled-name='_ZN15wxAuiToolBarArt7SetFontERK6wxFont' filepath='include/wx/aui/auibar.h' line='270' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-26'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='GetFont' mangled-name='_ZN15wxAuiToolBarArt7GetFontEv' filepath='include/wx/aui/auibar.h' line='271' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <return type-id='type-id-27'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='SetTextOrientation' mangled-name='_ZN15wxAuiToolBarArt18SetTextOrientationEi' filepath='include/wx/aui/auibar.h' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='GetTextOrientation' mangled-name='_ZN15wxAuiToolBarArt18GetTextOrientationEv' filepath='include/wx/aui/auibar.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <return type-id='type-id-11'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='DrawBackground' mangled-name='_ZN15wxAuiToolBarArt14DrawBackgroundER4wxDCP8wxWindowRK6wxRect' filepath='include/wx/aui/auibar.h' line='275' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='DrawPlainBackground' mangled-name='_ZN15wxAuiToolBarArt19DrawPlainBackgroundER4wxDCP8wxWindowRK6wxRect' filepath='include/wx/aui/auibar.h' line='280' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <function-decl name='DrawLabel' mangled-name='_ZN15wxAuiToolBarArt9DrawLabelER4wxDCP8wxWindowRK16wxAuiToolBarItemRK6wxRect' filepath='include/wx/aui/auibar.h' line='285' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-30'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <function-decl name='DrawButton' mangled-name='_ZN15wxAuiToolBarArt10DrawButtonER4wxDCP8wxWindowRK16wxAuiToolBarItemRK6wxRect' filepath='include/wx/aui/auibar.h' line='291' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-30'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <function-decl name='DrawDropDownButton' mangled-name='_ZN15wxAuiToolBarArt18DrawDropDownButtonER4wxDCP8wxWindowRK16wxAuiToolBarItemRK6wxRect' filepath='include/wx/aui/auibar.h' line='297' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-30'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <function-decl name='DrawControlLabel' mangled-name='_ZN15wxAuiToolBarArt16DrawControlLabelER4wxDCP8wxWindowRK16wxAuiToolBarItemRK6wxRect' filepath='include/wx/aui/auibar.h' line='303' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-30'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <function-decl name='DrawSeparator' mangled-name='_ZN15wxAuiToolBarArt13DrawSeparatorER4wxDCP8wxWindowRK6wxRect' filepath='include/wx/aui/auibar.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <function-decl name='DrawGripper' mangled-name='_ZN15wxAuiToolBarArt11DrawGripperER4wxDCP8wxWindowRK6wxRect' filepath='include/wx/aui/auibar.h' line='314' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <function-decl name='DrawOverflowButton' mangled-name='_ZN15wxAuiToolBarArt18DrawOverflowButtonER4wxDCP8wxWindowRK6wxRecti' filepath='include/wx/aui/auibar.h' line='319' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-29'/>
          <parameter type-id='type-id-11'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <function-decl name='GetLabelSize' mangled-name='_ZN15wxAuiToolBarArt12GetLabelSizeER4wxDCP8wxWindowRK16wxAuiToolBarItem' filepath='include/wx/aui/auibar.h' line='325' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-30'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <function-decl name='GetToolSize' mangled-name='_ZN15wxAuiToolBarArt11GetToolSizeER4wxDCP8wxWindowRK16wxAuiToolBarItem' filepath='include/wx/aui/auibar.h' line='330' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-30'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='GetElementSize' mangled-name='_ZN15wxAuiToolBarArt14GetElementSizeEi' filepath='include/wx/aui/auibar.h' line='337' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-11'/>
          <return type-id='type-id-11'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='21'>
        <function-decl name='SetElementSize' mangled-name='_ZN15wxAuiToolBarArt14SetElementSizeEii' filepath='include/wx/aui/auibar.h' line='338' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-11'/>
          <parameter type-id='type-id-11'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <function-decl name='ShowDropDown' mangled-name='_ZN15wxAuiToolBarArt12ShowDropDownEP8wxWindowRK21wxAuiToolBarItemArray' filepath='include/wx/aui/auibar.h' line='340' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-31'/>
          <return type-id='type-id-11'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='23'>
        <function-decl name='UpdateColoursFromSystem' mangled-name='_ZN15wxAuiToolBarArt23UpdateColoursFromSystemEv' filepath='include/wx/aui/auibar.h' line='345' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-24' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxAuiGenericToolBarArt' size-in-bits='1280' visibility='default' filepath='include/wx/aui/auibar.h' line='351' column='1' id='type-id-32'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-23'/>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_buttonDropDownBmp' type-id='type-id-8' visibility='default' filepath='include/wx/aui/auibar.h' line='436' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_disabledButtonDropDownBmp' type-id='type-id-8' visibility='default' filepath='include/wx/aui/auibar.h' line='437' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_overflowBmp' type-id='type-id-8' visibility='default' filepath='include/wx/aui/auibar.h' line='438' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='256'>
        <var-decl name='m_disabledOverflowBmp' type-id='type-id-8' visibility='default' filepath='include/wx/aui/auibar.h' line='439' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='320'>
        <var-decl name='m_baseColour' type-id='type-id-33' visibility='default' filepath='include/wx/aui/auibar.h' line='440' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='448'>
        <var-decl name='m_highlightColour' type-id='type-id-33' visibility='default' filepath='include/wx/aui/auibar.h' line='441' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='576'>
        <var-decl name='m_font' type-id='type-id-27' visibility='default' filepath='include/wx/aui/auibar.h' line='442' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='704'>
        <var-decl name='m_flags' type-id='type-id-25' visibility='default' filepath='include/wx/aui/auibar.h' line='443' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='736'>
        <var-decl name='m_textOrientation' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibar.h' line='444' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='768'>
        <var-decl name='m_gripperPen1' type-id='type-id-34' visibility='default' filepath='include/wx/aui/auibar.h' line='446' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='896'>
        <var-decl name='m_gripperPen2' type-id='type-id-34' visibility='default' filepath='include/wx/aui/auibar.h' line='447' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='1024'>
        <var-decl name='m_gripperPen3' type-id='type-id-34' visibility='default' filepath='include/wx/aui/auibar.h' line='448' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='1152'>
        <var-decl name='m_separatorSize' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibar.h' line='451' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='1184'>
        <var-decl name='m_gripperSize' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibar.h' line='452' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='1216'>
        <var-decl name='m_overflowSize' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibar.h' line='453' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='1248'>
        <var-decl name='m_dropdownSize' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibar.h' line='454' column='1'/>
      </data-member>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxAuiGenericToolBarArt' mangled-name='_ZN22wxAuiGenericToolBarArtC2Ev' filepath='src/aui/auibar.cpp' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArtC2Ev@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAuiGenericToolBarArt' mangled-name='_ZN22wxAuiGenericToolBarArtD4Ev' filepath='src/aui/auibar.cpp' line='149' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAuiGenericToolBarArt' mangled-name='_ZN22wxAuiGenericToolBarArtD0Ev' filepath='src/aui/auibar.cpp' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArtD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAuiGenericToolBarArt' mangled-name='_ZN22wxAuiGenericToolBarArtD2Ev' filepath='src/aui/auibar.cpp' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArtD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='Clone' mangled-name='_ZN22wxAuiGenericToolBarArt5CloneEv' filepath='src/aui/auibar.cpp' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArt5CloneEv@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <return type-id='type-id-24'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <function-decl name='SetFlags' mangled-name='_ZN22wxAuiGenericToolBarArt8SetFlagsEj' filepath='src/aui/auibar.cpp' line='186' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArt8SetFlagsEj@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <parameter type-id='type-id-25'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='4'>
        <function-decl name='GetFlags' mangled-name='_ZN22wxAuiGenericToolBarArt8GetFlagsEv' filepath='src/aui/auibar.cpp' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArt8GetFlagsEv@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <return type-id='type-id-25'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='SetFont' mangled-name='_ZN22wxAuiGenericToolBarArt7SetFontERK6wxFont' filepath='src/aui/auibar.cpp' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArt7SetFontERK6wxFont@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <parameter type-id='type-id-26'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='GetFont' mangled-name='_ZN22wxAuiGenericToolBarArt7GetFontEv' filepath='src/aui/auibar.cpp' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArt7GetFontEv@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <return type-id='type-id-27'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='SetTextOrientation' mangled-name='_ZN22wxAuiGenericToolBarArt18SetTextOrientationEi' filepath='src/aui/auibar.cpp' line='196' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArt18SetTextOrientationEi@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='GetTextOrientation' mangled-name='_ZN22wxAuiGenericToolBarArt18GetTextOrientationEv' filepath='src/aui/auibar.cpp' line='211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArt18GetTextOrientationEv@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <return type-id='type-id-11'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='DrawBackground' mangled-name='_ZN22wxAuiGenericToolBarArt14DrawBackgroundER4wxDCP8wxWindowRK6wxRect' filepath='src/aui/auibar.cpp' line='216' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArt14DrawBackgroundER4wxDCP8wxWindowRK6wxRect@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='DrawPlainBackground' mangled-name='_ZN22wxAuiGenericToolBarArt19DrawPlainBackgroundER4wxDCP8wxWindowRK6wxRect' filepath='src/aui/auibar.cpp' line='241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArt19DrawPlainBackgroundER4wxDCP8wxWindowRK6wxRect@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <function-decl name='DrawLabel' mangled-name='_ZN22wxAuiGenericToolBarArt9DrawLabelER4wxDCP8wxWindowRK16wxAuiToolBarItemRK6wxRect' filepath='src/aui/auibar.cpp' line='251' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArt9DrawLabelER4wxDCP8wxWindowRK16wxAuiToolBarItemRK6wxRect@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-30'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <function-decl name='DrawButton' mangled-name='_ZN22wxAuiGenericToolBarArt10DrawButtonER4wxDCP8wxWindowRK16wxAuiToolBarItemRK6wxRect' filepath='src/aui/auibar.cpp' line='278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArt10DrawButtonER4wxDCP8wxWindowRK16wxAuiToolBarItemRK6wxRect@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-30'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <function-decl name='DrawDropDownButton' mangled-name='_ZN22wxAuiGenericToolBarArt18DrawDropDownButtonER4wxDCP8wxWindowRK16wxAuiToolBarItemRK6wxRect' filepath='src/aui/auibar.cpp' line='378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArt18DrawDropDownButtonER4wxDCP8wxWindowRK16wxAuiToolBarItemRK6wxRect@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-30'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <function-decl name='DrawControlLabel' mangled-name='_ZN22wxAuiGenericToolBarArt16DrawControlLabelER4wxDCP8wxWindowRK16wxAuiToolBarItemRK6wxRect' filepath='src/aui/auibar.cpp' line='507' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArt16DrawControlLabelER4wxDCP8wxWindowRK16wxAuiToolBarItemRK6wxRect@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-30'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <function-decl name='DrawSeparator' mangled-name='_ZN22wxAuiGenericToolBarArt13DrawSeparatorER4wxDCP8wxWindowRK6wxRect' filepath='src/aui/auibar.cpp' line='626' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArt13DrawSeparatorER4wxDCP8wxWindowRK6wxRect@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <function-decl name='DrawGripper' mangled-name='_ZN22wxAuiGenericToolBarArt11DrawGripperER4wxDCP8wxWindowRK6wxRect' filepath='src/aui/auibar.cpp' line='659' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArt11DrawGripperER4wxDCP8wxWindowRK6wxRect@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <function-decl name='DrawOverflowButton' mangled-name='_ZN22wxAuiGenericToolBarArt18DrawOverflowButtonER4wxDCP8wxWindowRK6wxRecti' filepath='src/aui/auibar.cpp' line='698' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArt18DrawOverflowButtonER4wxDCP8wxWindowRK6wxRecti@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-29'/>
          <parameter type-id='type-id-11'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <function-decl name='GetLabelSize' mangled-name='_ZN22wxAuiGenericToolBarArt12GetLabelSizeER4wxDCP8wxWindowRK16wxAuiToolBarItem' filepath='src/aui/auibar.cpp' line='549' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArt12GetLabelSizeER4wxDCP8wxWindowRK16wxAuiToolBarItem@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-30'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <function-decl name='GetToolSize' mangled-name='_ZN22wxAuiGenericToolBarArt11GetToolSizeER4wxDCP8wxWindowRK16wxAuiToolBarItem' filepath='src/aui/auibar.cpp' line='572' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArt11GetToolSizeER4wxDCP8wxWindowRK16wxAuiToolBarItem@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-30'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='GetElementSize' mangled-name='_ZN22wxAuiGenericToolBarArt14GetElementSizeEi' filepath='src/aui/auibar.cpp' line='732' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArt14GetElementSizeEi@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <parameter type-id='type-id-11'/>
          <return type-id='type-id-11'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='21'>
        <function-decl name='SetElementSize' mangled-name='_ZN22wxAuiGenericToolBarArt14SetElementSizeEii' filepath='src/aui/auibar.cpp' line='744' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArt14SetElementSizeEii@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <parameter type-id='type-id-11'/>
          <parameter type-id='type-id-11'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <function-decl name='ShowDropDown' mangled-name='_ZN22wxAuiGenericToolBarArt12ShowDropDownEP8wxWindowRK21wxAuiToolBarItemArray' filepath='src/aui/auibar.cpp' line='755' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArt12ShowDropDownEP8wxWindowRK21wxAuiToolBarItemArray@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-31'/>
          <return type-id='type-id-11'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='23'>
        <function-decl name='UpdateColoursFromSystem' mangled-name='_ZN22wxAuiGenericToolBarArt23UpdateColoursFromSystemEv' filepath='src/aui/auibar.cpp' line='158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN22wxAuiGenericToolBarArt23UpdateColoursFromSystemEv@@WXU_3.2'>
          <parameter type-id='type-id-35' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxAutoBufferedPaintDC' size-in-bits='192' visibility='default' filepath='include/wx/dcbuffer.h' line='220' column='1' id='type-id-36'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-37'/>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAutoBufferedPaintDC' mangled-name='_ZN21wxAutoBufferedPaintDCD0Ev' filepath='include/wx/dcbuffer.h' line='233' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAutoBufferedPaintDC' mangled-name='_ZN21wxAutoBufferedPaintDCD2Ev' filepath='include/wx/dcbuffer.h' line='233' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAutoBufferedPaintDC' mangled-name='_ZN21wxAutoBufferedPaintDCD4Ev' filepath='include/wx/dcbuffer.h' line='233' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-38' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
    </class-decl>
    <enum-decl name='wxItemKind' filepath='include/wx/defs.h' line='2076' column='1' id='type-id-39'>
      <underlying-type type-id='type-id-40'/>
      <enumerator name='wxITEM_SEPARATOR' value='-1'/>
      <enumerator name='wxITEM_NORMAL' value='0'/>
      <enumerator name='wxITEM_CHECK' value='1'/>
      <enumerator name='wxITEM_RADIO' value='2'/>
      <enumerator name='wxITEM_DROPDOWN' value='3'/>
      <enumerator name='wxITEM_MAX' value='4'/>
    </enum-decl>
    <class-decl name='wxArray_SortFunction&lt;wxAuiToolBarItem*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-41'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-43' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-42'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-42' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;wxAuiToolBarItem*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-44'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-46' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-45'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-45' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxBaseArray&lt;wxAuiToolBarItem*, wxSortedArray_SortFunction&lt;wxAuiToolBarItem*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-47'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-48'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-45' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-49'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-42' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-50'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-52' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-51'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseObjectArray&lt;wxAuiToolBarItem, wxObjectArrayTraitsForwxAuiToolBarItemArray&gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='276' column='1' id='type-id-17'>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-47'/>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-5' filepath='include/wx/dynarray.h' line='281' column='1' id='type-id-53'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-43' filepath='include/wx/dynarray.h' line='283' column='1' id='type-id-54'/>
      </member-type>
    </class-decl>
    <class-decl name='wxEventTypeTag&lt;wxAuiToolBarEvent&gt;' size-in-bits='32' visibility='default' filepath='include/wx/event.h' line='202' column='1' id='type-id-55'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_type' type-id='type-id-56' visibility='default' filepath='include/wx/event.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTypeTag&lt;wxDPIChangedEvent&gt;' size-in-bits='32' visibility='default' filepath='include/wx/event.h' line='202' column='1' id='type-id-57'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_type' type-id='type-id-56' visibility='default' filepath='include/wx/event.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventFunctorMethod&lt;wxEventTypeTag&lt;wxDPIChangedEvent&gt;, wxEvtHandler, wxEvent, wxEvtHandler&gt;' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='392' column='1' id='type-id-58'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-59'/>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-60'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-61' visibility='default' filepath='include/wx/event.h' line='461' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxEventFunctorMethodI14wxEventTypeTagI17wxDPIChangedEventE12wxEvtHandler7wxEventS3_EclEPS3_RS4_' filepath='include/wx/event.h' line='422' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-62' is-artificial='yes'/>
          <parameter type-id='type-id-61'/>
          <parameter type-id='type-id-63'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI17wxDPIChangedEventE12wxEvtHandler7wxEventS3_E10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='439' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-64' is-artificial='yes'/>
          <parameter type-id='type-id-65'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI17wxDPIChangedEventE12wxEvtHandler7wxEventS3_E13GetEvtHandlerEv' filepath='include/wx/event.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-64' is-artificial='yes'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI17wxDPIChangedEventE12wxEvtHandler7wxEventS3_E12GetEvtMethodEv' filepath='include/wx/event.h' line='457' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-64' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxMenuItemList' size-in-bits='384' visibility='default' filepath='include/wx/menu.h' line='37' column='1' id='type-id-66'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-67'/>
      <member-type access='public'>
        <class-decl name='const_iterator' size-in-bits='128' visibility='default' filepath='include/wx/menu.h' line='37' column='1' id='type-id-68'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-70' filepath='include/wx/menu.h' line='37' column='1' id='type-id-69'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-68' filepath='include/wx/menu.h' line='37' column='1' id='type-id-71'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-73' filepath='include/wx/menu.h' line='37' column='1' id='type-id-72'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-72' filepath='include/wx/menu.h' line='37' column='1' id='type-id-74'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-76' filepath='include/wx/menu.h' line='37' column='1' id='type-id-75'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-77' visibility='default' filepath='include/wx/menu.h' line='37' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-77' visibility='default' filepath='include/wx/menu.h' line='37' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='const_reverse_iterator' size-in-bits='128' visibility='default' filepath='include/wx/menu.h' line='37' column='1' id='type-id-78'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-70' filepath='include/wx/menu.h' line='37' column='1' id='type-id-79'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-78' filepath='include/wx/menu.h' line='37' column='1' id='type-id-80'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-82' filepath='include/wx/menu.h' line='37' column='1' id='type-id-81'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-81' filepath='include/wx/menu.h' line='37' column='1' id='type-id-83'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-76' filepath='include/wx/menu.h' line='37' column='1' id='type-id-84'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-85' visibility='default' filepath='include/wx/menu.h' line='37' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-85' visibility='default' filepath='include/wx/menu.h' line='37' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='iterator' size-in-bits='128' visibility='default' filepath='include/wx/menu.h' line='37' column='1' id='type-id-86'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-70' filepath='include/wx/menu.h' line='37' column='1' id='type-id-87'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-86' filepath='include/wx/menu.h' line='37' column='1' id='type-id-88'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-90' filepath='include/wx/menu.h' line='37' column='1' id='type-id-89'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-89' filepath='include/wx/menu.h' line='37' column='1' id='type-id-91'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-76' filepath='include/wx/menu.h' line='37' column='1' id='type-id-92'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-93' visibility='default' filepath='include/wx/menu.h' line='37' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-93' visibility='default' filepath='include/wx/menu.h' line='37' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <class-decl name='reverse_iterator' size-in-bits='128' visibility='default' filepath='include/wx/menu.h' line='37' column='1' id='type-id-94'>
          <member-type access='public'>
            <typedef-decl name='Node' type-id='type-id-70' filepath='include/wx/menu.h' line='37' column='1' id='type-id-95'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='itor' type-id='type-id-94' filepath='include/wx/menu.h' line='37' column='1' id='type-id-96'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference' type-id='type-id-98' filepath='include/wx/menu.h' line='37' column='1' id='type-id-97'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='reference_type' type-id='type-id-97' filepath='include/wx/menu.h' line='37' column='1' id='type-id-99'/>
          </member-type>
          <member-type access='public'>
            <typedef-decl name='value_type' type-id='type-id-76' filepath='include/wx/menu.h' line='37' column='1' id='type-id-100'/>
          </member-type>
          <data-member access='public' layout-offset-in-bits='0'>
            <var-decl name='m_node' type-id='type-id-101' visibility='default' filepath='include/wx/menu.h' line='37' column='1'/>
          </data-member>
          <data-member access='public' layout-offset-in-bits='64'>
            <var-decl name='m_init' type-id='type-id-101' visibility='default' filepath='include/wx/menu.h' line='37' column='1'/>
          </data-member>
        </class-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-103' filepath='include/wx/menu.h' line='37' column='1' id='type-id-102'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='reference' type-id='type-id-105' filepath='include/wx/menu.h' line='37' column='1' id='type-id-104'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-107' filepath='include/wx/menu.h' line='37' column='1' id='type-id-106'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-76' filepath='include/wx/menu.h' line='37' column='1' id='type-id-108'/>
      </member-type>
      <member-function access='protected' vtable-offset='2'>
        <function-decl name='CreateNode' mangled-name='_ZN14wxMenuItemList10CreateNodeEP10wxNodeBaseS1_PvRK9wxListKey' filepath='include/wx/menu.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-109' is-artificial='yes'/>
          <parameter type-id='type-id-110'/>
          <parameter type-id='type-id-110'/>
          <parameter type-id='type-id-111'/>
          <parameter type-id='type-id-112'/>
          <return type-id='type-id-110'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='Find' mangled-name='_ZNK14wxMenuItemList4FindERK9wxListKey' filepath='include/wx/menu.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-113' is-artificial='yes'/>
          <parameter type-id='type-id-112'/>
          <return type-id='type-id-114'/>
        </function-decl>
      </member-function>
    </class-decl>
    <typedef-decl name='wxSortFuncFor_wxMenuItemList' type-id='type-id-115' filepath='include/wx/menu.h' line='37' column='1' id='type-id-116'/>
    <class-decl name='wxScopeGuardImpl3&lt;void (*)(wxAuiToolBarItem**, wxAuiToolBarItem**, long unsigned int), wxAuiToolBarItem**, wxAuiToolBarItem**, long unsigned int&gt;' size-in-bits='320' visibility='default' filepath='include/wx/scopeguard.h' line='196' column='1' id='type-id-117'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-118'/>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_fun' type-id='type-id-119' visibility='default' filepath='include/wx/scopeguard.h' line='212' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_p1' type-id='type-id-120' visibility='default' filepath='include/wx/scopeguard.h' line='213' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_p2' type-id='type-id-120' visibility='default' filepath='include/wx/scopeguard.h' line='214' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='256'>
        <var-decl name='m_p3' type-id='type-id-121' visibility='default' filepath='include/wx/scopeguard.h' line='215' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVector&lt;wxAuiToolBarItem*&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-48'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-107' filepath='include/wx/vector.h' line='179' column='1' id='type-id-122'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-22' filepath='include/wx/vector.h' line='181' column='1' id='type-id-123'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-125' filepath='include/wx/vector.h' line='184' column='1' id='type-id-124'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-127' filepath='include/wx/vector.h' line='185' column='1' id='type-id-126'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-128' filepath='include/wx/vector.h' line='187' column='1' id='type-id-52'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-129'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-130'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_INITIAL_SIZE' type-id='type-id-131' mangled-name='_ZN8wxVectorIP16wxAuiToolBarItemE18ALLOC_INITIAL_SIZEE' visibility='default' filepath='include/wx/vector.h' line='592' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-122' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-122' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-125' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ToolbarCommandCapture' size-in-bits='704' visibility='default' filepath='src/aui/auibar.cpp' line='90' column='1' id='type-id-132'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-133'/>
      <data-member access='private' layout-offset-in-bits='672'>
        <var-decl name='m_lastId' type-id='type-id-11' visibility='default' filepath='src/aui/auibar.cpp' line='112' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='ProcessEvent' mangled-name='_ZN21ToolbarCommandCapture12ProcessEventER7wxEvent' filepath='src/aui/auibar.cpp' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-134' is-artificial='yes'/>
          <parameter type-id='type-id-63'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
    </class-decl>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-134'/>
    <qualified-type-def type-id='type-id-134' const='yes' id='type-id-135'/>
    <qualified-type-def type-id='type-id-132' const='yes' id='type-id-136'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-137'/>
    <qualified-type-def type-id='type-id-137' const='yes' id='type-id-138'/>
    <qualified-type-def type-id='type-id-139' const='yes' id='type-id-140'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-141'/>
    <qualified-type-def type-id='type-id-141' const='yes' id='type-id-142'/>
    <qualified-type-def type-id='type-id-143' const='yes' id='type-id-144'/>
    <reference-type-def kind='lvalue' type-id='type-id-144' size-in-bits='64' id='type-id-145'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-146'/>
    <qualified-type-def type-id='type-id-5' const='yes' id='type-id-147'/>
    <reference-type-def kind='lvalue' type-id='type-id-147' size-in-bits='64' id='type-id-30'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-148'/>
    <qualified-type-def type-id='type-id-148' const='yes' id='type-id-14'/>
    <qualified-type-def type-id='type-id-16' const='yes' id='type-id-149'/>
    <reference-type-def kind='lvalue' type-id='type-id-149' size-in-bits='64' id='type-id-31'/>
    <qualified-type-def type-id='type-id-36' const='yes' id='type-id-150'/>
    <reference-type-def kind='lvalue' type-id='type-id-150' size-in-bits='64' id='type-id-151'/>
    <qualified-type-def type-id='type-id-47' const='yes' id='type-id-152'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-153'/>
    <qualified-type-def type-id='type-id-17' const='yes' id='type-id-154'/>
    <reference-type-def kind='lvalue' type-id='type-id-154' size-in-bits='64' id='type-id-155'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-156'/>
    <qualified-type-def type-id='type-id-156' const='yes' id='type-id-157'/>
    <qualified-type-def type-id='type-id-53' const='yes' id='type-id-158'/>
    <reference-type-def kind='lvalue' type-id='type-id-158' size-in-bits='64' id='type-id-21'/>
    <qualified-type-def type-id='type-id-159' const='yes' id='type-id-160'/>
    <qualified-type-def type-id='type-id-58' const='yes' id='type-id-161'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-64'/>
    <qualified-type-def type-id='type-id-55' const='yes' id='type-id-162'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-163'/>
    <qualified-type-def type-id='type-id-163' const='yes' id='type-id-164'/>
    <qualified-type-def type-id='type-id-57' const='yes' id='type-id-165'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-166'/>
    <qualified-type-def type-id='type-id-166' const='yes' id='type-id-167'/>
    <qualified-type-def type-id='type-id-168' const='yes' id='type-id-169'/>
    <qualified-type-def type-id='type-id-170' const='yes' id='type-id-171'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-172'/>
    <qualified-type-def type-id='type-id-173' const='yes' id='type-id-174'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-175'/>
    <qualified-type-def type-id='type-id-176' const='yes' id='type-id-177'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-178'/>
    <qualified-type-def type-id='type-id-179' const='yes' id='type-id-180'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-181'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-182'/>
    <qualified-type-def type-id='type-id-66' const='yes' id='type-id-183'/>
    <reference-type-def kind='lvalue' type-id='type-id-183' size-in-bits='64' id='type-id-184'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' id='type-id-113'/>
    <qualified-type-def type-id='type-id-68' const='yes' id='type-id-185'/>
    <reference-type-def kind='lvalue' type-id='type-id-185' size-in-bits='64' id='type-id-186'/>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-187'/>
    <qualified-type-def type-id='type-id-71' const='yes' id='type-id-188'/>
    <reference-type-def kind='lvalue' type-id='type-id-188' size-in-bits='64' id='type-id-189'/>
    <qualified-type-def type-id='type-id-75' const='yes' id='type-id-190'/>
    <reference-type-def kind='lvalue' type-id='type-id-190' size-in-bits='64' id='type-id-73'/>
    <qualified-type-def type-id='type-id-78' const='yes' id='type-id-191'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-192'/>
    <qualified-type-def type-id='type-id-80' const='yes' id='type-id-193'/>
    <reference-type-def kind='lvalue' type-id='type-id-193' size-in-bits='64' id='type-id-194'/>
    <qualified-type-def type-id='type-id-84' const='yes' id='type-id-195'/>
    <reference-type-def kind='lvalue' type-id='type-id-195' size-in-bits='64' id='type-id-82'/>
    <qualified-type-def type-id='type-id-86' const='yes' id='type-id-196'/>
    <reference-type-def kind='lvalue' type-id='type-id-196' size-in-bits='64' id='type-id-197'/>
    <pointer-type-def type-id='type-id-196' size-in-bits='64' id='type-id-198'/>
    <qualified-type-def type-id='type-id-88' const='yes' id='type-id-199'/>
    <reference-type-def kind='lvalue' type-id='type-id-199' size-in-bits='64' id='type-id-200'/>
    <qualified-type-def type-id='type-id-94' const='yes' id='type-id-201'/>
    <reference-type-def kind='lvalue' type-id='type-id-201' size-in-bits='64' id='type-id-202'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' id='type-id-203'/>
    <qualified-type-def type-id='type-id-96' const='yes' id='type-id-204'/>
    <reference-type-def kind='lvalue' type-id='type-id-204' size-in-bits='64' id='type-id-205'/>
    <qualified-type-def type-id='type-id-108' const='yes' id='type-id-206'/>
    <reference-type-def kind='lvalue' type-id='type-id-206' size-in-bits='64' id='type-id-103'/>
    <qualified-type-def type-id='type-id-117' const='yes' id='type-id-207'/>
    <reference-type-def kind='lvalue' type-id='type-id-207' size-in-bits='64' id='type-id-208'/>
    <qualified-type-def type-id='type-id-209' const='yes' id='type-id-210'/>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' id='type-id-211'/>
    <qualified-type-def type-id='type-id-211' const='yes' id='type-id-212'/>
    <qualified-type-def type-id='type-id-48' const='yes' id='type-id-213'/>
    <reference-type-def kind='lvalue' type-id='type-id-213' size-in-bits='64' id='type-id-214'/>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-215'/>
    <qualified-type-def type-id='type-id-215' const='yes' id='type-id-216'/>
    <qualified-type-def type-id='type-id-122' const='yes' id='type-id-131'/>
    <qualified-type-def type-id='type-id-123' const='yes' id='type-id-217'/>
    <reference-type-def kind='lvalue' type-id='type-id-217' size-in-bits='64' id='type-id-128'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-127'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-115'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-43'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-46'/>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' id='type-id-119'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-222'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-35'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-223'/>
    <qualified-type-def type-id='type-id-223' const='yes' id='type-id-224'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-24'/>
    <reference-type-def kind='lvalue' type-id='type-id-143' size-in-bits='64' id='type-id-225'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-226'/>
    <qualified-type-def type-id='type-id-226' const='yes' id='type-id-227'/>
    <reference-type-def kind='lvalue' type-id='type-id-5' size-in-bits='64' id='type-id-228'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-22'/>
    <qualified-type-def type-id='type-id-22' const='yes' id='type-id-229'/>
    <reference-type-def kind='lvalue' type-id='type-id-229' size-in-bits='64' id='type-id-230'/>
    <reference-type-def kind='lvalue' type-id='type-id-22' size-in-bits='64' id='type-id-231'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-232'/>
    <qualified-type-def type-id='type-id-232' const='yes' id='type-id-120'/>
    <reference-type-def kind='lvalue' type-id='type-id-36' size-in-bits='64' id='type-id-233'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-38'/>
    <qualified-type-def type-id='type-id-38' const='yes' id='type-id-234'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-235'/>
    <qualified-type-def type-id='type-id-235' const='yes' id='type-id-236'/>
    <reference-type-def kind='lvalue' type-id='type-id-17' size-in-bits='64' id='type-id-237'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-238'/>
    <qualified-type-def type-id='type-id-238' const='yes' id='type-id-239'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-19'/>
    <reference-type-def kind='lvalue' type-id='type-id-240' size-in-bits='64' id='type-id-241'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-62'/>
    <qualified-type-def type-id='type-id-62' const='yes' id='type-id-242'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-243'/>
    <qualified-type-def type-id='type-id-243' const='yes' id='type-id-244'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-245'/>
    <qualified-type-def type-id='type-id-246' const='yes' id='type-id-247'/>
    <pointer-type-def type-id='type-id-248' size-in-bits='64' id='type-id-249'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-250'/>
    <qualified-type-def type-id='type-id-250' const='yes' id='type-id-251'/>
    <qualified-type-def type-id='type-id-76' const='yes' id='type-id-252'/>
    <reference-type-def kind='lvalue' type-id='type-id-66' size-in-bits='64' id='type-id-253'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-109'/>
    <qualified-type-def type-id='type-id-109' const='yes' id='type-id-254'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-255'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-77'/>
    <reference-type-def kind='lvalue' type-id='type-id-71' size-in-bits='64' id='type-id-256'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-257'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-85'/>
    <reference-type-def kind='lvalue' type-id='type-id-80' size-in-bits='64' id='type-id-258'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-259'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-93'/>
    <reference-type-def kind='lvalue' type-id='type-id-88' size-in-bits='64' id='type-id-260'/>
    <reference-type-def kind='lvalue' type-id='type-id-92' size-in-bits='64' id='type-id-90'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-261'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-101'/>
    <reference-type-def kind='lvalue' type-id='type-id-96' size-in-bits='64' id='type-id-262'/>
    <reference-type-def kind='lvalue' type-id='type-id-100' size-in-bits='64' id='type-id-98'/>
    <reference-type-def kind='lvalue' type-id='type-id-108' size-in-bits='64' id='type-id-105'/>
    <reference-type-def kind='lvalue' type-id='type-id-117' size-in-bits='64' id='type-id-263'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-264'/>
    <qualified-type-def type-id='type-id-264' const='yes' id='type-id-265'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-266'/>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-267'/>
    <qualified-type-def type-id='type-id-267' const='yes' id='type-id-268'/>
    <reference-type-def kind='lvalue' type-id='type-id-48' size-in-bits='64' id='type-id-269'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-270'/>
    <qualified-type-def type-id='type-id-270' const='yes' id='type-id-271'/>
    <reference-type-def kind='lvalue' type-id='type-id-123' size-in-bits='64' id='type-id-272'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-125'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-114'/>
    <qualified-type-def type-id='type-id-114' const='yes' id='type-id-273'/>
    <class-decl name='wxMenuBarBase' visibility='default' is-declaration-only='yes' id='type-id-248'/>
    <class-decl name='wxMenuBase' visibility='default' is-declaration-only='yes' id='type-id-176'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMenuBase' mangled-name='_ZN10wxMenuBaseD0Ev' filepath='include/wx/menu.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-250' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMenuBase' mangled-name='_ZN10wxMenuBaseD0Ev' filepath='include/wx/menu.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-250' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMenuBase' mangled-name='_ZN10wxMenuBaseD0Ev' filepath='include/wx/menu.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-250' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMenuBase' mangled-name='_ZN10wxMenuBaseD1Ev' filepath='include/wx/menu.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-250' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMenuBase' mangled-name='_ZN10wxMenuBaseD1Ev' filepath='include/wx/menu.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-250' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMenuBase' mangled-name='_ZN10wxMenuBaseD1Ev' filepath='include/wx/menu.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-250' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMenuBase' mangled-name='_ZN10wxMenuBaseD2Ev' filepath='include/wx/menu.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-250' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMenuBase' mangled-name='_ZN10wxMenuBaseD2Ev' filepath='include/wx/menu.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-250' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMenuBase' mangled-name='_ZN10wxMenuBaseD2Ev' filepath='include/wx/menu.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-250' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxMenuBase' mangled-name='_ZN10wxMenuBaseD4Ev' filepath='include/wx/menu.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-250' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='22'>
        <function-decl name='Break' mangled-name='_ZN10wxMenuBase5BreakEv' filepath='include/wx/menu.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-250' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='23'>
        <function-decl name='FindItem' mangled-name='_ZNK10wxMenuBase8FindItemERK8wxString' filepath='include/wx/menu.h' line='224' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-178' is-artificial='yes'/>
          <parameter type-id='type-id-274'/>
          <return type-id='type-id-11'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='24'>
        <function-decl name='SetHelpString' mangled-name='_ZN10wxMenuBase13SetHelpStringEiRK8wxString' filepath='include/wx/menu.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-250' is-artificial='yes'/>
          <parameter type-id='type-id-11'/>
          <parameter type-id='type-id-274'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='25'>
        <function-decl name='GetHelpString' mangled-name='_ZNK10wxMenuBase13GetHelpStringEi' filepath='include/wx/menu.h' line='244' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-178' is-artificial='yes'/>
          <parameter type-id='type-id-11'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='26'>
        <function-decl name='SetTitle' mangled-name='_ZN10wxMenuBase8SetTitleERK8wxString' filepath='include/wx/menu.h' line='250' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-250' is-artificial='yes'/>
          <parameter type-id='type-id-274'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='27'>
        <function-decl name='SetInvokingWindow' mangled-name='_ZN10wxMenuBase17SetInvokingWindowEP8wxWindow' filepath='include/wx/menu.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-250' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='28'>
        <function-decl name='Attach' mangled-name='_ZN10wxMenuBase6AttachEP13wxMenuBarBase' filepath='include/wx/menu.h' line='291' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-250' is-artificial='yes'/>
          <parameter type-id='type-id-249'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='29'>
        <function-decl name='Detach' mangled-name='_ZN10wxMenuBase6DetachEv' filepath='include/wx/menu.h' line='292' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-250' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='30'>
        <function-decl name='DoAppend' mangled-name='_ZN10wxMenuBase8DoAppendEP10wxMenuItem' filepath='include/wx/menu.h' line='372' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-250' is-artificial='yes'/>
          <parameter type-id='type-id-76'/>
          <return type-id='type-id-76'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='31'>
        <function-decl name='DoInsert' mangled-name='_ZN10wxMenuBase8DoInsertEmP10wxMenuItem' filepath='include/wx/menu.h' line='373' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-250' is-artificial='yes'/>
          <parameter type-id='type-id-107'/>
          <parameter type-id='type-id-76'/>
          <return type-id='type-id-76'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='32'>
        <function-decl name='DoRemove' mangled-name='_ZN10wxMenuBase8DoRemoveEP10wxMenuItem' filepath='include/wx/menu.h' line='375' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-250' is-artificial='yes'/>
          <parameter type-id='type-id-76'/>
          <return type-id='type-id-76'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='33'>
        <function-decl name='DoDelete' mangled-name='_ZN10wxMenuBase8DoDeleteEP10wxMenuItem' filepath='include/wx/menu.h' line='376' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-250' is-artificial='yes'/>
          <parameter type-id='type-id-76'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='34'>
        <function-decl name='DoDestroy' mangled-name='_ZN10wxMenuBase9DoDestroyEP10wxMenuItem' filepath='include/wx/menu.h' line='377' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-250' is-artificial='yes'/>
          <parameter type-id='type-id-76'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxwxMenuItemListNode' visibility='default' is-declaration-only='yes' id='type-id-70'>
      <member-function access='protected' vtable-offset='2'>
        <function-decl name='DeleteData' mangled-name='_ZN20wxwxMenuItemListNode10DeleteDataEv' filepath='include/wx/menu.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-114' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxAuiToolBarEvent' visibility='default' filepath='include/wx/aui/auibar.h' line='67' column='1' is-declaration-only='yes' id='type-id-143'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-275'/>
      <data-member access='private' layout-offset-in-bits='1352'>
        <var-decl name='m_isDropdownClicked' type-id='type-id-12' visibility='default' filepath='include/wx/aui/auibar.h' line='95' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1376'>
        <var-decl name='m_clickPt' type-id='type-id-276' visibility='default' filepath='include/wx/aui/auibar.h' line='96' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1440'>
        <var-decl name='m_rect' type-id='type-id-277' visibility='default' filepath='include/wx/aui/auibar.h' line='97' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='1568'>
        <var-decl name='m_toolId' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibar.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-278' mangled-name='_ZN17wxAuiToolBarEvent12ms_classInfoE' visibility='default' filepath='src/aui/auibar.cpp' line='51' column='1' elf-symbol-id='_ZN17wxAuiToolBarEvent12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <member-function access='public' static='yes'>
        <function-decl name='wxCreateObject' mangled-name='_ZN17wxAuiToolBarEvent14wxCreateObjectEv' filepath='src/aui/auibar.cpp' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN17wxAuiToolBarEvent14wxCreateObjectEv@@WXU_3.2'>
          <return type-id='type-id-279'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK17wxAuiToolBarEvent12GetClassInfoEv' filepath='src/aui/auibar.cpp' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK17wxAuiToolBarEvent12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-146' is-artificial='yes'/>
          <return type-id='type-id-280'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='Clone' mangled-name='_ZNK17wxAuiToolBarEvent5CloneEv' filepath='include/wx/aui/auibar.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-146' is-artificial='yes'/>
          <return type-id='type-id-281'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxAuiToolBar' visibility='default' filepath='include/wx/aui/auibar.h' line='460' column='1' is-declaration-only='yes' id='type-id-139'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-282'/>
      <data-member access='protected' layout-offset-in-bits='5696'>
        <var-decl name='m_items' type-id='type-id-16' visibility='default' filepath='include/wx/aui/auibar.h' line='662' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='5888'>
        <var-decl name='m_art' type-id='type-id-24' visibility='default' filepath='include/wx/aui/auibar.h' line='663' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='5952'>
        <var-decl name='m_sizer' type-id='type-id-283' visibility='default' filepath='include/wx/aui/auibar.h' line='664' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6016'>
        <var-decl name='m_actionItem' type-id='type-id-22' visibility='default' filepath='include/wx/aui/auibar.h' line='665' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6080'>
        <var-decl name='m_tipItem' type-id='type-id-22' visibility='default' filepath='include/wx/aui/auibar.h' line='666' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6144'>
        <var-decl name='m_bitmap' type-id='type-id-15' visibility='default' filepath='include/wx/aui/auibar.h' line='667' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6272'>
        <var-decl name='m_gripperSizerItem' type-id='type-id-9' visibility='default' filepath='include/wx/aui/auibar.h' line='668' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6336'>
        <var-decl name='m_overflowSizerItem' type-id='type-id-9' visibility='default' filepath='include/wx/aui/auibar.h' line='669' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6400'>
        <var-decl name='m_absoluteMinSize' type-id='type-id-10' visibility='default' filepath='include/wx/aui/auibar.h' line='670' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6464'>
        <var-decl name='m_actionPos' type-id='type-id-276' visibility='default' filepath='include/wx/aui/auibar.h' line='671' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6528'>
        <var-decl name='m_customOverflowPrepend' type-id='type-id-16' visibility='default' filepath='include/wx/aui/auibar.h' line='672' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6720'>
        <var-decl name='m_customOverflowAppend' type-id='type-id-16' visibility='default' filepath='include/wx/aui/auibar.h' line='673' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6912'>
        <var-decl name='m_buttonWidth' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibar.h' line='675' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6944'>
        <var-decl name='m_buttonHeight' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibar.h' line='676' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6976'>
        <var-decl name='m_sizerElementCount' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibar.h' line='677' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7008'>
        <var-decl name='m_leftPadding' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibar.h' line='678' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7040'>
        <var-decl name='m_rightPadding' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibar.h' line='679' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7072'>
        <var-decl name='m_topPadding' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibar.h' line='680' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7104'>
        <var-decl name='m_bottomPadding' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibar.h' line='681' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7136'>
        <var-decl name='m_toolPacking' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibar.h' line='682' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7168'>
        <var-decl name='m_toolBorderPadding' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibar.h' line='683' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7200'>
        <var-decl name='m_toolTextOrientation' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibar.h' line='684' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7232'>
        <var-decl name='m_overflowState' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibar.h' line='685' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7264'>
        <var-decl name='m_dragging' type-id='type-id-12' visibility='default' filepath='include/wx/aui/auibar.h' line='686' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7272'>
        <var-decl name='m_gripperVisible' type-id='type-id-12' visibility='default' filepath='include/wx/aui/auibar.h' line='687' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7280'>
        <var-decl name='m_overflowVisible' type-id='type-id-12' visibility='default' filepath='include/wx/aui/auibar.h' line='688' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7296'>
        <var-decl name='m_orientation' type-id='type-id-284' visibility='default' filepath='include/wx/aui/auibar.h' line='694' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7328'>
        <var-decl name='m_horzHintSize' type-id='type-id-10' visibility='default' filepath='include/wx/aui/auibar.h' line='695' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='7392'>
        <var-decl name='m_vertHintSize' type-id='type-id-10' visibility='default' filepath='include/wx/aui/auibar.h' line='696' column='1'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='sm_eventTableEntries' type-id='type-id-2' mangled-name='_ZN12wxAuiToolBar20sm_eventTableEntriesE' visibility='default' filepath='src/aui/auibar.cpp' line='825' column='1' elf-symbol-id='_ZN12wxAuiToolBar20sm_eventTableEntriesE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' static='yes'>
        <var-decl name='sm_eventTable' type-id='type-id-285' mangled-name='_ZN12wxAuiToolBar13sm_eventTableE' visibility='default' filepath='src/aui/auibar.cpp' line='825' column='1' elf-symbol-id='_ZN12wxAuiToolBar13sm_eventTableE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' static='yes'>
        <var-decl name='sm_eventHashTable' type-id='type-id-286' mangled-name='_ZN12wxAuiToolBar17sm_eventHashTableE' visibility='default' filepath='src/aui/auibar.cpp' line='825' column='1' elf-symbol-id='_ZN12wxAuiToolBar17sm_eventHashTableE@@WXU_3.2'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-278' mangled-name='_ZN12wxAuiToolBar12ms_classInfoE' visibility='default' filepath='src/aui/auibar.cpp' line='50' column='1' elf-symbol-id='_ZN12wxAuiToolBar12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <member-function access='protected'>
        <function-decl name='OnSetCursor' mangled-name='_ZN12wxAuiToolBar11OnSetCursorER16wxSetCursorEvent' filepath='src/aui/auibar.cpp' line='2951' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar11OnSetCursorER16wxSetCursorEvent@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-287' name='evt' filepath='src/aui/auibar.cpp' line='2951' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnCaptureLost' mangled-name='_ZN12wxAuiToolBar13OnCaptureLostER23wxMouseCaptureLostEvent' filepath='src/aui/auibar.cpp' line='2944' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar13OnCaptureLostER23wxMouseCaptureLostEvent@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-288'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnLeaveWindow' mangled-name='_ZN12wxAuiToolBar13OnLeaveWindowER12wxMouseEvent' filepath='src/aui/auibar.cpp' line='2933' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar13OnLeaveWindowER12wxMouseEvent@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-289' name='evt' filepath='src/aui/auibar.cpp' line='2933' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='private'>
        <function-decl name='DoResetMouseState' mangled-name='_ZN12wxAuiToolBar17DoResetMouseStateEv' filepath='src/aui/auibar.cpp' line='2918' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar17DoResetMouseStateEv@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnMotion' mangled-name='_ZN12wxAuiToolBar8OnMotionER12wxMouseEvent' filepath='src/aui/auibar.cpp' line='2850' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar8OnMotionER12wxMouseEvent@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-289' name='evt' filepath='src/aui/auibar.cpp' line='2933' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnMiddleUp' mangled-name='_ZN12wxAuiToolBar10OnMiddleUpER12wxMouseEvent' filepath='src/aui/auibar.cpp' line='2824' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar10OnMiddleUpER12wxMouseEvent@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-289' name='evt' filepath='src/aui/auibar.cpp' line='2933' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnMiddleDown' mangled-name='_ZN12wxAuiToolBar12OnMiddleDownER12wxMouseEvent' filepath='src/aui/auibar.cpp' line='2782' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar12OnMiddleDownER12wxMouseEvent@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-289' name='evt' filepath='src/aui/auibar.cpp' line='2933' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnRightUp' mangled-name='_ZN12wxAuiToolBar9OnRightUpER12wxMouseEvent' filepath='src/aui/auibar.cpp' line='2749' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar9OnRightUpER12wxMouseEvent@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-289' name='evt' filepath='src/aui/auibar.cpp' line='2933' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnRightDown' mangled-name='_ZN12wxAuiToolBar11OnRightDownER12wxMouseEvent' filepath='src/aui/auibar.cpp' line='2710' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar11OnRightDownER12wxMouseEvent@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-289' name='evt' filepath='src/aui/auibar.cpp' line='2933' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnLeftUp' mangled-name='_ZN12wxAuiToolBar8OnLeftUpER12wxMouseEvent' filepath='src/aui/auibar.cpp' line='2647' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar8OnLeftUpER12wxMouseEvent@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-289' name='evt' filepath='src/aui/auibar.cpp' line='2933' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnLeftDown' mangled-name='_ZN12wxAuiToolBar10OnLeftDownER12wxMouseEvent' filepath='src/aui/auibar.cpp' line='2516' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar10OnLeftDownER12wxMouseEvent@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-289' name='evt' filepath='src/aui/auibar.cpp' line='2933' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnEraseBackground' mangled-name='_ZN12wxAuiToolBar17OnEraseBackgroundER12wxEraseEvent' filepath='src/aui/auibar.cpp' line='2511' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar17OnEraseBackgroundER12wxEraseEvent@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-290'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnPaint' mangled-name='_ZN12wxAuiToolBar7OnPaintER12wxPaintEvent' filepath='src/aui/auibar.cpp' line='2413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar7OnPaintER12wxPaintEvent@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-291'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnSysColourChanged' mangled-name='_ZN12wxAuiToolBar18OnSysColourChangedER23wxSysColourChangedEvent' filepath='src/aui/auibar.cpp' line='2405' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar18OnSysColourChangedER23wxSysColourChangedEvent@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-292' name='event' filepath='src/aui/auibar.cpp' line='2405' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnDPIChanged' mangled-name='_ZN12wxAuiToolBar12OnDPIChangedER17wxDPIChangedEvent' filepath='src/aui/auibar.cpp' line='2388' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar12OnDPIChangedER17wxDPIChangedEvent@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-293' name='event' filepath='src/aui/auibar.cpp' line='2388' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnIdle' mangled-name='_ZN12wxAuiToolBar6OnIdleER11wxIdleEvent' filepath='src/aui/auibar.cpp' line='2314' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar6OnIdleER11wxIdleEvent@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-294' name='evt' filepath='src/aui/auibar.cpp' line='2314' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnSize' mangled-name='_ZN12wxAuiToolBar6OnSizeER11wxSizeEvent' filepath='src/aui/auibar.cpp' line='2266' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar6OnSizeER11wxSizeEvent@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-295'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='DoIdleUpdate' mangled-name='_ZN12wxAuiToolBar12DoIdleUpdateEv' filepath='src/aui/auibar.cpp' line='2187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar12DoIdleUpdateEv@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='GetLabelSize' mangled-name='_ZN12wxAuiToolBar12GetLabelSizeERK8wxString' filepath='src/aui/auibar.cpp' line='2168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar12GetLabelSizeERK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-274' name='label' filepath='src/aui/auibar.cpp' line='2168' column='1'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes'>
        <function-decl name='GetOverflowRect' mangled-name='_ZNK12wxAuiToolBar15GetOverflowRectEv' filepath='src/aui/auibar.cpp' line='2144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar15GetOverflowRectEv@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <return type-id='type-id-277'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes'>
        <function-decl name='GetOverflowState' mangled-name='_ZNK12wxAuiToolBar16GetOverflowStateEv' filepath='src/aui/auibar.cpp' line='2139' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar16GetOverflowStateEv@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <return type-id='type-id-11'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='RealizeHelper' mangled-name='_ZN12wxAuiToolBar13RealizeHelperER10wxClientDCb' filepath='src/aui/auibar.cpp' line='1894' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar13RealizeHelperER10wxClientDCb@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-241' name='dc' filepath='src/aui/auibar.cpp' line='1894' column='1'/>
          <parameter type-id='type-id-12' name='horizontal' filepath='src/aui/auibar.cpp' line='1894' column='1'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Realize' mangled-name='_ZN12wxAuiToolBar7RealizeEv' filepath='src/aui/auibar.cpp' line='1856' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar7RealizeEv@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetToolBarFits' mangled-name='_ZNK12wxAuiToolBar14GetToolBarFitsEv' filepath='src/aui/auibar.cpp' line='1844' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar14GetToolBarFitsEv@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetToolRect' mangled-name='_ZNK12wxAuiToolBar11GetToolRectEi' filepath='src/aui/auibar.cpp' line='1833' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar11GetToolRectEi@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='1833' column='1'/>
          <return type-id='type-id-277'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetToolFits' mangled-name='_ZNK12wxAuiToolBar11GetToolFitsEi' filepath='src/aui/auibar.cpp' line='1828' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar11GetToolFitsEi@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='1828' column='1'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetToolFitsByIndex' mangled-name='_ZNK12wxAuiToolBar18GetToolFitsByIndexEi' filepath='src/aui/auibar.cpp' line='1792' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar18GetToolFitsByIndexEi@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='1828' column='1'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetToolIndex' mangled-name='_ZNK12wxAuiToolBar12GetToolIndexEi' filepath='src/aui/auibar.cpp' line='1774' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar12GetToolIndexEi@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='1774' column='1'/>
          <return type-id='type-id-11'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetToolCount' mangled-name='_ZNK12wxAuiToolBar12GetToolCountEv' filepath='src/aui/auibar.cpp' line='1769' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar12GetToolCountEv@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <return type-id='type-id-107'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes'>
        <function-decl name='SetArtFlags' mangled-name='_ZNK12wxAuiToolBar11SetArtFlagsEv' filepath='src/aui/auibar.cpp' line='1759' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar11SetArtFlagsEv@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes'>
        <function-decl name='IsPaneValid' mangled-name='_ZNK12wxAuiToolBar11IsPaneValidEl' filepath='src/aui/auibar.cpp' line='1749' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar11IsPaneValidEl@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-13' name='style' filepath='src/aui/auibar.cpp' line='1749' column='1'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='protected' static='yes'>
        <function-decl name='IsPaneValid' mangled-name='_ZN12wxAuiToolBar11IsPaneValidElRK13wxAuiPaneInfo' filepath='src/aui/auibar.cpp' line='1730' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar11IsPaneValidElRK13wxAuiPaneInfo@@WXU_3.2'>
          <parameter type-id='type-id-13'/>
          <parameter type-id='type-id-296'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='IsPaneValid' mangled-name='_ZNK12wxAuiToolBar11IsPaneValidERK13wxAuiPaneInfo' filepath='src/aui/auibar.cpp' line='1725' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar11IsPaneValidERK13wxAuiPaneInfo@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-296' name='pane' filepath='src/aui/auibar.cpp' line='1725' column='1'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetHintSize' mangled-name='_ZNK12wxAuiToolBar11GetHintSizeEi' filepath='src/aui/auibar.cpp' line='1709' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar11GetHintSizeEi@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='dock_direction' filepath='src/aui/auibar.cpp' line='1709' column='1'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetCustomOverflowItems' mangled-name='_ZN12wxAuiToolBar22SetCustomOverflowItemsERK21wxAuiToolBarItemArrayS2_' filepath='src/aui/auibar.cpp' line='1701' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar22SetCustomOverflowItemsERK21wxAuiToolBarItemArrayS2_@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-31' name='prepend' filepath='src/aui/auibar.cpp' line='1701' column='1'/>
          <parameter type-id='type-id-31' name='append' filepath='src/aui/auibar.cpp' line='1702' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetToolLongHelp' mangled-name='_ZN12wxAuiToolBar15SetToolLongHelpEiRK8wxString' filepath='src/aui/auibar.cpp' line='1692' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar15SetToolLongHelpEiRK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='1692' column='1'/>
          <parameter type-id='type-id-274' name='help_string' filepath='src/aui/auibar.cpp' line='1692' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetToolLongHelp' mangled-name='_ZNK12wxAuiToolBar15GetToolLongHelpEi' filepath='src/aui/auibar.cpp' line='1682' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar15GetToolLongHelpEi@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='1682' column='1'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetToolShortHelp' mangled-name='_ZN12wxAuiToolBar16SetToolShortHelpEiRK8wxString' filepath='src/aui/auibar.cpp' line='1673' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar16SetToolShortHelpEiRK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='1692' column='1'/>
          <parameter type-id='type-id-274' name='help_string' filepath='src/aui/auibar.cpp' line='1692' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetToolShortHelp' mangled-name='_ZNK12wxAuiToolBar16GetToolShortHelpEi' filepath='src/aui/auibar.cpp' line='1663' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar16GetToolShortHelpEi@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='1682' column='1'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetToolBitmap' mangled-name='_ZN12wxAuiToolBar13SetToolBitmapEiRK14wxBitmapBundle' filepath='src/aui/auibar.cpp' line='1654' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar13SetToolBitmapEiRK14wxBitmapBundle@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='1654' column='1'/>
          <parameter type-id='type-id-297' name='bitmap' filepath='src/aui/auibar.cpp' line='1654' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetToolBitmap' mangled-name='_ZNK12wxAuiToolBar13GetToolBitmapEi' filepath='src/aui/auibar.cpp' line='1644' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar13GetToolBitmapEi@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='1644' column='1'/>
          <return type-id='type-id-15'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetToolLabel' mangled-name='_ZN12wxAuiToolBar12SetToolLabelEiRK8wxString' filepath='src/aui/auibar.cpp' line='1635' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar12SetToolLabelEiRK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='1692' column='1'/>
          <parameter type-id='type-id-274' name='help_string' filepath='src/aui/auibar.cpp' line='1692' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetToolLabel' mangled-name='_ZNK12wxAuiToolBar12GetToolLabelEi' filepath='src/aui/auibar.cpp' line='1625' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar12GetToolLabelEi@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='1682' column='1'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetToolEnabled' mangled-name='_ZNK12wxAuiToolBar14GetToolEnabledEi' filepath='src/aui/auibar.cpp' line='1615' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar14GetToolEnabledEi@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='1828' column='1'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='EnableTool' mangled-name='_ZN12wxAuiToolBar10EnableToolEib' filepath='src/aui/auibar.cpp' line='1602' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar10EnableToolEib@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='1602' column='1'/>
          <parameter type-id='type-id-12' name='state' filepath='src/aui/auibar.cpp' line='1602' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetToolToggled' mangled-name='_ZNK12wxAuiToolBar14GetToolToggledEi' filepath='src/aui/auibar.cpp' line='1592' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar14GetToolToggledEi@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='1828' column='1'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='ToggleTool' mangled-name='_ZN12wxAuiToolBar10ToggleToolEib' filepath='src/aui/auibar.cpp' line='1551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar10ToggleToolEib@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='1602' column='1'/>
          <parameter type-id='type-id-12' name='state' filepath='src/aui/auibar.cpp' line='1602' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='RefreshOverflowState' mangled-name='_ZN12wxAuiToolBar20RefreshOverflowStateEv' filepath='src/aui/auibar.cpp' line='1515' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar20RefreshOverflowStateEv@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='SetPressedItem' mangled-name='_ZN12wxAuiToolBar14SetPressedItemEP16wxAuiToolBarItem' filepath='src/aui/auibar.cpp' line='1489' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar14SetPressedItemEP16wxAuiToolBarItem@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-22' name='pitem' filepath='src/aui/auibar.cpp' line='1489' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='SetHoverItem' mangled-name='_ZN12wxAuiToolBar12SetHoverItemEP16wxAuiToolBarItem' filepath='src/aui/auibar.cpp' line='1461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar12SetHoverItemEP16wxAuiToolBarItem@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-22' name='pitem' filepath='src/aui/auibar.cpp' line='1489' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetOverflowVisible' mangled-name='_ZN12wxAuiToolBar18SetOverflowVisibleEb' filepath='src/aui/auibar.cpp' line='1438' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar18SetOverflowVisibleEb@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-12' name='visible' filepath='src/aui/auibar.cpp' line='1438' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetOverflowVisible' mangled-name='_ZNK12wxAuiToolBar18GetOverflowVisibleEv' filepath='src/aui/auibar.cpp' line='1433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar18GetOverflowVisibleEv@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetGripperVisible' mangled-name='_ZN12wxAuiToolBar17SetGripperVisibleEb' filepath='src/aui/auibar.cpp' line='1421' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar17SetGripperVisibleEb@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-12' name='visible' filepath='src/aui/auibar.cpp' line='1438' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetGripperVisible' mangled-name='_ZNK12wxAuiToolBar17GetGripperVisibleEv' filepath='src/aui/auibar.cpp' line='1416' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar17GetGripperVisibleEv@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetMargins' mangled-name='_ZN12wxAuiToolBar10SetMarginsEiiii' filepath='src/aui/auibar.cpp' line='1404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar10SetMarginsEiiii@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='left' filepath='src/aui/auibar.cpp' line='1404' column='1'/>
          <parameter type-id='type-id-11' name='right' filepath='src/aui/auibar.cpp' line='1404' column='1'/>
          <parameter type-id='type-id-11' name='top' filepath='src/aui/auibar.cpp' line='1404' column='1'/>
          <parameter type-id='type-id-11' name='bottom' filepath='src/aui/auibar.cpp' line='1404' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='SetOrientation' mangled-name='_ZN12wxAuiToolBar14SetOrientationEi' filepath='src/aui/auibar.cpp' line='1392' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar14SetOrientationEi@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='orientation' filepath='src/aui/auibar.cpp' line='1392' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetToolPacking' mangled-name='_ZNK12wxAuiToolBar14GetToolPackingEv' filepath='src/aui/auibar.cpp' line='1386' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar14GetToolPackingEv@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <return type-id='type-id-11'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetToolPacking' mangled-name='_ZN12wxAuiToolBar14SetToolPackingEi' filepath='src/aui/auibar.cpp' line='1381' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar14SetToolPackingEi@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='orientation' filepath='src/aui/auibar.cpp' line='1392' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetToolTextOrientation' mangled-name='_ZNK12wxAuiToolBar22GetToolTextOrientationEv' filepath='src/aui/auibar.cpp' line='1376' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar22GetToolTextOrientationEv@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <return type-id='type-id-11'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetToolTextOrientation' mangled-name='_ZN12wxAuiToolBar22SetToolTextOrientationEi' filepath='src/aui/auibar.cpp' line='1366' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar22SetToolTextOrientationEi@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='orientation' filepath='src/aui/auibar.cpp' line='1392' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetToolBorderPadding' mangled-name='_ZNK12wxAuiToolBar20GetToolBorderPaddingEv' filepath='src/aui/auibar.cpp' line='1361' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar20GetToolBorderPaddingEv@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <return type-id='type-id-11'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetToolBorderPadding' mangled-name='_ZN12wxAuiToolBar20SetToolBorderPaddingEi' filepath='src/aui/auibar.cpp' line='1356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar20SetToolBorderPaddingEi@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='orientation' filepath='src/aui/auibar.cpp' line='1392' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetToolSticky' mangled-name='_ZNK12wxAuiToolBar13GetToolStickyEi' filepath='src/aui/auibar.cpp' line='1344' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar13GetToolStickyEi@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='1828' column='1'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetToolSticky' mangled-name='_ZN12wxAuiToolBar13SetToolStickyEib' filepath='src/aui/auibar.cpp' line='1325' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar13SetToolStickyEib@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='1602' column='1'/>
          <parameter type-id='type-id-12' name='state' filepath='src/aui/auibar.cpp' line='1602' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetToolDropDown' mangled-name='_ZNK12wxAuiToolBar15GetToolDropDownEi' filepath='src/aui/auibar.cpp' line='1316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar15GetToolDropDownEi@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='1828' column='1'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetToolDropDown' mangled-name='_ZN12wxAuiToolBar15SetToolDropDownEib' filepath='src/aui/auibar.cpp' line='1307' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar15SetToolDropDownEib@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='1602' column='1'/>
          <parameter type-id='type-id-12' name='state' filepath='src/aui/auibar.cpp' line='1602' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetToolSeparation' mangled-name='_ZNK12wxAuiToolBar17GetToolSeparationEv' filepath='src/aui/auibar.cpp' line='1298' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar17GetToolSeparationEv@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <return type-id='type-id-11'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetToolSeparation' mangled-name='_ZN12wxAuiToolBar17SetToolSeparationEi' filepath='src/aui/auibar.cpp' line='1292' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar17SetToolSeparationEi@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='orientation' filepath='src/aui/auibar.cpp' line='1392' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetToolProportion' mangled-name='_ZNK12wxAuiToolBar17GetToolProportionEi' filepath='src/aui/auibar.cpp' line='1283' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar17GetToolProportionEi@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='1774' column='1'/>
          <return type-id='type-id-11'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetToolProportion' mangled-name='_ZN12wxAuiToolBar17SetToolProportionEii' filepath='src/aui/auibar.cpp' line='1274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar17SetToolProportionEii@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='1274' column='1'/>
          <parameter type-id='type-id-11' name='proportion' filepath='src/aui/auibar.cpp' line='1274' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetToolBitmapSize' mangled-name='_ZNK12wxAuiToolBar17GetToolBitmapSizeEv' filepath='src/aui/auibar.cpp' line='1268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar17GetToolBitmapSizeEv@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetToolBitmapSize' mangled-name='_ZN12wxAuiToolBar17SetToolBitmapSizeERK6wxSize' filepath='src/aui/auibar.cpp' line='1263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar17SetToolBitmapSizeERK6wxSize@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-298'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='FindToolByIndex' mangled-name='_ZNK12wxAuiToolBar15FindToolByIndexEi' filepath='src/aui/auibar.cpp' line='1252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar15FindToolByIndexEi@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='idx' filepath='src/aui/auibar.cpp' line='1252' column='1'/>
          <return type-id='type-id-22'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes'>
        <function-decl name='FindToolByPositionWithPacking' mangled-name='_ZNK12wxAuiToolBar29FindToolByPositionWithPackingEii' filepath='src/aui/auibar.cpp' line='1223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar29FindToolByPositionWithPackingEii@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-299' name='x' filepath='src/aui/auibar.cpp' line='1223' column='1'/>
          <parameter type-id='type-id-299' name='y' filepath='src/aui/auibar.cpp' line='1223' column='1'/>
          <return type-id='type-id-22'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='FindToolByPosition' mangled-name='_ZNK12wxAuiToolBar18FindToolByPositionEii' filepath='src/aui/auibar.cpp' line='1199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar18FindToolByPositionEii@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-299' name='x' filepath='src/aui/auibar.cpp' line='1223' column='1'/>
          <parameter type-id='type-id-299' name='y' filepath='src/aui/auibar.cpp' line='1223' column='1'/>
          <return type-id='type-id-22'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='FindTool' mangled-name='_ZNK12wxAuiToolBar8FindToolEi' filepath='src/aui/auibar.cpp' line='1186' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar8FindToolEi@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='idx' filepath='src/aui/auibar.cpp' line='1252' column='1'/>
          <return type-id='type-id-22'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='FindControl' mangled-name='_ZN12wxAuiToolBar11FindControlEi' filepath='src/aui/auibar.cpp' line='1180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar11FindControlEi@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='id' filepath='src/aui/auibar.cpp' line='1180' column='1'/>
          <return type-id='type-id-300'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='DestroyToolByIndex' mangled-name='_ZN12wxAuiToolBar18DestroyToolByIndexEi' filepath='src/aui/auibar.cpp' line='1168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar18DestroyToolByIndexEi@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='idx' filepath='src/aui/auibar.cpp' line='1168' column='1'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='DestroyTool' mangled-name='_ZN12wxAuiToolBar11DestroyToolEi' filepath='src/aui/auibar.cpp' line='1163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar11DestroyToolEi@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='idx' filepath='src/aui/auibar.cpp' line='1168' column='1'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='DeleteByIndex' mangled-name='_ZN12wxAuiToolBar13DeleteByIndexEi' filepath='src/aui/auibar.cpp' line='1151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar13DeleteByIndexEi@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='idx' filepath='src/aui/auibar.cpp' line='1168' column='1'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='DeleteTool' mangled-name='_ZN12wxAuiToolBar10DeleteToolEi' filepath='src/aui/auibar.cpp' line='1146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar10DeleteToolEi@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='idx' filepath='src/aui/auibar.cpp' line='1168' column='1'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Clear' mangled-name='_ZN12wxAuiToolBar5ClearEv' filepath='src/aui/auibar.cpp' line='1140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar5ClearEv@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='AddStretchSpacer' mangled-name='_ZN12wxAuiToolBar16AddStretchSpacerEi' filepath='src/aui/auibar.cpp' line='1117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar16AddStretchSpacerEi@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='proportion' filepath='src/aui/auibar.cpp' line='1117' column='1'/>
          <return type-id='type-id-22'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='AddSpacer' mangled-name='_ZN12wxAuiToolBar9AddSpacerEi' filepath='src/aui/auibar.cpp' line='1094' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar9AddSpacerEi@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='proportion' filepath='src/aui/auibar.cpp' line='1117' column='1'/>
          <return type-id='type-id-22'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='AddSeparator' mangled-name='_ZN12wxAuiToolBar12AddSeparatorEv' filepath='src/aui/auibar.cpp' line='1072' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar12AddSeparatorEv@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <return type-id='type-id-22'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='AddLabel' mangled-name='_ZN12wxAuiToolBar8AddLabelEiRK8wxStringi' filepath='src/aui/auibar.cpp' line='1040' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar8AddLabelEiRK8wxStringi@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='1040' column='1'/>
          <parameter type-id='type-id-274' name='label' filepath='src/aui/auibar.cpp' line='1041' column='1'/>
          <parameter type-id='type-id-301' name='width' filepath='src/aui/auibar.cpp' line='1042' column='1'/>
          <return type-id='type-id-22'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='AddControl' mangled-name='_ZN12wxAuiToolBar10AddControlEP9wxControlRK8wxString' filepath='src/aui/auibar.cpp' line='1016' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar10AddControlEP9wxControlRK8wxString@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-300' name='control' filepath='src/aui/auibar.cpp' line='1016' column='1'/>
          <parameter type-id='type-id-274' name='label' filepath='src/aui/auibar.cpp' line='1017' column='1'/>
          <return type-id='type-id-22'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='AddTool' mangled-name='_ZN12wxAuiToolBar7AddToolEiRK8wxStringRK14wxBitmapBundleS5_10wxItemKindS2_S2_P8wxObject' filepath='src/aui/auibar.cpp' line='981' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar7AddToolEiRK8wxStringRK14wxBitmapBundleS5_10wxItemKindS2_S2_P8wxObject@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='981' column='1'/>
          <parameter type-id='type-id-274' name='label' filepath='src/aui/auibar.cpp' line='982' column='1'/>
          <parameter type-id='type-id-297' name='bitmap' filepath='src/aui/auibar.cpp' line='983' column='1'/>
          <parameter type-id='type-id-297' name='disabledBitmap' filepath='src/aui/auibar.cpp' line='984' column='1'/>
          <parameter type-id='type-id-39' name='kind' filepath='src/aui/auibar.cpp' line='985' column='1'/>
          <parameter type-id='type-id-274' name='shortHelpString' filepath='src/aui/auibar.cpp' line='986' column='1'/>
          <parameter type-id='type-id-274' name='longHelpString' filepath='src/aui/auibar.cpp' line='987' column='1'/>
          <parameter type-id='type-id-279'/>
          <return type-id='type-id-22'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='AddTool' mangled-name='_ZN12wxAuiToolBar7AddToolEiRK8wxStringRK14wxBitmapBundleS2_10wxItemKind' filepath='src/aui/auibar.cpp' line='964' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar7AddToolEiRK8wxStringRK14wxBitmapBundleS2_10wxItemKind@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-11' name='tool_id' filepath='src/aui/auibar.cpp' line='964' column='1'/>
          <parameter type-id='type-id-274' name='label' filepath='src/aui/auibar.cpp' line='965' column='1'/>
          <parameter type-id='type-id-297' name='bitmap' filepath='src/aui/auibar.cpp' line='966' column='1'/>
          <parameter type-id='type-id-274' name='shortHelp_string' filepath='src/aui/auibar.cpp' line='967' column='1'/>
          <parameter type-id='type-id-39' name='kind' filepath='src/aui/auibar.cpp' line='968' column='1'/>
          <return type-id='type-id-22'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes'>
        <function-decl name='GetArtProvider' mangled-name='_ZNK12wxAuiToolBar14GetArtProviderEv' filepath='src/aui/auibar.cpp' line='956' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar14GetArtProviderEv@@WXU_3.2'>
          <parameter type-id='type-id-142' name='this' is-artificial='yes'/>
          <return type-id='type-id-24'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='SetArtProvider' mangled-name='_ZN12wxAuiToolBar14SetArtProviderEP15wxAuiToolBarArt' filepath='src/aui/auibar.cpp' line='943' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar14SetArtProviderEP15wxAuiToolBarArt@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-24' name='art' filepath='src/aui/auibar.cpp' line='943' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public'>
        <function-decl name='Create' mangled-name='_ZN12wxAuiToolBar6CreateEP8wxWindowiRK7wxPointRK6wxSizel' filepath='src/aui/auibar.cpp' line='867' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar6CreateEP8wxWindowiRK7wxPointRK6wxSizel@@WXU_3.2'>
          <parameter type-id='type-id-224' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-6' name='parent' filepath='src/aui/auibar.cpp' line='867' column='1'/>
          <parameter type-id='type-id-302' name='id' filepath='src/aui/auibar.cpp' line='868' column='1'/>
          <parameter type-id='type-id-303' name='pos' filepath='src/aui/auibar.cpp' line='869' column='1'/>
          <parameter type-id='type-id-298' name='size' filepath='src/aui/auibar.cpp' line='870' column='1'/>
          <parameter type-id='type-id-13' name='style' filepath='src/aui/auibar.cpp' line='871' column='1'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='Init' mangled-name='_ZN12wxAuiToolBar4InitEv' filepath='src/aui/auibar.cpp' line='847' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar4InitEv@@WXU_3.2'>
          <parameter type-id='type-id-223' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAuiToolBar' mangled-name='_ZN12wxAuiToolBarD4Ev' filepath='src/aui/auibar.cpp' line='905' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-223' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAuiToolBar' mangled-name='_ZN12wxAuiToolBarD0Ev' filepath='src/aui/auibar.cpp' line='905' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBarD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-223' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAuiToolBar' mangled-name='_ZN12wxAuiToolBarD0Ev' filepath='src/aui/auibar.cpp' line='905' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBarD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-223' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAuiToolBar' mangled-name='_ZN12wxAuiToolBarD1Ev' filepath='src/aui/auibar.cpp' line='905' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBarD1Ev@@WXU_3.2'>
          <parameter type-id='type-id-223' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAuiToolBar' mangled-name='_ZN12wxAuiToolBarD2Ev' filepath='src/aui/auibar.cpp' line='905' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBarD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-223' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK12wxAuiToolBar12GetClassInfoEv' filepath='src/aui/auibar.cpp' line='50' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-141' is-artificial='yes'/>
          <return type-id='type-id-280'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='14'>
        <function-decl name='GetEventTable' mangled-name='_ZNK12wxAuiToolBar13GetEventTableEv' filepath='src/aui/auibar.cpp' line='825' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar13GetEventTableEv@@WXU_3.2'>
          <parameter type-id='type-id-141' is-artificial='yes'/>
          <return type-id='type-id-304'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='15'>
        <function-decl name='GetEventHashTable' mangled-name='_ZNK12wxAuiToolBar17GetEventHashTableEv' filepath='src/aui/auibar.cpp' line='825' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiToolBar17GetEventHashTableEv@@WXU_3.2'>
          <parameter type-id='type-id-141' is-artificial='yes'/>
          <return type-id='type-id-305'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='65'>
        <function-decl name='SetWindowStyleFlag' mangled-name='_ZN12wxAuiToolBar18SetWindowStyleFlagEl' filepath='src/aui/auibar.cpp' line='911' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar18SetWindowStyleFlagEl@@WXU_3.2'>
          <parameter type-id='type-id-223' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='111'>
        <function-decl name='SetFont' mangled-name='_ZN12wxAuiToolBar7SetFontERK6wxFont' filepath='src/aui/auibar.cpp' line='1448' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar7SetFontERK6wxFont@@WXU_3.2'>
          <parameter type-id='type-id-223' is-artificial='yes'/>
          <parameter type-id='type-id-26'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='115'>
        <function-decl name='UpdateWindowUI' mangled-name='_ZN12wxAuiToolBar14UpdateWindowUIEl' filepath='src/aui/auibar.cpp' line='2395' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiToolBar14UpdateWindowUIEl@@WXU_3.2'>
          <parameter type-id='type-id-223' is-artificial='yes'/>
          <parameter type-id='type-id-13'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='212'>
        <function-decl name='OnCustomRender' mangled-name='_ZN12wxAuiToolBar14OnCustomRenderER4wxDCRK16wxAuiToolBarItemRK6wxRect' filepath='include/wx/aui/auibar.h' line='624' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-223' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-30'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
    </class-decl>
    <var-decl name='wxEVT_AUITOOLBAR_TOOL_DROPDOWN' type-id='type-id-162' mangled-name='wxEVT_AUITOOLBAR_TOOL_DROPDOWN' visibility='default' filepath='include/wx/aui/auibar.h' line='713' column='1' elf-symbol-id='wxEVT_AUITOOLBAR_TOOL_DROPDOWN@@WXU_3.2'/>
    <var-decl name='wxEVT_AUITOOLBAR_OVERFLOW_CLICK' type-id='type-id-162' mangled-name='wxEVT_AUITOOLBAR_OVERFLOW_CLICK' visibility='default' filepath='include/wx/aui/auibar.h' line='714' column='1' elf-symbol-id='wxEVT_AUITOOLBAR_OVERFLOW_CLICK@@WXU_3.2'/>
    <var-decl name='wxEVT_AUITOOLBAR_RIGHT_CLICK' type-id='type-id-162' mangled-name='wxEVT_AUITOOLBAR_RIGHT_CLICK' visibility='default' filepath='include/wx/aui/auibar.h' line='715' column='1' elf-symbol-id='wxEVT_AUITOOLBAR_RIGHT_CLICK@@WXU_3.2'/>
    <var-decl name='wxEVT_AUITOOLBAR_MIDDLE_CLICK' type-id='type-id-162' mangled-name='wxEVT_AUITOOLBAR_MIDDLE_CLICK' visibility='default' filepath='include/wx/aui/auibar.h' line='716' column='1' elf-symbol-id='wxEVT_AUITOOLBAR_MIDDLE_CLICK@@WXU_3.2'/>
    <var-decl name='wxEVT_AUITOOLBAR_BEGIN_DRAG' type-id='type-id-162' mangled-name='wxEVT_AUITOOLBAR_BEGIN_DRAG' visibility='default' filepath='include/wx/aui/auibar.h' line='717' column='1' elf-symbol-id='wxEVT_AUITOOLBAR_BEGIN_DRAG@@WXU_3.2'/>
    <namespace-decl name='wxPrivate'>
      <class-decl name='wxVectorMemOpsMovable&lt;wxAuiToolBarItem*&gt;' size-in-bits='8' is-struct='yes' visibility='default' filepath='include/wx/vector.h' line='75' column='1' id='type-id-306'/>
    </namespace-decl>
    <function-type size-in-bits='64' id='type-id-218'>
      <parameter type-id='type-id-182'/>
      <parameter type-id='type-id-182'/>
      <return type-id='type-id-11'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-219'>
      <parameter type-id='type-id-232'/>
      <parameter type-id='type-id-232'/>
      <return type-id='type-id-11'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-220'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-11'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-221'>
      <parameter type-id='type-id-232'/>
      <parameter type-id='type-id-232'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-20'/>
    </function-type>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-3'/>
  </abi-instr>
  <abi-instr address-size='64' path='src/aui/auibook.cpp' language='LANG_C_plus_plus_14'>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='4864' id='type-id-307'>
      <subrange length='19' type-id='type-id-3' id='type-id-308'/>
    </array-type-def>
    <class-decl name='wxAuiNotebookPage' size-in-bits='1088' visibility='default' filepath='include/wx/aui/auibook.h' line='88' column='1' id='type-id-309'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='window' type-id='type-id-6' visibility='default' filepath='include/wx/aui/auibook.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='caption' type-id='type-id-7' visibility='default' filepath='include/wx/aui/auibook.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tooltip' type-id='type-id-7' visibility='default' filepath='include/wx/aui/auibook.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='bitmap' type-id='type-id-8' visibility='default' filepath='include/wx/aui/auibook.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='rect' type-id='type-id-277' visibility='default' filepath='include/wx/aui/auibook.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='active' type-id='type-id-12' visibility='default' filepath='include/wx/aui/auibook.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1032'>
        <var-decl name='hover' type-id='type-id-12' visibility='default' filepath='include/wx/aui/auibook.h' line='97' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxAuiTabContainerButton' size-in-bits='384' visibility='default' filepath='include/wx/aui/auibook.h' line='100' column='1' id='type-id-310'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibook.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='curState' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibook.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='location' type-id='type-id-11' visibility='default' filepath='include/wx/aui/auibook.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bitmap' type-id='type-id-8' visibility='default' filepath='include/wx/aui/auibook.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='disBitmap' type-id='type-id-8' visibility='default' filepath='include/wx/aui/auibook.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='rect' type-id='type-id-277' visibility='default' filepath='include/wx/aui/auibook.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxAuiNotebookPageArray' size-in-bits='192' visibility='default' filepath='include/wx/aui/auibook.h' line='114' column='1' id='type-id-311'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-312'/>
    </class-decl>
    <class-decl name='wxObjectArrayTraitsForwxAuiNotebookPageArray' size-in-bits='8' visibility='default' filepath='include/wx/aui/auibook.h' line='114' column='1' id='type-id-313'>
      <member-function access='public' static='yes'>
        <function-decl name='Free' mangled-name='_ZN44wxObjectArrayTraitsForwxAuiNotebookPageArray4FreeEP17wxAuiNotebookPage' filepath='src/aui/auibook.cpp' line='38' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN44wxObjectArrayTraitsForwxAuiNotebookPageArray4FreeEP17wxAuiNotebookPage@@WXU_3.2'>
          <parameter type-id='type-id-314' name='p' filepath='src/aui/auibook.cpp' line='38' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='Clone' mangled-name='_ZN44wxObjectArrayTraitsForwxAuiNotebookPageArray5CloneERK17wxAuiNotebookPage' filepath='src/aui/auibook.cpp' line='38' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN44wxObjectArrayTraitsForwxAuiNotebookPageArray5CloneERK17wxAuiNotebookPage@@WXU_3.2'>
          <parameter type-id='type-id-315' name='item' filepath='src/aui/auibook.cpp' line='38' column='1'/>
          <return type-id='type-id-316'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxAuiTabContainerButtonArray' size-in-bits='192' visibility='default' filepath='include/wx/aui/auibook.h' line='115' column='1' id='type-id-317'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-318'/>
    </class-decl>
    <class-decl name='wxObjectArrayTraitsForwxAuiTabContainerButtonArray' size-in-bits='8' visibility='default' filepath='include/wx/aui/auibook.h' line='115' column='1' id='type-id-319'>
      <member-function access='public' static='yes'>
        <function-decl name='Free' mangled-name='_ZN50wxObjectArrayTraitsForwxAuiTabContainerButtonArray4FreeEP23wxAuiTabContainerButton' filepath='src/aui/auibook.cpp' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN50wxObjectArrayTraitsForwxAuiTabContainerButtonArray4FreeEP23wxAuiTabContainerButton@@WXU_3.2'>
          <parameter type-id='type-id-320' name='p' filepath='src/aui/auibook.cpp' line='39' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' static='yes'>
        <function-decl name='Clone' mangled-name='_ZN50wxObjectArrayTraitsForwxAuiTabContainerButtonArray5CloneERK23wxAuiTabContainerButton' filepath='src/aui/auibook.cpp' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN50wxObjectArrayTraitsForwxAuiTabContainerButtonArray5CloneERK23wxAuiTabContainerButton@@WXU_3.2'>
          <parameter type-id='type-id-321' name='item' filepath='src/aui/auibook.cpp' line='39' column='1'/>
          <return type-id='type-id-322'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxAuiTabCtrl' size-in-bits='6976' visibility='default' filepath='include/wx/aui/auibook.h' line='188' column='1' id='type-id-323'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-282'/>
      <base-class access='public' layout-offset-in-bits='5696' type-id='type-id-324'/>
      <data-member access='protected' layout-offset-in-bits='6624'>
        <var-decl name='m_clickPt' type-id='type-id-276' visibility='default' filepath='include/wx/aui/auibook.h' line='230' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6720'>
        <var-decl name='m_clickTab' type-id='type-id-6' visibility='default' filepath='include/wx/aui/auibook.h' line='231' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6784'>
        <var-decl name='m_isDragging' type-id='type-id-12' visibility='default' filepath='include/wx/aui/auibook.h' line='232' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6848'>
        <var-decl name='m_hoverButton' type-id='type-id-322' visibility='default' filepath='include/wx/aui/auibook.h' line='233' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='6912'>
        <var-decl name='m_pressedButton' type-id='type-id-322' visibility='default' filepath='include/wx/aui/auibook.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' static='yes'>
        <var-decl name='ms_classInfo' type-id='type-id-278' mangled-name='_ZN12wxAuiTabCtrl12ms_classInfoE' visibility='default' filepath='src/aui/auibook.cpp' line='59' column='1' elf-symbol-id='_ZN12wxAuiTabCtrl12ms_classInfoE@@WXU_3.2'/>
      </data-member>
      <data-member access='private' static='yes'>
        <var-decl name='sm_eventTableEntries' type-id='type-id-307' mangled-name='_ZN12wxAuiTabCtrl20sm_eventTableEntriesE' visibility='default' filepath='src/aui/auibook.cpp' line='987' column='1' elf-symbol-id='_ZN12wxAuiTabCtrl20sm_eventTableEntriesE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' static='yes'>
        <var-decl name='sm_eventTable' type-id='type-id-285' mangled-name='_ZN12wxAuiTabCtrl13sm_eventTableE' visibility='default' filepath='src/aui/auibook.cpp' line='987' column='1' elf-symbol-id='_ZN12wxAuiTabCtrl13sm_eventTableE@@WXU_3.2'/>
      </data-member>
      <data-member access='protected' static='yes'>
        <var-decl name='sm_eventHashTable' type-id='type-id-286' mangled-name='_ZN12wxAuiTabCtrl17sm_eventHashTableE' visibility='default' filepath='src/aui/auibook.cpp' line='987' column='1' elf-symbol-id='_ZN12wxAuiTabCtrl17sm_eventHashTableE@@WXU_3.2'/>
      </data-member>
      <member-function access='protected'>
        <function-decl name='SetHoverTab' mangled-name='_ZN12wxAuiTabCtrl11SetHoverTabEP8wxWindow' filepath='src/aui/auibook.cpp' line='3678' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiTabCtrl11SetHoverTabEP8wxWindow@@WXU_3.2'>
          <parameter type-id='type-id-325' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-6' name='wnd' filepath='src/aui/auibook.cpp' line='3678' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnChar' mangled-name='_ZN12wxAuiTabCtrl6OnCharER10wxKeyEvent' filepath='src/aui/auibook.cpp' line='1378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiTabCtrl6OnCharER10wxKeyEvent@@WXU_3.2'>
          <parameter type-id='type-id-325' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-326' name='event' filepath='src/aui/auibook.cpp' line='1378' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnKillFocus' mangled-name='_ZN12wxAuiTabCtrl11OnKillFocusER12wxFocusEvent' filepath='src/aui/auibook.cpp' line='1373' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiTabCtrl11OnKillFocusER12wxFocusEvent@@WXU_3.2'>
          <parameter type-id='type-id-325' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-327'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnSetFocus' mangled-name='_ZN12wxAuiTabCtrl10OnSetFocusER12wxFocusEvent' filepath='src/aui/auibook.cpp' line='1368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiTabCtrl10OnSetFocusER12wxFocusEvent@@WXU_3.2'>
          <parameter type-id='type-id-325' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-327'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnButton' mangled-name='_ZN12wxAuiTabCtrl8OnButtonER18wxAuiNotebookEvent' filepath='src/aui/auibook.cpp' line='1327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiTabCtrl8OnButtonER18wxAuiNotebookEvent@@WXU_3.2'>
          <parameter type-id='type-id-325' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-328' name='event' filepath='src/aui/auibook.cpp' line='1327' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnLeaveWindow' mangled-name='_ZN12wxAuiTabCtrl13OnLeaveWindowER12wxMouseEvent' filepath='src/aui/auibook.cpp' line='1314' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiTabCtrl13OnLeaveWindowER12wxMouseEvent@@WXU_3.2'>
          <parameter type-id='type-id-325' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-289'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnMotion' mangled-name='_ZN12wxAuiTabCtrl8OnMotionER12wxMouseEvent' filepath='src/aui/auibook.cpp' line='1224' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiTabCtrl8OnMotionER12wxMouseEvent@@WXU_3.2'>
          <parameter type-id='type-id-325' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-289'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnLeftDClick' mangled-name='_ZN12wxAuiTabCtrl12OnLeftDClickER12wxMouseEvent' filepath='src/aui/auibook.cpp' line='1212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiTabCtrl12OnLeftDClickER12wxMouseEvent@@WXU_3.2'>
          <parameter type-id='type-id-325' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-289'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnRightDown' mangled-name='_ZN12wxAuiTabCtrl11OnRightDownER12wxMouseEvent' filepath='src/aui/auibook.cpp' line='1200' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiTabCtrl11OnRightDownER12wxMouseEvent@@WXU_3.2'>
          <parameter type-id='type-id-325' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-289'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnRightUp' mangled-name='_ZN12wxAuiTabCtrl9OnRightUpER12wxMouseEvent' filepath='src/aui/auibook.cpp' line='1188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiTabCtrl9OnRightUpER12wxMouseEvent@@WXU_3.2'>
          <parameter type-id='type-id-325' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-289'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnMiddleDown' mangled-name='_ZN12wxAuiTabCtrl12OnMiddleDownER12wxMouseEvent' filepath='src/aui/auibook.cpp' line='1176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiTabCtrl12OnMiddleDownER12wxMouseEvent@@WXU_3.2'>
          <parameter type-id='type-id-325' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-289'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnMiddleUp' mangled-name='_ZN12wxAuiTabCtrl10OnMiddleUpER12wxMouseEvent' filepath='src/aui/auibook.cpp' line='1164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiTabCtrl10OnMiddleUpER12wxMouseEvent@@WXU_3.2'>
          <parameter type-id='type-id-325' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-289'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnLeftUp' mangled-name='_ZN12wxAuiTabCtrl8OnLeftUpER12wxMouseEvent' filepath='src/aui/auibook.cpp' line='1112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiTabCtrl8OnLeftUpER12wxMouseEvent@@WXU_3.2'>
          <parameter type-id='type-id-325' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-289'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnCaptureLost' mangled-name='_ZN12wxAuiTabCtrl13OnCaptureLostER23wxMouseCaptureLostEvent' filepath='src/aui/auibook.cpp' line='1098' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiTabCtrl13OnCaptureLostER23wxMouseCaptureLostEvent@@WXU_3.2'>
          <parameter type-id='type-id-325' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-288'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnLeftDown' mangled-name='_ZN12wxAuiTabCtrl10OnLeftDownER12wxMouseEvent' filepath='src/aui/auibook.cpp' line='1057' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiTabCtrl10OnLeftDownER12wxMouseEvent@@WXU_3.2'>
          <parameter type-id='type-id-325' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-289'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnSize' mangled-name='_ZN12wxAuiTabCtrl6OnSizeER11wxSizeEvent' filepath='src/aui/auibook.cpp' line='1050' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiTabCtrl6OnSizeER11wxSizeEvent@@WXU_3.2'>
          <parameter type-id='type-id-325' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-295' name='evt' filepath='src/aui/auibook.cpp' line='1050' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnEraseBackground' mangled-name='_ZN12wxAuiTabCtrl17OnEraseBackgroundER12wxEraseEvent' filepath='src/aui/auibook.cpp' line='1046' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiTabCtrl17OnEraseBackgroundER12wxEraseEvent@@WXU_3.2'>
          <parameter type-id='type-id-325' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-290'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnSysColourChanged' mangled-name='_ZN12wxAuiTabCtrl18OnSysColourChangedER23wxSysColourChangedEvent' filepath='src/aui/auibook.cpp' line='1036' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiTabCtrl18OnSysColourChangedER23wxSysColourChangedEvent@@WXU_3.2'>
          <parameter type-id='type-id-325' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-292' name='event' filepath='src/aui/auibook.cpp' line='1036' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected'>
        <function-decl name='OnPaint' mangled-name='_ZN12wxAuiTabCtrl7OnPaintER12wxPaintEvent' filepath='src/aui/auibook.cpp' line='1026' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiTabCtrl7OnPaintER12wxPaintEvent@@WXU_3.2'>
          <parameter type-id='type-id-325' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-291'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' constructor='yes'>
        <function-decl name='wxAuiTabCtrl' mangled-name='_ZN12wxAuiTabCtrlC2EP8wxWindowiRK7wxPointRK6wxSizel' filepath='src/aui/auibook.cpp' line='1009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiTabCtrlC2EP8wxWindowiRK7wxPointRK6wxSizel@@WXU_3.2'>
          <parameter type-id='type-id-325' name='this' is-artificial='yes'/>
          <parameter type-id='type-id-6' name='parent' filepath='src/aui/auibook.cpp' line='1009' column='1'/>
          <parameter type-id='type-id-302' name='id' filepath='src/aui/auibook.cpp' line='1010' column='1'/>
          <parameter type-id='type-id-303' name='pos' filepath='src/aui/auibook.cpp' line='1011' column='1'/>
          <parameter type-id='type-id-298' name='size' filepath='src/aui/auibook.cpp' line='1012' column='1'/>
          <parameter type-id='type-id-13' name='style' filepath='src/aui/auibook.cpp' line='1013' column='1'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAuiTabCtrl' mangled-name='_ZN12wxAuiTabCtrlD4Ev' filepath='src/aui/auibook.cpp' line='1022' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-329' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAuiTabCtrl' mangled-name='_ZN12wxAuiTabCtrlD0Ev' filepath='src/aui/auibook.cpp' line='1022' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiTabCtrlD0Ev@@WXU_3.2'>
          <parameter type-id='type-id-329' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAuiTabCtrl' mangled-name='_ZN12wxAuiTabCtrlD2Ev' filepath='src/aui/auibook.cpp' line='1022' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZN12wxAuiTabCtrlD2Ev@@WXU_3.2'>
          <parameter type-id='type-id-329' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK12wxAuiTabCtrl12GetClassInfoEv' filepath='src/aui/auibook.cpp' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiTabCtrl12GetClassInfoEv@@WXU_3.2'>
          <parameter type-id='type-id-330' is-artificial='yes'/>
          <return type-id='type-id-280'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='14'>
        <function-decl name='GetEventTable' mangled-name='_ZNK12wxAuiTabCtrl13GetEventTableEv' filepath='src/aui/auibook.cpp' line='987' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiTabCtrl13GetEventTableEv@@WXU_3.2'>
          <parameter type-id='type-id-330' is-artificial='yes'/>
          <return type-id='type-id-304'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='15'>
        <function-decl name='GetEventHashTable' mangled-name='_ZNK12wxAuiTabCtrl17GetEventHashTableEv' filepath='src/aui/auibook.cpp' line='987' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_ZNK12wxAuiTabCtrl17GetEventHashTableEv@@WXU_3.2'>
          <parameter type-id='type-id-330' is-artificial='yes'/>
          <return type-id='type-id-305'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='161'>
        <function-decl name='GetDefaultBorder' mangled-name='_ZNK12wxAuiTabCtrl16GetDefaultBorderEv' filepath='include/wx/aui/auibook.h' line='207' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-330' is-artificial='yes'/>
          <return type-id='type-id-331'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxAuiTabArt' size-in-bits='64' visibility='default' filepath='include/wx/aui/tabart.h' line='39' column='1' id='type-id-332'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAuiTabArt' mangled-name='_ZN11wxAuiTabArtD0Ev' filepath='include/wx/aui/tabart.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAuiTabArt' mangled-name='_ZN11wxAuiTabArtD2Ev' filepath='include/wx/aui/tabart.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxAuiTabArt' mangled-name='_ZN11wxAuiTabArtD4Ev' filepath='include/wx/aui/tabart.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='Clone' mangled-name='_ZN11wxAuiTabArt5CloneEv' filepath='include/wx/aui/tabart.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <return type-id='type-id-333'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='3'>
        <function-decl name='SetFlags' mangled-name='_ZN11wxAuiTabArt8SetFlagsEj' filepath='include/wx/aui/tabart.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <parameter type-id='type-id-25'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='4'>
        <function-decl name='SetSizingInfo' mangled-name='_ZN11wxAuiTabArt13SetSizingInfoERK6wxSizemP8wxWindow' filepath='include/wx/aui/tabart.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <parameter type-id='type-id-298'/>
          <parameter type-id='type-id-107'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='5'>
        <function-decl name='SetNormalFont' mangled-name='_ZN11wxAuiTabArt13SetNormalFontERK6wxFont' filepath='include/wx/aui/tabart.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <parameter type-id='type-id-26'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='6'>
        <function-decl name='SetSelectedFont' mangled-name='_ZN11wxAuiTabArt15SetSelectedFontERK6wxFont' filepath='include/wx/aui/tabart.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <parameter type-id='type-id-26'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='7'>
        <function-decl name='SetMeasuringFont' mangled-name='_ZN11wxAuiTabArt16SetMeasuringFontERK6wxFont' filepath='include/wx/aui/tabart.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <parameter type-id='type-id-26'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='8'>
        <function-decl name='SetColour' mangled-name='_ZN11wxAuiTabArt9SetColourERK8wxColour' filepath='include/wx/aui/tabart.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <parameter type-id='type-id-334'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='9'>
        <function-decl name='SetActiveColour' mangled-name='_ZN11wxAuiTabArt15SetActiveColourERK8wxColour' filepath='include/wx/aui/tabart.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <parameter type-id='type-id-334'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='10'>
        <function-decl name='DrawBorder' mangled-name='_ZN11wxAuiTabArt10DrawBorderER4wxDCP8wxWindowRK6wxRect' filepath='include/wx/aui/tabart.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='11'>
        <function-decl name='DrawBackground' mangled-name='_ZN11wxAuiTabArt14DrawBackgroundER4wxDCP8wxWindowRK6wxRect' filepath='include/wx/aui/tabart.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-29'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='12'>
        <function-decl name='DrawTab' mangled-name='_ZN11wxAuiTabArt7DrawTabER4wxDCP8wxWindowRK17wxAuiNotebookPageRK6wxRectiPS7_SA_Pi' filepath='include/wx/aui/tabart.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-335'/>
          <parameter type-id='type-id-29'/>
          <parameter type-id='type-id-11'/>
          <parameter type-id='type-id-336'/>
          <parameter type-id='type-id-336'/>
          <parameter type-id='type-id-337'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='13'>
        <function-decl name='DrawButton' mangled-name='_ZN11wxAuiTabArt10DrawButtonER4wxDCP8wxWindowRK6wxRectiiiPS4_' filepath='include/wx/aui/tabart.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-29'/>
          <parameter type-id='type-id-11'/>
          <parameter type-id='type-id-11'/>
          <parameter type-id='type-id-11'/>
          <parameter type-id='type-id-336'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='14'>
        <function-decl name='GetTabSize' mangled-name='_ZN11wxAuiTabArt10GetTabSizeER4wxDCP8wxWindowRK8wxStringRK14wxBitmapBundlebiPi' filepath='include/wx/aui/tabart.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <parameter type-id='type-id-28'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-274'/>
          <parameter type-id='type-id-297'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-11'/>
          <parameter type-id='type-id-337'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='15'>
        <function-decl name='ShowDropDown' mangled-name='_ZN11wxAuiTabArt12ShowDropDownEP8wxWindowRK22wxAuiNotebookPageArrayi' filepath='include/wx/aui/tabart.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-338'/>
          <parameter type-id='type-id-11'/>
          <return type-id='type-id-11'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='16'>
        <function-decl name='GetIndentSize' mangled-name='_ZN11wxAuiTabArt13GetIndentSizeEv' filepath='include/wx/aui/tabart.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <return type-id='type-id-11'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='17'>
        <function-decl name='GetBorderWidth' mangled-name='_ZN11wxAuiTabArt14GetBorderWidthEP8wxWindow' filepath='include/wx/aui/tabart.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-11'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='18'>
        <function-decl name='GetAdditionalBorderSpace' mangled-name='_ZN11wxAuiTabArt24GetAdditionalBorderSpaceEP8wxWindow' filepath='include/wx/aui/tabart.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <return type-id='type-id-11'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='19'>
        <function-decl name='GetBestTabCtrlSize' mangled-name='_ZN11wxAuiTabArt18GetBestTabCtrlSizeEP8wxWindowRK22wxAuiNotebookPageArrayRK6wxSize' filepath='include/wx/aui/tabart.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-338'/>
          <parameter type-id='type-id-298'/>
          <return type-id='type-id-11'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='20'>
        <function-decl name='UpdateColoursFromSystem' mangled-name='_ZN11wxAuiTabArt23UpdateColoursFromSystemEv' filepath='include/wx/aui/tabart.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-333' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxNavigationEnabled&lt;wxBookCtrlBase&gt;' size-in-bits='6848' visibility='default' filepath='include/wx/containr.h' line='189' column='1' id='type-id-339'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-340'/>
      <data-member access='protected' layout-offset-in-bits='6592'>
        <var-decl name='m_container' type-id='type-id-341' visibility='default' filepath='include/wx/containr.h' line='293' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='71'>
        <function-decl name='SetFocus' mangled-name='_ZN19wxNavigationEnabledI14wxBookCtrlBaseE8SetFocusEv' filepath='include/wx/containr.h' line='250' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-342' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='74'>
        <function-decl name='AcceptsFocus' mangled-name='_ZNK19wxNavigationEnabledI14wxBookCtrlBaseE12AcceptsFocusEv' filepath='include/wx/containr.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-343' is-artificial='yes'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='75'>
        <function-decl name='AcceptsFocusRecursively' mangled-name='_ZNK19wxNavigationEnabledI14wxBookCtrlBaseE23AcceptsFocusRecursivelyEv' filepath='include/wx/containr.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-343' is-artificial='yes'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='76'>
        <function-decl name='AcceptsFocusFromKeyboard' mangled-name='_ZNK19wxNavigationEnabledI14wxBookCtrlBaseE24AcceptsFocusFromKeyboardEv' filepath='include/wx/containr.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-343' is-artificial='yes'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='82'>
        <function-decl name='AddChild' mangled-name='_ZN19wxNavigationEnabledI14wxBookCtrlBaseE8AddChildEP12wxWindowBase' filepath='include/wx/containr.h' line='224' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-342' is-artificial='yes'/>
          <parameter type-id='type-id-344'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='83'>
        <function-decl name='RemoveChild' mangled-name='_ZN19wxNavigationEnabledI14wxBookCtrlBaseE11RemoveChildEP12wxWindowBase' filepath='include/wx/containr.h' line='237' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-342' is-artificial='yes'/>
          <parameter type-id='type-id-344'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxArray_SortFunction&lt;wxAuiNotebookPage*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-345'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-347' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-346'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-346' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxArray_SortFunction&lt;wxAuiTabContainerButton*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='53' column='1' id='type-id-348'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-350' filepath='include/wx/dynarray.h' line='56' column='1' id='type-id-349'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-349' visibility='default' filepath='include/wx/dynarray.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;wxAuiNotebookPage*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-351'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-353' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-352'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-352' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxSortedArray_SortFunction&lt;wxAuiTabContainerButton*&gt;' size-in-bits='64' visibility='default' filepath='include/wx/dynarray.h' line='66' column='1' id='type-id-354'>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-356' filepath='include/wx/dynarray.h' line='69' column='1' id='type-id-355'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_f' type-id='type-id-355' visibility='default' filepath='include/wx/dynarray.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxBaseArray&lt;wxAuiNotebookPage*, wxSortedArray_SortFunction&lt;wxAuiNotebookPage*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-357'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-358'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-352' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-359'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-346' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-360'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-362' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-361'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseArray&lt;wxAuiTabContainerButton*, wxSortedArray_SortFunction&lt;wxAuiTabContainerButton*&gt; &gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='79' column='1' id='type-id-363'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-364'/>
      <member-type access='public'>
        <typedef-decl name='SCMPFUNC' type-id='type-id-355' filepath='include/wx/dynarray.h' line='82' column='1' id='type-id-365'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-349' filepath='include/wx/dynarray.h' line='83' column='1' id='type-id-366'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-368' filepath='include/wx/dynarray.h' line='89' column='1' id='type-id-367'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseObjectArray&lt;wxAuiNotebookPage, wxObjectArrayTraitsForwxAuiNotebookPageArray&gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='276' column='1' id='type-id-312'>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-357'/>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-309' filepath='include/wx/dynarray.h' line='281' column='1' id='type-id-369'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-347' filepath='include/wx/dynarray.h' line='283' column='1' id='type-id-370'/>
      </member-type>
    </class-decl>
    <class-decl name='wxBaseObjectArray&lt;wxAuiTabContainerButton, wxObjectArrayTraitsForwxAuiTabContainerButtonArray&gt;' size-in-bits='192' visibility='default' filepath='include/wx/dynarray.h' line='276' column='1' id='type-id-318'>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-363'/>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-310' filepath='include/wx/dynarray.h' line='281' column='1' id='type-id-371'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='CMPFUNC' type-id='type-id-350' filepath='include/wx/dynarray.h' line='283' column='1' id='type-id-372'/>
      </member-type>
    </class-decl>
    <class-decl name='wxEventTypeTag&lt;wxAuiNotebookEvent&gt;' size-in-bits='32' visibility='default' filepath='include/wx/event.h' line='202' column='1' id='type-id-373'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_type' type-id='type-id-56' visibility='default' filepath='include/wx/event.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTypeTag&lt;wxFocusEvent&gt;' size-in-bits='32' visibility='default' filepath='include/wx/event.h' line='202' column='1' id='type-id-374'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_type' type-id='type-id-56' visibility='default' filepath='include/wx/event.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTypeTag&lt;wxKeyEvent&gt;' size-in-bits='32' visibility='default' filepath='include/wx/event.h' line='202' column='1' id='type-id-375'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_type' type-id='type-id-56' visibility='default' filepath='include/wx/event.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventTypeTag&lt;wxNavigationKeyEvent&gt;' size-in-bits='32' visibility='default' filepath='include/wx/event.h' line='202' column='1' id='type-id-376'>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_type' type-id='type-id-56' visibility='default' filepath='include/wx/event.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxEventFunctorMethod&lt;wxEventTypeTag&lt;wxAuiNotebookEvent&gt;, wxEvtHandler, wxEvent, wxEvtHandler&gt;' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='392' column='1' id='type-id-377'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-59'/>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-60'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-61' visibility='default' filepath='include/wx/event.h' line='461' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxEventFunctorMethodI14wxEventTypeTagI18wxAuiNotebookEventE12wxEvtHandler7wxEventS3_EclEPS3_RS4_' filepath='include/wx/event.h' line='422' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-378' is-artificial='yes'/>
          <parameter type-id='type-id-61'/>
          <parameter type-id='type-id-63'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI18wxAuiNotebookEventE12wxEvtHandler7wxEventS3_E10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='439' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-379' is-artificial='yes'/>
          <parameter type-id='type-id-65'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI18wxAuiNotebookEventE12wxEvtHandler7wxEventS3_E13GetEvtHandlerEv' filepath='include/wx/event.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-379' is-artificial='yes'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI18wxAuiNotebookEventE12wxEvtHandler7wxEventS3_E12GetEvtMethodEv' filepath='include/wx/event.h' line='457' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-379' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEventFunctorMethod&lt;wxEventTypeTag&lt;wxFocusEvent&gt;, wxEvtHandler, wxEvent, wxEvtHandler&gt;' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='392' column='1' id='type-id-380'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-59'/>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-60'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-61' visibility='default' filepath='include/wx/event.h' line='461' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxEventFunctorMethodI14wxEventTypeTagI12wxFocusEventE12wxEvtHandler7wxEventS3_EclEPS3_RS4_' filepath='include/wx/event.h' line='422' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-381' is-artificial='yes'/>
          <parameter type-id='type-id-61'/>
          <parameter type-id='type-id-63'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI12wxFocusEventE12wxEvtHandler7wxEventS3_E10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='439' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-382' is-artificial='yes'/>
          <parameter type-id='type-id-65'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI12wxFocusEventE12wxEvtHandler7wxEventS3_E13GetEvtHandlerEv' filepath='include/wx/event.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-382' is-artificial='yes'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI12wxFocusEventE12wxEvtHandler7wxEventS3_E12GetEvtMethodEv' filepath='include/wx/event.h' line='457' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-382' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEventFunctorMethod&lt;wxEventTypeTag&lt;wxKeyEvent&gt;, wxEvtHandler, wxEvent, wxEvtHandler&gt;' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='392' column='1' id='type-id-383'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-59'/>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-60'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-61' visibility='default' filepath='include/wx/event.h' line='461' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxEventFunctorMethodI14wxEventTypeTagI10wxKeyEventE12wxEvtHandler7wxEventS3_EclEPS3_RS4_' filepath='include/wx/event.h' line='422' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-384' is-artificial='yes'/>
          <parameter type-id='type-id-61'/>
          <parameter type-id='type-id-63'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI10wxKeyEventE12wxEvtHandler7wxEventS3_E10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='439' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-385' is-artificial='yes'/>
          <parameter type-id='type-id-65'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI10wxKeyEventE12wxEvtHandler7wxEventS3_E13GetEvtHandlerEv' filepath='include/wx/event.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-385' is-artificial='yes'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI10wxKeyEventE12wxEvtHandler7wxEventS3_E12GetEvtMethodEv' filepath='include/wx/event.h' line='457' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-385' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEventFunctorMethod&lt;wxEventTypeTag&lt;wxNavigationKeyEvent&gt;, wxEvtHandler, wxEvent, wxEvtHandler&gt;' size-in-bits='256' visibility='default' filepath='include/wx/event.h' line='392' column='1' id='type-id-386'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-59'/>
      <base-class access='private' layout-offset-in-bits='0' type-id='type-id-60'/>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_handler' type-id='type-id-61' visibility='default' filepath='include/wx/event.h' line='461' column='1'/>
      </data-member>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='operator()' mangled-name='_ZN20wxEventFunctorMethodI14wxEventTypeTagI20wxNavigationKeyEventE12wxEvtHandler7wxEventS3_EclEPS3_RS4_' filepath='include/wx/event.h' line='422' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-387' is-artificial='yes'/>
          <parameter type-id='type-id-61'/>
          <parameter type-id='type-id-63'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='3'>
        <function-decl name='IsMatching' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI20wxNavigationKeyEventE12wxEvtHandler7wxEventS3_E10IsMatchingERK14wxEventFunctor' filepath='include/wx/event.h' line='439' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-388' is-artificial='yes'/>
          <parameter type-id='type-id-65'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='4'>
        <function-decl name='GetEvtHandler' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI20wxNavigationKeyEventE12wxEvtHandler7wxEventS3_E13GetEvtHandlerEv' filepath='include/wx/event.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-388' is-artificial='yes'/>
          <return type-id='type-id-61'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='GetEvtMethod' mangled-name='_ZNK20wxEventFunctorMethodI14wxEventTypeTagI20wxNavigationKeyEventE12wxEvtHandler7wxEventS3_E12GetEvtMethodEv' filepath='include/wx/event.h' line='457' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-388' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxEventBasicPayloadMixin' size-in-bits='512' visibility='default' filepath='include/wx/event.h' line='1254' column='1' id='type-id-389'>
      <data-member access='protected' layout-offset-in-bits='0'>
        <var-decl name='m_cmdString' type-id='type-id-7' visibility='default' filepath='include/wx/event.h' line='1275' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='384'>
        <var-decl name='m_commandInt' type-id='type-id-11' visibility='default' filepath='include/wx/event.h' line='1276' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='448'>
        <var-decl name='m_extraLong' type-id='type-id-13' visibility='default' filepath='include/wx/event.h' line='1277' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxScopeGuardImpl3&lt;void (*)(wxAuiNotebookPage**, wxAuiNotebookPage**, long unsigned int), wxAuiNotebookPage**, wxAuiNotebookPage**, long unsigned int&gt;' size-in-bits='320' visibility='default' filepath='include/wx/scopeguard.h' line='196' column='1' id='type-id-390'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-118'/>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_fun' type-id='type-id-391' visibility='default' filepath='include/wx/scopeguard.h' line='212' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_p1' type-id='type-id-392' visibility='default' filepath='include/wx/scopeguard.h' line='213' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_p2' type-id='type-id-392' visibility='default' filepath='include/wx/scopeguard.h' line='214' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='256'>
        <var-decl name='m_p3' type-id='type-id-121' visibility='default' filepath='include/wx/scopeguard.h' line='215' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxScopeGuardImpl3&lt;void (*)(wxAuiTabContainerButton**, wxAuiTabContainerButton**, long unsigned int), wxAuiTabContainerButton**, wxAuiTabContainerButton**, long unsigned int&gt;' size-in-bits='320' visibility='default' filepath='include/wx/scopeguard.h' line='196' column='1' id='type-id-393'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-118'/>
      <data-member access='protected' layout-offset-in-bits='64'>
        <var-decl name='m_fun' type-id='type-id-394' visibility='default' filepath='include/wx/scopeguard.h' line='212' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='128'>
        <var-decl name='m_p1' type-id='type-id-395' visibility='default' filepath='include/wx/scopeguard.h' line='213' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='192'>
        <var-decl name='m_p2' type-id='type-id-395' visibility='default' filepath='include/wx/scopeguard.h' line='214' column='1'/>
      </data-member>
      <data-member access='protected' layout-offset-in-bits='256'>
        <var-decl name='m_p3' type-id='type-id-121' visibility='default' filepath='include/wx/scopeguard.h' line='215' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wxSortCallback' type-id='type-id-396' filepath='include/wx/vector.h' line='57' column='1' id='type-id-397'/>
    <class-decl name='wxVector&lt;wxAuiNotebookPage*&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-358'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-107' filepath='include/wx/vector.h' line='179' column='1' id='type-id-398'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-316' filepath='include/wx/vector.h' line='181' column='1' id='type-id-399'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-401' filepath='include/wx/vector.h' line='184' column='1' id='type-id-400'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-403' filepath='include/wx/vector.h' line='185' column='1' id='type-id-402'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-404' filepath='include/wx/vector.h' line='187' column='1' id='type-id-362'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-405'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-406'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_INITIAL_SIZE' type-id='type-id-407' mangled-name='_ZN8wxVectorIP17wxAuiNotebookPageE18ALLOC_INITIAL_SIZEE' visibility='default' filepath='include/wx/vector.h' line='592' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-398' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-398' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-401' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVector&lt;wxAuiTabContainerButton*&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-364'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-107' filepath='include/wx/vector.h' line='179' column='1' id='type-id-408'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-322' filepath='include/wx/vector.h' line='181' column='1' id='type-id-409'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-411' filepath='include/wx/vector.h' line='184' column='1' id='type-id-410'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-413' filepath='include/wx/vector.h' line='185' column='1' id='type-id-412'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_reference' type-id='type-id-414' filepath='include/wx/vector.h' line='187' column='1' id='type-id-368'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-415'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-416'/>
      </member-type>
      <data-member access='private' static='yes'>
        <var-decl name='ALLOC_INITIAL_SIZE' type-id='type-id-417' mangled-name='_ZN8wxVectorIP23wxAuiTabContainerButtonE18ALLOC_INITIAL_SIZEE' visibility='default' filepath='include/wx/vector.h' line='592' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-408' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-408' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-411' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxVector&lt;wxWindow*&gt;' size-in-bits='192' visibility='default' filepath='include/wx/vector.h' line='166' column='1' id='type-id-418'>
      <member-type access='public'>
        <typedef-decl name='size_type' type-id='type-id-107' filepath='include/wx/vector.h' line='179' column='1' id='type-id-419'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='value_type' type-id='type-id-6' filepath='include/wx/vector.h' line='181' column='1' id='type-id-420'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='iterator' type-id='type-id-422' filepath='include/wx/vector.h' line='184' column='1' id='type-id-421'/>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='const_iterator' type-id='type-id-424' filepath='include/wx/vector.h' line='185' column='1' id='type-id-423'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-425'/>
      </member-type>
      <member-type access='private'>
        <class-decl name='const_reverse_iterator' visibility='default' is-declaration-only='yes' id='type-id-426'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='0'>
        <var-decl name='m_size' type-id='type-id-419' visibility='default' filepath='include/wx/vector.h' line='647' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_capacity' type-id='type-id-419' visibility='default' filepath='include/wx/vector.h' line='648' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='128'>
        <var-decl name='m_values' type-id='type-id-422' visibility='default' filepath='include/wx/vector.h' line='649' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='wxWithImages' size-in-bits='384' visibility='default' filepath='include/wx/withimages.h' line='25' column='1' id='type-id-427'>
      <member-type access='public'>
        <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='include/wx/withimages.h' line='29' column='1' id='type-id-428'>
          <underlying-type type-id='type-id-40'/>
          <enumerator name='NO_IMAGE' value='-1'/>
        </enum-decl>
      </member-type>
      <member-type access='public'>
        <typedef-decl name='Images' type-id='type-id-430' filepath='include/wx/withimages.h' line='33' column='1' id='type-id-429'/>
      </member-type>
      <data-member access='private' layout-offset-in-bits='64'>
        <var-decl name='m_images' type-id='type-id-429' visibility='default' filepath='include/wx/withimages.h' line='222' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='256'>
        <var-decl name='m_imageList' type-id='type-id-431' visibility='default' filepath='include/wx/withimages.h' line='225' column='1'/>
      </data-member>
      <data-member access='private' layout-offset-in-bits='320'>
        <var-decl name='m_ownsImageList' type-id='type-id-12' visibility='default' filepath='include/wx/withimages.h' line='228' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWithImages' mangled-name='_ZN12wxWithImagesD0Ev' filepath='include/wx/withimages.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-432' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWithImages' mangled-name='_ZN12wxWithImagesD0Ev' filepath='include/wx/withimages.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-432' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWithImages' mangled-name='_ZN12wxWithImagesD0Ev' filepath='include/wx/withimages.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-432' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWithImages' mangled-name='_ZN12wxWithImagesD2Ev' filepath='include/wx/withimages.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-432' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWithImages' mangled-name='_ZN12wxWithImagesD2Ev' filepath='include/wx/withimages.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-432' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWithImages' mangled-name='_ZN12wxWithImagesD2Ev' filepath='include/wx/withimages.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-432' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxWithImages' mangled-name='_ZN12wxWithImagesD4Ev' filepath='include/wx/withimages.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-432' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='2'>
        <function-decl name='SetImageList' mangled-name='_ZN12wxWithImages12SetImageListEP11wxImageList' filepath='include/wx/withimages.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-432' is-artificial='yes'/>
          <parameter type-id='type-id-431'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='3'>
        <function-decl name='OnImagesChanged' mangled-name='_ZN12wxWithImages15OnImagesChangedEv' filepath='include/wx/withimages.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-432' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxTabFrame' size-in-bits='5696' visibility='default' filepath='src/aui/auibook.cpp' line='1516' column='1' id='type-id-433'>
      <base-class access='public' layout-offset-in-bits='0' type-id='type-id-434'/>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='m_rect' type-id='type-id-277' visibility='default' filepath='src/aui/auibook.cpp' line='1636' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='m_tab_rect' type-id='type-id-277' visibility='default' filepath='src/aui/auibook.cpp' line='1637' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='m_tabs' type-id='type-id-329' visibility='default' filepath='src/aui/auibook.cpp' line='1638' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='m_tabCtrlHeight' type-id='type-id-11' visibility='default' filepath='src/aui/auibook.cpp' line='1639' column='1'/>
      </data-member>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxTabFrame' mangled-name='_ZN10wxTabFrameD0Ev' filepath='src/aui/auibook.cpp' line='1528' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-435' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxTabFrame' mangled-name='_ZN10wxTabFrameD2Ev' filepath='src/aui/auibook.cpp' line='1528' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-435' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxTabFrame' mangled-name='_ZN10wxTabFrameD4Ev' filepath='src/aui/auibook.cpp' line='1528' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-435' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='58'>
        <function-decl name='Show' mangled-name='_ZN10wxTabFrame4ShowEb' filepath='src/aui/auibook.cpp' line='1554' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-435' is-artificial='yes'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='98'>
        <function-decl name='Update' mangled-name='_ZN10wxTabFrame6UpdateEv' filepath='src/aui/auibook.cpp' line='1631' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-435' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='171'>
        <function-decl name='DoGetSize' mangled-name='_ZNK10wxTabFrame9DoGetSizeEPiS0_' filepath='src/aui/auibook.cpp' line='1622' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-436' is-artificial='yes'/>
          <parameter type-id='type-id-337'/>
          <parameter type-id='type-id-337'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='172'>
        <function-decl name='DoGetClientSize' mangled-name='_ZNK10wxTabFrame15DoGetClientSizeEPiS0_' filepath='src/aui/auibook.cpp' line='1547' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-436' is-artificial='yes'/>
          <parameter type-id='type-id-337'/>
          <parameter type-id='type-id-337'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='177'>
        <function-decl name='DoSetSize' mangled-name='_ZN10wxTabFrame9DoSetSizeEiiiii' filepath='src/aui/auibook.cpp' line='1539' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-435' is-artificial='yes'/>
          <parameter type-id='type-id-11'/>
          <parameter type-id='type-id-11'/>
          <parameter type-id='type-id-11'/>
          <parameter type-id='type-id-11'/>
          <parameter type-id='type-id-11'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
    </class-decl>
    <reference-type-def kind='lvalue' type-id='type-id-437' size-in-bits='64' id='type-id-438'/>
    <qualified-type-def type-id='type-id-439' const='yes' id='type-id-440'/>
    <pointer-type-def type-id='type-id-440' size-in-bits='64' id='type-id-441'/>
    <qualified-type-def type-id='type-id-441' const='yes' id='type-id-442'/>
    <qualified-type-def type-id='type-id-443' const='yes' id='type-id-444'/>
    <reference-type-def kind='lvalue' type-id='type-id-444' size-in-bits='64' id='type-id-445'/>
    <pointer-type-def type-id='type-id-444' size-in-bits='64' id='type-id-446'/>
    <qualified-type-def type-id='type-id-309' const='yes' id='type-id-447'/>
    <reference-type-def kind='lvalue' type-id='type-id-447' size-in-bits='64' id='type-id-335'/>
    <pointer-type-def type-id='type-id-447' size-in-bits='64' id='type-id-448'/>
    <qualified-type-def type-id='type-id-311' const='yes' id='type-id-449'/>
    <reference-type-def kind='lvalue' type-id='type-id-449' size-in-bits='64' id='type-id-338'/>
    <qualified-type-def type-id='type-id-324' const='yes' id='type-id-450'/>
    <pointer-type-def type-id='type-id-450' size-in-bits='64' id='type-id-451'/>
    <qualified-type-def type-id='type-id-451' const='yes' id='type-id-452'/>
    <qualified-type-def type-id='type-id-310' const='yes' id='type-id-453'/>
    <reference-type-def kind='lvalue' type-id='type-id-453' size-in-bits='64' id='type-id-454'/>
    <pointer-type-def type-id='type-id-453' size-in-bits='64' id='type-id-455'/>
    <qualified-type-def type-id='type-id-323' const='yes' id='type-id-456'/>
    <pointer-type-def type-id='type-id-456' size-in-bits='64' id='type-id-330'/>
    <qualified-type-def type-id='type-id-330' const='yes' id='type-id-457'/>
    <qualified-type-def type-id='type-id-357' const='yes' id='type-id-458'/>
    <pointer-type-def type-id='type-id-458' size-in-bits='64' id='type-id-459'/>
    <qualified-type-def type-id='type-id-363' const='yes' id='type-id-460'/>
    <pointer-type-def type-id='type-id-460' size-in-bits='64' id='type-id-461'/>
    <qualified-type-def type-id='type-id-312' const='yes' id='type-id-462'/>
    <reference-type-def kind='lvalue' type-id='type-id-462' size-in-bits='64' id='type-id-463'/>
    <pointer-type-def type-id='type-id-462' size-in-bits='64' id='type-id-464'/>
    <qualified-type-def type-id='type-id-464' const='yes' id='type-id-465'/>
    <qualified-type-def type-id='type-id-369' const='yes' id='type-id-466'/>
    <reference-type-def kind='lvalue' type-id='type-id-466' size-in-bits='64' id='type-id-315'/>
    <qualified-type-def type-id='type-id-318' const='yes' id='type-id-467'/>
    <reference-type-def kind='lvalue' type-id='type-id-467' size-in-bits='64' id='type-id-468'/>
    <pointer-type-def type-id='type-id-467' size-in-bits='64' id='type-id-469'/>
    <qualified-type-def type-id='type-id-469' const='yes' id='type-id-470'/>
    <qualified-type-def type-id='type-id-371' const='yes' id='type-id-471'/>
    <reference-type-def kind='lvalue' type-id='type-id-471' size-in-bits='64' id='type-id-321'/>
    <qualified-type-def type-id='type-id-340' const='yes' id='type-id-472'/>
    <pointer-type-def type-id='type-id-472' size-in-bits='64' id='type-id-473'/>
    <qualified-type-def type-id='type-id-474' const='yes' id='type-id-475'/>
    <reference-type-def kind='lvalue' type-id='type-id-475' size-in-bits='64' id='type-id-476'/>
    <pointer-type-def type-id='type-id-475' size-in-bits='64' id='type-id-477'/>
    <qualified-type-def type-id='type-id-477' const='yes' id='type-id-478'/>
    <qualified-type-def type-id='type-id-479' const='yes' id='type-id-480'/>
    <reference-type-def kind='lvalue' type-id='type-id-480' size-in-bits='64' id='type-id-481'/>
    <pointer-type-def type-id='type-id-480' size-in-bits='64' id='type-id-482'/>
    <qualified-type-def type-id='type-id-282' const='yes' id='type-id-483'/>
    <pointer-type-def type-id='type-id-483' size-in-bits='64' id='type-id-484'/>
    <qualified-type-def type-id='type-id-485' const='yes' id='type-id-486'/>
    <pointer-type-def type-id='type-id-486' size-in-bits='64' id='type-id-487'/>
    <qualified-type-def type-id='type-id-488' const='yes' id='type-id-489'/>
    <pointer-type-def type-id='type-id-489' size-in-bits='64' id='type-id-490'/>
    <qualified-type-def type-id='type-id-490' const='yes' id='type-id-491'/>
    <qualified-type-def type-id='type-id-389' const='yes' id='type-id-492'/>
    <reference-type-def kind='lvalue' type-id='type-id-492' size-in-bits='64' id='type-id-493'/>
    <pointer-type-def type-id='type-id-492' size-in-bits='64' id='type-id-494'/>
    <qualified-type-def type-id='type-id-494' const='yes' id='type-id-495'/>
    <qualified-type-def type-id='type-id-377' const='yes' id='type-id-496'/>
    <pointer-type-def type-id='type-id-496' size-in-bits='64' id='type-id-379'/>
    <qualified-type-def type-id='type-id-380' const='yes' id='type-id-497'/>
    <pointer-type-def type-id='type-id-497' size-in-bits='64' id='type-id-382'/>
    <qualified-type-def type-id='type-id-383' const='yes' id='type-id-498'/>
    <pointer-type-def type-id='type-id-498' size-in-bits='64' id='type-id-385'/>
    <qualified-type-def type-id='type-id-386' const='yes' id='type-id-499'/>
    <pointer-type-def type-id='type-id-499' size-in-bits='64' id='type-id-388'/>
    <qualified-type-def type-id='type-id-373' const='yes' id='type-id-500'/>
    <pointer-type-def type-id='type-id-500' size-in-bits='64' id='type-id-501'/>
    <qualified-type-def type-id='type-id-501' const='yes' id='type-id-502'/>
    <qualified-type-def type-id='type-id-374' const='yes' id='type-id-503'/>
    <pointer-type-def type-id='type-id-503' size-in-bits='64' id='type-id-504'/>
    <qualified-type-def type-id='type-id-504' const='yes' id='type-id-505'/>
    <qualified-type-def type-id='type-id-375' const='yes' id='type-id-506'/>
    <pointer-type-def type-id='type-id-506' size-in-bits='64' id='type-id-507'/>
    <qualified-type-def type-id='type-id-507' const='yes' id='type-id-508'/>
    <qualified-type-def type-id='type-id-376' const='yes' id='type-id-509'/>
    <pointer-type-def type-id='type-id-509' size-in-bits='64' id='type-id-510'/>
    <qualified-type-def type-id='type-id-510' const='yes' id='type-id-511'/>
    <pointer-type-def type-id='type-id-512' size-in-bits='64' id='type-id-513'/>
    <qualified-type-def type-id='type-id-514' const='yes' id='type-id-515'/>
    <pointer-type-def type-id='type-id-515' size-in-bits='64' id='type-id-516'/>
    <qualified-type-def type-id='type-id-516' const='yes' id='type-id-517'/>
    <qualified-type-def type-id='type-id-518' const='yes' id='type-id-519'/>
    <qualified-type-def type-id='type-id-339' const='yes' id='type-id-520'/>
    <reference-type-def kind='lvalue' type-id='type-id-520' size-in-bits='64' id='type-id-521'/>
    <pointer-type-def type-id='type-id-520' size-in-bits='64' id='type-id-343'/>
    <qualified-type-def type-id='type-id-522' const='yes' id='type-id-523'/>
    <pointer-type-def type-id='type-id-523' size-in-bits='64' id='type-id-524'/>
    <qualified-type-def type-id='type-id-524' const='yes' id='type-id-525'/>
    <qualified-type-def type-id='type-id-275' const='yes' id='type-id-526'/>
    <reference-type-def kind='lvalue' type-id='type-id-526' size-in-bits='64' id='type-id-527'/>
    <pointer-type-def type-id='type-id-526' size-in-bits='64' id='type-id-528'/>
    <qualified-type-def type-id='type-id-528' const='yes' id='type-id-529'/>
    <qualified-type-def type-id='type-id-390' const='yes' id='type-id-530'/>
    <reference-type-def kind='lvalue' type-id='type-id-530' size-in-bits='64' id='type-id-531'/>
    <qualified-type-def type-id='type-id-393' const='yes' id='type-id-532'/>
    <reference-type-def kind='lvalue' type-id='type-id-532' size-in-bits='64' id='type-id-533'/>
    <qualified-type-def type-id='type-id-534' const='yes' id='type-id-535'/>
    <pointer-type-def type-id='type-id-535' size-in-bits='64' id='type-id-536'/>
    <qualified-type-def type-id='type-id-536' const='yes' id='type-id-537'/>
    <qualified-type-def type-id='type-id-433' const='yes' id='type-id-538'/>
    <pointer-type-def type-id='type-id-538' size-in-bits='64' id='type-id-436'/>
    <qualified-type-def type-id='type-id-358' const='yes' id='type-id-539'/>
    <reference-type-def kind='lvalue' type-id='type-id-539' size-in-bits='64' id='type-id-540'/>
    <pointer-type-def type-id='type-id-539' size-in-bits='64' id='type-id-541'/>
    <qualified-type-def type-id='type-id-541' const='yes' id='type-id-542'/>
    <qualified-type-def type-id='type-id-398' const='yes' id='type-id-407'/>
    <qualified-type-def type-id='type-id-399' const='yes' id='type-id-543'/>
    <reference-type-def kind='lvalue' type-id='type-id-543' size-in-bits='64' id='type-id-404'/>
    <pointer-type-def type-id='type-id-543' size-in-bits='64' id='type-id-403'/>
    <qualified-type-def type-id='type-id-364' const='yes' id='type-id-544'/>
    <reference-type-def kind='lvalue' type-id='type-id-544' size-in-bits='64' id='type-id-545'/>
    <pointer-type-def type-id='type-id-544' size-in-bits='64' id='type-id-546'/>
    <qualified-type-def type-id='type-id-546' const='yes' id='type-id-547'/>
    <qualified-type-def type-id='type-id-408' const='yes' id='type-id-417'/>
    <qualified-type-def type-id='type-id-409' const='yes' id='type-id-548'/>
    <reference-type-def kind='lvalue' type-id='type-id-548' size-in-bits='64' id='type-id-414'/>
    <pointer-type-def type-id='type-id-548' size-in-bits='64' id='type-id-413'/>
    <qualified-type-def type-id='type-id-549' const='yes' id='type-id-550'/>
    <qualified-type-def type-id='type-id-418' const='yes' id='type-id-551'/>
    <reference-type-def kind='lvalue' type-id='type-id-551' size-in-bits='64' id='type-id-552'/>
    <pointer-type-def type-id='type-id-551' size-in-bits='64' id='type-id-553'/>
    <qualified-type-def type-id='type-id-553' const='yes' id='type-id-554'/>
    <qualified-type-def type-id='type-id-420' const='yes' id='type-id-555'/>
    <reference-type-def kind='lvalue' type-id='type-id-555' size-in-bits='64' id='type-id-556'/>
    <pointer-type-def type-id='type-id-555' size-in-bits='64' id='type-id-424'/>
    <qualified-type-def type-id='type-id-557' const='yes' id='type-id-558'/>
    <qualified-type-def type-id='type-id-427' const='yes' id='type-id-559'/>
    <reference-type-def kind='lvalue' type-id='type-id-559' size-in-bits='64' id='type-id-560'/>
    <pointer-type-def type-id='type-id-559' size-in-bits='64' id='type-id-561'/>
    <qualified-type-def type-id='type-id-561' const='yes' id='type-id-562'/>
    <qualified-type-def type-id='type-id-429' const='yes' id='type-id-563'/>
    <reference-type-def kind='lvalue' type-id='type-id-563' size-in-bits='64' id='type-id-564'/>
    <pointer-type-def type-id='type-id-565' size-in-bits='64' id='type-id-396'/>
    <pointer-type-def type-id='type-id-566' size-in-bits='64' id='type-id-347'/>
    <pointer-type-def type-id='type-id-567' size-in-bits='64' id='type-id-353'/>
    <pointer-type-def type-id='type-id-568' size-in-bits='64' id='type-id-350'/>
    <pointer-type-def type-id='type-id-569' size-in-bits='64' id='type-id-356'/>
    <pointer-type-def type-id='type-id-570' size-in-bits='64' id='type-id-391'/>
    <pointer-type-def type-id='type-id-571' size-in-bits='64' id='type-id-394'/>
    <pointer-type-def type-id='type-id-345' size-in-bits='64' id='type-id-572'/>
    <pointer-type-def type-id='type-id-348' size-in-bits='64' id='type-id-573'/>
    <pointer-type-def type-id='type-id-574' size-in-bits='64' id='type-id-575'/>
    <qualified-type-def type-id='type-id-575' const='yes' id='type-id-576'/>
    <pointer-type-def type-id='type-id-439' size-in-bits='64' id='type-id-577'/>
    <qualified-type-def type-id='type-id-577' const='yes' id='type-id-578'/>
    <reference-type-def kind='lvalue' type-id='type-id-443' size-in-bits='64' id='type-id-328'/>
    <pointer-type-def type-id='type-id-443' size-in-bits='64' id='type-id-579'/>
    <qualified-type-def type-id='type-id-579' const='yes' id='type-id-580'/>
    <reference-type-def kind='lvalue' type-id='type-id-309' size-in-bits='64' id='type-id-581'/>
    <pointer-type-def type-id='type-id-309' size-in-bits='64' id='type-id-316'/>
    <qualified-type-def type-id='type-id-316' const='yes' id='type-id-582'/>
    <reference-type-def kind='lvalue' type-id='type-id-582' size-in-bits='64' id='type-id-583'/>
    <reference-type-def kind='lvalue' type-id='type-id-316' size-in-bits='64' id='type-id-584'/>
    <pointer-type-def type-id='type-id-316' size-in-bits='64' id='type-id-585'/>
    <qualified-type-def type-id='type-id-585' const='yes' id='type-id-392'/>
    <reference-type-def kind='lvalue' type-id='type-id-311' size-in-bits='64' id='type-id-586'/>
    <pointer-type-def type-id='type-id-332' size-in-bits='64' id='type-id-333'/>
    <pointer-type-def type-id='type-id-324' size-in-bits='64' id='type-id-587'/>
    <qualified-type-def type-id='type-id-587' const='yes' id='type-id-588'/>
    <reference-type-def kind='lvalue' type-id='type-id-310' size-in-bits='64' id='type-id-589'/>
    <pointer-type-def type-id='type-id-310' size-in-bits='64' id='type-id-322'/>
    <qualified-type-def type-id='type-id-322' const='yes' id='type-id-590'/>
    <reference-type-def kind='lvalue' type-id='type-id-590' size-in-bits='64' id='type-id-591'/>
    <reference-type-def kind='lvalue' type-id='type-id-322' size-in-bits='64' id='type-id-592'/>
    <pointer-type-def type-id='type-id-322' size-in-bits='64' id='type-id-593'/>
    <qualified-type-def type-id='type-id-593' const='yes' id='type-id-395'/>
    <pointer-type-def type-id='type-id-323' size-in-bits='64' id='type-id-329'/>
    <qualified-type-def type-id='type-id-329' const='yes' id='type-id-325'/>
    <pointer-type-def type-id='type-id-329' size-in-bits='64' id='type-id-594'/>
    <pointer-type-def type-id='type-id-357' size-in-bits='64' id='type-id-595'/>
    <qualified-type-def type-id='type-id-595' const='yes' id='type-id-596'/>
    <pointer-type-def type-id='type-id-363' size-in-bits='64' id='type-id-597'/>
    <qualified-type-def type-id='type-id-597' const='yes' id='type-id-598'/>
    <reference-type-def kind='lvalue' type-id='type-id-312' size-in-bits='64' id='type-id-599'/>
    <pointer-type-def type-id='type-id-312' size-in-bits='64' id='type-id-600'/>
    <qualified-type-def type-id='type-id-600' const='yes' id='type-id-601'/>
    <pointer-type-def type-id='type-id-369' size-in-bits='64' id='type-id-314'/>
    <reference-type-def kind='lvalue' type-id='type-id-318' size-in-bits='64' id='type-id-602'/>
    <pointer-type-def type-id='type-id-318' size-in-bits='64' id='type-id-603'/>
    <qualified-type-def type-id='type-id-603' const='yes' id='type-id-604'/>
    <pointer-type-def type-id='type-id-371' size-in-bits='64' id='type-id-320'/>
    <pointer-type-def type-id='type-id-340' size-in-bits='64' id='type-id-605'/>
    <qualified-type-def type-id='type-id-605' const='yes' id='type-id-606'/>
    <reference-type-def kind='lvalue' type-id='type-id-474' size-in-bits='64' id='type-id-607'/>
    <pointer-type-def type-id='type-id-474' size-in-bits='64' id='type-id-608'/>
    <qualified-type-def type-id='type-id-608' const='yes' id='type-id-609'/>
    <pointer-type-def type-id='type-id-610' size-in-bits='64' id='type-id-611'/>
    <qualified-type-def type-id='type-id-611' const='yes' id='type-id-612'/>
    <reference-type-def kind='lvalue' type-id='type-id-479' size-in-bits='64' id='type-id-613'/>
    <pointer-type-def type-id='type-id-479' size-in-bits='64' id='type-id-614'/>
    <qualified-type-def type-id='type-id-614' const='yes' id='type-id-615'/>
    <pointer-type-def type-id='type-id-282' size-in-bits='64' id='type-id-300'/>
    <qualified-type-def type-id='type-id-300' const='yes' id='type-id-616'/>
    <pointer-type-def type-id='type-id-485' size-in-bits='64' id='type-id-617'/>
    <pointer-type-def type-id='type-id-341' size-in-bits='64' id='type-id-618'/>
    <pointer-type-def type-id='type-id-488' size-in-bits='64' id='type-id-619'/>
    <reference-type-def kind='lvalue' type-id='type-id-620' size-in-bits='64' id='type-id-293'/>
    <reference-type-def kind='lvalue' type-id='type-id-389' size-in-bits='64' id='type-id-621'/>
    <pointer-type-def type-id='type-id-389' size-in-bits='64' id='type-id-622'/>
    <qualified-type-def type-id='type-id-622' const='yes' id='type-id-623'/>
    <pointer-type-def type-id='type-id-377' size-in-bits='64' id='type-id-378'/>
    <qualified-type-def type-id='type-id-378' const='yes' id='type-id-624'/>
    <pointer-type-def type-id='type-id-380' size-in-bits='64' id='type-id-381'/>
    <qualified-type-def type-id='type-id-381' const='yes' id='type-id-625'/>
    <pointer-type-def type-id='type-id-383' size-in-bits='64' id='type-id-384'/>
    <qualified-type-def type-id='type-id-384' const='yes' id='type-id-626'/>
    <pointer-type-def type-id='type-id-386' size-in-bits='64' id='type-id-387'/>
    <qualified-type-def type-id='type-id-387' const='yes' id='type-id-627'/>
    <pointer-type-def type-id='type-id-373' size-in-bits='64' id='type-id-628'/>
    <qualified-type-def type-id='type-id-628' const='yes' id='type-id-629'/>
    <pointer-type-def type-id='type-id-374' size-in-bits='64' id='type-id-630'/>
    <pointer-type-def type-id='type-id-375' size-in-bits='64' id='type-id-631'/>
    <pointer-type-def type-id='type-id-376' size-in-bits='64' id='type-id-632'/>
    <reference-type-def kind='lvalue' type-id='type-id-633' size-in-bits='64' id='type-id-327'/>
    <pointer-type-def type-id='type-id-634' size-in-bits='64' id='type-id-635'/>
    <reference-type-def kind='lvalue' type-id='type-id-514' size-in-bits='64' id='type-id-326'/>
    <reference-type-def kind='lvalue' type-id='type-id-339' size-in-bits='64' id='type-id-636'/>
    <pointer-type-def type-id='type-id-339' size-in-bits='64' id='type-id-342'/>
    <reference-type-def kind='lvalue' type-id='type-id-522' size-in-bits='64' id='type-id-637'/>
    <pointer-type-def type-id='type-id-522' size-in-bits='64' id='type-id-638'/>
    <qualified-type-def type-id='type-id-638' const='yes' id='type-id-639'/>
    <pointer-type-def type-id='type-id-275' size-in-bits='64' id='type-id-640'/>
    <qualified-type-def type-id='type-id-640' const='yes' id='type-id-641'/>
    <qualified-type-def type-id='type-id-642' const='yes' id='type-id-643'/>
    <reference-type-def kind='lvalue' type-id='type-id-390' size-in-bits='64' id='type-id-644'/>
    <pointer-type-def type-id='type-id-390' size-in-bits='64' id='type-id-645'/>
    <qualified-type-def type-id='type-id-645' const='yes' id='type-id-646'/>
    <reference-type-def kind='lvalue' type-id='type-id-393' size-in-bits='64' id='type-id-647'/>
    <pointer-type-def type-id='type-id-393' size-in-bits='64' id='type-id-648'/>
    <qualified-type-def type-id='type-id-648' const='yes' id='type-id-649'/>
    <pointer-type-def type-id='type-id-351' size-in-bits='64' id='type-id-650'/>
    <pointer-type-def type-id='type-id-354' size-in-bits='64' id='type-id-651'/>
    <reference-type-def kind='lvalue' type-id='type-id-652' size-in-bits='64' id='type-id-653'/>
    <pointer-type-def type-id='type-id-433' size-in-bits='64' id='type-id-435'/>
    <qualified-type-def type-id='type-id-435' const='yes' id='type-id-654'/>
    <reference-type-def kind='lvalue' type-id='type-id-358' size-in-bits='64' id='type-id-655'/>
    <pointer-type-def type-id='type-id-358' size-in-bits='64' id='type-id-656'/>
    <qualified-type-def type-id='type-id-656' const='yes' id='type-id-657'/>
    <reference-type-def kind='lvalue' type-id='type-id-399' size-in-bits='64' id='type-id-658'/>
    <pointer-type-def type-id='type-id-399' size-in-bits='64' id='type-id-401'/>
    <reference-type-def kind='lvalue' type-id='type-id-364' size-in-bits='64' id='type-id-659'/>
    <pointer-type-def type-id='type-id-364' size-in-bits='64' id='type-id-660'/>
    <qualified-type-def type-id='type-id-660' const='yes' id='type-id-661'/>
    <reference-type-def kind='lvalue' type-id='type-id-409' size-in-bits='64' id='type-id-662'/>
    <pointer-type-def type-id='type-id-409' size-in-bits='64' id='type-id-411'/>
    <qualified-type-def type-id='type-id-663' const='yes' id='type-id-664'/>
    <reference-type-def kind='lvalue' type-id='type-id-418' size-in-bits='64' id='type-id-665'/>
    <pointer-type-def type-id='type-id-418' size-in-bits='64' id='type-id-666'/>
    <qualified-type-def type-id='type-id-666' const='yes' id='type-id-667'/>
    <reference-type-def kind='lvalue' type-id='type-id-420' size-in-bits='64' id='type-id-668'/>
    <pointer-type-def type-id='type-id-420' size-in-bits='64' id='type-id-422'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-669'/>
    <reference-type-def kind='lvalue' type-id='type-id-427' size-in-bits='64' id='type-id-670'/>
    <pointer-type-def type-id='type-id-427' size-in-bits='64' id='type-id-432'/>
    <qualified-type-def type-id='type-id-432' const='yes' id='type-id-671'/>
    <class-decl name='wxBookCtrlBase' visibility='default' is-declaration-only='yes' id='type-id-340'>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK14wxBookCtrlBase12GetClassInfoEv' filepath='include/wx/bookctrl.h' line='377' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <return type-id='type-id-280'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='14'>
        <function-decl name='GetEventTable' mangled-name='_ZNK14wxBookCtrlBase13GetEventTableEv' filepath='include/wx/bookctrl.h' line='380' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <return type-id='type-id-304'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='15'>
        <function-decl name='GetEventHashTable' mangled-name='_ZNK14wxBookCtrlBase17GetEventHashTableEv' filepath='include/wx/bookctrl.h' line='380' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <return type-id='type-id-305'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='109'>
        <function-decl name='HasTransparentBackground' mangled-name='_ZN14wxBookCtrlBase24HasTransparentBackgroundEv' filepath='include/wx/bookctrl.h' line='328' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-605' is-artificial='yes'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='117'>
        <function-decl name='HasMultiplePages' mangled-name='_ZNK14wxBookCtrlBase16HasMultiplePagesEv' filepath='include/wx/bookctrl.h' line='227' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='154'>
        <function-decl name='CanApplyThemeBorder' mangled-name='_ZNK14wxBookCtrlBase19CanApplyThemeBorderEv' filepath='include/wx/bookctrl.h' line='230' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='161'>
        <function-decl name='GetDefaultBorder' mangled-name='_ZNK14wxBookCtrlBase16GetDefaultBorderEv' filepath='include/wx/bookctrl.h' line='249' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <return type-id='type-id-331'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='173'>
        <function-decl name='DoGetBestSize' mangled-name='_ZNK14wxBookCtrlBase13DoGetBestSizeEv' filepath='include/wx/bookctrl.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='212'>
        <function-decl name='GetPageCount' mangled-name='_ZNK14wxBookCtrlBase12GetPageCountEv' filepath='include/wx/bookctrl.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <return type-id='type-id-107'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='213'>
        <function-decl name='GetPage' mangled-name='_ZNK14wxBookCtrlBase7GetPageEm' filepath='include/wx/bookctrl.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <parameter type-id='type-id-107'/>
          <return type-id='type-id-6'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='214'>
        <function-decl name='GetSelection' mangled-name='_ZNK14wxBookCtrlBase12GetSelectionEv' filepath='include/wx/bookctrl.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <return type-id='type-id-11'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='219'>
        <function-decl name='SetPageSize' mangled-name='_ZN14wxBookCtrlBase11SetPageSizeERK6wxSize' filepath='include/wx/bookctrl.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-605' is-artificial='yes'/>
          <parameter type-id='type-id-298'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='220'>
        <function-decl name='CalcSizeFromPage' mangled-name='_ZNK14wxBookCtrlBase16CalcSizeFromPageERK6wxSize' filepath='include/wx/bookctrl.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <parameter type-id='type-id-298'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='221'>
        <function-decl name='DeletePage' mangled-name='_ZN14wxBookCtrlBase10DeletePageEm' filepath='include/wx/bookctrl.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-605' is-artificial='yes'/>
          <parameter type-id='type-id-107'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='222'>
        <function-decl name='RemovePage' mangled-name='_ZN14wxBookCtrlBase10RemovePageEm' filepath='include/wx/bookctrl.h' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-605' is-artificial='yes'/>
          <parameter type-id='type-id-107'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='223'>
        <function-decl name='DeleteAllPages' mangled-name='_ZN14wxBookCtrlBase14DeleteAllPagesEv' filepath='include/wx/bookctrl.h' line='169' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-605' is-artificial='yes'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='224'>
        <function-decl name='AddPage' mangled-name='_ZN14wxBookCtrlBase7AddPageEP8wxWindowRK8wxStringbi' filepath='include/wx/bookctrl.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-605' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-274'/>
          <parameter type-id='type-id-12'/>
          <parameter type-id='type-id-11'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='228'>
        <function-decl name='FindPage' mangled-name='_ZNK14wxBookCtrlBase8FindPageEPK8wxWindow' filepath='include/wx/bookctrl.h' line='216' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <parameter type-id='type-id-672'/>
          <return type-id='type-id-11'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='229'>
        <function-decl name='HitTest' mangled-name='_ZNK14wxBookCtrlBase7HitTestERK7wxPointPl' filepath='include/wx/bookctrl.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <parameter type-id='type-id-303'/>
          <parameter type-id='type-id-673'/>
          <return type-id='type-id-11'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='230'>
        <function-decl name='DoSetSelection' mangled-name='_ZN14wxBookCtrlBase14DoSetSelectionEmi' filepath='include/wx/bookctrl.h' line='269' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-605' is-artificial='yes'/>
          <parameter type-id='type-id-107'/>
          <parameter type-id='type-id-11'/>
          <return type-id='type-id-11'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='231'>
        <function-decl name='UpdateSelectedPage' mangled-name='_ZN14wxBookCtrlBase18UpdateSelectedPageEm' filepath='include/wx/bookctrl.h' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-605' is-artificial='yes'/>
          <parameter type-id='type-id-107'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='232'>
        <function-decl name='CreatePageChangingEvent' mangled-name='_ZNK14wxBookCtrlBase23CreatePageChangingEventEv' filepath='include/wx/bookctrl.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <return type-id='type-id-608'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='233'>
        <function-decl name='MakeChangedEvent' mangled-name='_ZN14wxBookCtrlBase16MakeChangedEventER15wxBookCtrlEvent' filepath='include/wx/bookctrl.h' line='286' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-605' is-artificial='yes'/>
          <parameter type-id='type-id-607'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='234'>
        <function-decl name='DoShowPage' mangled-name='_ZN14wxBookCtrlBase10DoShowPageEP8wxWindowb' filepath='include/wx/bookctrl.h' line='292' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-605' is-artificial='yes'/>
          <parameter type-id='type-id-6'/>
          <parameter type-id='type-id-12'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='235'>
        <function-decl name='AllowNullPage' mangled-name='_ZNK14wxBookCtrlBase13AllowNullPageEv' filepath='include/wx/bookctrl.h' line='300' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='236'>
        <function-decl name='TryGetNonNullPage' mangled-name='_ZN14wxBookCtrlBase17TryGetNonNullPageEm' filepath='include/wx/bookctrl.h' line='307' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-605' is-artificial='yes'/>
          <parameter type-id='type-id-107'/>
          <return type-id='type-id-6'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='238'>
        <function-decl name='DoSize' mangled-name='_ZN14wxBookCtrlBase6DoSizeEv' filepath='include/wx/bookctrl.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-605' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='239'>
        <function-decl name='GetPageRect' mangled-name='_ZNK14wxBookCtrlBase11GetPageRectEv' filepath='include/wx/bookctrl.h' line='347' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-473' is-artificial='yes'/>
          <return type-id='type-id-277'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxBookCtrlEvent' visibility='default' is-declaration-only='yes' id='type-id-474'>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK15wxBookCtrlEvent12GetClassInfoEv' filepath='include/wx/bookctrl.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-477' is-artificial='yes'/>
          <return type-id='type-id-280'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='Clone' mangled-name='_ZNK15wxBookCtrlEvent5CloneEv' filepath='include/wx/bookctrl.h' line='405' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-477' is-artificial='yes'/>
          <return type-id='type-id-281'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxCommandEvent' visibility='default' is-declaration-only='yes' id='type-id-479'>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK14wxCommandEvent12GetClassInfoEv' filepath='include/wx/event.h' line='1660' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-482' is-artificial='yes'/>
          <return type-id='type-id-280'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='5'>
        <function-decl name='Clone' mangled-name='_ZNK14wxCommandEvent5CloneEv' filepath='include/wx/event.h' line='1651' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-482' is-artificial='yes'/>
          <return type-id='type-id-281'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='6'>
        <function-decl name='GetEventCategory' mangled-name='_ZNK14wxCommandEvent16GetEventCategoryEv' filepath='include/wx/event.h' line='1652' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-482' is-artificial='yes'/>
          <return type-id='type-id-674'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxControl' visibility='default' is-declaration-only='yes' id='type-id-282'>
      <member-function access='public' const='yes' vtable-offset='2'>
        <function-decl name='GetClassInfo' mangled-name='_ZNK9wxControl12GetClassInfoEv' filepath='include/wx/gtk/control.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-484' is-artificial='yes'/>
          <return type-id='type-id-280'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='105'>
        <function-decl name='GetDefaultAttributes' mangled-name='_ZNK9wxControl20GetDefaultAttributesEv' filepath='include/wx/gtk/control.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-484' is-artificial='yes'/>
          <return type-id='type-id-675'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='111'>
        <function-decl name='SetFont' mangled-name='_ZN9wxControl7SetFontERK6wxFont' filepath='include/wx/gtk/control.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-300' is-artificial='yes'/>
          <parameter type-id='type-id-26'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='173'>
        <function-decl name='DoGetBestSize' mangled-name='_ZNK9wxControl13DoGetBestSizeEv' filepath='include/wx/gtk/control.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-484' is-artificial='yes'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='211'>
        <function-decl name='UseGTKStyleBase' mangled-name='_ZNK9wxControl15UseGTKStyleBaseEv' filepath='include/wx/gtk/control.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-484' is-artificial='yes'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxControlBase' visibility='default' is-declaration-only='yes' id='type-id-485'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD0Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-617' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD1Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-617' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-617' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-617' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-617' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-617' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD2Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-617' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlBase' mangled-name='_ZN13wxControlBaseD4Ev' filepath='include/wx/control.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-617' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='23'>
        <function-decl name='SetLabel' mangled-name='_ZN13wxControlBase8SetLabelERK8wxString' filepath='include/wx/control.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-617' is-artificial='yes'/>
          <parameter type-id='type-id-274'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='24'>
        <function-decl name='GetLabel' mangled-name='_ZNK13wxControlBase8GetLabelEv' filepath='include/wx/control.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-487' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='111'>
        <function-decl name='SetFont' mangled-name='_ZN13wxControlBase7SetFontERK6wxFont' filepath='include/wx/control.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-617' is-artificial='yes'/>
          <parameter type-id='type-id-26'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='116'>
        <function-decl name='DoUpdateWindowUI' mangled-name='_ZN13wxControlBase16DoUpdateWindowUIER15wxUpdateUIEvent' filepath='include/wx/control.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-617' is-artificial='yes'/>
          <parameter type-id='type-id-676'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='152'>
        <function-decl name='ShouldInheritColours' mangled-name='_ZNK13wxControlBase20ShouldInheritColoursEv' filepath='include/wx/control.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-487' is-artificial='yes'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='161'>
        <function-decl name='GetDefaultBorder' mangled-name='_ZNK13wxControlBase16GetDefaultBorderEv' filepath='include/wx/control.h' line='161' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-487' is-artificial='yes'/>
          <return type-id='type-id-331'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='206'>
        <function-decl name='SetLabelText' mangled-name='_ZN13wxControlBase12SetLabelTextERK8wxString' filepath='include/wx/control.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-617' is-artificial='yes'/>
          <parameter type-id='type-id-274'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' const='yes' vtable-offset='207'>
        <function-decl name='GetLabelText' mangled-name='_ZNK13wxControlBase12GetLabelTextEv' filepath='include/wx/control.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-487' is-artificial='yes'/>
          <return type-id='type-id-7'/>
        </function-decl>
      </member-function>
      <member-function access='public' vtable-offset='208'>
        <function-decl name='Command' mangled-name='_ZN13wxControlBase7CommandER14wxCommandEvent' filepath='include/wx/control.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-617' is-artificial='yes'/>
          <parameter type-id='type-id-613'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='protected' vtable-offset='209'>
        <function-decl name='DoSetLabelMarkup' mangled-name='_ZN13wxControlBase16DoSetLabelMarkupERK8wxString' filepath='include/wx/control.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-617' is-artificial='yes'/>
          <parameter type-id='type-id-274'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
      <member-function access='protected' const='yes' vtable-offset='210'>
        <function-decl name='DoGetSizeFromTextSize' mangled-name='_ZNK13wxControlBase21DoGetSizeFromTextSizeEii' filepath='include/wx/control.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-487' is-artificial='yes'/>
          <parameter type-id='type-id-11'/>
          <parameter type-id='type-id-11'/>
          <return type-id='type-id-10'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxControlContainer' visibility='default' is-declaration-only='yes' id='type-id-341'>
      <member-function access='protected' vtable-offset='2'>
        <function-decl name='SetFocusToChild' mangled-name='_ZN18wxControlContainer15SetFocusToChildEv' filepath='include/wx/containr.h' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-618' is-artificial='yes'/>
          <return type-id='type-id-12'/>
        </function-decl>
      </member-function>
    </class-decl>
    <class-decl name='wxControlContainerBase' visibility='default' is-declaration-only='yes' id='type-id-488'>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlContainerBase' mangled-name='_ZN22wxControlContainerBaseD0Ev' filepath='include/wx/containr.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
          <parameter type-id='type-id-619' is-artificial='yes'/>
          <parameter type-id='type-id-11' is-artificial='yes'/>
          <return type-id='type-id-20'/>
        </function-decl>
      </member-function>
      <member-function access='public' destructor='yes' vtable-offset='-1'>
        <function-decl name='~wxControlContainerBase' mangled-name='_ZN22wxControlContainerBaseD0Ev' filepath='include/wx/containr.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
