Repository: wxWidgets/wxWidgets
Catalog: wxWidgets/locale/*.po
Languages: pl

source: Please send this report to the program maintainer, thank you!
pl: Proszê przes³aæ ten raport do autora programu, dziêkujê!

source: Thank you and we're sorry for the inconvenience!
pl: Dziêkujemy i przepraszamy za niedogodno¶ci!

source: (error %ld: %s)
pl: (b³±d %ld: %s)

source: Preview
pl: Podgl±d

source: #10 Envelope, 4 1/8 x 9 1/2 in
pl: Koperta #10, 4 1/8 x 9 1/2 cali

source: #11 Envelope, 4 1/2 x 10 3/8 in
pl: Koperta #11, 4 1/2 x 10 3/8 cali

source: #12 Envelope, 4 3/4 x 11 in
pl: Koperta #12, 4 3/4 x 11 cali

source: #14 Envelope, 5 x 11 1/2 in
pl: Koperta #14, 5 x 11 1/2 cali

source: #9 Envelope, 3 7/8 x 8 7/8 in
pl: Koperta #9, 3 7/8 x 8 7/8 cali

source: #define %s must be an integer.
pl: #define %s musi byæ liczb± ca³kowit±.

source: %i of %i
pl: %i z %i

source: %s (or %s)
pl: %s (lub %s)

source: %s Error
pl: %s B³±d

source: %s Information
pl: %s Informacja

source: %s Warning
pl: %s Ostrze¿enie

source: %s files (%s)|%s
pl: %s pliki (%s)|%s

source: %s message
pl: Komunikat programu %s

source: %s not a bitmap resource specification.
pl: %s nie jest specyfikacj± zasobu mapy bitowej.

source: %s not an icon resource specification.
pl: %s nie jest specyfikacj± zasobu ikony.

source: %s: ill-formed resource file syntax.
pl: %s: b³êdna sk³adnia pliku zasobu.

source: &About...
pl: Inform&acje...

source: &Actual Size
pl: &Bie¿±cy rozmiar

source: &Apply
pl: Z&astosuj

source: &Arrange Icons
pl: &Rozmie¶æ ikony

source: &Back
pl: &Wstecz

source: &Bold
pl: Pogru&biony

source: &Cancel
pl: &Anuluj

source: &Cascade
pl: &Kaskada

source: &Clear
pl: Wy&czy¶æ

source: &Close
pl: Zam&knij

source: &Copy
pl: &Kopiuj

source: &Debug report preview:
pl: Po&dgl±d raportu b³êdów:

source: &Delete
pl: &Usuñ

source: &Details
pl: &Szczegó³y

source: &Down
pl: W &dó³

source: &File
pl: &Plik

source: &Find
pl: &Znajd¼

source: &Finish
pl: Za&koñcz

source: &Font family:
pl: &Rozmiar czcionki:

source: &Forward
pl: &Dalej

source: &Goto...
pl: &Przejd¼ do...

source: &Help
pl: &Pomoc

source: &Home
pl: &Pocz±tek

source: &Index
pl: &Indeks

source: &Italic
pl: &Kursywa

source: &Log
pl: &Dziennik

source: &Move
pl: Prz&enie¶

source: &New
pl: &Nowy

source: &Next
pl: &Nastêpne

source: &Next >
pl: &Dalej >

source: &Next Tip
pl: &Nastêpna porada

source: &No
pl: &Nie

source: &Notes:
pl: &Uwagi:

source: &Open
pl: &Otwórz

source: &Open...
pl: &Otwórz...

source: &Paste
pl: Wkl&ej

source: &Point size:
pl: &Rozmiar czcionki:

source: &Preferences
pl: &Preferencje

source: &Previous
pl: &Poprzednie

source: &Print
pl: &Drukuj

source: &Print...
pl: &Drukuj...

source: &Properties
pl: &W³a¶ciwo¶ci

source: &Quit
pl: &Wyj¶cie

source: &Redo
pl: &Ponów

source: &Redo
pl: &Ponów

source: &Replace
pl: &Zast±p

source: &Restore
pl: &Przywróæ

source: &Save
pl: Zapi&sz

source: &Save...
pl: &Zapisz...

source: &Show tips at startup
pl: &Pokazuj porady przy uruchamianiu

source: &Size
pl: &Rozmiar

source: &Style:
pl: &Styl:

source: &Underline
pl: &Podkre¶lony

source: &Undo
pl: &Cofnij

source: &Undo
pl: &Cofnij

source: &Unindent
pl: &Cofnij wciêcie

source: &Up
pl: &W górê

source: &Weight:
pl: &Waga

source: &Window
pl: &Okno

source: &Yes
pl: &Tak

source: '%s' has extra '..', ignored.
pl: '%s' ma nadmiarowe '..', zignorowane.

source: '%s' is invalid
pl: '%s' jest nieprawid³owy

source: '%s' is not a correct numeric value for option '%s'.
pl: '%s' nie jest poprawn± warto¶ci± numeryczn± opcji '%s'.

source: '%s' is not a valid message catalog.
pl: '%s' nie jest prawid³owym katalogiem komunikatów.

source: '%s' is probably a binary buffer.
pl: '%s' jest prawdopodobnie buforem binarnym.

source: '%s' should be numeric.
pl: '%s' powinno byæ numeryczne.

source: '%s' should only contain ASCII characters.
pl: '%s' powinien zawieraæ tylko znaki ASCII.

source: '%s' should only contain alphabetic characters.
pl: '%s' powinien zawieraæ tylko warto¶ci znakowe.

source: '%s' should only contain alphabetic or numeric characters.
pl: '%s' powinien zawieraæ tylko warto¶ci znakowe lub numeryczne.

source: (Help)
pl: (Pomoc)

source: (bookmarks)
pl: (zak³adki)

source: *** A debug report has been generated
pl: *** Raport b³êdów zosta³ wygenerowany

source: *** And includes the following files:
pl: *** I zawiera nastêpuj±ce pliku:

source: *** It can be found in "%s"
pl: *** Znajduje siê w "%s"

source: , expected static, #include or #define while parsing resource.
pl: , oczekiwano static, #include or #define podczas przetwarzania zasobu.

source: 10 x 11 in
pl: 10 x 11 cali

source: 10 x 14 in
pl: 10 x 14 cali

source: 11 x 17 in
pl: 11 x 17 cali

source: 12 x 11 in
pl: 12 x 11 cali

source: 15 x 11 in
pl: 15 x 11 cali

source: 6 3/4 Envelope, 3 5/8 x 6 1/2 in
pl: Koperta 6 3/4, 3 5/8 x 6 1/2 cali

source: 9 x 11 in
pl: 9 x 11 cali

source: : file does not exist!
pl: : plik nie istnieje!

source: : unknown charset
pl: : nieznany zestaw znaków

source: : unknown encoding
pl: : nieznane kodowanie

source: < &Back
pl: < &Wstecz

source: <DIR>
pl: <KATALOG>

source: <DRIVE>
pl: <NAPÊD>

source: <LINK>
pl: <£¡CZE>

source: <b><i>Bold italic face.</i></b><br>
pl: <b><i>Pogrubiona kursywa.</i></b><br>

source: <b><i>bold italic <u>underlined</u></i></b><br>
pl: <b><i>pogrubiona kursywa <u>z podkre¶leniem</u></i></b><br>

source: <b>Bold face.</b>
pl: <b>Pogrubienie.</b>

source: <i>Italic face.</i>
pl: <i>Kursywa.</i>

source: A debug report has been generated in the directory
pl: Raport b³êdów zosta³ wygenerowany w katalogu

source: A non empty collection must consist of 'element' nodes
pl: Nie pusta kolekcja musi sk³adaæ siê z wêz³ów typu 'element'

source: A3 Extra Transverse 322 x 445 mm
pl: A3 Extra Poprzecznie 322 x 445 mm

source: A3 Rotated 420 x 297 mm
pl: A3 Obrócone 420 x 297 mm

source: A3 Transverse 297 x 420 mm
pl: A3 Poprzecznie 297 x 420 mm

source: A3 sheet, 297 x 420 mm
pl: Arkusz A3, 297 x 420 mm

source: A4 Extra 9.27 x 12.69 in
pl: A4 Extra 9.27 x 12.69 cali

source: A4 Rotated 297 x 210 mm
pl: A4 Obrócone 297 x 210 mm

source: A4 Transverse 210 x 297 mm
pl: A4 Poprzecznie 210 x 297 mm

source: A4 sheet, 210 x 297 mm
pl: Arkusz A4, 210 x 297 mm

source: A4 small sheet, 210 x 297 mm
pl: Ma³y arkusz A4, 210 x 297 mm

source: A5 Rotated 210 x 148 mm
pl: A5 Obrócone 210 x 148 mm

source: A5 Transverse 148 x 210 mm
pl: A5 Poprzecznie 148 x 210 mm

source: A5 sheet, 148 x 210 mm
pl: Arkusz A5, 148 x 210 mm

source: A6 Rotated 148 x 105 mm
pl: A6 Obrócone 148 x 105 mm

source: Add
pl: Dodaj

source: Add current page to bookmarks
pl: Dodaj bie¿±c± stronê do listy zak³adek

source: Add to custom colours
pl: Dodaj do kolorów niestandardowych

source: AddToPropertyCollection called on a generic accessor
pl: Funkcja AddToPropertyCollection wywo³ana w ogólnym akcesorze

source: AddToPropertyCollection called w/o valid adder
pl: Funkcja AddToPropertyCollection wywo³ana bez poprawnego modu³u dodaj±cego

source: Adding book %s
pl: Dodawanie pliku pomocy %s

source: Align Left
pl: Wyrównanie do lewej

source: Align Right
pl: Wyrównanie do prawej

source: All
pl: Wszystko

source: All files (%s)|%s
pl: Wszystkie pliki (%s)|%s

source: All files (*)|*
pl: Wszystkie pliki (*)|*

source: All files (*.*)|*
pl: Wszystkie pliki (*.*)|*

source: All files (*.*)|*.*
pl: Wszystkie pliki (*.*)|*.*

source: Already Registered Object passed to SetObjectClassInfo
pl: Zarejestrowany wcze¶niej obiekt przekazany do funkcji SetObjectClassInfo

source: Already dialling ISP.
pl: Ju¿ ³±czy z ISP.

source: Append log to file '%s' (choosing [No] will overwrite it)?
pl: Do³±czyæ dziennik do pliku '%s' (wybieraj±c [Nie] zast±pisz go)?

source: Arabic (ISO-8859-6)
pl: Arabski (ISO-8859-6)

source: Archive doesnt contain #SYSTEM file
pl: Archiwum nie zawiera pliku #SYSTEM

source: Attributes
pl: W³a¶ciwo¶ci

source: B4 (JIS) Rotated 364 x 257 mm
pl: B4 (JIS) Obrócone 364 x 257 mm

source: B4 Envelope, 250 x 353 mm
pl: Koperta B4, 250 x 353 mm

source: B4 sheet, 250 x 354 mm
pl: Arkusz B4, 250 x 354 mm

source: B5 (JIS) Rotated 257 x 182 mm
pl: B5 (JIS) Obrócone 257 x 182 mm

source: B5 (JIS) Transverse 182 x 257 mm
pl: B5 (JIS) Poprzecznie 182 x 257 mm

source: B5 Envelope, 176 x 250 mm
pl: Koperta B5, 176 x 250 mm

source: B5 sheet, 182 x 257 millimeter
pl: Arkusz B5, 182 x 257 mm

source: B6 (JIS) Rotated 182 x 128 mm
pl: B6 (JIS) Obrócone 182 x 128 mm

source: B6 Envelope, 176 x 125 mm
pl: Koperta B6, 176 x 125 mm

source: BMP: Couldn't allocate memory.
pl: BMP: Nie mo¿na przydzieliæ pamiêci.

source: BMP: Couldn't save invalid image.
pl: BMP: Nie mo¿na zapisaæ nieprawid³owego obrazu..

source: BMP: Couldn't write RGB color map.
pl: BMP: Nie mo¿na zapisaæ mapy kolorów RGB.

source: BMP: Couldn't write data.
pl: BMP: Nie mo¿na zapisaæ danych.

source: BMP: Couldn't write the file (Bitmap) header.
pl: BMP: Nie mo¿na zapisaæ nag³ówka pliku (Bitmap).

source: BMP: Couldn't write the file (BitmapInfo) header.
pl: BMP: Nie mo¿na zapisaæ nag³ówka pliku (BitmapInfo).

source: BMP: wxImage doesn't have own wxPalette.
pl: BMP: wxImage nie ma w³asnej wxPalette.

source: Baltic (ISO-8859-13)
pl: Ba³tycki (ISO-8859-13)

source: Baltic (old) (ISO-8859-4)
pl: Ba³tycki (stary) (ISO-8859-4)

source: Bitmap resource specification %s not found.
pl: Nie znaleziono specyfikacji %s zasobu mapy bitowej.

source: Bold
pl: Pogrubiony

source: Bottom margin (mm):
pl: Dolny margines (mm):

source: C sheet, 17 x 22 in
pl: Arkusz C, 17 x 22 cali

source: C&lear
pl: &Wyczy¶æ

source: C&olour:
pl: K&olor:

source: C3 Envelope, 324 x 458 mm
pl: Koperta C3, 324 x 458 mm

source: C4 Envelope, 229 x 324 mm
pl: Koperta C4, 229 x 324 mm

source: C5 Envelope, 162 x 229 mm
pl: Koperta C5, 162 x 229 mm

source: C6 Envelope, 114 x 162 mm
pl: Koperta C6, 114 x 162 mm

source: C65 Envelope, 114 x 229 mm
pl: Koperta C65, 114 x 229 mm

source: CHM handler currently supports only local files!
pl: Obs³uga CHM obecnie wspiera tylko pliki lokalne!

source: Can not create mutex.
pl: Nie mo¿na utworzyæ muteksu.

source: Can not enumerate files '%s'
pl: Nie mo¿na wyliczyæ plików '%s'

source: Can not enumerate files in directory '%s'
pl: Nie mo¿na wyliczyæ plików w katalogu '%s'

source: Can not resume thread %lu
pl: Nie mo¿na wznowiæ w±tku %lu

source: Can not resume thread %x
pl: Nie mo¿na wznowiæ w±tku %x

source: Can not start thread: error writing TLS.
pl: Nie mo¿na wystartowaæ w±tku: b³±d zapisu TLS.

source: Can not suspend thread %lu
pl: Nie mo¿na zawiesiæ w±tku %lu

source: Can not suspend thread %x
pl: Nie mo¿na zawiesiæ w±tku %x

source: Can not wait for thread termination
pl: Nie mo¿na czekaæ na zakoñczenie w±tku

source: Can't &Undo
pl: Nie mo¿na &cofn±æ

source: Can't check image format of file '%s': file does not exist.
pl: Nie mo¿na sprawdziæ formatu graficznego pliku '%s': plik nie istnieje.

source: Can't close registry key '%s'
pl: Nie mo¿na zamkn±æ klucza rejestru '%s'

source: Can't copy values of unsupported type %d.
pl: Nie mo¿na kopiowaæ warto¶ci nieobs³ugiwanego typu %d.

source: Can't create registry key '%s'
pl: Nie mo¿na utworzyæ klucza rejestru '%s'

source: Can't create thread
pl: Nie mo¿na utworzyæ w±tku

source: Can't create window of class %s
pl: Nie mo¿na utworzyæ okna klasy '%s'

source: Can't delete key '%s'
pl: Nie mo¿na usun±æ klucza '%s'

source: Can't delete the INI file '%s'
pl: Nie mo¿na usun±æ pliku INI '%s'

source: Can't delete value '%s' from key '%s'
pl: Nie mo¿na usun±æ warto¶ci '%s' z klucza '%s'

source: Can't enumerate subkeys of key '%s'
pl: Nie mo¿na wyliczyæ podkluczy klucza '%s'

source: Can't enumerate values of key '%s'
pl: Nie mo¿na wyliczyæ warto¶ci klucza '%s'

source: Can't export value of unsupported type %d.
pl: Nie mo¿na wyeksportowaæ warto¶ci nieobs³ugiwanego typu %d.

source: Can't find current position in file '%s'
pl: Nie mo¿na znale¼æ bie¿±cej pozycji w pliku '%s'

source: Can't get info about registry key '%s'
pl: Nie mo¿na uzyskaæ informacji o kluczu rejestru '%s'

source: Can't initialize zlib deflate stream.
pl: Nie mo¿na zainicjowaæ strumienia kompresji biblioteki zlib.

source: Can't initialize zlib inflate stream.
pl: Nie mo¿na zainicjowaæ strumienia dekompresji biblioteki zlib.

source: Can't load image from file '%s': file does not exist.
pl: Nie mo¿na wczytaæ obrazu z pliku '%s': plik nie istnieje.

source: Can't open registry key '%s'
pl: Nie mo¿na otworzyæ klucza rejestru '%s'

source: Can't read from inflate stream: %s
pl: Nie mo¿na czytaæ z dekompresowanego strumienia: %s

source: Can't read inflate stream: unexpected EOF in underlying stream.
pl: Nie mo¿na odczytaæ dekompresowanego strumienia: nieoczekiwany koniec w strumieniu.

source: Can't read value of '%s'
pl: Nie mo¿na odczytaæ warto¶ci '%s'

source: Can't read value of key '%s'
pl: Nie mo¿na odczytaæ warto¶ci klucza '%s'

source: Can't save image to file '%s': unknown extension.
pl: Nie mo¿na zapisaæ obrazu do pliku '%s': nieznane rozszerzenie.

source: Can't save log contents to file.
pl: Nie mo¿na zapisaæ zawarto¶ci dziennika w pliku.

source: Can't set thread priority
pl: Nie mo¿na zmieniæ priorytetu w±tku

source: Can't set value of '%s'
pl: Nie mo¿na nadaæ warto¶ci '%s'

source: Can't write to deflate stream: %s
pl: Nie mo¿na zapisywaæ do kompresowanego strumienia: %s

source: Cancel
pl: Zrezygnuj

source: Cannot convert dialog units: dialog unknown.
pl: Nie mo¿na wykonaæ konwersji okien dialogowych: nieznane okno dialogowe.

source: Cannot convert from the charset '%s'!
pl: Nie mo¿na dokonaæ konwersji z tablicy '%s'!

source: Cannot find active dialup connection: %s
pl: NIe mo¿na znale¼æ aktywnego po³±czenia dialup: %s

source: Cannot find container for unknown control '%s'.
pl: NIe mo¿na znale¼æ kontenera dla nieznanej kontrolki '%s'.

source: Cannot find font node '%s'.
pl: Nie mo¿na znale¼æ wêz³a czcionki '%s'.

source: Cannot find the location of address book file
pl: Nie mo¿na znale¼æ lokalizacji pliku ksi±¿ki adresowej

source: Cannot get priority range for scheduling policy %d.
pl: Nie mo¿na uzyskaæ zakresu priorytetów strategii harmogramowania %d.

source: Cannot get the hostname
pl: Nie mo¿na pobraæ nazwy serwera

source: Cannot get the official hostname
pl: Nie mo¿na pobraæ oficjalnej nazwy serwera

source: Cannot hang up - no active dialup connection.
pl: Nie mo¿na roz³±czyæ - brak aktywnego po³±czenia dialup.

source: Cannot initialize OLE
pl: Nie mo¿na zainicjowaæ OLE

source: Cannot initialize SciTech MGL!
pl: Nie mo¿na zainicjowaæ SciTech MGL!

source: Cannot initialize display.
pl: Nie mo¿na zainicjowaæ obs³ugi wy¶wietlania.

source: Cannot load icon from '%s'.
pl: Nie mo¿na wczytaæ ikony z '%s'.

source: Cannot load resources from file '%s'.
pl: Nie mo¿na wczytaæ zasobów z pliku z '%s'.

source: Cannot open HTML document: %s
pl: Nie mo¿na otworzyæ dokumentu HTML: %s

source: Cannot open HTML help book: %s
pl: Nie mo¿na otworzyæ ksi±¿ki pomocy HTML: %s

source: Cannot open contents file: %s
pl: Nie mo¿na otworzyæ pliku pomocy: %s

source: Cannot open file '%s'.
pl: Nie mo¿na otworzyæ pliku '%s'.

source: Cannot open file for PostScript printing!
pl: Nie mo¿na otworzyæ pliku dla drukowania postscriptowego!

source: Cannot open index file: %s
pl: Nie mo¿na otworzyæ pliku indeksowego: %s

source: Cannot parse Plural-Forms:'%s'
pl: Nie mo¿na przetworzyæ formy liczby mnogiej: '%s'

source: Cannot parse coordinates from '%s'.
pl: Nie mo¿na wyci±gn±æ koordynatów z '%s'.

source: Cannot parse dimension from '%s'.
pl: Nie mo¿na wyci±gn±æ wymiaru z '%s'.

source: Cannot print empty page.
pl: Nie mo¿na wydrukowaæ pustej strony.

source: Cannot read typename from '%s'!
pl: Nie mo¿na odczytaæ nazwy typu z '%s'!

source: Cannot retrieve thread scheduling policy.
pl: Nie mo¿na uzyskaæ strategii harmonogramowania w±tków.

source: Cannot start thread: error writing TLS
pl: Nie mo¿na wystartowaæ w±tku: b³±d zapisu TLS

source: Cannot wait for thread termination.
pl: Nie mo¿na czekaæ na zakoñczenie w±tku.

source: Cant create the thread event queue
pl: Nie mo¿na utworzyæ kolejki zdarzeñ w±tku

source: Case sensitive
pl: Uwzglêdniaj wielko¶æ liter

source: Celtic (ISO-8859-14)
pl: Celtycki (ISO-8859-14)

source: Centered
pl: Wyrównanie do ¶rodka

source: Central European (ISO-8859-2)
pl: ¦rodkowoeuropejski (ISO-8859-2)

source: Choose ISP to dial
pl: Wybierz ISP do po³±czenia

source: Choose colour
pl: Wybierz kolor

source: Choose font
pl: Wybierz czcionkê

source: Cl&ose
pl: Zam&knij

source: Clear the log contents
pl: Wyczy¶æ zawarto¶æ dziennika

source: Click to cancel the font selection.
pl: Anulowanie wyboru czcionki

source: Click to confirm the font selection.
pl: Potwierdzenie wyboru czcionki

source: Close
pl: Zamknij

source: Close Alt-F4
pl: Zamknij Alt-F4

source: Close All
pl: Zamknij wszystko

source: Close this window
pl: Zamknij okno

source: Compressed HTML Help file (*.chm)|*.chm|
pl: Skompresowane pliki pomocy HTML Help (*.chm)|*.chm|

source: Computer
pl: Komputer

source: Config entry name cannot start with '%c'.
pl: Nazwa pozycji konfiguracji nie mo¿e zaczynaæ siê od '%c'.

source: Confirm
pl: Potwierd¼

source: Confirm registry update
pl: Potwierd¼ uaktualnienie rejestru

source: Connecting...
pl: £±czenie...

source: Contents
pl: Zawarto¶æ

source: Conversion to charset '%s' doesn't work.
pl: Nie dzia³a konwersja do zestawu znaków '%s'.

source: Copied to clipboard:"%s"
pl: Skopiowano do schowka:"%s"

source: Copies:
pl: Kopie:

source: Could not create temporary file '%s'
pl: Nie mo¿na utworzyæ tymczasowego pliku '%s'

source: Could not extract %s into %s: %s
pl: Nie mo¿na wydzieliæ %s do %s: %s

source: Could not find resource include file %s.
pl: Nie odnaleziono pliku zasobów %s.

source: Could not find tab for id
pl: Nie mo¿na znale¼æ (tab) dla (id)

source: Could not locate file '%s'.
pl: Nie odnaleziono pliku '%s'.

source: Could not resolve control class or id '%s'. Use (non-zero) integer instead or provide #define (see manual for caveats)
pl: Nie rozpoznano klasy lub identyfikatora '%s'. U¿yj (niezerow±) liczbê ca³kowit± lub #define (szukaj szczegó³ów w dokumentacji)

source: Could not resolve menu id '%s'. Use (non-zero) integer instead or provide #define (see manual for caveats)
pl: Nie rozpoznano identyfikatora menu '%s'. U¿yj (niezerow±) liczbê ca³kowit± lub #define (szukaj szczegó³ów w dokumentacji)

source: Could not start document preview.
pl: Nie mo¿na wystartowaæ podgl±du dokumentu.

source: Could not start printing.
pl: Nie mo¿na rozpocz±æ drukowania.

source: Could not transfer data to window
pl: Nie mo¿na przenie¶æ danych do okna

source: Could not unlock mutex
pl: Nie odblokowano muteksu

source: Couldn't acquire a mutex lock
pl: Nie mo¿na przechwyciæ muteksu

source: Couldn't add an image to the image list.
pl: Nie mo¿na dodaæ obrazu do listy obrazów.

source: Couldn't create a timer
pl: Nie mo¿na utworzyæ stopera

source: Couldn't create cursor.
pl: Nie mo¿na utworzyæ kursora.

source: Couldn't find symbol '%s' in a dynamic library
pl: Nie mo¿na znale¼æ symbolu '%s' w bibliotece

source: Couldn't get the current thread pointer
pl: Nie mo¿na pobraæ wska¼nika aktualnego w±tku

source: Couldn't load a PNG image - file is corrupted or not enough memory.
pl: Nie mo¿na wczytaæ obrazu PNG - plik jest uszkodzony lub zabrak³o pamiêci.

source: Couldn't load sound data from '%s'.
pl: Nie mo¿na wczytaæ danych d¼wiêkowych '%s'.

source: Couldn't open audio: %s
pl: Nie mo¿na otworzyæ d¼wiêku: %s

source: Couldn't register clipboard format '%s'.
pl: Nie mo¿na zarejestrowaæ formatu schowka '%s'.

source: Couldn't release a mutex
pl: Muteks nie móg³ byæ uwolniony

source: Couldn't retrieve information about list control item %d.
pl: Nie mo¿na pobraæ informacji o elemencie listy kontroli %d.

source: Couldn't save PNG image.
pl: Nie mo¿na zapisaæ obrazu PNG.

source: Couldn't terminate thread
pl: Nie mo¿na zakoñczyæ w±tku

source: Create Parameter not found in declared RTTI Parameters
pl: Parametr Create nie odnaleziony w parametrach RTTI

source: Create directory
pl: Tworzenie katalogu

source: Create new directory
pl: Utwórz nowy katalog

source: Cu&t
pl: &Wytnij

source: Current directory:
pl: Bie¿±cy katalog:

source: Cyrillic (ISO-8859-5)
pl: Cyrylica (ISO-8859-5)

source: D sheet, 22 x 34 in
pl: Arkusz D, 22 x 34 cali

source: DDE poke request failed
pl: ¿±danie danych z serwera DDE nie powiod³o siê

source: DIB Header: Encoding doesn't match bitdepth.
pl: Nag³ówek DIB: kodowanie nie odpowiada rozdzielczo¶ci.

source: DIB Header: Image height > 32767 pixels for file.
pl: DIB nag³ówek: Wysoko¶æ obrazu > 32767 pikseli.

source: DIB Header: Image width > 32767 pixels for file.
pl: Nag³ówek DIB: Szeroko¶æ obrazu > 32767 pikseli.

source: DIB Header: Unknown bitdepth in file.
pl: Nag³ówek DIB: Plik z nieznan± rozdzielczo¶ci±.

source: DIB Header: Unknown encoding in file.
pl: Nag³ówek DIB: Plik z nieznanym kodowaniem.

source: DL Envelope, 110 x 220 mm
pl: Koperta DL, 110 x 220 mm

source: Debug report "%s"
pl: Raport b³êdów "%s"

source: Debug report couldn't be created.
pl: Wygenerowanie raport b³êdów nie powiod³o siê.

source: Debug report generation has failed.
pl: Generowanie raportu b³êdów nie powiod³o siê.

source: Default encoding
pl: Kodowanie domy¶lne

source: Default printer
pl: Domy¶lna drukarka

source: Delete item
pl: Usuñ pozycjê

source: Deleted stale lock file '%s'.
pl: Nieaktualny plik blokuj±cy '%s' zosta³ usuniêty.

source: Desktop
pl: Pulpit

source: Dial up functions are unavailable because the remote access service (RAS) is not installed on this machine. Please install it.
pl: Funkcje Dial up nie s± dostêpne, poniewa¿ serwis zdalnego dostêpu (RAS) nie jest zainstalowany na tej maszynie. Zainstaluj go.

source: Did you know...
pl: Czy wiesz ¿e...

source: Directories
pl: Katalogi

source: Directory '%s' couldn't be created
pl: Nie mo¿na utworzyæ katalogu '%s'

source: Directory '%s' doesn't exist!
pl: Katalog '%s' nie istnieje!

source: Directory does not exist
pl: Katalog nie istnieje

source: Directory doesn't exist.
pl: Katalog nie istnieje.

source: Display all index items that contain given substring. Search is case insensitive.
pl: Wy¶wietla wszystkie elementy indeksu zawieraj±ce podany ³añcuch. Szuka bez uwzglêdniania wielko¶ci liter.

source: Display options dialog
pl: Wy¶wietl okno dialogowe opcji

source: Do you want to overwrite the command used to %s files with extension "%s" ? Current value is %s, New value is %s %1
pl: Chcesz zast±piæ polecenie u¿ywane do plików %s z rozszerzeniem "%s" ? Bie¿aca warto¶æ to %s, Nowa warto¶æ to %s %1

source: Do you want to save changes to document %s?
pl: Chcesz zapisaæ zmiany w dokumencie %s?

source: Don't Save
pl: Nie Zapisuj

source: Done
pl: Zrobione

source: Done.
pl: Zrobione.

source: Double Japanese Postcard Rotated 148 x 200 mm
pl: Podwójna Japoñska Pocztówka Obrócona 148 x 200 mm

source: Doubly used id : %d
pl: Dwukrotnie u¿yty identyfikator : %d

source: Down
pl: W dó³

source: E sheet, 34 x 44 in
pl: Arkusz E, 34 x 44 cale

source: Edit item
pl: Edytuj pozycjê

source: Elapsed time :
pl: Up³ynê³o ju¿ :

source: Enter a page number between %d and %d:
pl: Wprowad¼ numer strony pomiêdzy %d a %d:

source: Enter command to open file "%s":
pl: Wprowad¼ komendê otwieraj±c± plik "%s":

source: Entries found
pl: Znalezione pozycje

source: Envelope Invite 220 x 220 mm
pl: Koperta Invite 220 x 220 mm

source: Environment variables expansion failed: missing '%c' at position %u in '%s'.
pl: Rozwiniêcie zmiennych ¶rodowiskowych nie powiod³o siê: zabrak³o '%c' na pozycji '%u' w '%s'.

source: Error
pl: B³±d

source: Error creating directory
pl: B³±d przy tworzeniu katalogu

source: Error reading config options.
pl: B³±d odczytu opcji konfiguracji.

source: Error saving user configuration data.
pl: B³±d zapisu konfiguracji u¿ytkownika.
