Repository: wxWidgets/wxWidgets
Catalog: wxWidgets/locale/*.po
Languages: pl

source: can't find length of file on file descriptor %d
pl: nie mo¿na znale¼æ rozmiaru pliku w deskryptorze pliku %d

source: can't find user's HOME, using current directory.
pl: nie mo¿na znale¼æ katalogu domowego, zostanie u¿yty bie¿±cy.

source: can't flush file descriptor %d
pl: nie mo¿na opró¿niæ deskryptora pliku %d

source: can't get seek position on file descriptor %d
pl: nie mo¿na odczytaæ bie¿±cej pozycji w deskryptorze pliku %d

source: can't load any font, aborting
pl: nie mo¿na za³adowaæ ¿adnej czcionki, program koñczy pracê

source: can't open file '%s'
pl: nie mo¿na otworzyæ pliku '%s'

source: can't open global configuration file '%s'.
pl: nie mo¿na otworzyæ globalnego pliku konfiguracji '%s'.

source: can't open user configuration file '%s'.
pl: nie mo¿na otworzyæ pliku konfiguracyjnego u¿ytkownika '%s'.

source: can't open user configuration file.
pl: nie mo¿na otworzyæ pliku konfiguracyjnego u¿ytkownika.

source: can't re-initialize zlib deflate stream
pl: nie mo¿na ponownie zainicjowaæ strumienia kompresji biblioteki zlib

source: can't re-initialize zlib inflate stream
pl: nie mo¿na ponownie zainicjowaæ strumienia dekompresji biblioteki zlib

source: can't read from file descriptor %d
pl: nie mo¿na czytaæ z deskryptora pliku %d

source: can't remove file '%s'
pl: nie mo¿na usun±æ pliku '%s'

source: can't remove temporary file '%s'
pl: nie mo¿na usun±æ tymczasowego pliku '%s'

source: can't seek on file descriptor %d
pl: nie mo¿na ustawiæ pozycji w deskryptorze pliku %d

source: can't write buffer '%s' to disk.
pl: nie mo¿na zapisaæ bufora '%s' na dysk.

source: can't write to file descriptor %d
pl: nie mo¿na zapisaæ do deskryptora pliku %d

source: can't write user configuration file.
pl: nie mo¿na zapisaæ pliku konfiguracyjnego u¿ytkownika.

source: catalog file for domain '%s' not found.
pl: Nie znaleziono pliku katalogowego dla domeny '%s'.

source: checksum error
pl: b³±d sumy kontrolnej

source: compression error
pl: b³±d kompresji

source: conversion to 8-bit encoding failed
pl: nie powiod³a siê konwersja do kodowania '8-bit'

source: date
pl: data

source: decompression error
pl: b³±d dekompresji

source: default
pl: domy¶lny

source: delegate has no type info
pl: brak informacji o delegowanym typie

source: dump of the process state (binary)
pl: kopia stanu procesu (binarnie)

source: eighteenth
pl: osiemnasty

source: eighth
pl: ósmy

source: eleventh
pl: jedenasty

source: entry '%s' appears more than once in group '%s'
pl: pozycja '%s' wystêpuje w grupie '%s' wiêcej ni¿ jeden raz

source: error in data format
pl: b³±d w formacie

source: error opening '%s'
pl: b³±d otwarcia '%s'

source: error opening file
pl: b³±d otwarcia pliku

source: error reading zip central directory
pl: b³±d przy odczycie centralnego katalogu zip

source: error reading zip local header
pl: b³±d odczytu lokalnego nag³ówka zip

source: error writing zip entry '%s': bad crc or length
pl: b³±d zapisu zip '%s': niepoprawna sygnatura crc lub d³ugo¶æ

source: establish
pl: nawi±zaæ

source: failed to flush the file '%s'
pl: nie uda³o siê opró¿niæ (flush) pliku '%s'

source: fifteenth
pl: piêtnasty

source: fifth
pl: pi±ty

source: file '%s', line %d: '%s' ignored after group header.
pl: plik '%s', linia %d: zignorowano '%s' po nag³ówku grupy.

source: file '%s', line %d: '=' expected.
pl: plik '%s', linia %d: oczekiwano '='.

source: file '%s', line %d: key '%s' was first found at line %d.
pl: plik '%s', linia %d: klucz '%s' wyst±pi³ po raz pierwszy w lini %d.

source: file '%s', line %d: value for immutable key '%s' ignored.
pl: plik '%s', linia %d: zignorowano warto¶æ dla niezmiennego klucza '%s'.

source: file '%s': unexpected character %c at line %d.
pl: plik '%s': nieoczekiwany znak %c w lini %d.

source: first
pl: pierwszy

source: font size
pl: rozmiar czcionki

source: fourteenth
pl: czternasty

source: fourth
pl: czwarty

source: generate verbose log messages
pl: generuje listê komunikatów

source: incorrect event handler string, missing dot
pl: nieprawid³owy uchwyt zdarzenia, brak kropki w nazwie

source: initiate
pl: zainicjowaæ

source: invalid eof() return value.
pl: b³êdna warto¶æ znacznika koñca pliku.

source: invalid message box return value
pl: warto¶æ zwrócona przez okno komunikatu jest nieprawid³owa

source: invalid zip file
pl: nieprawid³owy plik zip

source: italic
pl: kursywa

source: light
pl: lekki

source: locale '%s' can not be set.
pl: lokalizacja '%s' nie mo¿e byæ ustawiona.

source: looking for catalog '%s' in path '%s'.
pl: szukanie katalogu '%s' w ¶cie¿ce '%s'.

source: midnight
pl: pó³noc

source: nineteenth
pl: dziewiêtnasty

source: ninth
pl: dziewi±ty

source: no DDE error.
pl: bez b³êdu DDE.

source: no error
pl: brak b³êdu

source: noname
pl: beznazwy

source: noon
pl: po³udnie

source: num
pl: liczba

source: objects cannot have XML Text Nodes
pl: obiekty nie mo¿e mieæ wêz³ów typu 'XML Text'

source: out of memory
pl: brak wolnej pamiêci

source: process context description
pl: opis kontekstu procesu

source: read error
pl: b³±d odczytu

source: reading
pl: odczytu

source: reading zip stream (entry %s): bad crc
pl: odczyt strumienia zip (%s): niepoprawna sygnatura crc

source: reading zip stream (entry %s): bad length
pl: odczyt strumienia zip (%s): niepoprawna d³ugo¶æ

source: reentrancy problem.
pl: problem wspó³bie¿no¶ci

source: second
pl: drugi

source: seek error
pl: b³±d przeszukiwania

source: seventeenth
pl: siedemnasty

source: seventh
pl: siódmy

source: show this help message
pl: wy¶wietla ten komunikat

source: sixteenth
pl: szesnasty

source: sixth
pl: szósty

source: specify display mode to use (e.g. 640x480-16)
pl: okre¶la tryb wy¶wietlania, który ma byæ u¿yty (np. 640x480-16)

source: specify the theme to use
pl: okre¶la kompozycjê, który ma byæ u¿yta

source: stored file length not in Zip header
pl: d³ugo¶æ pliku nie w nag³ówku Zip

source: str
pl: tekst

source: tenth
pl: dziesi±ty

source: the response to the transaction caused the DDE_FBUSY bit to be set.
pl: odpowied¼ na transakcjê spowodowa³a ustawienie bitu DDE_FBUSY.

source: third
pl: trzeci

source: thirteenth
pl: trzynasty

source: tiff module: %s
pl: modu³ tiff: %s

source: today
pl: dzi¶

source: tomorrow
pl: jutro

source: twelfth
pl: dwunasty

source: twentieth
pl: dwudziesty

source: underlined
pl: podkre¶lony

source: unexpected " at position %d in '%s'.
pl: nieoczekiwany " na pozycji %d w '%s'.

source: unknown
pl: nieznany

source: unknown class %s
pl: nieznana klasa %s

source: unknown error
pl: nieznany b³±d

source: unknown error (error code %08x).
pl: nieznany b³±d (kod b³êdu %08x).

source: unknown line terminator
pl: nieznany znacznik koñca linii

source: unknown seek origin
pl: nieznany odno¶nik pozycjonowania

source: unknown-%d
pl: nieznany-%d

source: unnamed
pl: beznazwy

source: unnamed%d
pl: beznazwy%d

source: unsupported Zip compression method
pl: niewspierana metoda kompresji Zip

source: using catalog '%s' from '%s'.
pl: u¿ycie katalogu '%s' z '%s'.

source: write error
pl: b³±d zapisu

source: writing
pl: zapisu

source: wxGetTimeOfDay failed.
pl: wxGetTimeOfDay zwróci³o b³±d.

source: wxSocket: invalid signature in ReadMsg.
pl: wxSocket: b³êdna sygnatura w ReadMsg.

source: wxSocket: unknown event!.
pl: wxSocket: nieznane zdarzenie!

source: wxWidgets could not open display for '%s': exiting.
pl: Nie mo¿na zainicjowaæ wy¶wietlania dla '%s': program koñczy pracê.

source: wxWidgets could not open display. Exiting.
pl: Nie mo¿na zainicjowaæ wy¶wietlania. Program koñczy pracê.

source: yesterday
pl: wczoraj

source: zlib error %d
pl: b³±d biblioteki zlib %d
