Repository: wxWidgets/wxWidgets
Catalog: wxWidgets/locale/*.po
Languages: pl

source: Option '%s' requires a value.
pl: Opcja '%s' wymaga podania warto¶ci.

source: Option '%s': '%s' cannot be converted to a date.
pl: Opcja '%s': nie mo¿na przekszta³ciæ '%s' na datê.

source: Options
pl: Opcje

source: Orientation
pl: Orientacja

source: PCX: couldn't allocate memory
pl: PCX: Nie mo¿na przydzieliæ pamiêci.

source: PCX: image format unsupported
pl: PCX: nieobs³ugiwany format obrazu.

source: PCX: invalid image
pl: PCX: nieprawid³owy obraz

source: PCX: this is not a PCX file.
pl: PCX: To nie jest plik w formacie PCX.

source: PCX: unknown error !!!
pl: PCX: nieznany b³±d !!!

source: PCX: version number too low
pl: PCX: zbyt niski numer wersji.

source: PNM: Couldn't allocate memory.
pl: PNM: Nie mo¿na przydzieliæ pamiêci.

source: PNM: File format is not recognized.
pl: PNM: Nieznany format pliku.

source: PNM: File seems truncated.
pl: PNM: Plik wygl±da na obciêty.

source: PRC 16K Rotated
pl: PRC 16K Obrócony

source: PRC 32K Rotated
pl: PRC 32K Obrócony

source: PRC 32K(Big) Rotated
pl: PRC 32K(Big) Obrócony

source: PRC Envelope #1 102 x 165 mm
pl: Koperta PRC #1, 102 x 165 mm

source: PRC Envelope #1 Rotated 165 x 102 mm
pl: Koperta PRC #1 Obrócona, 165 x 102 mm

source: PRC Envelope #10 324 x 458 mm
pl: Koperta PRC #10 324 x 458 mm

source: PRC Envelope #10 Rotated 458 x 324 mm
pl: Koperta PRC #10 Obrócona 458 x 324 mm

source: PRC Envelope #2 102 x 176 mm
pl: Koperta PRC #2 102 x 176 mm

source: PRC Envelope #2 Rotated 176 x 102 mm
pl: Koperta PRC #2 Obrócona 176 x 102 mm

source: PRC Envelope #3 125 x 176 mm
pl: Koperta PRC #3 125 x 176 mm

source: PRC Envelope #3 Rotated 176 x 125 mm
pl: Koperta PRC #3 Obrócona 176 x 125 mm

source: PRC Envelope #4 110 x 208 mm
pl: Koperta PRC #4 110 x 208 mm

source: PRC Envelope #4 Rotated 208 x 110 mm
pl: Koperta PRC #4 Obrócona 208 x 110 mm

source: PRC Envelope #5 110 x 220 mm
pl: Koperta PRC #5 110 x 220 mm

source: PRC Envelope #5 Rotated 220 x 110 mm
pl: Koperta PRC #5 Obrócona 220 x 110 mm

source: PRC Envelope #6 120 x 230 mm
pl: Koperta PRC #6 120 x 230 mm

source: PRC Envelope #6 Rotated 230 x 120 mm
pl: Koperta PRC #6 Obrócona 230 x 120 mm

source: PRC Envelope #7 160 x 230 mm
pl: Koperta PRC #7 160 x 230 mm

source: PRC Envelope #7 Rotated 230 x 160 mm
pl: Koperta PRC #7 Obrócona 230 x 160 mm

source: PRC Envelope #8 120 x 309 mm
pl: Koperta PRC #8 120 x 309 mm

source: PRC Envelope #8 Rotated 309 x 120 mm
pl: Koperta PRC #8 Obrócona 309 x 120 mm

source: PRC Envelope #9 229 x 324 mm
pl: Koperta PRC #9 229 x 324 mm

source: PRC Envelope #9 Rotated 324 x 229 mm
pl: Koperta PRC #9 Obrócona 324 x 229 mm

source: Page %d
pl: Strona %d

source: Page %d of %d
pl: Strona %d z %d

source: Page Setup
pl: Ustawienia strony

source: Page setup
pl: Ustawienia strony

source: Pages
pl: Strony

source: Paper Size
pl: Rozmiar papieru

source: Paper size
pl: Rozmiar papieru

source: Passing a already registered object to SetObject
pl: Przekazano ju¿ zarejestrowany obiekt do funkcji SetObject

source: Passing a already registered object to SetObjectName
pl: Przekazano ju¿ zarejestrowany obiekt do funkcji SetObjectName

source: Passing an unkown object to GetObject
pl: Przekazanie nieznanego obiektu do funkcji GetObject

source: Permissions
pl: Uprawnienia

source: Pipe creation failed
pl: Nie uda³o siê utworzyæ potoku.

source: Please choose a valid font.
pl: Proszê wybraæ poprawn± czcionkê.

source: Please choose an existing file.
pl: Proszê wybraæ istniej±cy plik.

source: Please choose the page to display:
pl: Wybierz stronê do wy¶wietlenia:

source: Please choose which ISP do you want to connect to
pl: Wybierz ISP, z którym chcesz siê po³±czyæ

source: Please install a newer version of comctl32.dll (at least version 4.70 is required but you have %d.%02d) or this program won't operate correctly.
pl: Proszê zainstalowaæ nowsz± wersjê bliblioteki comctl32.dll (wymagana co najmniej 4.70, zainstalowana %d.%02d) inaczej program nie bêdzie dzia³a³ poprawnie.

source: Please wait while printing
pl: Proszê czekaæ, trwa drukowanie

source: Portrait
pl: Portret

source: PostScript file
pl: plik PostScript

source: Preview:
pl: Podgl±d:

source: Previous page
pl: Poprzednia strona

source: Print
pl: Drukuj

source: Print Preview
pl: Podgl±d wydruku

source: Print Preview Failure
pl: Awaria podgl±du wydruku

source: Print Range
pl: Zakres wydruku

source: Print Setup
pl: Ustawienia wydruku

source: Print in colour
pl: Wydruk w kolorze

source: Print previe&w
pl: Podgl±d &wydruku

source: Print preview
pl: Podgl±d wydruku

source: Print spooling
pl: Kolejkowanie wydruków

source: Print this page
pl: Drukuj stronê

source: Print to File
pl: Drukuj do pliku

source: Printer
pl: Drukarka

source: Printer command:
pl: Polecenie drukarki:

source: Printer options
pl: Opcje drukarki

source: Printer options:
pl: Opcje drukarki:

source: Printer...
pl: Drukarka...

source: Printer:
pl: Drukarka:

source: Printing
pl: Drukowanie

source: Printing Error
pl: B³±d wydruku

source: Printing page %d...
pl: Drukowanie strony %d...

source: Printing...
pl: Drukowanie...

source: Processing debug report has failed, leaving the files in "%s" directory.
pl: Przetwarzanie raportu b³êdów nie powiod³o siê, pozostawiaj±c pliku w katalogu "%s".

source: Program aborted.
pl: Program przerwany.

source: Question
pl: Pytanie

source: Read error on file '%s'
pl: B³±d odczytu pliku '%s'

source: Ready
pl: Gotowy

source: Referenced object node with ref="%s" not found!
pl: Nie znalezione wêz³a obiektu, do którego odwo³uje siê ref="%s"!

source: Refresh
pl: Od¶wie¿

source: Registry key '%s' already exists.
pl: Klucz rejestru '%s' ju¿ istnieje.

source: Registry key '%s' does not exist, cannot rename it.
pl: Klucz rejestru '%s' nie istnieje, nie mo¿na zmieniæ jego nazwy.

source: Registry key '%s' is needed for normal system operation, deleting it will leave your system in unusable state: operation aborted.
pl: Klucz rejestru '%s' jest potrzebny do normalnego funkcjonowania systemu, usuniêcie go zdestabilizowa³oby system: operacja zosta³a przerwana.

source: Registry value '%s' already exists.
pl: Warto¶æ rejestru '%s' ju¿ istnieje.

source: Relevant entries:
pl: Pozycje zwi±zane:

source: Remaining time :
pl: Zosta³o :

source: Remove
pl: Usuñ

source: Remove current page from bookmarks
pl: Usuñ bie¿±c± stronê z listy zak³adek

source: Renderer "%s" has incompatible version %d.%d and couldn't be loaded.
pl: Wizualizator "%s" ma niezgodn± wersjê %d.%d i nie mo¿e byæ za³adowany.

source: Rep&lace
pl: &Zast±p

source: Replace &all
pl: Zast±p &wszystko

source: Replace with:
pl: Zast±p przez:

source: Resource files must have same version number!
pl: Pliki zasobów muszê mieæ zgodny numer wersji!

source: Revert to Saved
pl: Przywróæ zapisany

source: Right margin (mm):
pl: Prawy margines (mm):

source: Save
pl: Zapisz

source: Save %s file
pl: Zapisz plik %s

source: Save &As...
pl: Zapisz J&ako...

source: Save as
pl: Zapisz jako

source: Save log contents to file
pl: Zapisz zawarto¶æ dziennika do pliku

source: Search
pl: Szukaj

source: Search contents of help book(s) for all occurences of the text you typed above
pl: Przeszukuje zawarto¶æ pliku(ów) pomocy dla wszystkich wyst±pieñ wprowadzonego powy¿ej tekstu

source: Search direction
pl: Kierunek szukania

source: Search for:
pl: Znajd¼:

source: Search in all books
pl: Szukaj we wszystkich plikach pomocy

source: Searching...
pl: Wyszukiwanie...

source: Sections
pl: Sekcje

source: Seek error on file '%s'
pl: B³±d pozycjonowania w pliku '%s'

source: Seek error on file '%s' (large files not supported by stdio)
pl: B³±d wyszukiwania w pliku '%s' (stdio nie wspiera olbrzymich plików)

source: Select &All
pl: &Zaznacz wszystko

source: Select a document template
pl: Wybierz szablon dokumentu

source: Select a document view
pl: Wybierz widok dokumentu

source: Select a file
pl: Wybierz plik

source: Selection
pl: Wybór

source: Separator expected after the option '%s'.
pl: Oczekiwano separatora po opcji '%s'.

source: SetProperty called w/o valid setter
pl: Funkcja SetProperty wywo³ana bez poprawnej modu³y ustawiaj±cego w³a¶ciwo¶æ

source: Setup...
pl: Ustawienia...

source: Several active dialup connections found, choosing one randomly.
pl: Znalezione kilka dostêpnych po³±czeñ dialup, zostanie u¿yte pierwsze.

source: Show all
pl: Poka¿ wszystko

source: Show all items in index
pl: Poka¿ wszystkie elementy indeksu

source: Show hidden directories
pl: Poka¿ ukryte katalogi

source: Show/hide navigation panel
pl: Poka¿/ukryj panel sterowania

source: Shows the font preview.
pl: Podgl±d czcionki.

source: Size
pl: Rozmiar

source: Skip
pl: Pomiñ

source: Slant
pl: Pochylony

source: Sorry, could not open this file for saving.
pl: Niestety nie mo¿na otworzyæ tego pliku do zapisu.

source: Sorry, could not open this file.
pl: Niestety nie mo¿na otworzyæ tego pliku.

source: Sorry, could not save this file.
pl: Niestety nie mo¿na zapisaæ tego pliku.

source: Sorry, not enough memory to create a preview.
pl: Niestety za ma³o pamiêci aby przygotowaæ podgl±d.

source: Sorry, print preview needs a printer to be installed.
pl: Niestety, podgl±d wydruku wymaga zainstalowania drukarki.

source: Sorry, the format for this file is unknown.
pl: Niestety, nieznany format pliku.

source: Sound data are in unsupported format.
pl: Dane d¼wiêkowe s± w formacie, który nie jest wspierany.

source: Sound file '%s' is in unsupported format.
pl: Plik z d¼wiêkiem '%s' jest w formacie, który nie jest wspierany.

source: Statement, 5 1/2 x 8 1/2 in
pl: Statement, 5 1/2 x 8 1/2 cala

source: Streaming delegates for not already streamed objects not yet supported
pl: Delegacja w strumieniu dlaobiektu który nie jest ju¿ w strumieniu nie jest jeszcze wspierana

source: String To Colour : Incorrect colour specification : %s
pl: Nieprawid³owa specyfikacja koloru : %s

source: String conversions not supported
pl: Konwersja tekstu nie jest wspierana

source: Subclass '%s' not found for resource '%s', not subclassing!
pl: Nie znaleziono podklasy '%s' dla zasobu '%s', bez podklas!

source: TIFF library error.
pl: B³±d biblioteki TIFF.

source: TIFF library warning.
pl: Ostrze¿enie biblioteki TIFF.

source: TIFF: Couldn't allocate memory.
pl: TIFF: Nie mo¿na przydzieliæ pamiêci.

source: TIFF: Error loading image.
pl: TIFF: B³±d przy wczytywaniu obrazu.

source: TIFF: Error reading image.
pl: TIFF: B³±d odczytu.

source: TIFF: Error saving image.
pl: TIFF: Wyst±pi³ b³±d przy zapisie.

source: TIFF: Error writing image.
pl: TIFF: B³±d zapisu.

source: Tabloid Extra 11.69 x 18 in
pl: Tabloid Extra 11.69 x 18 cali

source: Tabloid, 11 x 17 in
pl: Tabloid, 11 x 17 cali

source: Templates
pl: Szablony

source: Thai (ISO-8859-11)
pl: Tajski (ISO-8859-11)

source: The FTP server doesn't support passive mode.
pl: Serwer FTP nie obs³uguje trybu pasywnego.

source: The FTP server doesn't support the PORT command.
pl: Serwer FTP nie obs³uguje komendy PORT.

source: The charset '%s' is unknown. You may select another charset to replace it with or choose [Cancel] if it cannot be replaced
pl: Nieznany zestaw znaków '%s'. Mo¿esz wybraæ inny zestaw aby go zast±piæ lub wybierz [Anuluj] je¶li nie mo¿na go zast±piæ.

source: The clipboard format '%d' doesn't exist.
pl: Format schowka '%d' nie istnieje.

source: The directory '%s' does not exist Create it now?
pl: Katalog '%s' nie istnieje Utworzyæ go teraz?

source: The file '%s' couldn't be opened. It has been removed from the most recently used files list.
pl: Nie mo¿na otworzyæ pliku '%s'. Informacja o nim zosta³a usuniêta z listy ostatnio u¿ywanych plików.

source: The file '%s' doesn't exist and couldn't be opened. It has been removed from the most recently used files list.
pl: Plik '%s' nie istnieje i nie mo¿na go otworzyæ. Informacja o nim zosta³a usuniêta z listy ostatnio u¿ywanych plików.

source: The font colour.
pl: Kolor czcionki.

source: The font family.
pl: Rodzina czcionki.

source: The font point size.
pl: Rozmiar czcionki.

source: The font style.
pl: Styl czcionki.

source: The font weight.
pl: Waga czcionki.

source: The path '%s' contains too many ".."!
pl: ¦cie¿ka '%s' zawiera za du¿o ".."!

source: The report contains the files listed below. If any of these files contain private information, please uncheck them and they will be removed from the report.
pl: Raport zawiera pliki wymienione ni¿ej. Je¶li którykolwiek z tych plików zawiera prywatne informacje, proszê odznacz go w celu usuniêcia go z raportu.

source: The required parameter '%s' was not specified.
pl: Wymagany parametr '%s' nie zosta³ podany.

source: The text couldn't be saved.
pl: Tekst nie mo¿e byæ zapisany..

source: The value for the option '%s' must be specified.
pl: Warto¶æ opcji '%s' musi zostaæ podana.

source: The version of remote access service (RAS) installed on this machine is tooold, please upgrade (the following required function is missing: %s).
pl: Zainstalowana wersja serwiisu zdalnego dostêpu (RAS) jest zbyt stara, zainstaluj nowsz± (brakuj±ca funkcja to: %s).

source: There was a problem during page setup: you may need to set a default printer.
pl: Wyst±pi³ b³±d podczas konfigurowania strony: powiniene¶ okre¶liæ domy¶ln± drukarkê.

source: This system doesn't support date picker control, please upgrade your version of comctl32.dll
pl: Ten system nie wspiera komponentu wyboru daty, nale¿y zaktualizowaæ bibliotekê comctl32.dll

source: Thread module initialization failed: can not store value in thread local storage
pl: Zainicjowanie modu³u w±tków nie powiod³o siê: nie mo¿na od³o¿yæ warto¶ci do lokalnej pamiêci w±tków

source: Thread module initialization failed: failed to create thread key
pl: Zainicjowanie modu³u w±tków nie powiod³o siê: nie uda³o siê utworzyæ klucza w±tków

source: Thread module initialization failed: impossible to allocate index in thread local storage
pl: Zainicjowanie modu³u w±tków nie powiod³o siê: nie jest mo¿liwe przydzielenie indeksu w lokalnej pamiêci w±tków.

source: Thread priority setting is ignored.
pl: Ustawienie priorytetu w±tku jest ignorowane.

source: Tile &Horizontally
pl: &S±siaduj±co w poziomie

source: Tile &Vertically
pl: S±si&aduj±co w pionie

source: Timeout while waiting for FTP server to connect, try passive mode.
pl: Przekroczono czas oczekiwania dla serwera FTP, spróbuj trybu pasywnego.

source: Timer creation failed.
pl: Nie powiod³o siê utworzenie stopera.

source: Tip of the Day
pl: Porada dnia

source: Tips not available, sorry!
pl: Niestety, porady nie s± dostêpne!

source: To:
pl: Do:

source: Too many colours in PNG, the image may be slightly blurred.
pl: Zbyt wiele kolorów w formacie PNG, obraz mo¿e byæ zamazany.

source: Top margin (mm):
pl: Górny margines (mm):

source: Trying to remove file '%s' from memory VFS, but it is not loaded!
pl: Prób± usuniêcia pliku '%s' z pamiêci VFS, który nie zosta³ wczytany!

source: Trying to solve a NULL hostname: giving up
pl: próba u¿ycia niezdefiniowej (NULL) nazwy serwera: rezygnacja

source: Turkish (ISO-8859-9)
pl: Turecki (ISO-8859-9)

source: Type
pl: Typ

source: Type must have enum - long conversion
pl: Typ musi umo¿liwiaæ konswersjê enum - long

source: US Std Fanfold, 14 7/8 x 11 in
pl: Sk³adanka US Std, 14 7/8 x 11 cali

source: Unable to open requested HTML document: %s
pl: Nie mo¿na otworzyæ wskazanego dokumentu HTML: %s

source: Unable to play sound asynchronously.
pl: Nie mo¿na odtowrzyæ d¼wiêku asynchronicznie.

source: Undelete
pl: Odzyskaj

source: Unexpected end of file while parsing resource.
pl: Nieoczekiwany koniec pliku podczas przetwarzania zasobu.

source: Unexpected parameter '%s'
pl: Nieoczekiwany parametr '%s'

source: Unknown DDE error %08x
pl: Nieznany b³±d DDE %08x

source: Unknown Object passed to GetObjectClassInfo
pl: Nieznany obiekt przekazany do funkcji GetObjectClassInfo

source: Unknown dynamic library error
pl: Nieznany b³±d biblioteki dynamicznej

source: Unknown encoding (%d)
pl: Nieznane kodowanie (%d)

source: Unknown long option '%s'
pl: Nieznana d³uga opcja '%s'

source: Unknown option '%s'
pl: Nieznana opcja '%s'

source: Unknown style flag
pl: Nieznana flaga stylu

source: Unkown Property %s
pl: Nieznana w³a¶ciwo¶æ %s

source: Unmatched '{' in an entry for mime type %s.
pl: Nieodpowiedni '{' w pozycji dla typu mime %s.

source: Unnamed command
pl: Polecenie bez nazwy

source: Unrecognized style %s while parsing resource.
pl: Nierozpoznany styl %s podczas przetwarzania zasobu.

source: Unsupported clipboard format.
pl: Nieobs³ugiwany format schowka.

source: Unsupported theme '%s'.
pl: Nieobs³ugiwana kompozycja '%s'.

source: Up
pl: W górê

source: Usage: %s
pl: U¿ycie: %s

source: Validation conflict
pl: Konflikt kontroli poprawno¶ci

source: Video Output
pl: Wyj¶cie Video

source: View files as a detailed view
pl: Przegl±daj pliki w formie szczegó³owej listy

source: View files as a list view
pl: Przegl±daj pliki w formie listy

source: Views
pl: Widoki

source: Waiting for subprocess termination failed
pl: Oczekiwanie na zakoñczenie podprocesu nie powiod³o siê

source: Warning
pl: Ostrze¿enie

source: Warning:
pl: Ostrze¿enie:

source: Warning: attempt to remove HTML tag handler from empty stack.
pl: Ostrze¿enie: próba usuniêcia procedury obs³ugi znacznika HTML z pustego stosu.

source: Western European (ISO-8859-1)
pl: Zachodnioeuropejski (ISO-8859-1)

source: Western European with Euro (ISO-8859-15)
pl: Zachodnioeuropejski z Euro (ISO-8859-15)

source: Whether the font is underlined.
pl: Okre¶lenie podkre¶lenia.

source: Whole word
pl: Ca³e s³owo

source: Whole words only
pl: Tylko ca³e s³owa

source: Win32 theme
pl: Kompozycja Win32

source: Win32s on Windows 3.1
pl: Win32s na Windows 3.1

source: Windows 2000 (build %lu
pl: Windows 2000 (kompilacja %lu

source: Windows Arabic (CP 1256)
pl: Windows arabski (CP 1256)

source: Windows Baltic (CP 1257)
pl: Windows ba³tycki (CP 1257)

source: Windows Central European (CP 1250)
pl: Windows ¶rodkowoeuropejski (CP 1250)

source: Windows Chinese Simplified (CP 936)
pl: Windows chiñski uproszczony (CP 936)

source: Windows Chinese Traditional (CP 950)
pl: Windows chiñski tradycyjny (CP 950)

source: Windows Cyrillic (CP 1251)
pl: Windows cyrylica (CP 1251)

source: Windows Greek (CP 1253)
pl: Windows grecki (CP 1253)

source: Windows Hebrew (CP 1255)
pl: Windows hebrajski (CP 1255)

source: Windows Japanese (CP 932)
pl: Windows japoñski (CP 932)

source: Windows Korean (CP 949)
pl: Windows koreañski (CP 949)

source: Windows NT %lu.%lu (build %lu
pl: Windows NT %lu.%lu (kompilacja %lu

source: Windows Server 2003 (build %lu
pl: Windows Server 2003 (kompilacja %lu

source: Windows Turkish (CP 1254)
pl: Windows turecki (CP 1254)

source: Windows Western European (CP 1252)
pl: Windows zachodnioeuropejski (CP 1252)

source: Windows XP (build %lu
pl: Windows XP (kompilacja %lu

source: Write error on file '%s'
pl: B³±d zapisu do pliku '%s'

source: XML parsing error: '%s' at line %d
pl: B³±d parsowania XML: '%s' w linii %d

source: XPM: Malformed pixel data!
pl: XPM: Zniekszta³cone dane obrazu!

source: XRC resource '%s' (class '%s') not found!
pl: Nie znaleziono zasobu XRC '%s' (klasa '%s')!

source: XRC resource: Cannot create bitmap from '%s'.
pl: Zasoby XRC: Nie mo¿na utworzyæ mapy bitowej z '%s'.

source: XRC resource: Incorrect colour specification '%s' for property '%s'.
pl: Zasoby XRC: Nieprawid³owa specyfikacja koloru '%s' dla w³a¶ciwo¶ci '%s'.

source: Yes
pl: Tak

source: You cannot add a new directory to this section.
pl: Nie mo¿esz dodaæ nowego katalogu do tej sekcji.

source: Zoom &In
pl: Powiêkszen&ie

source: Zoom &Out
pl: P&omniejszenie

source: Zoom to &Fit
pl: &Dopasowanie powiêkszenia

source: [EMPTY]
pl: [PUSTY]

source: a DDEML application has created a prolonged race condition.
pl: Aplikacja DDEML utworzy³a przed³u¿ony wy¶cig (race condition).

source: a DDEML function was called without first calling the DdeInitialize function, or an invalid instance identifier was passed to a DDEML function.
pl: zosta³a wywo³ana funkcja DDEML bez wcze¶niejszego wywo³ania funkcji DdeInitialize, lub do funkcji DDEML przes³ano nieprawid³owy identyfikator instancji.

source: a client's attempt to establish a conversation has failed.
pl: próba nawi±zania konwersacji przez klienta nie powiod³a siê.

source: a memory allocation failed.
pl: przydzielenie pamiêci nie powiod³o siê.

source: a parameter failed to be validated by the DDEML.
pl: parametr nie przeszed³ kontroli poprawno¶ci DDEML

source: a request for a synchronous advise transaction has timed out.
pl: up³yn±³ czas oczekiwania na rozpoczêcie synchronicznej transakcji advise.

source: a request for a synchronous data transaction has timed out.
pl: up³yn±³ czas oczekiwania na rozpoczêcie synchronicznej transakcji data.

source: a request for a synchronous execute transaction has timed out.
pl: up³yn±³ czas oczekiwania na rozpoczêcie synchronicznej transakcji execute.

source: a request for a synchronous poke transaction has timed out.
pl: up³yn±³ czas oczekiwania na rozpoczêcie synchronicznej transakcji poke.

source: a request to end an advise transaction has timed out.
pl: up³yn±³ czas oczekiwania na zakoñczenie trancakcji advise.

source: a server-side transaction was attempted on a conversation that was terminated by the client, or the server terminated before completing a transaction.
pl: transakcja server-side próbowa³a kontynuowaæ konwersacjê zakoñczon± przez klienta, lub serwer zakoñczy³ pracê przez zakoñczeniem transakcji.

source: a transaction failed.
pl: transakcja nie powiod³a siê.

source: an application initialized as APPCLASS_MONITOR has attempted to perform a DDE transaction, or an application initialized as APPCMD_CLIENTONLY has attempted to perform server transactions.
pl: aplikacja zainicjowana jako APPCLASS_MONITOR usi³owa³a wykonaæ transakcjê DDE, lub aplikacja zainicjowana jako APPCMD_CLIENTONLY usi³owa³a wykonaæ transakcjê serwera.

source: an internal call to the PostMessage function has failed.
pl: wewnêtrzne wywo³anie funkcji PostMessage zakoñczy³o siê niepowodzeniem

source: an internal error has occurred in the DDEML.
pl: wyst±pi³ wewnêtrzny b³±d w DDEML.

source: an invalid transaction identifier was passed to a DDEML function. Once the application has returned from an XTYP_XACT_COMPLETE callback, the transaction identifier for that callback is no longer valid.
pl: do funkcji DDEML przes³ano nieprawid³owy identyfikator transakcji. Kiedy aplikacja koñczy po³±czenie zwrotne XTYP_XACT_COMPLETE, identyfikator transakcji dla tego po³±czenia nie jest d³u¿ej wa¿ny.

source: assuming this is a multi-part zip concatenated
pl: za³o¿enie ¿e jest to po³±czony wieloczê¶ciowy zip

source: attempt to change immutable key '%s' ignored.
pl: zignorowano próbê zmiany niezmiennego klucza '%s'.

source: bad arguments to library function
pl: b³êdne argumenty funkcji bibliotecznej

source: bad signature
pl: b³êdne oznaczenie

source: bad zipfile offset to entry
pl: b³êdne przemieszczenie w pliku zip

source: binary
pl: binarny

source: bold
pl: pogrubiony

source: buffer is too small for Windows directory.
pl: bufor jest zbyt ma³y na katalog Windows.

source: can't close file '%s'
pl: nie mo¿na zamkn±æ pliku '%s'

source: can't close file descriptor %d
pl: nie mo¿na zamkn±æ deskryptora pliku %d

source: can't commit changes to file '%s'
pl: nie mo¿na zatwierdziæ zmian w pliku '%s'

source: can't create file '%s'
pl: nie mo¿na utworzyæ pliku '%s'

source: can't delete user configuration file '%s'
pl: nie mo¿na usun±æ pliku konfiguracyjnego u¿ytkownika '%s'

source: can't determine if the end of file is reached on descriptor %d
pl: nie mo¿na okre¶liæ czy osi±gniêto koniec pliku w deskryptorze %d

source: can't execute '%s'
pl: nie uda³o siê wykonaæ '%s'

source: can't find central directory in zip
pl: nie mo¿na znale¼æ centralnego katalogu zip
