Repository: wxWidgets/wxWidgets
Catalog: wxWidgets/locale/*.po
Languages: pl

source: Error while waiting on semaphore
pl: B³±d oczekiwania na semafor

source: Error:
pl: B³±d:

source: Estimated time :
pl: Szacowany czas :

source: Executable files (*.exe)|*.exe|All files (*.*)|*.*||
pl: Programy (*.exe)|*.exe|Wszystkie pliki (*.*)|*.*||

source: Execution of command '%s' failed
pl: Wykonanie polecenia '%s' nie powiod³o siê

source: Execution of command '%s' failed with error: %ul
pl: Wykonanie polecenia '%s' nie powiod³o siê; b³±d: %ul

source: Executive, 7 1/4 x 10 1/2 in
pl: Executive, 7 1/4 x 10 1/2 cali

source: Expected '*' while parsing resource.
pl: Przetwarzaj±c zasób oczekiwano '*'.

source: Expected '=' while parsing resource.
pl: Przetwarzaj±c zasób oczekiwano '='.

source: Expected 'char' while parsing resource.
pl: Przetwarzaj±c zasób oczekiwano 'char'.

source: Exporting registry key: file "%s" already exists and won't be overwritten.
pl: Eksport klucza rejestrów: plik "%s" ju¿ istnieje i nie mo¿e zostaæ nadpisany.

source: Extended Unix Codepage for Japanese (EUC-JP)
pl: Japoñska rozszerzona strona kodowa UNIX (EUC-JP)

source: Extraction of '%s' into '%s' failed.
pl: Pobranie '%s' do '%s' nie powiod³o siê.

source: Failed to %s dialup connection: %s
pl: Nie uda³o siê %s po³±czenia dialup: %s

source: Failed to access lock file.
pl: Nie uda³o siê dostaæ do pliku blokuj±cego.

source: Failed to allocated %luKb of memory for bitmap data.
pl: Nie powiod³a siê rezerwacja %luKb pamiêci na dane obrazu.

source: Failed to change video mode
pl: Nie uda³o siê zmieniæ trybu video

source: Failed to clean up debug report directory "%s"
pl: Nie powiod³o siê czyszczenie katalogu raportu b³êdów "%s"

source: Failed to close file handle
pl: Nie uda³o siê zamkn±æ pliku.

source: Failed to close lock file '%s'
pl: Nie uda³o siê zamkn±æ pliku blokuj±cego '%s'

source: Failed to close the clipboard.
pl: Nie uda³o siê zamkn±æ schowka.

source: Failed to connect: missing username/password.
pl: Nie uda³o siê po³±czyæ: brakuje u¿ytkownika/has³a.

source: Failed to connect: no ISP to dial.
pl: Nie uda³o siê po³±czyæ: brak ISP.

source: Failed to copy registry value '%s'
pl: Nie uda³o siê skopiowaæ warto¶ci rejestru '%s'

source: Failed to copy the contents of registry key '%s' to '%s'.
pl: Nie uda³o siê skopiowaæ zawarto¶ci klucza rejestru '%s' do '%s'.

source: Failed to copy the file '%s' to '%s'
pl: Nie uda³o siê skopiowaæ pliku '%s' do '%s'.

source: Failed to copy the registry subkey '%s' to '%s'.
pl: Nie powiod³o siê kopiowanie klucza rejestru '%s' na '%s'.

source: Failed to create DDE string
pl: Nie uda³o siê utworzyæ ³añcucha DDE

source: Failed to create MDI parent frame.
pl: Nie uda³o siê utworzyæ ramki rodzica MDI.

source: Failed to create a status bar.
pl: Nie uda³o siê utworzyæ paska statusu.

source: Failed to create a temporary file name
pl: Nie uda³o siê wygenerowaæ nazwy dla pliku tymczasowego

source: Failed to create an anonymous pipe
pl: Nie uda³o siê utworzyæ potoku

source: Failed to create connection to server '%s' on topic '%s'
pl: Nie uda³o siê utworzyæ po³±czenia do serwera '%s' na temat '%s'

source: Failed to create cursor.
pl: Nie uda³o siê utworzyæ kursora.

source: Failed to create directory "%s"
pl: Nie powiod³o siê utworzenie katalogu "%s"

source: Failed to create directory '%s' (Do you have the required permissions?)
pl: Nie uda³o siê utworzyæ katalogu '%s' (Posiadasz wymagane prawa dostêpu?)

source: Failed to create registry entry for '%s' files.
pl: Nie uda³o siê utworzyæ pozycji rejestru dla plików '%s'.

source: Failed to create the standard find/replace dialog (error code %d)
pl: Nie uda³o siê utworzyæ standardowego okna dialogowego wyszukaj/zast±p (kod b³êdu %d)

source: Failed to display HTML document in %s encoding
pl: Nie uda³o siê wy¶wieliæ dokumentu HTML w kodowaniu %s

source: Failed to empty the clipboard.
pl: Nie uda³o siê opró¿niæ schowka.

source: Failed to enumerate video modes
pl: Nie uda³o siê pobranie listy trybów video

source: Failed to establish an advise loop with DDE server
pl: Nie uda³o siê rozpocz±æ transakcji doradzaj±cej (advise) z serwerem DDE

source: Failed to establish dialup connection: %s
pl: Nie uda³o siê nawi±zaæ po³±czenia dialup: %s

source: Failed to execute '%s'
pl: Nie uda³o siê wykonaæ '%s'

source: Failed to execute curl, please install it in PATH.
pl: Nie powiod³o siê uruchomienie curl, proszê zainstalowaæ go w dostêpnym katalogu (PATH).

source: Failed to find XBM resource %s. Forgot to use wxResourceLoadBitmapData?
pl: Brak zasobu XBM %s. Nie wywo³ano wxResourceLoadBitmapData?

source: Failed to find XBM resource %s. Forgot to use wxResourceLoadIconData?
pl: Brak zasobu XBM %s. Nie wywo³ano wxResourceLoadIconData?

source: Failed to find XPM resource %s. Forgot to use wxResourceLoadBitmapData?
pl: Brak zasobu XBM %s. Nie wywo³ano wxResourceLoadBitmapData?

source: Failed to get ISP names: %s
pl: Nie uda³o siê usyskaæ listy ISP: %s

source: Failed to get clipboard data.
pl: Nie uda³o siê pobraæ danych ze schowka.

source: Failed to get data from the clipboard
pl: Nie uda³o siê pobraæ danych ze schowka

source: Failed to get the local system time
pl: Nie uda³o siê pobraæ lokalnego czasu systemowego

source: Failed to get the working directory
pl: Nie uda³o siê uzyskaæ katalogu roboczego

source: Failed to initialize GUI: no built-in themes found.
pl: Nie uda³o siê zainicjowaæ GUI: brak wbudowanych kompozycji.

source: Failed to initialize MS HTML Help.
pl: Nie uda³o siê zainicjowaæ pomocy MS HTML.

source: Failed to initialize OpenGL
pl: Nie uda³o siê zainicjowaæ OpenGL

source: Failed to inspect the lock file '%s'
pl: Nie powiod³o siê sprawdzenie blokady pliku '%s'

source: Failed to join a thread, potential memory leak detected - please restart the program
pl: Nie uda³o po³±czyæ z w±tkiem, potencjalny wyciek pamiêci - uruchom program ponownie

source: Failed to kill process %d
pl: Nie uda³o siê zabiæ procesu %d

source: Failed to load image %d from file '%s'.
pl: Nie uda³o siê wczytaæ obrazu %d z pliku '%s'.

source: Failed to load metafile from file "%s".
pl: Nie powiod³o siê za³adowanie pliku meta "%s".

source: Failed to load mpr.dll.
pl: Nie uda³o siê wczytaæ mpr.dll.

source: Failed to load shared library '%s'
pl: Nie uda³o siê wczytaæ biblioteki '%s'.

source: Failed to load shared library '%s' Error '%s'
pl: Nie uda³o siê wczytaæ biblioteki '%s': b³±d '%s'

source: Failed to lock the lock file '%s'
pl: Nie uda³o siê zablokowaæ pliku blokuj±cego '%s'

source: Failed to modify file times for '%s'
pl: Nie uda³o siê zmodyfikowaæ czasów pliku '%s'

source: Failed to open '%s' for %s
pl: Nie uda³o siê otworzyæ '%s' do %s

source: Failed to open CHM archive '%s'.
pl: Nie uda³o siê otworzyæ archiwum CHM '%s'.

source: Failed to open temporary file.
pl: Nie uda³o siê otworzyæ pliku tymczasowego.

source: Failed to open the clipboard.
pl: Nie uda³o siê otworzyæ schowka.

source: Failed to put data on the clipboard
pl: Nie uda³o siê umie¶ciæ danych w schowku

source: Failed to read PID from lock file.
pl: Nie uda³o sie odczytaæ identyfikatora z pliku blokuj±cego.

source: Failed to redirect child process input/output
pl: Nie uda³o siê przekierowaæ wej¶cia/wyj¶cia procesu potomnego.

source: Failed to redirect the child process IO
pl: Nie uda³o siê przekierowaæ wej¶cia/wyj¶cia procesu potomnego

source: Failed to register DDE server '%s'
pl: Nie uda³o siê zarejestrowaæ serwera DDE '%s'

source: Failed to register OpenGL window class.
pl: Nie powiod³a siê rejestracja klasy okna OpenGL.

source: Failed to remember the encoding for the charset '%s'.
pl: Nie uda³o siê zapamiêtaæ kodowania dla zestawu znaków '%s'

source: Failed to remove debug report file "%s"
pl: Nie powiod³o siê usuniêcie pliku raportu b³êdów "%s"

source: Failed to remove lock file '%s'
pl: Nie uda³o siê usun±æ pliku blokuj±cego '%s'

source: Failed to remove stale lock file '%s'.
pl: Nie uda³o siê usun±æ nieaktualnego pliku blokuj±cego '%s'.

source: Failed to rename registry value '%s' to '%s'.
pl: Nie uda³o siê zmieniæ nazwy warto¶ci rejestru '%s' do '%s'.

source: Failed to rename the registry key '%s' to '%s'.
pl: Nie uda³o siê zmieniæ nazwy klucza rejestru '%s' na '%s'.

source: Failed to retrieve data from the clipboard.
pl: Nie uda³o siê odzyskaæ danych ze schowka.

source: Failed to retrieve file times for '%s'
pl: Nie uda³o siê odczytaæ czasów pliku '%s'

source: Failed to retrieve text of RAS error message
pl: Nie uda³o siê uzyskaæ tekstu komunikatu b³êdu RAS

source: Failed to retrieve the supported clipboard formats
pl: Nie uda³o siê uzyskaæ listy formatów obs³ugiwanych przez schowek

source: Failed to save the bitmap image to file "%s".
pl: Nie uda³o siê zapisaæ obrazu do pliku "%s".

source: Failed to send DDE advise notification
pl: Nie uda³o siê wys³aæ powiadomienia DDE

source: Failed to set FTP transfer mode to %s.
pl: FTP: Nie uda³o siê ustawiæ trybu transmisji na '%s'.

source: Failed to set clipboard data.
pl: Nie uda³o siê skorzystaæ ze schowka.

source: Failed to set permissions on lock file '%s'
pl: Nie powiod³o siê nadanie praw dostêpu na blokowanym pliku '%s'

source: Failed to set temporary file permissions
pl: Nie uda³o siê nadaæ praw dostêpu pliku tymczasowemu

source: Failed to set thread priority %d.
pl: Nie uda³o siê zmieniæ priorytetu w±tku na %d.

source: Failed to store image '%s' to memory VFS!
pl: Nie uda³o siê od³o¿yæ obrazu '%s' do pamiêci VFS!

source: Failed to terminate a thread.
pl: Nie uda³o siê zakoñczyæ w±tku.

source: Failed to terminate the advise loop with DDE server
pl: Nie uda³o siê zakoñczyæ transakcji doradzaj±cej (advise) z serwerem DDE

source: Failed to terminate the dialup connection: %s
pl: Nie uda³o siê zakoñczyæ po³±czenia dialup: %s

source: Failed to touch the file '%s'
pl: Nie uda³o siê zmieniæ czasów pliku '%s'

source: Failed to unlock lock file '%s'
pl: Nie uda³o siê odblokowaæ pliku blokuj±cego '%s'

source: Failed to unregister DDE server '%s'
pl: Nie uda³o siê wyrejestrowaæ serwera DDE '%s'

source: Failed to update user configuration file.
pl: Nie powiod³a siê aktualizacja pliku konfiguracyjnego u¿ytkownika.

source: Failed to upload the debug report (error code %d).
pl: Nie powiod³o siê przes³anie raportu b³êdów (kod b³êdu %d)

source: Failed to write to lock file '%s'
pl: Nie uda³o siê zapisaæ identyfikatora do pliku blokuj±cego '%s'

source: Fatal error
pl: B³±d krytyczny

source: Fatal error:
pl: B³±d krytyczny:

source: File
pl: Plik

source: File %s does not exist.
pl: Plik %s nie istnieje.

source: File '%s' already exists, do you really want to overwrite it?
pl: Plik '%s' ju¿ istnieje, naprawdê chcesz go zast±piæ?

source: File '%s' already exists. Do you want to replace it?
pl: Plik '%s' ju¿ istnieje. Chcesz go zast±piæ?

source: File couldn't be loaded.
pl: Plik nie mo¿e byæ wczytany.

source: File error
pl: B³±d plikowy

source: File name exists already.
pl: Plik o tej nazwie ju¿ istnieje.

source: Files
pl: Pliki

source: Files (%s)
pl: Pliki (%s)

source: Filter
pl: Filtr

source: Find
pl: Znajd¼

source: Fixed font:
pl: Czcionka o sta³ej szeroko¶ci:

source: Fixed size face.<br> <b>bold</b> <i>italic</i>
pl: Ustalony rozmiar tekstu.<br> <b>pogrubienie</b> <i>kursywa</i>

source: Folio, 8 1/2 x 13 in
pl: Folio, 8 1/2 x 13 cali

source: Font size:
pl: Rozmiar czcionki:

source: Fork failed
pl: Rozwidlenie nie powiod³o siê

source: Forward hrefs are not supported
pl: Przekazywanie w³a¶ciwo¶ci 'href' nie jest wspierane

source: Found
pl: Znaleziono

source: Found %i matches
pl: Znaleziono %i odpowiednik(i/ów)

source: From:
pl: Od:

source: GIF: Invalid gif index.
pl: GIF: Brak obrazu o podanym indeksie.

source: GIF: data stream seems to be truncated.
pl: GIF: strumieñ daych wygl±da na obciêty.

source: GIF: error in GIF image format.
pl: GIF: b³±d w formacie obrazu GIF.

source: GIF: not enough memory.
pl: GIF: za ma³o pamiêci.

source: GIF: unknown error!!!
pl: GIF: neznany b³±d !!!

source: GTK+ theme
pl: Kompozycja GTK+

source: Generic PostScript
pl: PostScript

source: German Legal Fanfold, 8 1/2 x 13 in
pl: Sk³adanka German Legal, 8 1/2 x 13 cali

source: German Std Fanfold, 8 1/2 x 12 in
pl: Sk³adanka German Std, 8 1/2 x 12 cali

source: GetProperty called w/o valid getter
pl: Funkcja GetProperty wywo³ana bez poprawnego modu³u pobieraj±cego

source: GetPropertyCollection called on a generic accessor
pl: Funkcja GetPropertyCollection wywo³ana w ogólnym akcesorze

source: GetPropertyCollection called w/o valid collection getter
pl: Funkcja GetPropertyCollection wywo³ana bez poprawnego modu³u pobieraj±cego

source: Go back
pl: Id¼ wstecz

source: Go forward
pl: Id¼ dalej

source: Go one level up in document hierarchy
pl: Id¼ poziom wy¿ej w hierarchi dokumentu

source: Go to home directory
pl: Id¼ do katalogu domowego

source: Go to parent directory
pl: Id¼ do katalogu nadrzêdnego

source: Goto Page
pl: Skocz do strony

source: Greek (ISO-8859-7)
pl: Grecki (ISO-8859-7)

source: Gzip not supported by this version of zlib
pl: Format Gzip nie jest wspierany przez tê wersjê biblioteki zlib

source: HTML Help Project (*.hhp)|*.hhp|
pl: Plik projektu pomocy HTML Help (*.hhp)|*.hhp|

source: HTML anchor %s does not exist.
pl: HTML: kotwica %s ie istnieje.

source: HTML files (*.html;*.htm)|*.html;*.htm|
pl: Pliki HTML (*.html;*.htm)|*.html;*.htm|

source: Hebrew (ISO-8859-8)
pl: Hebrajski (ISO-8859-8)

source: Help
pl: Pomoc

source: Help Browser Options
pl: Opcje przegl±darki pomocy

source: Help Index
pl: Spis tre¶ci

source: Help Printing
pl: Drukowanie pomocy

source: Help Topics
pl: Tematy Pomocy

source: Help books (*.htb)|*.htb|Help books (*.zip)|*.zip|
pl: Pakiety pomocy (*.htb)|*.htb|Pakiety pomocy (*.zip)|*.zip|

source: Help: %s
pl: Pomoc: %s

source: Home
pl: Katalog pocz±tkowy

source: Home directory
pl: Katalog pocz±tkowy

source: ICO: Error in reading mask DIB.
pl: ICO: B³±d odczytu maski DIB.

source: ICO: Error writing the image file!
pl: ICO: B³±d przy zapisie do pliku.

source: ICO: Image too tall for an icon.
pl: ICO: Obraz jest zbyt wysoki jak na ikonê.

source: ICO: Image too wide for an icon.
pl: ICO: Obraz jest zbyt szeroki jak na ikonê.

source: ICO: Invalid icon index.
pl: ICO: Brak ikony o podanym indeksie..

source: IFF: data stream seems to be truncated.
pl: IFF: strumieñ daych wygl±da na obciêty.

source: IFF: error in IFF image format.
pl: IFF: b³±d w formacie obrazu IFF.

source: IFF: not enough memory.
pl: IFF: za ma³o pamiêci.

source: IFF: unknown error!!!
pl: IFF: nieznany b³±d !!!

source: Icon resource specification %s not found.
pl: Specyfikacja zasobu ikony %s nie znaleziona.

source: If you have any additional information pertaining to this bug report, please enter it here and it will be joined to it:
pl: Je¶li masz jakiekolwiek dodatkowe informacje odno¶nie raportowanego b³êdu, proszê do³±cz je tu:

source: If you wish to suppress this debug report completely, please choose the "Cancel" button, but be warned that it may hinder improving the program, so if at all possible please do continue with the report generation.
pl: Je¶li chcesz ca³kowicie pomin±æ raport b³êdów, wybierz "Anuluj", ale rozwa¿ ¿e to mo¿e utrudniæ usprawnianie oprogramowania, w zwi±zku z tym zachêcamy do kontynuowania raportowania b³êdów.

source: Ignoring value "%s" of the key "%s".
pl: Warti¶æ "%s" klucza "%s" zignorowana.

source: Ill-formed resource file syntax.
pl: B³êdna sk³adnia pliku zasobu

source: Illegal Object Class (Non-wxEvtHandler) as Event Source
pl: B³êdna Klasa Obiekty (nie typu wxEvtHandler) jako ¬ród³o Zdarzenia

source: Illegal Parameter Count for ConstructObject Method
pl: Nieprawid³owa Liczba Parametrów w Metodzie ConstructObject

source: Illegal Parameter Count for Create Method
pl: Nieprawid³owa Liczba Parametrów w Metodzie Create

source: Illegal directory name.
pl: Niedozwolona nazwa katalogu.

source: Illegal file specification.
pl: Niedozwolona specyfikacja pliku.

source: Image and mask have different sizes.
pl: Obraz i maska maj± ró¿ne rozmiary.

source: Impossible to create a rich edit control, using simple text control instead. Please reinstall riched32.dll
pl: Nie jest mo¿liwe utworzenie kontrolki rich edit, u¿yj zamiast tego prostego 'text control'. Przeinstaluj riched32.dll

source: Impossible to get child process input
pl: Nie jest mo¿liwe uzyskanie wej¶cia procesu potomnego

source: Impossible to get permissions for file '%s'
pl: Uzyskanie praw dostêpu do pliku '%s' jest niemo¿liwe

source: Impossible to overwrite the file '%s'
pl: Zast±pienie pliku '%s' jest niemo¿liwe

source: Impossible to set permissions for the file '%s'
pl: Nie jest mo¿liwe nadanie praw dostêpu plikowi '%s'

source: Indent
pl: Wciêcie

source: Index
pl: Indeks

source: Indian (ISO-8859-12)
pl: Hinduski (ISO-8859-12)

source: Initialization failed in post init, aborting.
pl: Inicjalizacja nie powiod³a siê powoduj±c wyj¶cie.

source: Internal error, illegal wxCustomTypeInfo
pl: B³±d wewnêtrzny, nieprawid³owo¶ci w wxCustomTypeInfo

source: Invalid TIFF image index.
pl: TIFF: Brak obrazu o podanym indeksie.

source: Invalid XRC resource '%s': doesn't have root node 'resource'.
pl: Nieprawid³owy zasób XRC '%s': brakuje g³ównego wêz³a 'resource'.

source: Invalid display mode specification '%s'.
pl: B³êdna specyfikacja trybu wy¶wietlania '%s'.

source: Invalid geometry specification '%s'
pl: Niedozwolona specyfikacja "geometry" '%s'.

source: Invalid lock file '%s'.
pl: Nieprawid³owy plik blokuj±cy '%s'.

source: Invalid or Null Object ID passed to GetObjectClassInfo
pl: B³êdny lub Pusty Identyfikator Obiektu przekazany do funkcji GetObjectClassInfo

source: Invalid or Null Object ID passed to HasObjectClassInfo
pl: B³êdny lub Pusty Identyfikator Obiektu przekazany do funkcji HasObjectClassInfo

source: Invalid regular expression '%s': %s
pl: Nieprawid³owe wyra¿enie regularne '%s': %s

source: Italic
pl: Kursywa

source: Italy Envelope, 110 x 230 mm
pl: Koperta w³oska, 110 x 230 mm

source: JPEG: Couldn't load - file is probably corrupted.
pl: JPEG: Nie mo¿na wczytaæ - prawdopodobnie plik jest uszkodzony.

source: JPEG: Couldn't save image.
pl: JPEG: Nie mo¿na zapisaæ obrazu.

source: Japanese Double Postcard 200 x 148 mm
pl: Japoñska Podwójna Pocztówka 200 x 148 mm

source: Japanese Envelope Chou #3
pl: Japoñska Koperta Chou #3

source: Japanese Envelope Chou #3 Rotated
pl: Japoñska Koperta Chou #3 Obrócona

source: Japanese Envelope Chou #4
pl: Japoñska Koperta Chou #4

source: Japanese Envelope Chou #4 Rotated
pl: Japoñska Koperta Chou #4 Obrócona

source: Japanese Envelope Kaku #2
pl: Japoñska Koperta Kaku #2

source: Japanese Envelope Kaku #2 Rotated
pl: Japoñska Koperta Kaku #2 Obrócona

source: Japanese Envelope Kaku #3
pl: Japoñska Koperta Kaku #3

source: Japanese Envelope Kaku #3 Rotated
pl: Japoñska Koperta Kaku #3 Obrócona

source: Japanese Envelope You #4
pl: Japoñska Koperta You #4

source: Japanese Envelope You #4 Rotated
pl: Japoñska Koperta You #4 Obrócona

source: Japanese Postcard 100 x 148 mm
pl: Japoñska Pocztówka 100 x 148 mm

source: Japanese Postcard Rotated 148 x 100 mm
pl: Japoñska Pocztówka Obrócona 148 x 100 mm

source: Justified
pl: Wyrównanie obustronne

source: Landscape
pl: Pejza¿

source: Ledger, 17 x 11 in
pl: Ledger, 17 x 11 cali

source: Left margin (mm):
pl: Lewy margines (mm):

source: Legal Extra 9 1/2 x 15 in
pl: Legal Extra 9 1/2 x 15 cali

source: Legal, 8 1/2 x 14 in
pl: Legal, 8 1/2 x 14 cali

source: Letter Extra 9 1/2 x 12 in
pl: List Extra 9 1/2 x 12 cali

source: Letter Extra Transverse 9.275 x 12 in
pl: List Extra Poprzecznie 9.275 x 12 cali

source: Letter Plus 8 1/2 x 12.69 in
pl: List Plus 8 1/2 x 12.69 cala

source: Letter Rotated 11 x 8 1/2 in
pl: List Obrócony 11 x 8 1/2 cala

source: Letter Small, 8 1/2 x 11 in
pl: Ma³y list, 8 1/2 x 11 cali

source: Letter Transverse 8 1/2 x 11 in
pl: List Poprzecznie 8 1/2 x 11 cali

source: Letter, 8 1/2 x 11 in
pl: List, 8 1/2 x 11 cali

source: Light
pl: Cieñszy

source: Link contained '//', converted to absolute link.
pl: Odsy³acz zawieraj±cy '//' przekonwertowano do adresu bezwzglêdnego.

source: Load %s file
pl: Wczytaj plik %s

source: Loading :
pl: Wczytywanie :

source: Lock file '%s' has incorrect owner.
pl: Blokowany plik '%s' ma niew³a¶ciwego w³a¶ciciela.

source: Lock file '%s' has incorrect permissions.
pl: Blokowany plik '%s' ma niew³a¶ciwe uprawnienia.

source: Log saved to the file '%s'.
pl: Log zosta³ zapisany do pliku '%s'.

source: Long Conversions not supported
pl: Konwersja typu 'Long' nie jest wspierana.

source: MDI child
pl: potomek MDI

source: MS HTML Help functions are unavailable because the MS HTML Help library is not installed on this machine. Please install it.
pl: Funkcje pomocy dla MS HTML Help nie s± dostêpne, poniewa¿ biblioteka MS HTML Help nie jest zainstalowana na tej maszynie. Zainstaluj j±.

source: Ma&ximize
pl: &Maksymalizuj

source: Match case
pl: Uwzglêdniaj wielko¶æ liter

source: Memory VFS already contains file '%s'!
pl: Pamiêæ VFS ju¿ zawiera plik '%s'!

source: Metal theme
pl: Kompozycja metalowa

source: Mi&nimize
pl: Mi&nimalizuj

source: Mode %ix%i-%i not available.
pl: Tryb %ix%i-%i nie jest dostêpny.

source: Modified
pl: Zmodyfikowany

source: Module "%s" initialization failed
pl: Inicjalizacja modu³u "%s" nie powiod³a siê

source: Monarch Envelope, 3 7/8 x 7 1/2 in
pl: Koperta Monarch, 3 7/8 x 7 1/2 cala

source: Move down
pl: Przenie¶ w dó³

source: Move up
pl: Przenie¶ w górê

source: Name
pl: Nazwa

source: New directory
pl: Nowy katalog

source: New item
pl: Nowa pozycja

source: NewName
pl: NowaNaz

source: Next
pl: Dalej

source: Next page
pl: Nastêpna strona

source: No
pl: Nie

source: No XBM facility available!
pl: Brak wsparcia dla XBM!

source: No XPM icon facility available!
pl: Brak wsparcia dla ikon XPM!

source: No entries found.
pl: Nie znaleziono pozycji.

source: No font for displaying text in encoding '%s' found, but an alternative encoding '%s' is available. Do you want to use this encoding (otherwise you will have to choose another one)?
pl: Brak czcionki do wy¶wielenia tekstu w kodowaniu '%s', jednak dostêpne jest alternatywne kodowanie '%s'. Chesz u¿yæ tego kodowania (mo¿esz tak¿e wybraæ inne)?

source: No font for displaying text in encoding '%s' found. Would you like to select a font to be used for this encoding (otherwise the text in this encoding will not be shown correctly)?
pl: Brak czcionki do wy¶wielenia tekstu w kodowaniu '%s'. Chcesz wskazaæ czcionkê do u¿ycia (inaczej tekst mo¿e nie byæ wy¶wietlony poprawnie)?

source: No handler found for XML node '%s', class '%s'!
pl: Brak procedury obs³ugi dla wêz³a XML '%s', klasa '%s'!

source: No handler found for image type.
pl: Brak procedury obs³ugi grafiki.

source: No image handler for type %d defined.
pl: Brak procedury obs³ugi obrazów typu %d.

source: No image handler for type %s defined.
pl: Brak procedury obs³ugi obrazów typu %s.

source: No matching page found yet
pl: Jeszcze nie znaleziono pasuj±cej strony

source: No sound
pl: Brak d¼wiêku

source: No unused colour in image being masked.
pl: Brak nieu¿ywanych kolorów w maskowanym obrazie.

source: No unused colour in image.
pl: Brak wolnych kolorów w obrazie.

source: Nordic (ISO-8859-10)
pl: Nordycki (ISO-8859-10)

source: Normal
pl: Normalny

source: Normal face<br>and <u>underlined</u>.
pl: Zwyk³y tekst<br>i <u>podkre¶lony</u>.

source: Normal font:
pl: Normalna czcionka:

source: Note, 8 1/2 x 11 in
pl: Note, 8 1/2 x 11 cali

source: Objects must have an id attribute
pl: Obiekty musz± posiadaæ w³a¶ciwo¶æ typu 'id'

source: Open File
pl: Otwieranie Pliku

source: Open HTML document
pl: Otwórz dokument HTML

source: Open file "%s"
pl: Otwieranie pliku "%s"

source: Operation not permitted.
pl: Operacja nie jest dozwolona.

source: Option '%s' requires a value, '=' expected.
pl: Opcja '%s' wymaga warto¶ci, oczekiwane: '='.
